import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;
import net.minecraft.class_1799;
import net.minecraft.class_2248;
import net.minecraft.class_3965;

public class Class_40 extends Class_342 {
   // $VF: renamed from: rd Class_115
   public Class_115 field_2250;
   // $VF: renamed from: qmx Class_105
   public Class_105 field_2251;
   // $VF: renamed from: oht Class_49
   public Class_49 field_2252;
   // $VF: renamed from: sar Class_49
   public Class_49 field_2253;
   // $VF: renamed from: jnq Class_105
   public Class_105 field_2254;
   // $VF: renamed from: sff Class_105
   public Class_105 field_2255;
   // $VF: renamed from: qux Class_105
   public Class_105 field_2256;
   // $VF: renamed from: blz int
   public int field_2257;
   // $VF: renamed from: nm int
   public int field_2258;
   // $VF: renamed from: at boolean
   public boolean field_2259;
   // $VF: renamed from: zks boolean
   public boolean field_2260;
   // $VF: renamed from: hji boolean
   public boolean field_2261;
   // $VF: renamed from: tke java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_2262 = new MethodHandle[-724623364 - -724623364 ^ 206];

   public Class_40() {
      int var10001 = -1274218117 >>> 1488303696 ^ 46092;

      StringBuilder var10002;
      for (var10002 = (StringBuilder)0<"JNT",-2134976441,"ઠᗠᜠᗠᢠଠ","ڐ߰ҀШޠШ۸ӰШӠи۸ݘްрӨӠиؘۨڠ","\ufff3\ufff4\uffe7\ufff4\u001f\ufff9\ufff4\uffdf\ufff6\u001f\ufffa￡ￛ￼\uffdf\ufff6ﾋ￠￼\ufff9\ufff1\ufff0ￛ",1644653116>(
            "ﳡ﵁ﵙﵱﯹﲹﶡﵙﯹﳑﵩﴡﵑﵙ\ufde1ﶙ"
         );
         var10001 < (-1440883913 * 672788394 ^ -673518698);
         var10001 += (-1921929027 << -1921929027 | 1) & 353472787
      ) {
         int var40 = 0<"JNT",-1864987567,"ᑠᖠᏠᠠ\u0be0ᢠ","ڐߨۨߘ","\ufff3\ufff4\uffe7\ufff4\u001f\ufff9\ufff4\uffdf\ufff6\u001f\ufffa￡ￛ￼\uffdf\ufff6ﾋ￠￼\ufff9\ufff1\ufff0ￛ",1644679513>(
                  var10002, var10001
               )
               - '\n'
            ^ 240;
         char var41 = (char)(((var40 & 65528) >> 3 | var40 << 13) + 147 + 42);
         0<"JNT",-1864987567,"ᡠᓠᢠౠᖠᏠᠠ\u0be0ᢠ","ڐߨߘۨڠ","\ufff3\ufff4\uffe7\ufff4\u001f\ufff9\ufff4\uffdf\ufff6\u001f\ufffa￡ￛ￼\uffdf\ufff6ﾋ￠￼\ufff9\ufff1\ufff0ￛ",1644679524>(
            var10002, var10001, (char)(((var40 & 65528) >> 3 | var40 << 13) + 147 + 42)
         );
      }

      String var2 = 0<"JNT",-1864987567,"ᢠᝠၠᢠᠠᗠᜠᕠ","ڐۨ߰ҀШޠШ۸ӰШӠи۸ݘްрӨӠиؘ","\ufff3\ufff4\uffe7\ufff4\u001f\ufff9\ufff4\uffdf\ufff6\u001f\ufffa￡ￛ￼\uffdf\ufff6ﾋ￠￼\ufff9\ufff1\ufff0ￛ",1644679516>(
         var10002
      );
      int var20 = -1305202250 >> -1305202250 ^ -312;

      StringBuilder var43;
      for (var43 = (StringBuilder)0<"JNT",-2134976441,"ઠᗠᜠᗠᢠଠ","ڐ߰ҀШޠШ۸ӰШӠи۸ݘްрӨӠиؘۨڠ","\ufff3\ufff4\uffe7\ufff4\u001f\ufff9\ufff4\uffdf\ufff6\u001f\ufffa￡ￛ￼\uffdf\ufff6ﾋ￠￼\ufff9\ufff1\ufff0ￛ",1644679515>(
            "䌾㤾㢾㐾㔾㌾㢾㜾㈾㌾㒾㒾㼾劾㚾㜾㢾唾㈾㦾㼾㨾㢾㌾㒾㨾劾⾾㐾㦾劾㼾㐾㤾"
         );
         var20 < ((-350158324 | -2094527155 | 34) & 81018930);
         var20 += (-1316640829 << 695352490 | 1) & 1080042251
      ) {
         int var85 = 0<"JNT",-1864987567,"ᑠᖠᏠᠠ\u0be0ᢠ","ڐߨۨߘ","\ufff3\ufff4\uffe7\ufff4\u001f\ufff9\ufff4\uffdf\ufff6\u001f\ufffa￡ￛ￼\uffdf\ufff6ﾋ￠￼\ufff9\ufff1\ufff0ￛ",1644653121>(
               var43, var20
            )
            + 194;
         char var86 = (char)(((var85 & 65408) >> 7 | var85 << 9) - 136 + 167 ^ 230);
         0<"JNT",-1864987567,"ᡠᓠᢠౠᖠᏠᠠ\u0be0ᢠ","ڐߨߘۨڠ","\ufff3\ufff4\uffe7\ufff4\u001f\ufff9\ufff4\uffdf\ufff6\u001f\ufffa￡ￛ￼\uffdf\ufff6ﾋ￠￼\ufff9\ufff1\ufff0ￛ",1644679564>(
            var43, var20, (char)(((var85 & 65408) >> 7 | var85 << 9) - 136 + 167 ^ 230)
         );
      }

      super(
         var2,
         0<"JNT",-1864987567,"ᢠᝠၠᢠᠠᗠᜠᕠ","ڐۨ߰ҀШޠШ۸ӰШӠи۸ݘްрӨӠиؘ","\ufff3\ufff4\uffe7\ufff4\u001f\ufff9\ufff4\uffdf\ufff6\u001f\ufffa￡ￛ￼\uffdf\ufff6ﾋ￠￼\ufff9\ufff1\ufff0ￛ",1644679563>(
            var43
         ),
         -1,
         1<"JNT",1311831168,"㫞㨮","羕ﾓ","ﮝﮩﯭﵩﳅﰱ",-61162765>()
      );
      var10001 = (2026778112 >>> 2026778112 | 0) & 69206017;

      for (var10002 = (StringBuilder)0<"JNT",-2134976441,"ઠᗠᜠᗠᢠଠ","ڐ߰ҀШޠШ۸ӰШӠи۸ݘްрӨӠиؘۨڠ","\ufff3\ufff4\uffe7\ufff4\u001f\ufff9\ufff4\uffdf\ufff6\u001f\ufffa￡ￛ￼\uffdf\ufff6ﾋ￠￼\ufff9\ufff1\ufff0ￛ",1644679565>(
            "ģÅÐ«ÒÃÐ¿Ƅč¿»"
         );
         var10001 < ((1473670455 ^ 1277154606 | 4) & -1608384274);
         var10001 += 1073392705 + 1788983076 ^ -1432591516
      ) {
         char var46 = 0<"JNT",-1864987567,"ᑠᖠᏠᠠ\u0be0ᢠ","ڐߨۨߘ","\ufff3\ufff4\uffe7\ufff4\u001f\ufff9\ufff4\uffdf\ufff6\u001f\ufffa￡ￛ￼\uffdf\ufff6ﾋ￠￼\ufff9\ufff1\ufff0ￛ",1644679543>(
            var10002, var10001
         );
         char var47 = (char)((((var46 & 0) >> 16 | var46 << 0) - 43 ^ 78) - 44 ^ 203);
         0<"JNT",-1864987567,"ᡠᓠᢠౠᖠᏠᠠ\u0be0ᢠ","ڐߨߘۨڠ","\ufff3\ufff4\uffe7\ufff4\u001f\ufff9\ufff4\uffdf\ufff6\u001f\ufffa￡ￛ￼\uffdf\ufff6ﾋ￠￼\ufff9\ufff1\ufff0ￛ",1644679514>(
            var10002, var10001, (char)((((var46 & 0) >> 16 | var46 << 0) - 43 ^ 78) - 44 ^ 203)
         );
      }

      Class_115 var5 = (Class_115)0<"JNT",-2134976441,"ઠᗠᜠᗠᢠଠ","ڐ߰ҀШޠШ۸ӰШӠи۸ݘްрӨӠиؘߨ܀ۨڠ","�￤",1644679573>(
         0<"JNT",-1864987567,"ᢠᝠၠᢠᠠᗠᜠᕠ","ڐۨ߰ҀШޠШ۸ӰШӠи۸ݘްрӨӠиؘ","\ufff3\ufff4\uffe7\ufff4\u001f\ufff9\ufff4\uffdf\ufff6\u001f\ufffa￡ￛ￼\uffdf\ufff6ﾋ￠￼\ufff9\ufff1\ufff0ￛ",1644679574>(
            var10002
         ),
         1,
         false
      );
      int var24 = (1892372635 | -1519570763 | 0) & 134250496;

      for (var43 = (StringBuilder)0<"JNT",-2134976441,"ઠᗠᜠᗠᢠଠ","ڐ߰ҀШޠШ۸ӰШӠи۸ݘްрӨӠиؘۨڠ","\ufff3\ufff4\uffe7\ufff4\u001f\ufff9\ufff4\uffdf\ufff6\u001f\ufffa￡ￛ￼\uffdf\ufff6ﾋ￠￼\ufff9\ufff1\ufff0ￛ",1644679568>(
            "Ƹ膲膳䇁䆶䆯膱䆶䇁䆲Ʊ膲ƶ䇁䆯膯䆶䇁Ʋ솵膳ƶ䆶膱䆰䆰膯솰Ƴ"
         );
         var24 < ((667645395 ^ 1989311695 | 5) & 263293);
         var24 += (-1520131783 >>> -1520131783 | 1) & 2032456073
      ) {
         char var90 = 0<"JNT",-1864987567,"ᑠᖠᏠᠠ\u0be0ᢠ","ڐߨۨߘ","\ufff3\ufff4\uffe7\ufff4\u001f\ufff9\ufff4\uffdf\ufff6\u001f\ufffa￡ￛ￼\uffdf\ufff6ﾋ￠￼\ufff9\ufff1\ufff0ￛ",1644679560>(
            var43, var24
         );
         int var133 = (var90 & '￼') >> 2;
         int var91 = ((var90 & '￼') >> 2 | var90 << 14) - 96;
         int var134 = (((var90 & '￼') >> 2 | var90 << 14) - 96 & 61440) >> 12;
         var90 = (char)((((var133 | var90 << 14) - 96 & 61440) >> 12 | ((var90 & '￼') >> 2 | var90 << 14) - 96 << 4) - 189 ^ 104);
         0<"JNT",-1864987567,"ᡠᓠᢠౠᖠᏠᠠ\u0be0ᢠ","ڐߨߘۨڠ","\ufff3\ufff4\uffe7\ufff4\u001f\ufff9\ufff4\uffdf\ufff6\u001f\ufffa￡ￛ￼\uffdf\ufff6ﾋ￠￼\ufff9\ufff1\ufff0ￛ",1644679527>(
            var43, var24, (char)((var134 | var91 << 4) - 189 ^ 104)
         );
      }

      this.field_2250 = 0<"JNT",-1864987567,"ᑠᡠ","ڐ߰ҀШޠШ۸ӰШӠи۸ݘްрӨӠиؘۨ߰Ґިؘ","�￤",1644679414>(
         var5,
         0<"JNT",-1864987567,"ᢠᝠၠᢠᠠᗠᜠᕠ","ڐۨ߰ҀШޠШ۸ӰШӠи۸ݘްрӨӠиؘ","\ufff3\ufff4\uffe7\ufff4\u001f\ufff9\ufff4\uffdf\ufff6\u001f\ufffa￡ￛ￼\uffdf\ufff6ﾋ￠￼\ufff9\ufff1\ufff0ￛ",1644679411>(
            var43
         )
      );
      int var6 = 0;

      for (var10002 = (StringBuilder)0<"JNT",-2134976441,"ઠᗠᜠᗠᢠଠ","ڐ߰ҀШޠШ۸ӰШӠи۸ݘްрӨӠиؘۨڠ","\ufff3\ufff4\uffe7\ufff4\u001f\ufff9\ufff4\uffdf\ufff6\u001f\ufffa￡ￛ￼\uffdf\ufff6ﾋ￠￼\ufff9\ufff1\ufff0ￛ",1644679413>(
            "᱀ᬀӀрᩀ甀ᄀᨀ׀рӀ"
         );
         var6 < ((-2039759235 >> -2039759235 | 11) & 11);
         var6 += 1
      ) {
         char var52 = 0<"JNT",-1864987567,"ᑠᖠᏠᠠ\u0be0ᢠ","ڐߨۨߘ","\ufff3\ufff4\uffe7\ufff4\u001f\ufff9\ufff4\uffdf\ufff6\u001f\ufffa￡ￛ￼\uffdf\ufff6ﾋ￠￼\ufff9\ufff1\ufff0ￛ",1644679408>(
            var10002, var6
         );
         char var53 = (char)((((var52 & '\uffc0') >> 6 | var52 << '\n') ^ 210) - 7 ^ 50 ^ 237);
         0<"JNT",-1864987567,"ᡠᓠᢠౠᖠᏠᠠ\u0be0ᢠ","ڐߨߘۨڠ","\ufff3\ufff4\uffe7\ufff4\u001f\ufff9\ufff4\uffdf\ufff6\u001f\ufffa￡ￛ￼\uffdf\ufff6ﾋ￠￼\ufff9\ufff1\ufff0ￛ",1644679407>(
            var10002, var6, (char)((((var52 & '\uffc0') >> 6 | var52 << '\n') ^ 210) - 7 ^ 50 ^ 237)
         );
      }

      Class_105 var8 = (Class_105)0<"JNT",-2134976441,"ઠᗠᜠᗠᢠଠ","ڐ߰ҀШޠШ۸ӰШӠи۸ݘްрӨӠиؘ܀ۨڠ","\ufff6ￛ",1644653119>(
         0<"JNT",-1864987567,"ᢠᝠၠᢠᠠᗠᜠᕠ","ڐۨ߰ҀШޠШ۸ӰШӠи۸ݘްрӨӠиؘ","\ufff3\ufff4\uffe7\ufff4\u001f\ufff9\ufff4\uffdf\ufff6\u001f\ufffa￡ￛ￼\uffdf\ufff6ﾋ￠￼\ufff9\ufff1\ufff0ￛ",1644653120>(
            var10002
         ),
         false
      );
      int var28 = (338009496 * 372663025 | 0) & 1410490788;

      for (var43 = (StringBuilder)0<"JNT",-2134976441,"ઠᗠᜠᗠᢠଠ","ڐ߰ҀШޠШ۸ӰШӠи۸ݘްрӨӠиؘۨڠ","\ufff3\ufff4\uffe7\ufff4\u001f\ufff9\ufff4\uffdf\ufff6\u001f\ufffa￡ￛ￼\uffdf\ufff6ﾋ￠￼\ufff9\ufff1\ufff0ￛ",1644653122>(
            "‚쀞怞„‟†쀕\ue01e耞쀕\ue020ꀟ怠쀕„\ue01d耟쀕쀟䀟\ue01d„怞쀕䀠쀞怞쀕ꀟ\u001e†\ue01e䀞\ue01e\ue01d耟쀕ꀟ耟쀕䀠쀞\ue01d䀠쀕\u001e䀟ꀟ„‟"
         );
         var28 < (-1105708790 ^ -1647012213 ^ 600616883);
         var28 += (-786875076 ^ 30333928 | 1) & 100663305
      ) {
         char var96 = 0<"JNT",-1864987567,"ᑠᖠᏠᠠ\u0be0ᢠ","ڐߨۨߘ","\ufff3\ufff4\uffe7\ufff4\u001f\ufff9\ufff4\uffdf\ufff6\u001f\ufffa￡ￛ￼\uffdf\ufff6ﾋ￠￼\ufff9\ufff1\ufff0ￛ",1644679562>(
            var43, var28
         );
         char var99 = (char)(
            (((((var96 & '쀀') >> 14 | var96 << 2) + 155 - 226 & 65472) >> 6 | ((var96 & '쀀') >> 14 | var96 << 2) + 155 - 226 << 10) & 65024) >> 9
               | ((((var96 & '쀀') >> 14 | var96 << 2) + 155 - 226 & 65472) >> 6 | ((var96 & '쀀') >> 14 | var96 << 2) + 155 - 226 << 10) << 7
         );
         0<"JNT",-1864987567,"ᡠᓠᢠౠᖠᏠᠠ\u0be0ᢠ","ڐߨߘۨڠ","\ufff3\ufff4\uffe7\ufff4\u001f\ufff9\ufff4\uffdf\ufff6\u001f\ufffa￡ￛ￼\uffdf\ufff6ﾋ￠￼\ufff9\ufff1\ufff0ￛ",1644679561>(
            var43,
            var28,
            (char)(
               (((((var96 & '쀀') >> 14 | var96 << 2) + 155 - 226 & 65472) >> 6 | ((var96 & '쀀') >> 14 | var96 << 2) + 155 - 226 << 10) & 65024) >> 9
                  | ((((var96 & '쀀') >> 14 | var96 << 2) + 155 - 226 & 65472) >> 6 | ((var96 & '쀀') >> 14 | var96 << 2) + 155 - 226 << 10) << 7
            )
         );
      }

      this.field_2251 = 0<"JNT",-1864987567,"Ꮰᣠᒠ","ڐ߰ҀШޠШ۸ӰШӠи۸ݘްрӨӠиؘۨ߰ирؘ","\ufff6ￛ",1644653143>(
         var8,
         0<"JNT",-1864987567,"ᢠᝠၠᢠᠠᗠᜠᕠ","ڐۨ߰ҀШޠШ۸ӰШӠи۸ݘްрӨӠиؘ","\ufff3\ufff4\uffe7\ufff4\u001f\ufff9\ufff4\uffdf\ufff6\u001f\ufffa￡ￛ￼\uffdf\ufff6ﾋ￠￼\ufff9\ufff1\ufff0ￛ",1644653112>(
            var43
         )
      );
      var6 = 1137411286 ^ 1588664315 ^ 494572333;

      for (var10002 = (StringBuilder)0<"JNT",-2134976441,"ઠᗠᜠᗠᢠଠ","ڐ߰ҀШޠШ۸ӰШӠи۸ݘްрӨӠиؘۨڠ","\ufff3\ufff4\uffe7\ufff4\u001f\ufff9\ufff4\uffdf\ufff6\u001f\ufffa￡ￛ￼\uffdf\ufff6ﾋ￠￼\ufff9\ufff1\ufff0ￛ",1644653114>(
            "ˠ̀Ұ̨͠ӈʈΨҐӨͰ̰"
         );
         var6 < (-494130038 * -1924153632 ^ 72049868);
         var6 += 788129250 >>> 788129250 ^ 197032313
      ) {
         int var58 = (
                  0<"JNT",-1864987567,"ᑠᖠᏠᠠ\u0be0ᢠ","ڐߨۨߘ","\ufff3\ufff4\uffe7\ufff4\u001f\ufff9\ufff4\uffdf\ufff6\u001f\ufffa￡ￛ￼\uffdf\ufff6ﾋ￠￼\ufff9\ufff1\ufff0ￛ",1644653113>(
                        var10002, var6
                     )
                     ^ 143
               )
               - 162
               + 54
            ^ 155;
         char var59 = (char)((var58 & 65528) >> 3 | var58 << 13);
         0<"JNT",-1864987567,"ᡠᓠᢠౠᖠᏠᠠ\u0be0ᢠ","ڐߨߘۨڠ","\ufff3\ufff4\uffe7\ufff4\u001f\ufff9\ufff4\uffdf\ufff6\u001f\ufffa￡ￛ￼\uffdf\ufff6ﾋ￠￼\ufff9\ufff1\ufff0ￛ",1644653124>(
            var10002, var6, (char)((var58 & 65528) >> 3 | var58 << 13)
         );
      }

      this.field_2252 = (Class_49)0<"JNT",-2134976441,"ઠᗠᜠᗠᢠଠ","ڐ߰ҀШޠШ۸ӰШӠи۸ݘްрӨӠиؘܰܰܰܰۨڠ","\ufff1￪",1644653118>(
         0<"JNT",-1864987567,"ᢠᝠၠᢠᠠᗠᜠᕠ","ڐۨ߰ҀШޠШ۸ӰШӠи۸ݘްрӨӠиؘ","\ufff3\ufff4\uffe7\ufff4\u001f\ufff9\ufff4\uffdf\ufff6\u001f\ufffa￡ￛ￼\uffdf\ufff6ﾋ￠￼\ufff9\ufff1\ufff0ￛ",1644653115>(
            var10002
         ),
         0.0,
         20.0,
         0.0,
         1.0
      );
      var6 = 330369570 << 330369570 ^ 1321478280;

      for (var10002 = (StringBuilder)0<"JNT",-2134976441,"ઠᗠᜠᗠᢠଠ","ڐ߰ҀШޠШ۸ӰШӠи۸ݘްрӨӠиؘۨڠ","\ufff3\ufff4\uffe7\ufff4\u001f\ufff9\ufff4\uffdf\ufff6\u001f\ufffa￡ￛ￼\uffdf\ufff6ﾋ￠￼\ufff9\ufff1\ufff0ￛ",1644653117>(
            "鵿ീ\ue17f\ue97f\uf17f\udd7e浿\uf17fീ\ue17f䅀"
         );
         var6 < (2009627810 >>> -1832681876 ^ 490636);
         var6 += (-1505144699 & 1701547233 | 0) & -1968936883
      ) {
         char var62 = 0<"JNT",-1864987567,"ᑠᖠᏠᠠ\u0be0ᢠ","ڐߨۨߘ","\ufff3\ufff4\uffe7\ufff4\u001f\ufff9\ufff4\uffdf\ufff6\u001f\ufffa￡ￛ￼\uffdf\ufff6ﾋ￠￼\ufff9\ufff1\ufff0ￛ",1644679572>(
            var10002, var6
         );
         int var122 = (var62 & '\uffc0') >> 6;
         int var63 = ((var62 & '\uffc0') >> 6 | var62 << '\n') - 15 - 247;
         int var123 = (((var62 & '\uffc0') >> 6 | var62 << '\n') - 15 - 247 & 65520) >> 4;
         char var64 = (char)((((var122 | var62 << '\n') - 15 - 247 & 65520) >> 4 | ((var62 & '\uffc0') >> 6 | var62 << '\n') - 15 - 247 << 12) + 122);
         0<"JNT",-1864987567,"ᡠᓠᢠౠᖠᏠᠠ\u0be0ᢠ","ڐߨߘۨڠ","\ufff3\ufff4\uffe7\ufff4\u001f\ufff9\ufff4\uffdf\ufff6\u001f\ufffa￡ￛ￼\uffdf\ufff6ﾋ￠￼\ufff9\ufff1\ufff0ￛ",1644679571>(
            var10002, var6, (char)((var123 | var63 << 12) + 122)
         );
      }

      this.field_2253 = (Class_49)0<"JNT",-2134976441,"ઠᗠᜠᗠᢠଠ","ڐ߰ҀШޠШ۸ӰШӠи۸ݘްрӨӠиؘܰܰܰܰۨڠ","\ufff1￪",1644653126>(
         0<"JNT",-1864987567,"ᢠᝠၠᢠᠠᗠᜠᕠ","ڐۨ߰ҀШޠШ۸ӰШӠи۸ݘްрӨӠиؘ","\ufff3\ufff4\uffe7\ufff4\u001f\ufff9\ufff4\uffdf\ufff6\u001f\ufffa￡ￛ￼\uffdf\ufff6ﾋ￠￼\ufff9\ufff1\ufff0ￛ",1644653123>(
            var10002
         ),
         0.0,
         20.0,
         0.0,
         1.0
      );
      var6 = (-2123136779 & 1567703692 | 0) & -1265839544;

      for (var10002 = (StringBuilder)0<"JNT",-2134976441,"ઠᗠᜠᗠᢠଠ","ڐ߰ҀШޠШ۸ӰШӠи۸ݘްрӨӠиؘۨڠ","\ufff3\ufff4\uffe7\ufff4\u001f\ufff9\ufff4\uffdf\ufff6\u001f\ufffa￡ￛ￼\uffdf\ufff6ﾋ￠￼\ufff9\ufff1\ufff0ￛ",1644653125>(
            "ﮫﯛﯡﯓ\ufb45ﮫ\ufbcfﯭﯕ\ufb45ﮭﯛﯭ\ufbc7ﯗ"
         );
         var6 < ((-727731200 >> 870031370 | 3) & 575519);
         var6 += 801773306 - (-1762022468 << 1019951867) ^ 1338644219
      ) {
         int var67 = 0<"JNT",-1864987567,"ᑠᖠᏠᠠ\u0be0ᢠ","ڐߨۨߘ","\ufff3\ufff4\uffe7\ufff4\u001f\ufff9\ufff4\uffdf\ufff6\u001f\ufffa￡ￛ￼\uffdf\ufff6ﾋ￠￼\ufff9\ufff1\ufff0ￛ",1644679410>(
               var10002, var6
            )
            + 'b';
         char var70 = (char)(
            (((((var67 & 65528) >> 3 | var67 << 13) + 148 & 0) >> 16 | ((var67 & 65528) >> 3 | var67 << 13) + 148 << 0) & 49152) >> 14
               | ((((var67 & 65528) >> 3 | var67 << 13) + 148 & 0) >> 16 | ((var67 & 65528) >> 3 | var67 << 13) + 148 << 0) << 2
         );
         0<"JNT",-1864987567,"ᡠᓠᢠౠᖠᏠᠠ\u0be0ᢠ","ڐߨߘۨڠ","\ufff3\ufff4\uffe7\ufff4\u001f\ufff9\ufff4\uffdf\ufff6\u001f\ufffa￡ￛ￼\uffdf\ufff6ﾋ￠￼\ufff9\ufff1\ufff0ￛ",1644679409>(
            var10002,
            var6,
            (char)(
               (((((var67 & 65528) >> 3 | var67 << 13) + 148 & 0) >> 16 | ((var67 & 65528) >> 3 | var67 << 13) + 148 << 0) & 49152) >> 14
                  | ((((var67 & 65528) >> 3 | var67 << 13) + 148 & 0) >> 16 | ((var67 & 65528) >> 3 | var67 << 13) + 148 << 0) << 2
            )
         );
      }

      this.field_2254 = (Class_105)0<"JNT",-2134976441,"ઠᗠᜠᗠᢠଠ","ڐ߰ҀШޠШ۸ӰШӠи۸ݘްрӨӠиؘ܀ۨڠ","\ufff6ￛ",1644679570>(
         0<"JNT",-1864987567,"ᢠᝠၠᢠᠠᗠᜠᕠ","ڐۨ߰ҀШޠШ۸ӰШӠи۸ݘްрӨӠиؘ","\ufff3\ufff4\uffe7\ufff4\u001f\ufff9\ufff4\uffdf\ufff6\u001f\ufffa￡ￛ￼\uffdf\ufff6ﾋ￠￼\ufff9\ufff1\ufff0ￛ",1644679567>(
            var10002
         ),
         false
      );
      var6 = (-636802203 * 1778003475 | 0) & 8921088;

      for (var10002 = (StringBuilder)0<"JNT",-2134976441,"ઠᗠᜠᗠᢠଠ","ڐ߰ҀШޠШ۸ӰШӠи۸ݘްрӨӠиؘۨڠ","\ufff3\ufff4\uffe7\ufff4\u001f\ufff9\ufff4\uffdf\ufff6\u001f\ufffa￡ￛ￼\uffdf\ufff6ﾋ￠￼\ufff9\ufff1\ufff0ￛ",1644679569>(
            "쁁쁇聈쁆4쁁䁆IF4쀼聈䁊쁈I䁄G"
         );
         var6 < ((-680991073 & -680991073 | 17) & 8454417);
         var6 += -1483033382 << 1530712545 ^ 1328900533
      ) {
         char var73 = 0<"JNT",-1864987567,"ᑠᖠᏠᠠ\u0be0ᢠ","ڐߨۨߘ","\ufff3\ufff4\uffe7\ufff4\u001f\ufff9\ufff4\uffdf\ufff6\u001f\ufffa￡ￛ￼\uffdf\ufff6ﾋ￠￼\ufff9\ufff1\ufff0ￛ",1644679559>(
            var10002, var6
         );
         int var127 = (var73 & '\ufff0') >> 4;
         int var74 = (var73 & '\ufff0') >> 4 | var73 << '\f';
         int var128 = (((var73 & '\ufff0') >> 4 | var73 << '\f') & 65408) >> 7;
         int var75 = ((var127 | var73 << '\f') & 65408) >> 7 | ((var73 & '\ufff0') >> 4 | var73 << '\f') << 9;
         var127 = ((var128 | var74 << 9) & 65520) >> 4;
         int var76 = ((var128 | var74 << 9) & 65520) >> 4 | var75 << 12;
         int var130 = ((((var128 | var74 << 9) & 65520) >> 4 | var75 << 12) & 32768) >> 15;
         char var77 = (char)((((var127 | var75 << 12) & 32768) >> 15 | (((var128 | var74 << 9) & 65520) >> 4 | var75 << 12) << 1) - 176);
         0<"JNT",-1864987567,"ᡠᓠᢠౠᖠᏠᠠ\u0be0ᢠ","ڐߨߘۨڠ","\ufff3\ufff4\uffe7\ufff4\u001f\ufff9\ufff4\uffdf\ufff6\u001f\ufffa￡ￛ￼\uffdf\ufff6ﾋ￠￼\ufff9\ufff1\ufff0ￛ",1644679466>(
            var10002, var6, (char)((var130 | var76 << 1) - 176)
         );
      }

      this.field_2255 = (Class_105)0<"JNT",-2134976441,"ઠᗠᜠᗠᢠଠ","ڐ߰ҀШޠШ۸ӰШӠи۸ݘްрӨӠиؘ܀ۨڠ","\ufff6ￛ",1644679517>(
         0<"JNT",-1864987567,"ᢠᝠၠᢠᠠᗠᜠᕠ","ڐۨ߰ҀШޠШ۸ӰШӠи۸ݘްрӨӠиؘ","\ufff3\ufff4\uffe7\ufff4\u001f\ufff9\ufff4\uffdf\ufff6\u001f\ufffa￡ￛ￼\uffdf\ufff6ﾋ￠￼\ufff9\ufff1\ufff0ￛ",1644679518>(
            var10002
         ),
         false
      );
      var6 = -1770562298 + (1524161062 | -1558179033) ^ -1838139347;

      for (var10002 = (StringBuilder)0<"JNT",-2134976441,"ઠᗠᜠᗠᢠଠ","ڐ߰ҀШޠШ۸ӰШӠи۸ݘްрӨӠиؘۨڠ","\ufff3\ufff4\uffe7\ufff4\u001f\ufff9\ufff4\uffdf\ufff6\u001f\ufffa￡ￛ￼\uffdf\ufff6ﾋ￠￼\ufff9\ufff1\ufff0ￛ",1644679512>(
            "ਠՀրԨט\u07b8ਠՀְԸ"
         );
         var6 < (-246833126 & -605775622 ^ -784302064);
         var6 += (-1123758992 >>> 2066159413 | 1) & 1834936851
      ) {
         char var80 = 0<"JNT",-1864987567,"ᑠᖠᏠᠠ\u0be0ᢠ","ڐߨۨߘ","\ufff3\ufff4\uffe7\ufff4\u001f\ufff9\ufff4\uffdf\ufff6\u001f\ufffa￡ￛ￼\uffdf\ufff6ﾋ￠￼\ufff9\ufff1\ufff0ￛ",1644679469>(
            var10002, var6
         );
         int var131 = (var80 & '쀀') >> 14;
         int var81 = (var80 & '쀀') >> 14 | var80 << 2;
         int var132 = (((var80 & '쀀') >> 14 | var80 << 2) & 65504) >> 5;
         char var82 = (char)(((((var131 | var80 << 2) & 65504) >> 5 | ((var80 & '쀀') >> 14 | var80 << 2) << 11) ^ 67) - 28 ^ 184);
         0<"JNT",-1864987567,"ᡠᓠᢠౠᖠᏠᠠ\u0be0ᢠ","ڐߨߘۨڠ","\ufff3\ufff4\uffe7\ufff4\u001f\ufff9\ufff4\uffdf\ufff6\u001f\ufffa￡ￛ￼\uffdf\ufff6ﾋ￠￼\ufff9\ufff1\ufff0ￛ",1644679464>(
            var10002, var6, (char)(((var132 | var81 << 11) ^ 67) - 28 ^ 184)
         );
      }

      this.field_2256 = (Class_105)0<"JNT",-2134976441,"ઠᗠᜠᗠᢠଠ","ڐ߰ҀШޠШ۸ӰШӠи۸ݘްрӨӠиؘ܀ۨڠ","\ufff6ￛ",1644679526>(
         0<"JNT",-1864987567,"ᢠᝠၠᢠᠠᗠᜠᕠ","ڐۨ߰ҀШޠШ۸ӰШӠи۸ݘްрӨӠиؘ","\ufff3\ufff4\uffe7\ufff4\u001f\ufff9\ufff4\uffdf\ufff6\u001f\ufffa￡ￛ￼\uffdf\ufff6ﾋ￠￼\ufff9\ufff1\ufff0ￛ",1644679523>(
            var10002
         ),
         true
      );
      this.field_2257 = 0;
      this.field_2258 = 0;
      0<"JNT",-1864987567,"០ᣠ","ڐܘ߰ިЈЈؘۨڠ","￪\ufff9",1644679470>(
         this,
         new Class_271[]{
            1<"JNT",1656541166,"㩮㦎","羔ﾞ","ﮝﮩﯭﲝﲉﰱ",-61162788>(this),
            1<"JNT",1656541166,"㩞㨞㫎","羔ﾞ","ﮝﮩﯭﲡﲅﰱ",-61162791>(this),
            1<"JNT",1656541166,"㨾㧎㪎","羔ﾞ","ﮝﮩﯭﲍﲑﰱ",-61162790>(this),
            1<"JNT",1656541166,"㩾㥞㩮","羔ﾞ","ﮝﮩﯭﲍﲑﰱ",-61162793>(this),
            1<"JNT",1656541166,"㧮㨮㩞","羔ﾞ","ﮝﮩﯭﲡﲅﰱ",-61162792>(this),
            1<"JNT",1656541166,"㩾㦮㦮","羔ﾞ","ﮝﮩﯭﲡﲅﰱ",-61162795>(this),
            1<"JNT",1656541166,"㩞㪞㫎","羔ﾞ","ﮝﮩﯭﲡﲅﰱ",-61162794>(this)
         }
      );
   }

   // $VF: renamed from: mg () void
   @Override
   public void method_1407() {
      0<"JNT",1450497436,"ᛠᕠ","ڐۨڠ","￠ￚ\ufff7",1644679465>(this);
   }

   // $VF: renamed from: q () void
   @Override
   public void method_1408() {
      0<"JNT",1450497436,"០","ڐۨڠ","￠ￚ\ufff7",1644679476>(this);
   }

   // $VF: renamed from: gd (Class_207) void
   // $VF: Irreducible bytecode was duplicated to produce valid code
   // $VF: Irreducible bytecode has more than 5 nodes in sequence and was not entirely decomposed
   // Please report this to the Vineflower issue tracker, at https://github.com/Vineflower/vineflower/issues with a copy of the class file (if you have the rights to distribute it!)
   @Class_21
   public void method_1896(Class_207 var1) {
      int var5 = 971138781;
      if (1<"JNT",1656541166,"㦮㧞㦞㨎㦎㤾㙞㚾㚞㚞","ﾑ羓䁋䀲羟羝ﾑ羓羔䁌羑ﾕ䁋䀲羔ﾞ羑쁌쁌쀺쁬쁩䁩","ﮝﮩﯭﱵﲙ﵍ﮁﱹﲩﱵﲙﲑﲅﳉﲕ﵍ﮁﲑﱭﳉﵑﵑﳁﱍﱑﱡﰱ",-61162741>(
            1<"JNT",1656541166,"㨎㩮","羔ﾞ","ﮝﮩﯭﱵﲙ﵍ﮁﱹﲩﱵﲙﲑﲅﳉﲕ﵍ﮁﲑﱭﳉﵑﵑﳁﱑﮉﭽﰱ",-61162738>(this)
         )
         == null) {
         var5 = (-1726765758 - -722517450 | -211083028) & -8700417;

         while (true) {
            label176:
            switch (var5 + 1949087815 - 1648173201 + 303085143 + 1796474427 - 1889128569 - 2022167249) {
               case -1785426223:
                  return;
               case -1654795542:
                  if (!0<"JNT",-1862264976,"ᛠᑠ","ڐߨۨ܀","\ufff9￫",1644679549>(
                     0<"JNT",-1864987567,"ᔠᖠ","ڐۨߨ","�￤",1644679550>(1<"JNT",1656541166,"㩮㦎","羔ﾞ","ﮝﮩﯭﲝﲉﰱ",-61162938>(this))
                  )) {
                     var5 = 285400704 >>> 285400704 ^ -909316855;
                     continue;
                  }

                  if (1<"JNT",1656541166,"㦮㧞㦞㨎㦎㤾㙞㚾㚮㚞","ﾑ羓䁋䀲羟羝ﾑ羓羔䁌羑ﾕ䁋䀲羔ﾞ羑쁌쁌쀺쁬쁩䁩","ﮝﮩﯭﱵﲙ﵍ﮁﱹﲩﱵﲙﲑﲅﳉﲕ﵍ﮁﲑﱭﳉﵑﵑﳁﮅﱑﱩﰱ",-61162942>(
                        1<"JNT",1656541166,"㨎㩮","羔ﾞ","ﮝﮩﯭﱵﲙ﵍ﮁﱹﲩﱵﲙﲑﲅﳉﲕ﵍ﮁﲑﱭﳉﵑﵑﳁﱑﮉﭽﰱ",-61162943>(this)
                     ) instanceof class_3965 var2
                     && 0<"JNT",-1864987567,"ᛠᓠᢠᖠᝠᒠ፠ߠॠॠঠࡠ","ڐۨ߰ӠЈް۸ӈӨӠЈӘрШРް۸ӘӰШјјݸـ٘٨ذӘӰШјјݸـưؘِ","\uffdf\ufff0￡\u001f\ufff8￼\uffdf\ufff0￪ￛ\ufff4\ufff7￡\u001f￪\ufff9\ufff4ￚￚ￮\u001b\u001a,",1644679556>(
                           1<"JNT",1656541166,"㦮㧞㦞㨎㦎㤾㙞㚾㚮㚞","ﾑ羓䁋䀲羟羝ﾑ羓羔䁌羑ﾕ䁋䀲羔ﾞ羑쁌쁌쀺쁬쁩䁩","ﮝﮩﯭﱵﲙ﵍ﮁﱹﲩﱵﲙﲑﲅﳉﲕ﵍ﮁﲑﱭﳉﵑﵑﳁﮅﱑﱩﰱ",-61162944>(
                              1<"JNT",1656541166,"㨎㩮","羔ﾞ","ﮝﮩﯭﱵﲙ﵍ﮁﱹﲩﱵﲙﲑﲅﳉﲕ﵍ﮁﲑﱭﳉﵑﵑﳁﱑﮉﭽﰱ",-61162945>(this)
                           )
                        )
                        == 1<"JNT",1311831168,"㦮㧞㦞㨎㦎㤾㙞㙾㙾㙮","ﾑ羓䁋䀲羟羝ﾑ羓羔䁌羑ﾕ䁋䀲羔ﾞ羑쁌쁌쀺䁬쁬쀵䀳羔ﾞ羑쁌쁌쀺䁬䁫䁩","ﮝﮩﯭﱵﲙ﵍ﮁﱹﲩﱵﲙﲑﲅﳉﲕ﵍ﮁﲑﱭﳉﵑﵑﳁﮅﱑﱩﮍﲑﱭﳉﵑﵑﳁﮅﱍﭽﰱ",-61162946>()
                     && !1<"JNT",1656541166,"㥞㪎","羔ﾞ","ﮝﮩﳥ",-61162949>(this)
                     && !0<"JNT",-1862264976,"ᝠᦠ","ڐ߰ӠЈް۸ӈӨӠЈӘрШРް۸ӘӰШјјݸـؘ٘٘ؐۨ܀","ￛ￤",1644679552>(
                        0<"JNT",-1864987567,"ᛠᓠᢠᖠᝠᒠ፠ߠॠॠॠॠ","ڐۨ߰ӠЈް۸ӈӨӠЈӘрШРް۸ӘӰШјјݸـؘ٘٘ؐ","\uffdf\ufff0￡\u001f\ufff8￼\uffdf\ufff0￪ￛ\ufff4\ufff7￡\u001f￪\ufff9\ufff4ￚￚ￮\u001a,' ",1644679557>(
                           var2
                        )
                     )
                     && 0<"JNT",-1864987567,"Ꮰᦠ","ڐۨ܀","\ufff6ￛ",1644679554>(1<"JNT",1656541166,"㩞㨞㫎","羔ﾞ","ﮝﮩﯭﲡﲅﰱ",-61162950>(this))) {
                     return;
                  }

                  class_1799 var6 = 0<"JNT",-1864987567,"ᛠᓠᢠᖠᝠᒠ፠ठޠࢠॠ","ڐۨ߰ӠЈް۸ӈӨӠЈӘрШРް۸ӘӰШјјݸƨƸ٨٨ؘ","\uffdf\ufff0￡\u001f\ufff8￼\uffdf\ufff0￪ￛ\ufff4\ufff7￡\u001f￪\ufff9\ufff4ￚￚ￮&!'",1644679365>(
                     1<"JNT",1656541166,"㦮㧞㦞㨎㦎㤾㙞㚾㙮㚎","ﾑ羓䁋䀲羟羝ﾑ羓羔䁌羑ﾕ䁋䀲羔ﾞ羑쁌쁌쀺쁬쁩䁩","ﮝﮩﯭﱵﲙ﵍ﮁﱹﲩﱵﲙﲑﲅﳉﲕ﵍ﮁﲑﱭﳉﵑﵑﳁﱡﱍﱕﰱ",-61162885>(
                        1<"JNT",1656541166,"㨎㩮","羔ﾞ","ﮝﮩﯭﱵﲙ﵍ﮁﱹﲩﱵﲙﲑﲅﳉﲕ﵍ﮁﲑﱭﳉﵑﵑﳁﱑﮉﭽﰱ",-61162882>(this)
                     )
                  );
                  if (!0<"JNT",-1864987567,"ᛠᓠᢠᖠᝠᒠ፠ࡠߠ࣠ॠࡠ","ڐ߰ӠЈް۸ӈӨӠЈӘрШРް۸ӘӰШјјݸƠؐƠـؘۨ܀","\uffdf\ufff0￡\u001f\ufff8￼\uffdf\ufff0￪ￛ\ufff4\ufff7￡\u001f￪\ufff9\ufff4ￚￚ￮$&,,",1644679359>(
                     var6, 1<"JNT",1311831168,"㦮㧞㦞㨎㦎㤾㚎㙮㚮㙞㙞","ﾑ羓䁋䀲羟羝ﾑ羓羔䁌羑ﾕ䁋䀲羔ﾞ羑쁌쁌쀺쁬䁫䀵쀵","ﮝﮩﯭﱵﲙ﵍ﮁﱹﲩﱵﲙﲑﲅﳉﲕ﵍ﮁﲑﱭﳉﵑﵑﳁﱕﱝﱕﮅﰱ",-61162887>()
                  )) {
                     if (0<"JNT",-1864987567,"Ꮰᦠ","ڐۨ܀","\ufff6ￛ",1644679361>(1<"JNT",1656541166,"㧮㨮㩞","羔ﾞ","ﮝﮩﯭﲡﲅﰱ",-61162889>(this))) {
                        if (!0<"JNT",-1864987567,"ᛠᓠᢠᖠᝠᒠ፠ࡠߠ࣠ॠࢠ","ڐ߰ӠЈް۸ӈӨӠЈӘрШРް۸ӘӰШјјݸƨƸ٨ـؘۨ܀","\uffdf\ufff0￡\u001f\ufff8￼\uffdf\ufff0￪ￛ\ufff4\ufff7￡\u001f￪\ufff9\ufff4ￚￚ￮$&,,",1644653067>(
                           var6, 1<"JNT",1311831168,"㦮㧞㦞㨎㦎㤾㛎㙮㛎㛎","ﾑ羓䁋䀲羟羝ﾑ羓羔䁌羑ﾕ䁋䀲羔ﾞ羑쁌쁌쀺쁩䀵䁩䁬","ﮝﮩﯭﱵﲙ﵍ﮁﱹﲩﱵﲙﲑﲅﳉﲕ﵍ﮁﲑﱭﳉﵑﵑﳁﮉﱡﱩﮅﰱ",-61162891>()
                        )) {
                           var5 = (1065407762 * 13137324 | -77210239) & -9052223;
                        } else {
                           var5 = -742404104 + 794399793 ^ -702937552;
                        }
                     } else {
                        var5 = (1065407762 * 13137324 | -77210239) & -9052223;
                     }
                  } else {
                     var5 = -742404104 + 794399793 ^ -702937552;
                  }

                  while (true) {
                     switch ((var5 - 945639315 + 1639223340 + 2032573013 ^ 768332952) - 1662369179 - 18254175) {
                        case -1999725960:
                           if (!1<"JNT",1656541166,"㥞㪎","羔ﾞ","ﮝﮩﳥ",-61162909>(this)) {
                              return;
                           }
                           break;
                        case -165764443:
                           if (1<"JNT",1656541166,"㦮㧞㦞㨎㦎㤾㙞㚾㚮㚞","ﾑ羓䁋䀲羟羝ﾑ羓羔䁌羑ﾕ䁋䀲羔ﾞ羑쁌쁌쀺쁬쁩䁩","ﮝﮩﯭﱵﲙ﵍ﮁﱹﲩﱵﲙﲑﲅﳉﲕ﵍ﮁﲑﱭﳉﵑﵑﳁﮅﱑﱩﰱ",-61162892>(
                                 1<"JNT",1656541166,"㨎㩮","羔ﾞ","ﮝﮩﯭﱵﲙ﵍ﮁﱹﲩﱵﲙﲑﲅﳉﲕ﵍ﮁﲑﱭﳉﵑﵑﳁﱑﮉﭽﰱ",-61162893>(this)
                              ) instanceof class_3965 var7
                              && !1<"JNT",1656541166,"㥞㪎","羔ﾞ","ﮝﮩﳥ",-61162895>(this)
                              && 0<"JNT",-1864987567,"Ꮰᦠ","ڐۨ܀","\ufff6ￛ",1644653066>(1<"JNT",1656541166,"㩞㪞㫎","羔ﾞ","ﮝﮩﯭﲡﲅﰱ",-61162894>(this))
                              && 0<"JNT",-1864987567,"ᛠᓠᢠᖠᝠᒠ፠ߠॠॠঠࡠ","ڐۨ߰ӠЈް۸ӈӨӠЈӘрШРް۸ӘӰШјјݸـ٘٨ذӘӰШјјݸـưؘِ","\uffdf\ufff0￡\u001f\ufff8￼\uffdf\ufff0￪ￛ\ufff4\ufff7￡\u001f￪\ufff9\ufff4ￚￚ￮\u001b\u001a,",1644653075>(
                                    1<"JNT",1656541166,"㦮㧞㦞㨎㦎㤾㙞㚾㚮㚞","ﾑ羓䁋䀲羟羝ﾑ羓羔䁌羑ﾕ䁋䀲羔ﾞ羑쁌쁌쀺쁬쁩䁩","ﮝﮩﯭﱵﲙ﵍ﮁﱹﲩﱵﲙﲑﲅﳉﲕ﵍ﮁﲑﱭﳉﵑﵑﳁﮅﱑﱩﰱ",-61162835>(
                                       1<"JNT",1656541166,"㨎㩮","羔ﾞ","ﮝﮩﯭﱵﲙ﵍ﮁﱹﲩﱵﲙﲑﲅﳉﲕ﵍ﮁﲑﱭﳉﵑﵑﳁﱑﮉﭽﰱ",-61162896>(this)
                                    )
                                 )
                                 == 1<"JNT",1311831168,"㦮㧞㦞㨎㦎㤾㙞㙾㙾㙮","ﾑ羓䁋䀲羟羝ﾑ羓羔䁌羑ﾕ䁋䀲羔ﾞ羑쁌쁌쀺䁬쁬쀵䀳羔ﾞ羑쁌쁌쀺䁬䁫䁩","ﮝﮩﯭﱵﲙ﵍ﮁﱹﲩﱵﲙﲑﲅﳉﲕ﵍ﮁﲑﱭﳉﵑﵑﳁﮅﱑﱩﮍﲑﱭﳉﵑﵑﳁﮅﱍﭽﰱ",-61162837>()) {
                              class_2248 var10 = 0<"JNT",-1864987567,"ᛠᓠᢠᖠᝠᒠ፠ࠠठࠠޠࢠ","ڐۨ߰ӠЈް۸ӈӨӠЈӘрШРް۸ӘӰШјјݸــưؘؐ","\uffdf\ufff0￡\u001f\ufff8￼\uffdf\ufff0￪ￛ\ufff4\ufff7￡\u001f￪\ufff9\ufff4ￚￚ￮\u001b'-%",1644653073>(
                                 0<"JNT",-1864987567,"ᛠᓠᢠᖠᝠᒠ፠ঠࡠࠠޠ","ڐ߰ӠЈް۸ӈӨӠЈӘрШРް۸ӘӰШјјݸـؘ٘٘ؐۨ߰ӠЈް۸ӈӨӠЈӘрШРް۸ӘӰШјјݸـƠؘِؐ","\uffdf\ufff0￡\u001f\ufff8￼\uffdf\ufff0￪ￛ\ufff4\ufff7￡\u001f￪\ufff9\ufff4ￚￚ￮'\u001a-",1644653074>(
                                    1<"JNT",1656541166,"㦮㧞㦞㨎㦎㤾㙞㚮㛎㚾","ﾑ羓䁋䀲羟羝ﾑ羓羔䁌羑ﾕ䁋䀲羔ﾞ羑쁌쁌쀺쁬쁩䁩","ﮝﮩﯭﱵﲙ﵍ﮁﱹﲩﱵﲙﲑﲅﳉﲕ﵍ﮁﲑﱭﳉﵑﵑﳁﱕﱑﱝﰱ",-61162903>(
                                       1<"JNT",1656541166,"㨎㩮","羔ﾞ","ﮝﮩﯭﱵﲙ﵍ﮁﱹﲩﱵﲙﲑﲅﳉﲕ﵍ﮁﲑﱭﳉﵑﵑﳁﱑﮉﭽﰱ",-61162836>(this)
                                    ),
                                    0<"JNT",-1864987567,"ᛠᓠᢠᖠᝠᒠ፠ߠॠॠॠॠ","ڐۨ߰ӠЈް۸ӈӨӠЈӘрШРް۸ӘӰШјјݸـؘ٘٘ؐ","\uffdf\ufff0￡\u001f\ufff8￼\uffdf\ufff0￪ￛ\ufff4\ufff7￡\u001f￪\ufff9\ufff4ￚￚ￮\u001a,' ",1644653071>(
                                       var7
                                    )
                                 )
                              );
                              if (var10 != 1<"JNT",1311831168,"㦮㧞㦞㨎㦎㤾㙞㙎㚞㚎㙎","ﾑ羓䁋䀲羟羝ﾑ羓羔䁌羑ﾕ䁋䀲羔ﾞ羑쁌쁌쀺䁬䁬䁫䁮","ﮝﮩﯭﱵﲙ﵍ﮁﱹﲩﱵﲙﲑﲅﳉﲕ﵍ﮁﲑﱭﳉﵑﵑﳁﮅﮅﱍﱝﰱ",-61162907>()
                                 && var10 != 1<"JNT",1311831168,"㦮㧞㦞㨎㦎㤾㛞㛞㛎㚾","ﾑ羓䁋䀲羟羝ﾑ羓羔䁌羑ﾕ䁋䀲羔ﾞ羑쁌쁌쀺䁬䁬䁫䁮","ﮝﮩﯭﱵﲙ﵍ﮁﱹﲩﱵﲙﲑﲅﳉﲕ﵍ﮁﲑﱭﳉﵑﵑﳁﮅﮅﱍﱝﰱ",-61162906>()) {
                                 var5 = 869502886;
                              } else {
                                 var5 = (-1826405517 + -1826405517 | -1919852198) & -577115809;
                              }
                              1<"JNT",1134125337,"㫮㧾㩾","羔ﾞ","ﮝﮩﳥ",-61162912>(
                                 this, switch (((var5 - 839073169 ^ 861212988) - 345364372 + 1389215575 ^ 113887372) + 345070462) {
                                    case -1962525218 -> false;
                                    default -> true;
                                 }
                              );
                           }

                           var5 = (1712214197 & -577532065 | -916117693) & -637587645;

                           while (true) {
                              switch ((var5 ^ 1288533793) + 589401263 + 137592335 + 1141522167 - 1665906496 + 1596870449) {
                                 case -805079753:
                                    if (0<"JNT",-1864987567,"ᛠᓠᢠᖠᝠᒠ፠ࠠࢠ࣠ߠঠ","ڐ߰ӠЈް۸ӈӨӠЈӘрШРް۸ӘӰШјјݸƨƸ٨ـؘۨ܀","\uffdf\ufff0￡\u001f\ufff8￼\uffdf\ufff0￪ￛ\ufff4\ufff7￡\u001f￪\ufff9\ufff4ￚￚ￮&!'",1644679380>(
                                       1<"JNT",1656541166,"㦮㧞㦞㨎㦎㤾㙞㚾㙮㚎","ﾑ羓䁋䀲羟羝ﾑ羓羔䁌羑ﾕ䁋䀲羔ﾞ羑쁌쁌쀺쁬쁩䁩","ﮝﮩﯭﱵﲙ﵍ﮁﱹﲩﱵﲙﲑﲅﳉﲕ﵍ﮁﲑﱭﳉﵑﵑﳁﱡﱍﱕﰱ",-61162961>(
                                          1<"JNT",1656541166,"㨎㩮","羔ﾞ","ﮝﮩﯭﱵﲙ﵍ﮁﱹﲩﱵﲙﲑﲅﳉﲕ﵍ﮁﲑﱭﳉﵑﵑﳁﱑﮉﭽﰱ",-61162958>(this)
                                       ),
                                       1<"JNT",1311831168,"㦮㧞㦞㨎㦎㤾㛎㙾㙎㙞","ﾑ羓䁋䀲羟羝ﾑ羓羔䁌羑ﾕ䁋䀲羔ﾞ羑쁌쁌쀺쁩䀵䁩䁬","ﮝﮩﯭﱵﲙ﵍ﮁﱹﲩﱵﲙﲑﲅﳉﲕ﵍ﮁﲑﱭﳉﵑﵑﳁﮉﱡﱩﮅﰱ",-61162960>()
                                    )) {
                                       Class_191 var9 = (Class_191)0<"JNT",-1864987567,"ᗠᡠ","ڐ߰ҀШޠШ۸ӰШӠи۸ߘӰШјјؘۨ߰ވјРؘ","\uffdf￪",1644679381>(
                                          0<"JNT",-1864987567,"ᦠហ","ڐۨ߰ӠӘؘ","\ufff7\ufff4",1644679382>(
                                             (ScreenUI_78)1<"JNT",1311831168,"㦞㪞㩞","ﾕ羑","ﮝﮩﯭﲥﳉﵕﳉﮁﱭﳉﱵﲡﮁﰁﳅﲥﲙﲑ﵍ﰱ",-61162898>()
                                          ),
                                          Class_191.class
                                       );
                                       if (!0<"JNT",-1864987567,"ហᐠᛠ","ڐۨ܀","\ufff9￦￠",1644679376>(var9)) {
                                          0<"JNT",-1864987567,"ᕠᒠ","ڐ߰ӈҘؘۨڠ","\ufff9￦￠",1644679375>(var9, null);
                                       }
                                    }
                                    break;
                                 case -277094494:
                                    break label176;
                                 case -252956152:
                                    1<"JNT",1134125337,"㥞㪎","羔ﾞ","ﮝﮩﳥ",-61162952>(this, true);
                                    if (!1<"JNT",1656541166,"㫮㧾㩾","羔ﾞ","ﮝﮩﳥ",-61162955>(this)
                                       && 1<"JNT",1656541166,"㦮㧞㦞㨎㦎㤾㙞㚾㚮㚞","ﾑ羓䁋䀲羟羝ﾑ羓羔䁌羑ﾕ䁋䀲羔ﾞ羑쁌쁌쀺쁬쁩䁩","ﮝﮩﯭﱵﲙ﵍ﮁﱹﲩﱵﲙﲑﲅﳉﲕ﵍ﮁﲑﱭﳉﵑﵑﳁﮅﱑﱩﰱ",-61162957>(
                                          1<"JNT",1656541166,"㨎㩮","羔ﾞ","ﮝﮩﯭﱵﲙ﵍ﮁﱹﲩﱵﲙﲑﲅﳉﲕ﵍ﮁﲑﱭﳉﵑﵑﳁﱑﮉﭽﰱ",-61162954>(this)
                                       ) instanceof class_3965 var8) {
                                       if (0<"JNT",-1864987567,"ᛠᓠᢠᖠᝠᒠ፠ߠॠॠঠࡠ","ڐۨ߰ӠЈް۸ӈӨӠЈӘрШРް۸ӘӰШјјݸـ٘٨ذӘӰШјјݸـưؘِ","\uffdf\ufff0￡\u001f\ufff8￼\uffdf\ufff0￪ￛ\ufff4\ufff7￡\u001f￪\ufff9\ufff4ￚￚ￮\u001a,' ",1644679373>(
                                             var8
                                          )
                                          == 1<"JNT",1311831168,"㦮㧞㦞㨎㦎㤾㙞㙾㙾㙾","ﾑ羓䁋䀲羟羝ﾑ羓羔䁌羑ﾕ䁋䀲羔ﾞ羑쁌쁌쀺䁬쁬쀵䀳羔ﾞ羑쁌쁌쀺䁬䁫䁩","ﮝﮩﯭﱵﲙ﵍ﮁﱹﲩﱵﲙﲑﲅﳉﲕ﵍ﮁﲑﱭﳉﵑﵑﳁﮅﱑﱩﮍﲑﱭﳉﵑﵑﳁﮅﱍﭽﰱ",-61162959>()
                                          )
                                        {
                                          return;
                                       }

                                       var5 = (1436613144 | 1436613144 | -1472001723) & -1436562971;

                                       label128:
                                       while (true) {
                                          switch ((var5 - 216308153 ^ 1417609068 ^ 1724560361 ^ 1064988774) - 609655307 + 813187194) {
                                             case -2037931815:
                                                0<"JNT",-1862264976,"ᑠ᧠","ڐ߰ӠЈް۸ӈӨӠЈӘрШРް۸ӘӰШјјݸ٘٨Ơƈؘ܀ۨڠ","ￛ￤",1644679351>(var8, true);
                                                1<"JNT",1134125337,"㥮㨎㫮","羔ﾞ","ﮝﮩﰩ",-61162979>(
                                                   this,
                                                   0<"JNT",-1864987567,"ᔠᨠᕠ","ڐۨߨ","\ufff1￪",1644679321>(
                                                      1<"JNT",1656541166,"㩾㥞㩮","羔ﾞ","ﮝﮩﯭﲍﲑﰱ",-61162977>(this)
                                                   )
                                                );
                                                1<"JNT",1134125337,"㫮㧾㩾","羔ﾞ","ﮝﮩﳥ",-61162978>(this, true);
                                                break label128;
                                             case -1565345314:
                                                if (!0<"JNT",-1862264976,"ᨠᨠ","ڐ߰ӠЈް۸ӈӨӠЈӘрШРް۸ӘӰШјјݸـؘ٘٘ؐ߰ӠЈް۸ӈӨӠЈӘрШРް۸ӘӰШјјݸــưؘؐۨ܀","ￛ￤",1644679327>(
                                                   0<"JNT",-1864987567,"ᛠᓠᢠᖠᝠᒠ፠ߠॠॠॠॠ","ڐۨ߰ӠЈް۸ӈӨӠЈӘрШРް۸ӘӰШјјݸـؘ٘٘ؐ","\uffdf\ufff0￡\u001f\ufff8￼\uffdf\ufff0￪ￛ\ufff4\ufff7￡\u001f￪\ufff9\ufff4ￚￚ￮\u001a,' ",1644679333>(
                                                      var8
                                                   ),
                                                   1<"JNT",1311831168,"㦮㧞㦞㨎㦎㤾㙞㙎㚞㚎㙎","ﾑ羓䁋䀲羟羝ﾑ羓羔䁌羑ﾕ䁋䀲羔ﾞ羑쁌쁌쀺䁬䁬䁫䁮","ﮝﮩﯭﱵﲙ﵍ﮁﱹﲩﱵﲙﲑﲅﳉﲕ﵍ﮁﲑﱭﳉﵑﵑﳁﮅﮅﱍﱝﰱ",-61162983>()
                                                )) {
                                                   if (0<"JNT",-1862264976,"ᨠᨠ","ڐ߰ӠЈް۸ӈӨӠЈӘрШРް۸ӘӰШјјݸـؘ٘٘ؐ߰ӠЈް۸ӈӨӠЈӘрШРް۸ӘӰШјјݸــưؘؐۨ܀","ￛ￤",1644679532>(
                                                         0<"JNT",-1864987567,"ᛠᓠᢠᖠᝠᒠ፠ߠॠॠॠॠ","ڐۨ߰ӠЈް۸ӈӨӠЈӘрШРް۸ӘӰШјјݸـؘ٘٘ؐ","\uffdf\ufff0￡\u001f\ufff8￼\uffdf\ufff0￪ￛ\ufff4\ufff7￡\u001f￪\ufff9\ufff4ￚￚ￮\u001a,' ",1644679330>(
                                                            var8
                                                         ),
                                                         1<"JNT",1311831168,"㦮㧞㦞㨎㦎㤾㙮㙾㙞㚞㙮","ﾑ羓䁋䀲羟羝ﾑ羓羔䁌羑ﾕ䁋䀲羔ﾞ羑쁌쁌쀺䁬䁬䁫䁮","ﮝﮩﯭﱵﲙ﵍ﮁﱹﲩﱵﲙﲑﲅﳉﲕ﵍ﮁﲑﱭﳉﵑﵑﳁﮅﮅﱍﱝﰱ",-61162984>()
                                                      )
                                                      && 0<"JNT",-1862264976,"ᕠᝠᠠ","ڐ߰ӠЈް۸ӈӨӠЈӘрШРް۸ӘӰШјјݸـؘ٘٘ؐۨ܀","ￛ￤",1644679534>(
                                                         0<"JNT",-1864987567,"ᛠᓠᢠᖠᝠᒠ፠ߠॠॠॠॠ","ڐۨ߰ӠЈް۸ӈӨӠЈӘрШРް۸ӘӰШјјݸـؘ٘٘ؐ","\uffdf\ufff0￡\u001f\ufff8￼\uffdf\ufff0￪ￛ\ufff4\ufff7￡\u001f￪\ufff9\ufff4ￚￚ￮\u001a,' ",1644679531>(
                                                            var8
                                                         )
                                                      )) {
                                                      return;
                                                   }

                                                   var5 = (-1843443739 >> (-1843443739 ^ 270951341) | -1240633846) & -30577010;
                                                } else {
                                                   var5 = -1132537586 - (1355542986 + (-1132537586 >>> 1355542986)) ^ -547929061;
                                                }
                                                break;
                                             case -1237091410:
                                                1<"JNT",1134125337,"㫮㧾㩾","羔ﾞ","ﮝﮩﳥ",-61162740>(this, true);
                                                break label128;
                                             case -930565323:
                                                1<"JNT",1134125337,"㨮㨞","羔ﾞ","ﮝﮩﰩ",-61162937>(
                                                   this,
                                                   0<"JNT",-1864987567,"ᔠᨠᕠ","ڐۨߨ","\ufff1￪",1644679471>(
                                                      1<"JNT",1656541166,"㨾㧎㪎","羔ﾞ","ﮝﮩﯭﲍﲑﰱ",-61162935>(this)
                                                   )
                                                );
                                                0<"JNT",-1862264976,"ᤠᨠᐠ","ڐ߰ӠЈް۸ӈӨӠЈӘрШРް۸ӘӰШјјݸƨƸ٨ـؘۨ܀","�",1644679548>(
                                                   1<"JNT",1311831168,"㦮㧞㦞㨎㦎㤾㛎㙮㛎㙞","ﾑ羓䁋䀲羟羝ﾑ羓羔䁌羑ﾕ䁋䀲羔ﾞ羑쁌쁌쀺쁩䀵䁩䁬","ﮝﮩﯭﱵﲙ﵍ﮁﱹﲩﱵﲙﲑﲅﳉﲕ﵍ﮁﲑﱭﳉﵑﵑﳁﮉﱡﱩﮅﰱ",-61162936>()
                                                );
                                                return;
                                             case 151555877:
                                             default:
                                                if (!0<"JNT",-1864987567,"ᛠᓠᢠᖠᝠᒠ፠ࠠࢠ࣠ߠঠ","ڐ߰ӠЈް۸ӈӨӠЈӘрШРް۸ӘӰШјјݸƨƸ٨ـؘۨ܀","\uffdf\ufff0￡\u001f\ufff8￼\uffdf\ufff0￪ￛ\ufff4\ufff7￡\u001f￪\ufff9\ufff4ￚￚ￮&!'",1644679323>(
                                                   1<"JNT",1656541166,"㦮㧞㦞㨎㦎㤾㙞㚾㙮㚎","ﾑ羓䁋䀲羟羝ﾑ羓羔䁌羑ﾕ䁋䀲羔ﾞ羑쁌쁌쀺쁬쁩䁩","ﮝﮩﯭﱵﲙ﵍ﮁﱹﲩﱵﲙﲑﲅﳉﲕ﵍ﮁﲑﱭﳉﵑﵑﳁﱡﱍﱕﰱ",-61162968>(
                                                      1<"JNT",1656541166,"㨎㩮","羔ﾞ","ﮝﮩﯭﱵﲙ﵍ﮁﱹﲩﱵﲙﲑﲅﳉﲕ﵍ﮁﲑﱭﳉﵑﵑﳁﱑﮉﭽﰱ",-61162969>(this)
                                                   ),
                                                   1<"JNT",1311831168,"㦮㧞㦞㨎㦎㤾㛎㙮㛎㙞","ﾑ羓䁋䀲羟羝ﾑ羓羔䁌羑ﾕ䁋䀲羔ﾞ羑쁌쁌쀺쁩䀵䁩䁬","ﮝﮩﯭﱵﲙ﵍ﮁﱹﲩﱵﲙﲑﲅﳉﲕ﵍ﮁﲑﱭﳉﵑﵑﳁﮉﱡﱩﮅﰱ",-61162971>()
                                                )) {
                                                   if (1<"JNT",1656541166,"㨮㨞","羔ﾞ","ﮝﮩﰩ",-61162973>(this) > 0) {
                                                      1<"JNT",1134125337,"㨮㨞","羔ﾞ","ﮝﮩﰩ",-61162975>(
                                                         this, 1<"JNT",1656541166,"㨮㨞","羔ﾞ","ﮝﮩﰩ",-61162972>(this) - 1
                                                      );
                                                      return;
                                                   }

                                                   var5 = -1050098043 + (1409528028 >>> 1775191778) ^ 1759804258;
                                                } else {
                                                   var5 = 962544135 & 962544135 ^ 1443558616;
                                                }
                                                break;
                                             case 2078328884:
                                                if (!0<"JNT",-1864987567,"ᛠᓠᢠᖠᝠᒠ፠ࠠࢠ࣠ߠঠ","ڐ߰ӠЈް۸ӈӨӠЈӘрШРް۸ӘӰШјјݸƨƸ٨ـؘۨ܀","\uffdf\ufff0￡\u001f\ufff8￼\uffdf\ufff0￪ￛ\ufff4\ufff7￡\u001f￪\ufff9\ufff4ￚￚ￮&!'",1644679383>(
                                                   1<"JNT",1656541166,"㦮㧞㦞㨎㦎㤾㙞㚾㙮㚎","ﾑ羓䁋䀲羟羝ﾑ羓羔䁌羑ﾕ䁋䀲羔ﾞ羑쁌쁌쀺쁬쁩䁩","ﮝﮩﯭﱵﲙ﵍ﮁﱹﲩﱵﲙﲑﲅﳉﲕ﵍ﮁﲑﱭﳉﵑﵑﳁﱡﱍﱕﰱ",-61162876>(
                                                      1<"JNT",1656541166,"㨎㩮","羔ﾞ","ﮝﮩﯭﱵﲙ﵍ﮁﱹﲩﱵﲙﲑﲅﳉﲕ﵍ﮁﲑﱭﳉﵑﵑﳁﱑﮉﭽﰱ",-61162877>(this)
                                                   ),
                                                   1<"JNT",1311831168,"㦮㧞㦞㨎㦎㤾㛎㙮㛎㙞","ﾑ羓䁋䀲羟羝ﾑ羓羔䁌羑ﾕ䁋䀲羔ﾞ羑쁌쁌쀺쁩䀵䁩䁬","ﮝﮩﯭﱵﲙ﵍ﮁﱹﲩﱵﲙﲑﲅﳉﲕ﵍ﮁﲑﱭﳉﵑﵑﳁﮉﱡﱩﮅﰱ",-61162879>()
                                                )) {
                                                   break label128;
                                                }

                                                if (1<"JNT",1656541166,"㥮㨎㫮","羔ﾞ","ﮝﮩﰩ",-61162881>(this) > 0) {
                                                   1<"JNT",1134125337,"㥮㨎㫮","羔ﾞ","ﮝﮩﰩ",-61162883>(
                                                      this, 1<"JNT",1656541166,"㥮㨎㫮","羔ﾞ","ﮝﮩﰩ",-61162880>(this) - 1
                                                   );
                                                   return;
                                                }

                                                var5 = (1195716483 << 691247658 | -2079301566) & -288230666;
                                          }
                                       }
                                    }

                                    var5 = 1582934641;
                                    continue;
                                 case 1282895026:
                                 default:
                                    1<"JNT",1134125337,"㧎㧮㧞","羔ﾞ","ﮝﮩﳥ",-61162873>(
                                       this,
                                       0<"JNT",-1862264976,"ᤠᨠᐠ","ڐ߰ӠЈް۸ӈӨӠЈӘрШРް۸ӘӰШјјݸƨƸ٨ـؘۨ܀","�",1644679535>(
                                          1<"JNT",1311831168,"㦮㧞㦞㨎㦎㤾㛎㙾㙎㙞","ﾑ羓䁋䀲羟羝ﾑ羓羔䁌羑ﾕ䁋䀲羔ﾞ羑쁌쁌쀺쁩䀵䁩䁬","ﮝﮩﯭﱵﲙ﵍ﮁﱹﲩﱵﲙﲑﲅﳉﲕ﵍ﮁﲑﱭﳉﵑﵑﳁﮉﱡﱩﮅﰱ",-61162871>()
                                       )
                                    );
                                    1<"JNT",1134125337,"㨮㨞","羔ﾞ","ﮝﮩﰩ",-61162874>(
                                       this, 0<"JNT",-1864987567,"ᔠᨠᕠ","ڐۨߨ","\ufff1￪",1644679356>(1<"JNT",1656541166,"㨾㧎㪎","羔ﾞ","ﮝﮩﯭﲍﲑﰱ",-61162872>(this))
                                    );
                                    return;
                                 case 2111225590:
                                    if (1<"JNT",1656541166,"㫮㧾㩾","羔ﾞ","ﮝﮩﳥ",-61162988>(this)) {
                                       if (!0<"JNT",-1864987567,"ᛠᓠᢠᖠᝠᒠ፠ࠠࢠ࣠ߠঠ","ڐ߰ӠЈް۸ӈӨӠЈӘрШРް۸ӘӰШјјݸƨƸ٨ـؘۨ܀","\uffdf\ufff0￡\u001f\ufff8￼\uffdf\ufff0￪ￛ\ufff4\ufff7￡\u001f￪\ufff9\ufff4ￚￚ￮&!'",1644679529>(
                                             1<"JNT",1656541166,"㦮㧞㦞㨎㦎㤾㙞㚾㙮㚎","ﾑ羓䁋䀲羟羝ﾑ羓羔䁌羑ﾕ䁋䀲羔ﾞ羑쁌쁌쀺쁬쁩䁩","ﮝﮩﯭﱵﲙ﵍ﮁﱹﲩﱵﲙﲑﲅﳉﲕ﵍ﮁﲑﱭﳉﵑﵑﳁﱡﱍﱕﰱ",-61162990>(
                                                1<"JNT",1656541166,"㨎㩮","羔ﾞ","ﮝﮩﯭﱵﲙ﵍ﮁﱹﲩﱵﲙﲑﲅﳉﲕ﵍ﮁﲑﱭﳉﵑﵑﳁﱑﮉﭽﰱ",-61162991>(this)
                                             ),
                                             1<"JNT",1311831168,"㦮㧞㦞㨎㦎㤾㛎㙾㙎㙞","ﾑ羓䁋䀲羟羝ﾑ羓羔䁌羑ﾕ䁋䀲羔ﾞ羑쁌쁌쀺쁩䀵䁩䁬","ﮝﮩﯭﱵﲙ﵍ﮁﱹﲩﱵﲙﲑﲅﳉﲕ﵍ﮁﲑﱭﳉﵑﵑﳁﮉﱡﱩﮅﰱ",-61162993>()
                                          )
                                          && !1<"JNT",1656541166,"㧎㧮㧞","羔ﾞ","ﮝﮩﳥ",-61162931>(this)) {
                                          if (1<"JNT",1656541166,"㨮㨞","羔ﾞ","ﮝﮩﰩ",-61162930>(this) > 0) {
                                             1<"JNT",1134125337,"㨮㨞","羔ﾞ","ﮝﮩﰩ",-61162932>(this, 1<"JNT",1656541166,"㨮㨞","羔ﾞ","ﮝﮩﰩ",-61162933>(this) - 1);
                                             return;
                                          }

                                          var5 = (2017652568 >> -1144529428 | -1376191455) & -1074201171;
                                       } else {
                                          var5 = 1896357958 & 1896357958 ^ 1493484790;
                                       }
                                       continue;
                                    }
                              }

                              var5 = 81842162 - (81842162 << 540173655) ^ -1022081745;
                           }
                        case 1274816509:
                        default:
                           if (!0<"JNT",-1864987567,"Ꮰᦠ","ڐۨ܀","\ufff6ￛ",1644653016>(1<"JNT",1656541166,"㩾㦮㦮","羔ﾞ","ﮝﮩﯭﲡﲅﰱ",-61162908>(this))) {
                              var5 = (589509379 << 1039028896 | 512973564) & -554476804;
                              continue;
                           }

                           if (!0<"JNT",-1864987567,"ᛠᓠᢠᖠᝠᒠ፠ࡠߠ࣠ॠࢠ","ڐ߰ӠЈް۸ӈӨӠЈӘрШРް۸ӘӰШјјݸƨƸ٨ـؘۨ܀","\uffdf\ufff0￡\u001f\ufff8￼\uffdf\ufff0￪ￛ\ufff4\ufff7￡\u001f￪\ufff9\ufff4ￚￚ￮$&,,",1644653018>(
                              var6, 1<"JNT",1311831168,"㦮㧞㦞㨎㦎㤾㛎㙾㙎㙞","ﾑ羓䁋䀲羟羝ﾑ羓羔䁌羑ﾕ䁋䀲羔ﾞ羑쁌쁌쀺쁩䀵䁩䁬","ﮝﮩﯭﱵﲙ﵍ﮁﱹﲩﱵﲙﲑﲅﳉﲕ﵍ﮁﲑﱭﳉﵑﵑﳁﮉﱡﱩﮅﰱ",-61162910>()
                           )) {
                              var5 = (589509379 << 1039028896 | 512973564) & -554476804;
                              continue;
                           }
                     }

                     var5 = -742404104 + 794399793 ^ -702937552;
                  }
               case 2126570631:
               default:
                  0<"JNT",-1864987567,"ᤠᥠ","ڐۨڠ","￪\ufff9",1644679334>(this);
            }

            var5 = (-525875718 | -1517573808) ^ 168701993;
         }
      }
   }

   // $VF: renamed from: lrl (Class_256) void
   // $VF: Irreducible bytecode was duplicated to produce valid code
   @Class_21
   public void method_1897(Class_256 var1) {
      int var3 = 988999641;
      if (1<"JNT",1656541166,"㥞㪎","羔ﾞ","ﮝﮩﳥ",-61162924>(this)) {
         class_1799 var2 = 0<"JNT",-1864987567,"ᛠᓠᢠᖠᝠᒠ፠ठޠࢠॠ","ڐۨ߰ӠЈް۸ӈӨӠЈӘрШРް۸ӘӰШјјݸƨƸ٨٨ؘ","\uffdf\ufff0￡\u001f\ufff8￼\uffdf\ufff0￪ￛ\ufff4\ufff7￡\u001f￪\ufff9\ufff4ￚￚ￮&!'",1644653030>(
            1<"JNT",1656541166,"㦮㧞㦞㨎㦎㤾㙞㚾㙮㚎","ﾑ羓䁋䀲羟羝ﾑ羓羔䁌羑ﾕ䁋䀲羔ﾞ羑쁌쁌쀺쁬쁩䁩","ﮝﮩﯭﱵﲙ﵍ﮁﱹﲩﱵﲙﲑﲅﳉﲕ﵍ﮁﲑﱭﳉﵑﵑﳁﱡﱍﱕﰱ",-61162914>(
               1<"JNT",1656541166,"㨎㩮","羔ﾞ","ﮝﮩﯭﱵﲙ﵍ﮁﱹﲩﱵﲙﲑﲅﳉﲕ﵍ﮁﲑﱭﳉﵑﵑﳁﱑﮉﭽﰱ",-61162915>(this)
            )
         );
         if (!0<"JNT",-1864987567,"ᛠᓠᢠᖠᝠᒠ፠ࡠߠ࣠ॠࢠ","ڐ߰ӠЈް۸ӈӨӠЈӘрШРް۸ӘӰШјјݸƨƸ٨ـؘۨ܀","\uffdf\ufff0￡\u001f\ufff8￼\uffdf\ufff0￪ￛ\ufff4\ufff7￡\u001f￪\ufff9\ufff4ￚￚ￮$&,,",1644653024>(
               var2, 1<"JNT",1311831168,"㦮㧞㦞㨎㦎㤾㛎㙾㙎㙞","ﾑ羓䁋䀲羟羝ﾑ羓羔䁌羑ﾕ䁋䀲羔ﾞ羑쁌쁌쀺쁩䀵䁩䁬","ﮝﮩﯭﱵﲙ﵍ﮁﱹﲩﱵﲙﲑﲅﳉﲕ﵍ﮁﲑﱭﳉﵑﵑﳁﮉﱡﱩﮅﰱ",-61162916>()
            )
            && !0<"JNT",-1864987567,"ᛠᓠᢠᖠᝠᒠ፠ࡠߠ࣠ॠࢠ","ڐ߰ӠЈް۸ӈӨӠЈӘрШРް۸ӘӰШјјݸƨƸ٨ـؘۨ܀","\uffdf\ufff0￡\u001f\ufff8￼\uffdf\ufff0￪ￛ\ufff4\ufff7￡\u001f￪\ufff9\ufff4ￚￚ￮$&,,",1644653026>(
               var2, 1<"JNT",1311831168,"㦮㧞㦞㨎㦎㤾㛎㙮㛎㙞","ﾑ羓䁋䀲羟羝ﾑ羓羔䁌羑ﾕ䁋䀲羔ﾞ羑쁌쁌쀺쁩䀵䁩䁬","ﮝﮩﯭﱵﲙ﵍ﮁﱹﲩﱵﲙﲑﲅﳉﲕ﵍ﮁﲑﱭﳉﵑﵑﳁﮉﱡﱩﮅﰱ",-61162918>()
            )) {
            var3 = -15398798;
         } else {
            var3 = -404227205 & -137118725;
         }

         while (true) {
            switch ((var3 ^ 486840057) + 1191465538 + 841034063 + 1994622066 ^ 2046444146 ^ 594050028) {
               case -2004310256:
               default:
                  return;
               case -1337846757:
            }

            if (!0<"JNT",-1862264976,"ᛠᑠ","ڐߨۨ܀","\ufff9￫",1644652971>(
               0<"JNT",-1864987567,"ᔠᖠ","ڐۨߨ","�￤",1644652972>(1<"JNT",1656541166,"㩮㦎","羔ﾞ","ﮝﮩﯭﲝﲉﰱ",-61162920>(this))
            )) {
               0<"JNT",-1864987567,"ᚠᗠ","ڐۨڠ","￥\ufff3￠",1644652974>(var1);
            }

            var3 = -15398798;
         }
      }
   }

   // $VF: renamed from: vw () void
   public void method_1898() {
      1<"JNT",1134125337,"㥮㨎㫮","羔ﾞ","ﮝﮩﰩ",-61162929>(
         this, 0<"JNT",-1864987567,"ᔠᨠᕠ","ڐۨߨ","\ufff1￪",1644653063>(1<"JNT",1656541166,"㩾㥞㩮","羔ﾞ","ﮝﮩﯭﲍﲑﰱ",-61162927>(this))
      );
      1<"JNT",1134125337,"㨮㨞","羔ﾞ","ﮝﮩﰩ",-61162866>(
         this, 0<"JNT",-1864987567,"ᔠᨠᕠ","ڐۨߨ","\ufff1￪",1644652980>(1<"JNT",1656541166,"㨾㧎㪎","羔ﾞ","ﮝﮩﯭﲍﲑﰱ",-61162928>(this))
      );
      1<"JNT",1134125337,"㥞㪎","羔ﾞ","ﮝﮩﳥ",-61162869>(this, false);
      1<"JNT",1134125337,"㫮㧾㩾","羔ﾞ","ﮝﮩﳥ",-61162868>(this, false);
      1<"JNT",1134125337,"㧎㧮㧞","羔ﾞ","ﮝﮩﳥ",-61164599>(this, false);
   }

   // $VF: renamed from: dws (Class_198) void
   @Class_21
   public void method_1899(Class_198 var1) {
      int var2 = 1253405026;
      if (1<"JNT",1656541166,"㥞㪎","羔ﾞ","ﮝﮩﳥ",-61164609>(this)) {
         var2 = 2045277791;

         while (true) {
            switch ((var2 ^ 146400313 ^ 858515912) + 1194025939 - 1536876337 + 1129852543 ^ 140974088) {
               case -2071373846:
               default:
                  return;
               case 2030319303:
            }

            if (0<"JNT",-1864987567,"ᛠᓠᢠᖠᝠᒠ፠ࡠߠ࣠ॠࢠ","ڐ߰ӠЈް۸ӈӨӠЈӘрШРް۸ӘӰШјјݸƨƸ٨ـؘۨ܀","\uffdf\ufff0￡\u001f\ufff8￼\uffdf\ufff0￪ￛ\ufff4\ufff7￡\u001f￪\ufff9\ufff4ￚￚ￮$&,,",1644653051>(
                  0<"JNT",-1864987567,"ᛠᓠᢠᖠᝠᒠ፠ठޠࢠॠ","ڐۨ߰ӠЈް۸ӈӨӠЈӘрШРް۸ӘӰШјјݸƨƸ٨٨ؘ","\uffdf\ufff0￡\u001f\ufff8￼\uffdf\ufff0￪ￛ\ufff4\ufff7￡\u001f￪\ufff9\ufff4ￚￚ￮&!'",1644652977>(
                     1<"JNT",1656541166,"㦮㧞㦞㨎㦎㤾㙞㚾㙮㚎","ﾑ羓䁋䀲羟羝ﾑ羓羔䁌羑ﾕ䁋䀲羔ﾞ羑쁌쁌쀺쁬쁩䁩","ﮝﮩﯭﱵﲙ﵍ﮁﱹﲩﱵﲙﲑﲅﳉﲕ﵍ﮁﲑﱭﳉﵑﵑﳁﱡﱍﱕﰱ",-61164601>(
                        1<"JNT",1656541166,"㨎㩮","羔ﾞ","ﮝﮩﯭﱵﲙ﵍ﮁﱹﲩﱵﲙﲑﲅﳉﲕ﵍ﮁﲑﱭﳉﵑﵑﳁﱑﮉﭽﰱ",-61164598>(this)
                     )
                  ),
                  1<"JNT",1311831168,"㦮㧞㦞㨎㦎㤾㛎㙾㙎㙞","ﾑ羓䁋䀲羟羝ﾑ羓羔䁌羑ﾕ䁋䀲羔ﾞ羑쁌쁌쀺쁩䀵䁩䁬","ﮝﮩﯭﱵﲙ﵍ﮁﱹﲩﱵﲙﲑﲅﳉﲕ﵍ﮁﲑﱭﳉﵑﵑﳁﮉﱡﱩﮅﰱ",-61164603>()
               )
               && !0<"JNT",-1862264976,"ᛠᑠ","ڐߨۨ܀","\ufff9￫",1644653048>(
                  0<"JNT",-1864987567,"ᔠᖠ","ڐۨߨ","�￤",1644653053>(1<"JNT",1656541166,"㩮㦎","羔ﾞ","ﮝﮩﯭﲝﲉﰱ",-61164605>(this))
               )) {
               0<"JNT",-1864987567,"ᚠᗠ","ڐۨڠ","\ufff8\ufff4￬",1644653079>(var1);
            }

            var2 = 1704431920;
         }
      }
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1413(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 + 580600362 - 2085823171 ^ 1978971136) + 968153857 ^ 280816815) + 2115404495 ^ 1157987501 ^ 188749543 ^ 581024480;
      MethodHandle var10000 = field_2262[(
            ((var10 + 580600362 - 2085823171 ^ 1978971136) + 968153857 ^ 280816815) + 2115404495 ^ 1157987501 ^ 188749543 ^ 581024480
         )
         - 1225238121];
      if (field_2262[var10001 - 1225238121] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = -393875962 ^ -1865423519 ^ -1865423519 ^ -393875962; var23 < var13.length(); var23 += -907428999 << -1719302601 ^ -1132462079) {
            int var42 = var13.charAt(var23);
            int var10004 = (var42 & 49152) >> 14;
            int var43 = (var42 & 49152) >> 14 | var42 << 2;
            int var85 = (((var42 & 49152) >> 14 | var42 << 2) & 65472) >> 6;
            var42 = ((var10004 | var42 << 2) & 65472) >> 6 | ((var42 & 49152) >> 14 | var42 << 2) << 10;
            var10004 = ((var85 | var43 << 10) & 65528) >> 3;
            int var45 = ((var85 | var43 << 10) & 65528) >> 3 | var42 << 13;
            int var87 = ((((var85 | var43 << 10) & 65528) >> 3 | var42 << 13) & 49152) >> 14;
            var42 = (((var10004 | var42 << 13) & 49152) >> 14 | (((var85 | var43 << 10) & 65528) >> 3 | var42 << 13) << 2) + 15 - 252;
            var10004 = ((var87 | var45 << 2) + 15 - 252 & 65535) >> 0;
            int var47 = (((var87 | var45 << 2) + 15 - 252 & 65535) >> 0 | var42 << 16) + 162 + 110;
            int var89 = ((((var87 | var45 << 2) + 15 - 252 & 65535) >> 0 | var42 << 16) + 162 + 110 & 65534) >> 1;
            char var48 = (char)(
               ((var10004 | var42 << 16) + 162 + 110 & 65534) >> 1 | (((var87 | var45 << 2) + 15 - 252 & 65535) >> 0 | var42 << 16) + 162 + 110 << 15
            );
            var13.setCharAt(var23, (char)(var89 | var47 << 15));
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = (1376185073 >>> -800150868 | 0) & 2074120064; var29 < var16.length(); var29 += -47105753 >> -152014426 ^ -736027) {
            char var53 = var16.charAt(var29);
            char var56 = (char)(
               (
                        (
                                 (((((var53 & '\uf000') >> 12 | var53 << 4) & 65472) >> 6 | ((var53 & '\uf000') >> 12 | var53 << 4) << 10) ^ 148)
                                       + 142
                                       - 68
                                       - 178
                                    & 65534
                              )
                              >> 1
                           | (((((var53 & '\uf000') >> 12 | var53 << 4) & 65472) >> 6 | ((var53 & '\uf000') >> 12 | var53 << 4) << 10) ^ 148) + 142 - 68 - 178
                              << 15
                     )
                     + 89
                  ^ 132
                  ^ 17
            );
            var16.setCharAt(
               var29,
               (char)(
                  (
                           (
                                    (((((var53 & '\uf000') >> 12 | var53 << 4) & 65472) >> 6 | ((var53 & '\uf000') >> 12 | var53 << 4) << 10) ^ 148)
                                          + 142
                                          - 68
                                          - 178
                                       & 65534
                                 )
                                 >> 1
                              | (((((var53 & '\uf000') >> 12 | var53 << 4) & 65472) >> 6 | ((var53 & '\uf000') >> 12 | var53 << 4) << 10) ^ 148)
                                    + 142
                                    - 68
                                    - 178
                                 << 15
                        )
                        + 89
                     ^ 132
                     ^ 17
               )
            );
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_40.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = 1064485714 + 1064485714 ^ 2128971428; var35 < var19.length(); var35 += -824743103 & -824743103 ^ -824743104) {
            int var61 = var19.charAt(var35) - 217;
            char var64 = (char)(
               (
                     (((((((var61 & 61440) >> 12 | var61 << 4) & 65520) >> 4 | ((var61 & 61440) >> 12 | var61 << 4) << 12) + 235 + 108 ^ 60) + 26 ^ 203) & 0)
                           >> 16
                        | ((((((var61 & 61440) >> 12 | var61 << 4) & 65520) >> 4 | ((var61 & 61440) >> 12 | var61 << 4) << 12) + 235 + 108 ^ 60) + 26 ^ 203)
                           << 0
                  )
                  - 66
            );
            var19.setCharAt(
               var35,
               (char)(
                  (
                        (((((((var61 & 61440) >> 12 | var61 << 4) & 65520) >> 4 | ((var61 & 61440) >> 12 | var61 << 4) << 12) + 235 + 108 ^ 60) + 26 ^ 203) & 0)
                              >> 16
                           | ((((((var61 & 61440) >> 12 | var61 << 4) & 65520) >> 4 | ((var61 & 61440) >> 12 | var61 << 4) << 12) + 235 + 108 ^ 60) + 26 ^ 203)
                              << 0
                     )
                     - 66
               )
            );
         }

         Class var7 = Class.forName(var19.toString(), false, Class_40.class.getClassLoader());
         switch (((var4 - 663028267 + 895132612 - 1750871345 + 444147055 ^ 2125254243) + 928602760 ^ 971203224) - 920973179 - 915478202 + 590756076) {
            case 39102548:
               var10000 = var0.findConstructor(var7, var6);
               break;
            case 303361515:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            case 303846146:
            case 372256263:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 1334299575:
               var10000 = var0.findSpecial(var7, var5, var6, Class_40.class);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_2262[(((var10 + 580600362 - 2085823171 ^ 1978971136) + 968153857 ^ 280816815) + 2115404495 ^ 1157987501 ^ 188749543 ^ 581024480) - 1225238121] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1414(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 + 1991615856 - 1019969919 ^ 2088834773 ^ 190670388) - 525004540 ^ 898448479) + 928069579 - 1338345651 - 321717691;
      MethodHandle var10000 = field_2262[((var10 + 1991615856 - 1019969919 ^ 2088834773 ^ 190670388) - 525004540 ^ 898448479)
         + 928069579
         - 1338345651
         - 321717691
         + 333501286];
      if (field_2262[var10001 + 333501286] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = -1355193835 >> -1355193835 ^ -647; var24 < var14.length(); var24 += (587043222 & 2066787610 | 1) & -2139000663) {
            char var43 = var14.charAt(var24);
            char var48 = (char)(
               (
                     (
                              (
                                    (
                                             (
                                                      (
                                                               (
                                                                        (((var43 & '\ufff8') >> 3 | var43 << '\r') & 65024) >> 9
                                                                           | ((var43 & '\ufff8') >> 3 | var43 << '\r') << 7
                                                                     )
                                                                     + 157
                                                                  & 65504
                                                            )
                                                            >> 5
                                                         | (
                                                                  (((var43 & '\ufff8') >> 3 | var43 << '\r') & 65024) >> 9
                                                                     | ((var43 & '\ufff8') >> 3 | var43 << '\r') << 7
                                                               )
                                                               + 157
                                                            << 11
                                                   )
                                                   - 176
                                                   + 224
                                                   + 108
                                                & 65472
                                          )
                                          >> 6
                                       | (
                                                (
                                                         (
                                                                  (((var43 & '\ufff8') >> 3 | var43 << '\r') & 65024) >> 9
                                                                     | ((var43 & '\ufff8') >> 3 | var43 << '\r') << 7
                                                               )
                                                               + 157
                                                            & 65504
                                                      )
                                                      >> 5
                                                   | ((((var43 & '\ufff8') >> 3 | var43 << '\r') & 65024) >> 9 | ((var43 & '\ufff8') >> 3 | var43 << '\r') << 7)
                                                         + 157
                                                      << 11
                                             )
                                             - 176
                                             + 224
                                             + 108
                                          << 10
                                 )
                                 & 57344
                           )
                           >> 13
                        | (
                              (
                                       (
                                                (
                                                         (
                                                                  (((var43 & '\ufff8') >> 3 | var43 << '\r') & 65024) >> 9
                                                                     | ((var43 & '\ufff8') >> 3 | var43 << '\r') << 7
                                                               )
                                                               + 157
                                                            & 65504
                                                      )
                                                      >> 5
                                                   | ((((var43 & '\ufff8') >> 3 | var43 << '\r') & 65024) >> 9 | ((var43 & '\ufff8') >> 3 | var43 << '\r') << 7)
                                                         + 157
                                                      << 11
                                             )
                                             - 176
                                             + 224
                                             + 108
                                          & 65472
                                    )
                                    >> 6
                                 | (
                                          (
                                                   ((((var43 & '\ufff8') >> 3 | var43 << '\r') & 65024) >> 9 | ((var43 & '\ufff8') >> 3 | var43 << '\r') << 7)
                                                         + 157
                                                      & 65504
                                                )
                                                >> 5
                                             | ((((var43 & '\ufff8') >> 3 | var43 << '\r') & 65024) >> 9 | ((var43 & '\ufff8') >> 3 | var43 << '\r') << 7)
                                                   + 157
                                                << 11
                                       )
                                       - 176
                                       + 224
                                       + 108
                                    << 10
                           )
                           << 3
                  )
                  - 73
            );
            var14.setCharAt(
               var24,
               (char)(
                  (
                        (
                                 (
                                       (
                                                (
                                                         (
                                                                  (
                                                                           (((var43 & '\ufff8') >> 3 | var43 << '\r') & 65024) >> 9
                                                                              | ((var43 & '\ufff8') >> 3 | var43 << '\r') << 7
                                                                        )
                                                                        + 157
                                                                     & 65504
                                                               )
                                                               >> 5
                                                            | (
                                                                     (((var43 & '\ufff8') >> 3 | var43 << '\r') & 65024) >> 9
                                                                        | ((var43 & '\ufff8') >> 3 | var43 << '\r') << 7
                                                                  )
                                                                  + 157
                                                               << 11
                                                      )
                                                      - 176
                                                      + 224
                                                      + 108
                                                   & 65472
                                             )
                                             >> 6
                                          | (
                                                   (
                                                            (
                                                                     (((var43 & '\ufff8') >> 3 | var43 << '\r') & 65024) >> 9
                                                                        | ((var43 & '\ufff8') >> 3 | var43 << '\r') << 7
                                                                  )
                                                                  + 157
                                                               & 65504
                                                         )
                                                         >> 5
                                                      | (
                                                               (((var43 & '\ufff8') >> 3 | var43 << '\r') & 65024) >> 9
                                                                  | ((var43 & '\ufff8') >> 3 | var43 << '\r') << 7
                                                            )
                                                            + 157
                                                         << 11
                                                )
                                                - 176
                                                + 224
                                                + 108
                                             << 10
                                    )
                                    & 57344
                              )
                              >> 13
                           | (
                                 (
                                          (
                                                   (
                                                            (
                                                                     (((var43 & '\ufff8') >> 3 | var43 << '\r') & 65024) >> 9
                                                                        | ((var43 & '\ufff8') >> 3 | var43 << '\r') << 7
                                                                  )
                                                                  + 157
                                                               & 65504
                                                         )
                                                         >> 5
                                                      | (
                                                               (((var43 & '\ufff8') >> 3 | var43 << '\r') & 65024) >> 9
                                                                  | ((var43 & '\ufff8') >> 3 | var43 << '\r') << 7
                                                            )
                                                            + 157
                                                         << 11
                                                )
                                                - 176
                                                + 224
                                                + 108
                                             & 65472
                                       )
                                       >> 6
                                    | (
                                             (
                                                      (
                                                               (((var43 & '\ufff8') >> 3 | var43 << '\r') & 65024) >> 9
                                                                  | ((var43 & '\ufff8') >> 3 | var43 << '\r') << 7
                                                            )
                                                            + 157
                                                         & 65504
                                                   )
                                                   >> 5
                                                | ((((var43 & '\ufff8') >> 3 | var43 << '\r') & 65024) >> 9 | ((var43 & '\ufff8') >> 3 | var43 << '\r') << 7)
                                                      + 157
                                                   << 11
                                          )
                                          - 176
                                          + 224
                                          + 108
                                       << 10
                              )
                              << 3
                     )
                     - 73
               )
            );
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = 1055937020 + -2045011789 ^ -989074769; var30 < var17.length(); var30 += (-257811050 | -1090948230) ^ -17072129) {
            char var53 = var17.charAt(var30);
            int var90 = (var53 & '\ue000') >> 13;
            int var54 = (((var53 & '\ue000') >> 13 | var53 << 3) + 85 + 37 ^ 125) + 3;
            int var91 = ((((var53 & '\ue000') >> 13 | var53 << 3) + 85 + 37 ^ 125) + 3 & 65532) >> 2;
            var53 = (char)(
               (((((var90 | var53 << 3) + 85 + 37 ^ 125) + 3 & 65532) >> 2 | (((var53 & '\ue000') >> 13 | var53 << 3) + 85 + 37 ^ 125) + 3 << 14) ^ 173) + 150
                  ^ 223
                  ^ 55
            );
            var17.setCharAt(var30, (char)(((var91 | var54 << 14) ^ 173) + 150 ^ 223 ^ 55));
         }

         Class var6 = Class.forName(var17.toString(), false, Class_40.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = -293709567 ^ 732482243 ^ -975793214; var36 < var20.length(); var36 += 1539997956 >>> 594469389 ^ 187989) {
            int var60 = var20.charAt(var36) - 'j' ^ 100;
            char var65 = (char)(
               (
                     (
                              (
                                    (
                                             (
                                                      (
                                                               ((((var60 & 65532) >> 2 | var60 << 14) & 0) >> 16 | ((var60 & 65532) >> 2 | var60 << 14) << 0)
                                                                     - 26
                                                                  & 65528
                                                            )
                                                            >> 3
                                                         | ((((var60 & 65532) >> 2 | var60 << 14) & 0) >> 16 | ((var60 & 65532) >> 2 | var60 << 14) << 0) - 26
                                                            << 13
                                                   )
                                                   + 18
                                                & 65472
                                          )
                                          >> 6
                                       | (
                                                (((((var60 & 65532) >> 2 | var60 << 14) & 0) >> 16 | ((var60 & 65532) >> 2 | var60 << 14) << 0) - 26 & 65528)
                                                      >> 3
                                                   | ((((var60 & 65532) >> 2 | var60 << 14) & 0) >> 16 | ((var60 & 65532) >> 2 | var60 << 14) << 0) - 26 << 13
                                             )
                                             + 18
                                          << 10
                                 )
                                 & 65408
                           )
                           >> 7
                        | (
                              (
                                       (
                                                (((((var60 & 65532) >> 2 | var60 << 14) & 0) >> 16 | ((var60 & 65532) >> 2 | var60 << 14) << 0) - 26 & 65528)
                                                      >> 3
                                                   | ((((var60 & 65532) >> 2 | var60 << 14) & 0) >> 16 | ((var60 & 65532) >> 2 | var60 << 14) << 0) - 26 << 13
                                             )
                                             + 18
                                          & 65472
                                    )
                                    >> 6
                                 | (
                                          (((((var60 & 65532) >> 2 | var60 << 14) & 0) >> 16 | ((var60 & 65532) >> 2 | var60 << 14) << 0) - 26 & 65528) >> 3
                                             | ((((var60 & 65532) >> 2 | var60 << 14) & 0) >> 16 | ((var60 & 65532) >> 2 | var60 << 14) << 0) - 26 << 13
                                       )
                                       + 18
                                    << 10
                           )
                           << 9
                  )
                  + 221
            );
            var20.setCharAt(
               var36,
               (char)(
                  (
                        (
                                 (
                                       (
                                                (
                                                         (
                                                                  ((((var60 & 65532) >> 2 | var60 << 14) & 0) >> 16 | ((var60 & 65532) >> 2 | var60 << 14) << 0)
                                                                        - 26
                                                                     & 65528
                                                               )
                                                               >> 3
                                                            | ((((var60 & 65532) >> 2 | var60 << 14) & 0) >> 16 | ((var60 & 65532) >> 2 | var60 << 14) << 0)
                                                                  - 26
                                                               << 13
                                                      )
                                                      + 18
                                                   & 65472
                                             )
                                             >> 6
                                          | (
                                                   (((((var60 & 65532) >> 2 | var60 << 14) & 0) >> 16 | ((var60 & 65532) >> 2 | var60 << 14) << 0) - 26 & 65528)
                                                         >> 3
                                                      | ((((var60 & 65532) >> 2 | var60 << 14) & 0) >> 16 | ((var60 & 65532) >> 2 | var60 << 14) << 0) - 26
                                                         << 13
                                                )
                                                + 18
                                             << 10
                                    )
                                    & 65408
                              )
                              >> 7
                           | (
                                 (
                                          (
                                                   (((((var60 & 65532) >> 2 | var60 << 14) & 0) >> 16 | ((var60 & 65532) >> 2 | var60 << 14) << 0) - 26 & 65528)
                                                         >> 3
                                                      | ((((var60 & 65532) >> 2 | var60 << 14) & 0) >> 16 | ((var60 & 65532) >> 2 | var60 << 14) << 0) - 26
                                                         << 13
                                                )
                                                + 18
                                             & 65472
                                       )
                                       >> 6
                                    | (
                                             (((((var60 & 65532) >> 2 | var60 << 14) & 0) >> 16 | ((var60 & 65532) >> 2 | var60 << 14) << 0) - 26 & 65528) >> 3
                                                | ((((var60 & 65532) >> 2 | var60 << 14) & 0) >> 16 | ((var60 & 65532) >> 2 | var60 << 14) << 0) - 26 << 13
                                          )
                                          + 18
                                       << 10
                              )
                              << 9
                     )
                     + 221
               )
            );
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_40.class.getClassLoader()).returnType();
         switch (var4 - 1286910153 - 1971088715 + 1093259846 - 557302128 - 1097540565 - 121432041 + 660929405 + 308753667 - 180003193 - 2059495923) {
            case 218262833:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            case 395968664:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            case 740678662:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            case 959305390:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_2262[((var10 + 1991615856 - 1019969919 ^ 2088834773 ^ 190670388) - 525004540 ^ 898448479) + 928069579 - 1338345651 - 321717691 + 333501286] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
