import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;

public enum Class_38 {
   // $VF: renamed from: zlh Class_38
   field_1202,
   // $VF: renamed from: mki Class_38
   field_1203,
   uiyc;

   // $VF: renamed from: rvq java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_1205 = new MethodHandle[21];

   // $VF: Failed to inline enum fields
   // Please report this to the Vineflower issue tracker, at https://github.com/Vineflower/vineflower/issues with a copy of the class file (if you have the rights to distribute it!)
   static {
      int var10000 = -1881759557 - -1881759557 ^ 0;

      StringBuilder var10001;
      for (var10001 = (StringBuilder)0<"JNT",-1594893814,"ᒄῄ℄ῄ⊄ᔄ","ᵊ\u206a\u1f5aἒᾺἒᶂὪἒὺὂᶂ₢ᾪᾚὒὺὂᷢᵒ₺","覦覔襾覔訮親覔覮覠訮覸襺襶覤覮覠觖襼覤親覚覜襶",460266439>(
            "\ue58c斝\ue596\ue59c斗\ue597"
         );
         var10000 < ((1173863318 >>> 1627731072 | 0) & 268451911);
         var10000 += (628941851 >> 628941851 | 1) & -1782869229
      ) {
         int var10 = 0<"JNT",-2145156128,"Ṅᾄ᷄∄ᗄ⊄","ᵊ⁒ᵒ•","覦覔襾覔訮親覔覮覠訮覸襺襶覤覮覠觖襼覤親覚覜襶",460266446>(var10001, var10000) + 153;
         char var13 = (char)(
            (((((var10 & 65528) >> 3 | var10 << 13) & 65472) >> 6 | ((var10 & 65528) >> 3 | var10 << 13) << 10) + 205 & 65472) >> 6
               | ((((var10 & 65528) >> 3 | var10 << 13) & 65472) >> 6 | ((var10 & 65528) >> 3 | var10 << 13) << 10) + 205 << 10
         );
         0<"JNT",-2145156128,"≄Ễ⊄ᙄᾄ᷄∄ᗄ⊄","ᵊ⁒•ᵒ₺","覦覔襾覔訮親覔覮覠訮覸襺襶覤覮覠觖襼覤親覚覜襶",460266427>(
            var10001,
            var10000,
            (char)(
               (((((var10 & 65528) >> 3 | var10 << 13) & 65472) >> 6 | ((var10 & 65528) >> 3 | var10 << 13) << 10) + 205 & 65472) >> 6
                  | ((((var10 & 65528) >> 3 | var10 << 13) & 65472) >> 6 | ((var10 & 65528) >> 3 | var10 << 13) << 10) + 205 << 10
            )
         );
      }

      field_1202 = (Class_38)0<"JNT",-1594893814,"ᒄῄ℄ῄ⊄ᔄ","ᵊ\u206a\u1f5aἒᾺἒᶂὪἒὺὂᶂ₢ᾪᾚὒὺὂᷢ⁒ᵒ₺","覘覨",460266441>(
         0<"JNT",-2145156128,"⊄⅄ᩄ⊄∄ῄ℄ὄ","ᵊᵒ\u206a\u1f5aἒᾺἒᶂὪἒὺὂᶂ₢ᾪᾚὒὺὂᷢ","覦覔襾覔訮親覔覮覠訮覸襺襶覤覮覠觖襼覤親覚覜襶",460266420>(var10001), 0
      );
      var10000 = (-416311102 << (1872179598 & -593201695) | 0) & 146818093;

      for (var10001 = (StringBuilder)0<"JNT",-1594893814,"ᒄῄ℄ῄ⊄ᔄ","ᵊ\u206a\u1f5aἒᾺἒᶂὪἒὺὂᶂ₢ᾪᾚὒὺὂᷢᵒ₺","覦覔襾覔訮親覔覮覠訮覸襺襶覤覮覠觖襼覤親覚覜襶",460266438>("飩쫩\udce9컩\ue8e9탩");
         var10000 < (765209897 + 765209897 ^ 1530419796);
         var10000 += -1742339853 - -1606534942 ^ -135804912
      ) {
         int var16 = 0<"JNT",-2145156128,"Ṅᾄ᷄∄ᗄ⊄","ᵊ⁒ᵒ•","覦覔襾覔訮親覔覮覠訮覸襺襶覤覮覠觖襼覤親覚覜襶",460266419>(var10001, var10000) - 6 ^ 136;
         int var35 = (var16 & 32768) >> 15;
         int var17 = ((var16 & 32768) >> 15 | var16 << 1) ^ 214;
         int var36 = ((((var16 & 32768) >> 15 | var16 << 1) ^ 214) & 64512) >> 10;
         char var18 = (char)((((var35 | var16 << 1) ^ 214) & 64512) >> 10 | (((var16 & 32768) >> 15 | var16 << 1) ^ 214) << 6);
         0<"JNT",-2145156128,"≄Ễ⊄ᙄᾄ᷄∄ᗄ⊄","ᵊ⁒•ᵒ₺","覦覔襾覔訮親覔覮覠訮覸襺襶覤覮覠觖襼覤親覚覜襶",460266432>(var10001, var10000, (char)(var36 | var17 << 6));
      }

      field_1203 = (Class_38)0<"JNT",-1594893814,"ᒄῄ℄ῄ⊄ᔄ","ᵊ\u206a\u1f5aἒᾺἒᶂὪἒὺὂᶂ₢ᾪᾚὒὺὂᷢ⁒ᵒ₺","覘覨",460266418>(
         0<"JNT",-2145156128,"⊄⅄ᩄ⊄∄ῄ℄ὄ","ᵊᵒ\u206a\u1f5aἒᾺἒᶂὪἒὺὂᶂ₢ᾪᾚὒὺὂᷢ","覦覔襾覔訮親覔覮覠訮覸襺襶覤覮覠觖襼覤親覚覜襶",460266421>(var10001), 1
      );
      var10000 = -837819437 << -1899935834 ^ -2080836416;

      for (var10001 = (StringBuilder)0<"JNT",-1594893814,"ᒄῄ℄ῄ⊄ᔄ","ᵊ\u206a\u1f5aἒᾺἒᶂὪἒὺὂᶂ₢ᾪᾚὒὺὂᷢᵒ₺","覦覔襾覔訮親覔覮覠訮覸襺襶覤覮覠觖襼覤親覚覜襶",460266431>("閰쾰\uf5b0쾰");
         var10000 < (115053807 & -1325119228);
         var10000 += (-1734130279 * -1878191123 | 1) & 151060569
      ) {
         char var21 = 0<"JNT",-2145156128,"Ṅᾄ᷄∄ᗄ⊄","ᵊ⁒ᵒ•","覦覔襾覔訮親覔覮覠訮覸襺襶覤覮覠觖襼覤親覚覜襶",460266428>(var10001, var10000);
         char var24 = (char)(
            ((((((var21 & '\ufffe') >> 1 | var21 << 15) ^ 216) & 65024) >> 9 | (((var21 & '\ufffe') >> 1 | var21 << 15) ^ 216) << 7) - 3 & 32768) >> 15
               | (((((var21 & '\ufffe') >> 1 | var21 << 15) ^ 216) & 65024) >> 9 | (((var21 & '\ufffe') >> 1 | var21 << 15) ^ 216) << 7) - 3 << 1
         );
         0<"JNT",-2145156128,"≄Ễ⊄ᙄᾄ᷄∄ᗄ⊄","ᵊ⁒•ᵒ₺","覦覔襾覔訮親覔覮覠訮覸襺襶覤覮覠觖襼覤親覚覜襶",460266449>(
            var10001,
            var10000,
            (char)(
               ((((((var21 & '\ufffe') >> 1 | var21 << 15) ^ 216) & 65024) >> 9 | (((var21 & '\ufffe') >> 1 | var21 << 15) ^ 216) << 7) - 3 & 32768) >> 15
                  | (((((var21 & '\ufffe') >> 1 | var21 << 15) ^ 216) & 65024) >> 9 | (((var21 & '\ufffe') >> 1 | var21 << 15) ^ 216) << 7) - 3 << 1
            )
         );
      }

      uiyc = (Class_38)0<"JNT",-1594893814,"ᒄῄ℄ῄ⊄ᔄ","ᵊ\u206a\u1f5aἒᾺἒᶂὪἒὺὂᶂ₢ᾪᾚὒὺὂᷢ⁒ᵒ₺","覘覨",460266429>(
         0<"JNT",-2145156128,"⊄⅄ᩄ⊄∄ῄ℄ὄ","ᵊᵒ\u206a\u1f5aἒᾺἒᶂὪἒὺὂᶂ₢ᾪᾚὒὺὂᷢ","覦覔襾覔訮親覔覮覠訮覸襺襶覤覮覠觖襼覤親覚覜襶",460266440>(var10001), 2
      );
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1248(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 + 205887142 ^ 2145275397) + 764323573 - 1882336341 - 1395889836 ^ 1212034436) - 628692193 - 1923607313 + 1372610091;
      MethodHandle var10000 = field_1205[((var10 + 205887142 ^ 2145275397) + 764323573 - 1882336341 - 1395889836 ^ 1212034436)
            - 628692193
            - 1923607313
            + 1372610091
         ^ 1146956829];
      if (field_1205[var10001 ^ 1146956829] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = (-471998222 ^ -2005846479 | 0) & 67117064; var23 < var13.length(); var23 += (1024040236 | 1430154766 | 1) & 41943041) {
            int var42 = var13.charAt(var23);
            int var10004 = (var42 & 65472) >> 6;
            int var43 = (var42 & 65472) >> 6 | var42 << 10;
            int var91 = (((var42 & 65472) >> 6 | var42 << 10) & 61440) >> 12;
            var42 = ((var10004 | var42 << 10) & 61440) >> 12 | ((var42 & 65472) >> 6 | var42 << 10) << 4;
            var10004 = ((var91 | var43 << 4) & 65535) >> 0;
            int var45 = ((var91 | var43 << 4) & 65535) >> 0 | var42 << 16;
            int var93 = ((((var91 | var43 << 4) & 65535) >> 0 | var42 << 16) & 65532) >> 2;
            var42 = (((var10004 | var42 << 16) & 65532) >> 2 | (((var91 | var43 << 4) & 65535) >> 0 | var42 << 16) << 14) - 82;
            var10004 = ((var93 | var45 << 14) - 82 & 61440) >> 12;
            int var47 = (((var93 | var45 << 14) - 82 & 61440) >> 12 | var42 << 4) + 229 - 84 - 245;
            int var95 = ((((var93 | var45 << 14) - 82 & 61440) >> 12 | var42 << 4) + 229 - 84 - 245 & 65472) >> 6;
            char var48 = (char)(
               ((var10004 | var42 << 4) + 229 - 84 - 245 & 65472) >> 6 | (((var93 | var45 << 14) - 82 & 61440) >> 12 | var42 << 4) + 229 - 84 - 245 << 10
            );
            var13.setCharAt(var23, (char)(var95 | var47 << 10));
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = (-377846369 * -618696178 | 0) & 2021827340; var29 < var16.length(); var29 += (-1542116974 * -361144873 | 1) & 672793697) {
            int var53 = var16.charAt(var29) - 162 + 30 + 121;
            int var96 = (var53 & 32768) >> 15;
            int var54 = (var53 & 32768) >> 15 | var53 << 1;
            int var97 = (((var53 & 32768) >> 15 | var53 << 1) & 65024) >> 9;
            var53 = ((((var96 | var53 << 1) & 65024) >> 9 | ((var53 & 32768) >> 15 | var53 << 1) << 7) + 27 ^ 101) + 164;
            var96 = (((var97 | var54 << 7) + 27 ^ 101) + 164 & 65534) >> 1;
            int var56 = (((var97 | var54 << 7) + 27 ^ 101) + 164 & 65534) >> 1 | var53 << 15;
            int var99 = (((((var97 | var54 << 7) + 27 ^ 101) + 164 & 65534) >> 1 | var53 << 15) & 64512) >> 10;
            char var57 = (char)(((var96 | var53 << 15) & 64512) >> 10 | ((((var97 | var54 << 7) + 27 ^ 101) + 164 & 65534) >> 1 | var53 << 15) << 6);
            var16.setCharAt(var29, (char)(var99 | var56 << 6));
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_38.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = 1552518818 << (-599587243 >> -700171087) ^ -1189929660; var35 < var19.length(); var35 += -1909124686 >> 1715792961 ^ -954562344) {
            int var62 = var19.charAt(var35) + 141;
            char var67 = (char)(
               (
                     (
                              (
                                    (
                                             (
                                                   (
                                                            (
                                                                     ((((var62 & 65024) >> 9 | var62 << 7) ^ 52) & 32768) >> 15
                                                                        | (((var62 & 65024) >> 9 | var62 << 7) ^ 52) << 1
                                                                  )
                                                                  + 31
                                                               & 32768
                                                         )
                                                         >> 15
                                                      | (
                                                               ((((var62 & 65024) >> 9 | var62 << 7) ^ 52) & 32768) >> 15
                                                                  | (((var62 & 65024) >> 9 | var62 << 7) ^ 52) << 1
                                                            )
                                                            + 31
                                                         << 1
                                                )
                                                & 65535
                                          )
                                          >> 0
                                       | (
                                             (
                                                      (
                                                               ((((var62 & 65024) >> 9 | var62 << 7) ^ 52) & 32768) >> 15
                                                                  | (((var62 & 65024) >> 9 | var62 << 7) ^ 52) << 1
                                                            )
                                                            + 31
                                                         & 32768
                                                   )
                                                   >> 15
                                                | (((((var62 & 65024) >> 9 | var62 << 7) ^ 52) & 32768) >> 15 | (((var62 & 65024) >> 9 | var62 << 7) ^ 52) << 1)
                                                      + 31
                                                   << 1
                                          )
                                          << 16
                                 )
                                 & 64512
                           )
                           >> 10
                        | (
                              (
                                       (
                                             (
                                                      (
                                                               ((((var62 & 65024) >> 9 | var62 << 7) ^ 52) & 32768) >> 15
                                                                  | (((var62 & 65024) >> 9 | var62 << 7) ^ 52) << 1
                                                            )
                                                            + 31
                                                         & 32768
                                                   )
                                                   >> 15
                                                | (((((var62 & 65024) >> 9 | var62 << 7) ^ 52) & 32768) >> 15 | (((var62 & 65024) >> 9 | var62 << 7) ^ 52) << 1)
                                                      + 31
                                                   << 1
                                          )
                                          & 65535
                                    )
                                    >> 0
                                 | (
                                       (
                                                (((((var62 & 65024) >> 9 | var62 << 7) ^ 52) & 32768) >> 15 | (((var62 & 65024) >> 9 | var62 << 7) ^ 52) << 1)
                                                      + 31
                                                   & 32768
                                             )
                                             >> 15
                                          | (((((var62 & 65024) >> 9 | var62 << 7) ^ 52) & 32768) >> 15 | (((var62 & 65024) >> 9 | var62 << 7) ^ 52) << 1) + 31
                                             << 1
                                    )
                                    << 16
                           )
                           << 6
                  )
                  ^ 77
                  ^ 189
            );
            var19.setCharAt(
               var35,
               (char)(
                  (
                        (
                                 (
                                       (
                                                (
                                                      (
                                                               (
                                                                        ((((var62 & 65024) >> 9 | var62 << 7) ^ 52) & 32768) >> 15
                                                                           | (((var62 & 65024) >> 9 | var62 << 7) ^ 52) << 1
                                                                     )
                                                                     + 31
                                                                  & 32768
                                                            )
                                                            >> 15
                                                         | (
                                                                  ((((var62 & 65024) >> 9 | var62 << 7) ^ 52) & 32768) >> 15
                                                                     | (((var62 & 65024) >> 9 | var62 << 7) ^ 52) << 1
                                                               )
                                                               + 31
                                                            << 1
                                                   )
                                                   & 65535
                                             )
                                             >> 0
                                          | (
                                                (
                                                         (
                                                                  ((((var62 & 65024) >> 9 | var62 << 7) ^ 52) & 32768) >> 15
                                                                     | (((var62 & 65024) >> 9 | var62 << 7) ^ 52) << 1
                                                               )
                                                               + 31
                                                            & 32768
                                                      )
                                                      >> 15
                                                   | (
                                                            ((((var62 & 65024) >> 9 | var62 << 7) ^ 52) & 32768) >> 15
                                                               | (((var62 & 65024) >> 9 | var62 << 7) ^ 52) << 1
                                                         )
                                                         + 31
                                                      << 1
                                             )
                                             << 16
                                    )
                                    & 64512
                              )
                              >> 10
                           | (
                                 (
                                          (
                                                (
                                                         (
                                                                  ((((var62 & 65024) >> 9 | var62 << 7) ^ 52) & 32768) >> 15
                                                                     | (((var62 & 65024) >> 9 | var62 << 7) ^ 52) << 1
                                                               )
                                                               + 31
                                                            & 32768
                                                      )
                                                      >> 15
                                                   | (
                                                            ((((var62 & 65024) >> 9 | var62 << 7) ^ 52) & 32768) >> 15
                                                               | (((var62 & 65024) >> 9 | var62 << 7) ^ 52) << 1
                                                         )
                                                         + 31
                                                      << 1
                                             )
                                             & 65535
                                       )
                                       >> 0
                                    | (
                                          (
                                                   (
                                                            ((((var62 & 65024) >> 9 | var62 << 7) ^ 52) & 32768) >> 15
                                                               | (((var62 & 65024) >> 9 | var62 << 7) ^ 52) << 1
                                                         )
                                                         + 31
                                                      & 32768
                                                )
                                                >> 15
                                             | (((((var62 & 65024) >> 9 | var62 << 7) ^ 52) & 32768) >> 15 | (((var62 & 65024) >> 9 | var62 << 7) ^ 52) << 1)
                                                   + 31
                                                << 1
                                       )
                                       << 16
                              )
                              << 6
                     )
                     ^ 77
                     ^ 189
               )
            );
         }

         Class var7 = Class.forName(var19.toString(), false, Class_38.class.getClassLoader());
         switch ((((var4 ^ 513400558 ^ 1284056544 ^ 1248422159) + 1424735802 ^ 1883187465) - 1630376657 - 107516448 ^ 2140725436) + 671365139 - 431479038) {
            case 141354210:
            case 1489540018:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 279234730:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            case 677021978:
               var10000 = var0.findSpecial(var7, var5, var6, Class_38.class);
               break;
            case 2014071292:
               var10000 = var0.findConstructor(var7, var6);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_1205[((var10 + 205887142 ^ 2145275397) + 764323573 - 1882336341 - 1395889836 ^ 1212034436) - 628692193 - 1923607313 + 1372610091 ^ 1146956829] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1249(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = (((var10 ^ 1439482405 ^ 1837610487) - 942271791 + 742113112 ^ 575356407 ^ 528237908) + 1830759183 ^ 37616112) + 1865536618;
      MethodHandle var10000 = field_1205[(((var10 ^ 1439482405 ^ 1837610487) - 942271791 + 742113112 ^ 575356407 ^ 528237908) + 1830759183 ^ 37616112)
            + 1865536618
         ^ 1171641212];
      if (field_1205[var10001 ^ 1171641212] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = (890474217 + (2082342500 | 899305263) | 0) & 524327; var24 < var14.length(); var24 += (-947554048 - -1233855165 | 0) & -1903688639) {
            int var43 = var14.charAt(var24) + 157;
            char var48 = (char)(
               (
                        (
                                 (
                                       (
                                                (
                                                      (
                                                            (
                                                                     (
                                                                              (((var43 & 49152) >> 14 | var43 << 2) & 64512) >> 10
                                                                                 | ((var43 & 49152) >> 14 | var43 << 2) << 6
                                                                           )
                                                                           + 240
                                                                        & 49152
                                                                  )
                                                                  >> 14
                                                               | (
                                                                        (((var43 & 49152) >> 14 | var43 << 2) & 64512) >> 10
                                                                           | ((var43 & 49152) >> 14 | var43 << 2) << 6
                                                                     )
                                                                     + 240
                                                                  << 2
                                                         )
                                                         ^ 98
                                                   )
                                                   & 32768
                                             )
                                             >> 15
                                          | (
                                                (
                                                      (
                                                               (
                                                                        (((var43 & 49152) >> 14 | var43 << 2) & 64512) >> 10
                                                                           | ((var43 & 49152) >> 14 | var43 << 2) << 6
                                                                     )
                                                                     + 240
                                                                  & 49152
                                                            )
                                                            >> 14
                                                         | ((((var43 & 49152) >> 14 | var43 << 2) & 64512) >> 10 | ((var43 & 49152) >> 14 | var43 << 2) << 6)
                                                               + 240
                                                            << 2
                                                   )
                                                   ^ 98
                                             )
                                             << 1
                                    )
                                    & 63488
                              )
                              >> 11
                           | (
                                 (
                                          (
                                                (
                                                      (
                                                               (
                                                                        (((var43 & 49152) >> 14 | var43 << 2) & 64512) >> 10
                                                                           | ((var43 & 49152) >> 14 | var43 << 2) << 6
                                                                     )
                                                                     + 240
                                                                  & 49152
                                                            )
                                                            >> 14
                                                         | ((((var43 & 49152) >> 14 | var43 << 2) & 64512) >> 10 | ((var43 & 49152) >> 14 | var43 << 2) << 6)
                                                               + 240
                                                            << 2
                                                   )
                                                   ^ 98
                                             )
                                             & 32768
                                       )
                                       >> 15
                                    | (
                                          (
                                                (
                                                         ((((var43 & 49152) >> 14 | var43 << 2) & 64512) >> 10 | ((var43 & 49152) >> 14 | var43 << 2) << 6)
                                                               + 240
                                                            & 49152
                                                      )
                                                      >> 14
                                                   | ((((var43 & 49152) >> 14 | var43 << 2) & 64512) >> 10 | ((var43 & 49152) >> 14 | var43 << 2) << 6) + 240
                                                      << 2
                                             )
                                             ^ 98
                                       )
                                       << 1
                              )
                              << 5
                     )
                     - 95
                  ^ 151
            );
            var14.setCharAt(
               var24,
               (char)(
                  (
                           (
                                    (
                                          (
                                                   (
                                                         (
                                                               (
                                                                        (
                                                                                 (((var43 & 49152) >> 14 | var43 << 2) & 64512) >> 10
                                                                                    | ((var43 & 49152) >> 14 | var43 << 2) << 6
                                                                              )
                                                                              + 240
                                                                           & 49152
                                                                     )
                                                                     >> 14
                                                                  | (
                                                                           (((var43 & 49152) >> 14 | var43 << 2) & 64512) >> 10
                                                                              | ((var43 & 49152) >> 14 | var43 << 2) << 6
                                                                        )
                                                                        + 240
                                                                     << 2
                                                            )
                                                            ^ 98
                                                      )
                                                      & 32768
                                                )
                                                >> 15
                                             | (
                                                   (
                                                         (
                                                                  (
                                                                           (((var43 & 49152) >> 14 | var43 << 2) & 64512) >> 10
                                                                              | ((var43 & 49152) >> 14 | var43 << 2) << 6
                                                                        )
                                                                        + 240
                                                                     & 49152
                                                               )
                                                               >> 14
                                                            | ((((var43 & 49152) >> 14 | var43 << 2) & 64512) >> 10 | ((var43 & 49152) >> 14 | var43 << 2) << 6)
                                                                  + 240
                                                               << 2
                                                      )
                                                      ^ 98
                                                )
                                                << 1
                                       )
                                       & 63488
                                 )
                                 >> 11
                              | (
                                    (
                                             (
                                                   (
                                                         (
                                                                  (
                                                                           (((var43 & 49152) >> 14 | var43 << 2) & 64512) >> 10
                                                                              | ((var43 & 49152) >> 14 | var43 << 2) << 6
                                                                        )
                                                                        + 240
                                                                     & 49152
                                                               )
                                                               >> 14
                                                            | ((((var43 & 49152) >> 14 | var43 << 2) & 64512) >> 10 | ((var43 & 49152) >> 14 | var43 << 2) << 6)
                                                                  + 240
                                                               << 2
                                                      )
                                                      ^ 98
                                                )
                                                & 32768
                                          )
                                          >> 15
                                       | (
                                             (
                                                   (
                                                            ((((var43 & 49152) >> 14 | var43 << 2) & 64512) >> 10 | ((var43 & 49152) >> 14 | var43 << 2) << 6)
                                                                  + 240
                                                               & 49152
                                                         )
                                                         >> 14
                                                      | ((((var43 & 49152) >> 14 | var43 << 2) & 64512) >> 10 | ((var43 & 49152) >> 14 | var43 << 2) << 6)
                                                            + 240
                                                         << 2
                                                )
                                                ^ 98
                                          )
                                          << 1
                                 )
                                 << 5
                        )
                        - 95
                     ^ 151
               )
            );
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = 488327468 << 488327468 ^ -1265451008; var30 < var17.length(); var30 += -1349714609 ^ 1981179383 ^ -1065138144 ^ 421122201) {
            int var53 = var17.charAt(var30);
            int var90 = (var53 & 61440) >> 12;
            int var54 = ((var53 & 61440) >> 12 | var53 << 4) - 100;
            int var91 = (((var53 & 61440) >> 12 | var53 << 4) - 100 & 65532) >> 2;
            var53 = (((((var90 | var53 << 4) - 100 & 65532) >> 2 | ((var53 & 61440) >> 12 | var53 << 4) - 100 << 14) ^ 206 ^ 97) - 226 ^ 2) - 254;
            var90 = ((((var91 | var54 << 14) ^ 206 ^ 97) - 226 ^ 2) - 254 & 61440) >> 12;
            int var56 = ((((var91 | var54 << 14) ^ 206 ^ 97) - 226 ^ 2) - 254 & 61440) >> 12 | var53 << 4;
            int var93 = ((((((var91 | var54 << 14) ^ 206 ^ 97) - 226 ^ 2) - 254 & 61440) >> 12 | var53 << 4) & 0) >> 16;
            char var57 = (char)(((var90 | var53 << 4) & 0) >> 16 | (((((var91 | var54 << 14) ^ 206 ^ 97) - 226 ^ 2) - 254 & 61440) >> 12 | var53 << 4) << 0);
            var17.setCharAt(var30, (char)(var93 | var56 << 0));
         }

         Class var6 = Class.forName(var17.toString(), false, Class_38.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = (1122830157 | 1170084431) ^ 1207899983; var36 < var20.length(); var36 += (-1940220516 >>> 87505668 | 1) & -1509814105) {
            int var62 = var20.charAt(var36) - '~';
            char var65 = (char)(
               (
                        (
                              (
                                       ((((var62 & 49152) >> 14 | var62 << 2) ^ 189) - 68 + 171 + 26 & 63488) >> 11
                                          | (((var62 & 49152) >> 14 | var62 << 2) ^ 189) - 68 + 171 + 26 << 5
                                    )
                                    - 13
                                 ^ 151
                           )
                           & 0
                     )
                     >> 16
                  | (
                        (
                                 ((((var62 & 49152) >> 14 | var62 << 2) ^ 189) - 68 + 171 + 26 & 63488) >> 11
                                    | (((var62 & 49152) >> 14 | var62 << 2) ^ 189) - 68 + 171 + 26 << 5
                              )
                              - 13
                           ^ 151
                     )
                     << 0
            );
            var20.setCharAt(
               var36,
               (char)(
                  (
                           (
                                 (
                                          ((((var62 & 49152) >> 14 | var62 << 2) ^ 189) - 68 + 171 + 26 & 63488) >> 11
                                             | (((var62 & 49152) >> 14 | var62 << 2) ^ 189) - 68 + 171 + 26 << 5
                                       )
                                       - 13
                                    ^ 151
                              )
                              & 0
                        )
                        >> 16
                     | (
                           (
                                    ((((var62 & 49152) >> 14 | var62 << 2) ^ 189) - 68 + 171 + 26 & 63488) >> 11
                                       | (((var62 & 49152) >> 14 | var62 << 2) ^ 189) - 68 + 171 + 26 << 5
                                 )
                                 - 13
                              ^ 151
                        )
                        << 0
               )
            );
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_38.class.getClassLoader()).returnType();
         switch (((var4 - 1770174915 + 1639679302 + 941060582 ^ 1916972791 ^ 1594691702) - 993208874 ^ 221800369) - 296081389 ^ 493873478 ^ 719538481) {
            case 359685077:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            case 505817165:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            case 1395958660:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            case 1921119583:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_1205[(((var10 ^ 1439482405 ^ 1837610487) - 942271791 + 742113112 ^ 575356407 ^ 528237908) + 1830759183 ^ 37616112) + 1865536618 ^ 1171641212] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
