import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;

public enum Class_334 {
   // $VF: renamed from: apg Class_334
   field_1039,
   // $VF: renamed from: xsl Class_334
   field_1040,
   // $VF: renamed from: tdc Class_334
   field_1041,
   // $VF: renamed from: udj Class_334
   field_1042,
   // $VF: renamed from: fvq Class_334
   field_1043;

   // $VF: renamed from: iq Class_334[]
   public static Class_334[] field_1044;
   // $VF: renamed from: sst java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_1046 = new MethodHandle[35];

   public static Class_334 valueOf(int var0) {
      return 1<"JNT",135026197,"ᮊᮒ","值幼","䶕䶘䵆䶱䵜䵊䶦",-821894314>()[var0];
   }

   // $VF: Failed to inline enum fields
   // Please report this to the Vineflower issue tracker, at https://github.com/Vineflower/vineflower/issues with a copy of the class file (if you have the rights to distribute it!)
   static {
      int var10000 = 1301181596 ^ 2124872858 ^ 858294278;

      StringBuilder var10001;
      for (var10001 = (StringBuilder)0<"JNT",-1947918595,"晜\uee5e홞\uee5e♞噜","⼇꼋\uef0f켈漍켈༆꼏켈漎༏༆輊꼎\uef0e켏漎༏輅켇漉","互㲒暒㲒횑劒㲒嚒䢒횑ₒ抒庒䲒嚒䢒ﺑ撒䲒劒䊒䒒庒",-1549668738>(
            "\ud8af粲낲䢲蒲墲粲꒲䲲"
         );
         var10000 < (-46346739 & 42017145);
         var10000 += -1263932342 >> -1486334304 ^ -1263932341
      ) {
         int var18 = 0<"JNT",150620740,"鹞虞깞㙞깝♞","⼇켋켇輄","互㲒暒㲒횑劒㲒嚒䢒횑ₒ抒庒䲒嚒䢒ﺑ撒䲒劒䊒䒒庒",-1549668762>(var10001, var10000) + 'L' - 249;
         char var19 = (char)((((var18 & 64512) >> 10 | var18 << 6) ^ 72) - 182);
         0<"JNT",150620740,"Ṟ蹞♞鹝虞깞㙞깝♞","⼇켋輄켇漉","互㲒暒㲒횑劒㲒嚒䢒횑ₒ抒庒䲒嚒䢒ﺑ撒䲒劒䊒䒒庒",-1549668763>(
            var10001, var10000, (char)((((var18 & 64512) >> 10 | var18 << 6) ^ 72) - 182)
         );
      }

      field_1039 = (Class_334)0<"JNT",-1947918595,"晜\uee5e홞\uee5e♞噜","⼇꼋\uef0f켈漍켈༆꼏켈漎༏༆輊꼎\uef0e켏漎༏輅켋켇漉","撒䢒",-1549670000>(
         0<"JNT",150620740,"♞빞ṝ♞㙞\uee5e홞繞","⼇켇꼋\uef0f켈漍켈༆꼏켈漎༏༆輊꼎\uef0e켏漎༏輅","互㲒暒㲒횑劒㲒嚒䢒횑ₒ抒庒䲒嚒䢒ﺑ撒䲒劒䊒䒒庒",-1549669999>(var10001), 0
      );
      var10000 = 143162562 >>> -462982588 * 143162562 ^ 559228;

      for (var10001 = (StringBuilder)0<"JNT",-1947918595,"晜\uee5e홞\uee5e♞噜","⼇꼋\uef0f켈漍켈༆꼏켈漎༏༆輊꼎\uef0e켏漎༏輅켇漉","互㲒暒㲒횑劒㲒嚒䢒횑ₒ抒庒䲒嚒䢒ﺑ撒䲒劒䊒䒒庒",-1549668753>("晼♿ᙾ홾噾");
         var10000 < (1423461832 >> 1423461832 ^ 5560392);
         var10000 += (-1020229460 | -1020229460) ^ -1020229459
      ) {
         int var22 = 0<"JNT",150620740,"鹞虞깞㙞깝♞","⼇켋켇輄","互㲒暒㲒횑劒㲒嚒䢒횑ₒ抒庒䲒嚒䢒ﺑ撒䲒劒䊒䒒庒",-1549668739>(var10001, var10000);
         int var49 = (var22 & 65528) >> 3;
         int var23 = ((var22 & 65528) >> 3 | var22 << 13) - 207;
         int var50 = (((var22 & 65528) >> 3 | var22 << 13) - 207 & 65408) >> 7;
         var22 = ((var49 | var22 << 13) - 207 & 65408) >> 7 | ((var22 & 65528) >> 3 | var22 << 13) - 207 << 9;
         var49 = ((var50 | var23 << 9) & 65520) >> 4;
         int var25 = ((var50 | var23 << 9) & 65520) >> 4 | var22 << 12;
         int var52 = ((((var50 | var23 << 9) & 65520) >> 4 | var22 << 12) & 49152) >> 14;
         char var26 = (char)(((var49 | var22 << 12) & 49152) >> 14 | (((var50 | var23 << 9) & 65520) >> 4 | var22 << 12) << 2);
         0<"JNT",150620740,"Ṟ蹞♞鹝虞깞㙞깝♞","⼇켋輄켇漉","互㲒暒㲒횑劒㲒嚒䢒횑ₒ抒庒䲒嚒䢒ﺑ撒䲒劒䊒䒒庒",-1549668740>(var10001, var10000, (char)(var52 | var25 << 2));
      }

      field_1040 = (Class_334)0<"JNT",-1947918595,"晜\uee5e홞\uee5e♞噜","⼇꼋\uef0f켈漍켈༆꼏켈漎༏༆輊꼎\uef0e켏漎༏輅켋켇漉","撒䢒",-1549669998>(
         0<"JNT",150620740,"♞빞ṝ♞㙞\uee5e홞繞","⼇켇꼋\uef0f켈漍켈༆꼏켈漎༏༆輊꼎\uef0e켏漎༏輅","互㲒暒㲒횑劒㲒嚒䢒횑ₒ抒庒䲒嚒䢒ﺑ撒䲒劒䊒䒒庒",-1549669997>(var10001), 1
      );
      var10000 = (297134633 >> -37551750 | 0) & -1986975831;

      for (var10001 = (StringBuilder)0<"JNT",-1947918595,"晜\uee5e홞\uee5e♞噜","⼇꼋\uef0f켈漍켈༆꼏켈漎༏༆輊꼎\uef0e켏漎༏輅켇漉","互㲒暒㲒횑劒㲒嚒䢒횑ₒ抒庒䲒嚒䢒ﺑ撒䲒劒䊒䒒庒",-1549670015>(
            "\u20c5⍕⎅⏅⋥"
         );
         var10000 < (1580621810 + -1668855052 ^ -88233245);
         var10000 += -2092959944 & -954248352 ^ -2095099103
      ) {
         int var29 = 0<"JNT",150620740,"鹞虞깞㙞깝♞","⼇켋켇輄","互㲒暒㲒횑劒㲒嚒䢒횑ₒ抒庒䲒嚒䢒ﺑ撒䲒劒䊒䒒庒",-1549670016>(var10001, var10000) - 'E';
         char var30 = (char)(((var29 & 65520) >> 4 | var29 << 12) - 177 - 227 - 49);
         0<"JNT",150620740,"Ṟ蹞♞鹝虞깞㙞깝♞","⼇켋輄켇漉","互㲒暒㲒횑劒㲒嚒䢒횑ₒ抒庒䲒嚒䢒ﺑ撒䲒劒䊒䒒庒",-1549669985>(
            var10001, var10000, (char)(((var29 & 65520) >> 4 | var29 << 12) - 177 - 227 - 49)
         );
      }

      field_1041 = (Class_334)0<"JNT",-1947918595,"晜\uee5e홞\uee5e♞噜","⼇꼋\uef0f켈漍켈༆꼏켈漎༏༆輊꼎\uef0e켏漎༏輅켋켇漉","撒䢒",-1549668744>(
         0<"JNT",150620740,"♞빞ṝ♞㙞\uee5e홞繞","⼇켇꼋\uef0f켈漍켈༆꼏켈漎༏༆輊꼎\uef0e켏漎༏輅","互㲒暒㲒횑劒㲒嚒䢒횑ₒ抒庒䲒嚒䢒ﺑ撒䲒劒䊒䒒庒",-1549668743>(var10001), 2
      );
      var10000 = (-1864506710 ^ 1186453932 ^ -1864506710 | 0) & 956302401;

      for (var10001 = (StringBuilder)0<"JNT",-1947918595,"晜\uee5e홞\uee5e♞噜","⼇꼋\uef0f켈漍켈༆꼏켈漎༏༆輊꼎\uef0e켏漎༏輅켇漉","互㲒暒㲒횑劒㲒嚒䢒횑ₒ抒庒䲒嚒䢒ﺑ撒䲒劒䊒䒒庒",-1549668745>(
            "쀅\ue006耉ꀆ"
         );
         var10000 < ((-1267572974 << 898831579 | 4) & 243671823);
         var10000 += (-538487642 | -52884888) ^ -41233
      ) {
         int var33 = 0<"JNT",150620740,"鹞虞깞㙞깝♞","⼇켋켇輄","互㲒暒㲒횑劒㲒嚒䢒횑ₒ抒庒䲒嚒䢒ﺑ撒䲒劒䊒䒒庒",-1549669995>(var10001, var10000) ^ '6' ^ 55;
         char var34 = (char)(((var33 & 57344) >> 13 | var33 << 3) - 22 ^ 64);
         0<"JNT",150620740,"Ṟ蹞♞鹝虞깞㙞깝♞","⼇켋輄켇漉","互㲒暒㲒횑劒㲒嚒䢒횑ₒ抒庒䲒嚒䢒ﺑ撒䲒劒䊒䒒庒",-1549669996>(
            var10001, var10000, (char)(((var33 & 57344) >> 13 | var33 << 3) - 22 ^ 64)
         );
      }

      field_1042 = (Class_334)0<"JNT",-1947918595,"晜\uee5e홞\uee5e♞噜","⼇꼋\uef0f켈漍켈༆꼏켈漎༏༆輊꼎\uef0e켏漎༏輅켋켇漉","撒䢒",-1549668765>(
         0<"JNT",150620740,"♞빞ṝ♞㙞\uee5e홞繞","⼇켇꼋\uef0f켈漍켈༆꼏켈漎༏༆輊꼎\uef0e켏漎༏輅","互㲒暒㲒횑劒㲒嚒䢒횑ₒ抒庒䲒嚒䢒ﺑ撒䲒劒䊒䒒庒",-1549668764>(var10001), 3
      );
      var10000 = -420600777 - (-1581116256 & -1581116256) ^ 1160515479;

      for (var10001 = (StringBuilder)0<"JNT",-1947918595,"晜\uee5e홞\uee5e♞噜","⼇꼋\uef0f켈漍켈༆꼏켈漎༏༆輊꼎\uef0e켏漎༏輅켇漉","互㲒暒㲒횑劒㲒嚒䢒횑ₒ抒庒䲒嚒䢒ﺑ撒䲒劒䊒䒒庒",-1549668766>("ﴅﺉﺍﺩ");
         var10000 < ((2075598439 ^ 2075598439 | 4) & 1883882095);
         var10000 += 1834040937 - (327385194 + -2121211386) ^ -667100168
      ) {
         int var37 = 0<"JNT",150620740,"鹞虞깞㙞깝♞","⼇켋켇輄","互㲒暒㲒횑劒㲒嚒䢒횑ₒ抒庒䲒嚒䢒ﺑ撒䲒劒䊒䒒庒",-1549668741>(var10001, var10000) ^ 131 ^ 109;
         int var55 = (var37 & 65532) >> 2;
         int var38 = ((var37 & 65532) >> 2 | var37 << 14) + 214;
         int var56 = (((var37 & 65532) >> 2 | var37 << 14) + 214 & 65535) >> 0;
         char var39 = (char)(((var55 | var37 << 14) + 214 & 65535) >> 0 | ((var37 & 65532) >> 2 | var37 << 14) + 214 << 16);
         0<"JNT",150620740,"Ṟ蹞♞鹝虞깞㙞깝♞","⼇켋輄켇漉","互㲒暒㲒횑劒㲒嚒䢒횑ₒ抒庒䲒嚒䢒ﺑ撒䲒劒䊒䒒庒",-1549668742>(var10001, var10000, (char)(var56 | var38 << 16));
      }

      field_1043 = (Class_334)0<"JNT",-1947918595,"晜\uee5e홞\uee5e♞噜","⼇꼋\uef0f켈漍켈༆꼏켈漎༏༆輊꼎\uef0e켏漎༏輅켋켇漉","撒䢒",-1549668760>(
         0<"JNT",150620740,"♞빞ṝ♞㙞\uee5e홞繞","⼇켇꼋\uef0f켈漍켈༆꼏켈漎༏༆輊꼎\uef0e켏漎༏輅","互㲒暒㲒횑劒㲒嚒䢒횑ₒ抒庒䲒嚒䢒ﺑ撒䲒劒䊒䒒庒",-1549668759>(var10001), 4
      );
      field_1044 = 0<"JNT",813230100,"ᙞ깞\ue65e\u0e5e蹞Ṟ","⼇켇載꼋伍༏輅","撒䢒",-1549669994>();
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1158(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 ^ 876270992) + 871010179 - 1187076165 + 836729691 ^ 1841025727 ^ 296238568) - 50725952 - 359412598 - 1811084623;
      MethodHandle var10000 = field_1046[((var10 ^ 876270992) + 871010179 - 1187076165 + 836729691 ^ 1841025727 ^ 296238568)
            - 50725952
            - 359412598
            - 1811084623
         ^ 1179309272];
      if (field_1046[var10001 ^ 1179309272] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = 556261038 * (556261038 >>> 556261038) ^ 647300626; var23 < var13.length(); var23 += 1995255280 << 630542641 ^ 1541406721) {
            int var42 = var13.charAt(var23) - '*';
            char var45 = (char)(
               (
                        (
                                 (((((var42 & 65532) >> 2 | var42 << 14) + 244 & 65472) >> 6 | ((var42 & 65532) >> 2 | var42 << 14) + 244 << 10) ^ 201)
                                       + 100
                                       - 99
                                    ^ 124
                              )
                              - 248
                           & 65528
                     )
                     >> 3
                  | ((((((var42 & 65532) >> 2 | var42 << 14) + 244 & 65472) >> 6 | ((var42 & 65532) >> 2 | var42 << 14) + 244 << 10) ^ 201) + 100 - 99 ^ 124)
                        - 248
                     << 13
            );
            var13.setCharAt(
               var23,
               (char)(
                  (
                           (
                                    (((((var42 & 65532) >> 2 | var42 << 14) + 244 & 65472) >> 6 | ((var42 & 65532) >> 2 | var42 << 14) + 244 << 10) ^ 201)
                                          + 100
                                          - 99
                                       ^ 124
                                 )
                                 - 248
                              & 65528
                        )
                        >> 3
                     | ((((((var42 & 65532) >> 2 | var42 << 14) + 244 & 65472) >> 6 | ((var42 & 65532) >> 2 | var42 << 14) + 244 << 10) ^ 201) + 100 - 99 ^ 124)
                           - 248
                        << 13
               )
            );
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = -212221189 << (690168946 >>> 1021601058) ^ -1342177280; var29 < var16.length(); var29 += (-89890322 | 1531877259 | 1) & 68159489) {
            char var50 = var16.charAt(var29);
            char var57 = (char)(
               (
                        (
                                 (
                                          (
                                                (
                                                         (
                                                                  (
                                                                        (
                                                                                 (
                                                                                       (
                                                                                                (
                                                                                                      (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                                         | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                                                   )
                                                                                                   & 65520
                                                                                             )
                                                                                             >> 4
                                                                                          | (
                                                                                                (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                                   | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                                             )
                                                                                             << 12
                                                                                    )
                                                                                    & 65408
                                                                              )
                                                                              >> 7
                                                                           | (
                                                                                 (
                                                                                          (
                                                                                                (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                                   | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                                             )
                                                                                             & 65520
                                                                                       )
                                                                                       >> 4
                                                                                    | (
                                                                                          (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                             | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                                       )
                                                                                       << 12
                                                                              )
                                                                              << 9
                                                                     )
                                                                     ^ 210
                                                               )
                                                               + 34
                                                            & 63488
                                                      )
                                                      >> 11
                                                   | (
                                                            (
                                                                  (
                                                                           (
                                                                                 (
                                                                                          (
                                                                                                (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                                   | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                                             )
                                                                                             & 65520
                                                                                       )
                                                                                       >> 4
                                                                                    | (
                                                                                          (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                             | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                                       )
                                                                                       << 12
                                                                              )
                                                                              & 65408
                                                                        )
                                                                        >> 7
                                                                     | (
                                                                           (
                                                                                    (
                                                                                          (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                             | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                                       )
                                                                                       & 65520
                                                                                 )
                                                                                 >> 4
                                                                              | (
                                                                                    (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                       | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                                 )
                                                                                 << 12
                                                                        )
                                                                        << 9
                                                               )
                                                               ^ 210
                                                         )
                                                         + 34
                                                      << 5
                                             )
                                             & 65528
                                       )
                                       >> 3
                                    | (
                                          (
                                                   (
                                                            (
                                                                  (
                                                                           (
                                                                                 (
                                                                                          (
                                                                                                (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                                   | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                                             )
                                                                                             & 65520
                                                                                       )
                                                                                       >> 4
                                                                                    | (
                                                                                          (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                             | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                                       )
                                                                                       << 12
                                                                              )
                                                                              & 65408
                                                                        )
                                                                        >> 7
                                                                     | (
                                                                           (
                                                                                    (
                                                                                          (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                             | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                                       )
                                                                                       & 65520
                                                                                 )
                                                                                 >> 4
                                                                              | (
                                                                                    (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                       | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                                 )
                                                                                 << 12
                                                                        )
                                                                        << 9
                                                               )
                                                               ^ 210
                                                         )
                                                         + 34
                                                      & 63488
                                                )
                                                >> 11
                                             | (
                                                      (
                                                            (
                                                                     (
                                                                           (
                                                                                    (
                                                                                          (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                             | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                                       )
                                                                                       & 65520
                                                                                 )
                                                                                 >> 4
                                                                              | (
                                                                                    (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                       | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                                 )
                                                                                 << 12
                                                                        )
                                                                        & 65408
                                                                  )
                                                                  >> 7
                                                               | (
                                                                     (
                                                                              (
                                                                                    (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                       | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                                 )
                                                                                 & 65520
                                                                           )
                                                                           >> 4
                                                                        | (
                                                                              (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                 | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                           )
                                                                           << 12
                                                                  )
                                                                  << 9
                                                         )
                                                         ^ 210
                                                   )
                                                   + 34
                                                << 5
                                       )
                                       << 13
                              )
                              + 17
                           & 65504
                     )
                     >> 5
                  | (
                           (
                                    (
                                          (
                                                   (
                                                            (
                                                                  (
                                                                           (
                                                                                 (
                                                                                          (
                                                                                                (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                                   | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                                             )
                                                                                             & 65520
                                                                                       )
                                                                                       >> 4
                                                                                    | (
                                                                                          (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                             | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                                       )
                                                                                       << 12
                                                                              )
                                                                              & 65408
                                                                        )
                                                                        >> 7
                                                                     | (
                                                                           (
                                                                                    (
                                                                                          (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                             | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                                       )
                                                                                       & 65520
                                                                                 )
                                                                                 >> 4
                                                                              | (
                                                                                    (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                       | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                                 )
                                                                                 << 12
                                                                        )
                                                                        << 9
                                                               )
                                                               ^ 210
                                                         )
                                                         + 34
                                                      & 63488
                                                )
                                                >> 11
                                             | (
                                                      (
                                                            (
                                                                     (
                                                                           (
                                                                                    (
                                                                                          (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                             | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                                       )
                                                                                       & 65520
                                                                                 )
                                                                                 >> 4
                                                                              | (
                                                                                    (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                       | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                                 )
                                                                                 << 12
                                                                        )
                                                                        & 65408
                                                                  )
                                                                  >> 7
                                                               | (
                                                                     (
                                                                              (
                                                                                    (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                       | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                                 )
                                                                                 & 65520
                                                                           )
                                                                           >> 4
                                                                        | (
                                                                              (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                 | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                           )
                                                                           << 12
                                                                  )
                                                                  << 9
                                                         )
                                                         ^ 210
                                                   )
                                                   + 34
                                                << 5
                                       )
                                       & 65528
                                 )
                                 >> 3
                              | (
                                    (
                                             (
                                                      (
                                                            (
                                                                     (
                                                                           (
                                                                                    (
                                                                                          (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                             | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                                       )
                                                                                       & 65520
                                                                                 )
                                                                                 >> 4
                                                                              | (
                                                                                    (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                       | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                                 )
                                                                                 << 12
                                                                        )
                                                                        & 65408
                                                                  )
                                                                  >> 7
                                                               | (
                                                                     (
                                                                              (
                                                                                    (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                       | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                                 )
                                                                                 & 65520
                                                                           )
                                                                           >> 4
                                                                        | (
                                                                              (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                 | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                           )
                                                                           << 12
                                                                  )
                                                                  << 9
                                                         )
                                                         ^ 210
                                                   )
                                                   + 34
                                                & 63488
                                          )
                                          >> 11
                                       | (
                                                (
                                                      (
                                                               (
                                                                     (
                                                                              (
                                                                                    (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                       | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                                 )
                                                                                 & 65520
                                                                           )
                                                                           >> 4
                                                                        | (
                                                                              (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                 | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                           )
                                                                           << 12
                                                                  )
                                                                  & 65408
                                                            )
                                                            >> 7
                                                         | (
                                                               (
                                                                        (
                                                                              (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                 | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                           )
                                                                           & 65520
                                                                     )
                                                                     >> 4
                                                                  | (
                                                                        (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                           | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                     )
                                                                     << 12
                                                            )
                                                            << 9
                                                   )
                                                   ^ 210
                                             )
                                             + 34
                                          << 5
                                 )
                                 << 13
                        )
                        + 17
                     << 11
            );
            var16.setCharAt(
               var29,
               (char)(
                  (
                           (
                                    (
                                             (
                                                   (
                                                            (
                                                                     (
                                                                           (
                                                                                    (
                                                                                          (
                                                                                                   (
                                                                                                         (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                                            | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                                                      )
                                                                                                      & 65520
                                                                                                )
                                                                                                >> 4
                                                                                             | (
                                                                                                   (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                                      | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                                                )
                                                                                                << 12
                                                                                       )
                                                                                       & 65408
                                                                                 )
                                                                                 >> 7
                                                                              | (
                                                                                    (
                                                                                             (
                                                                                                   (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                                      | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                                                )
                                                                                                & 65520
                                                                                          )
                                                                                          >> 4
                                                                                       | (
                                                                                             (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                                | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                                          )
                                                                                          << 12
                                                                                 )
                                                                                 << 9
                                                                        )
                                                                        ^ 210
                                                                  )
                                                                  + 34
                                                               & 63488
                                                         )
                                                         >> 11
                                                      | (
                                                               (
                                                                     (
                                                                              (
                                                                                    (
                                                                                             (
                                                                                                   (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                                      | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                                                )
                                                                                                & 65520
                                                                                          )
                                                                                          >> 4
                                                                                       | (
                                                                                             (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                                | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                                          )
                                                                                          << 12
                                                                                 )
                                                                                 & 65408
                                                                           )
                                                                           >> 7
                                                                        | (
                                                                              (
                                                                                       (
                                                                                             (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                                | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                                          )
                                                                                          & 65520
                                                                                    )
                                                                                    >> 4
                                                                                 | (
                                                                                       (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                          | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                                    )
                                                                                    << 12
                                                                           )
                                                                           << 9
                                                                  )
                                                                  ^ 210
                                                            )
                                                            + 34
                                                         << 5
                                                )
                                                & 65528
                                          )
                                          >> 3
                                       | (
                                             (
                                                      (
                                                               (
                                                                     (
                                                                              (
                                                                                    (
                                                                                             (
                                                                                                   (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                                      | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                                                )
                                                                                                & 65520
                                                                                          )
                                                                                          >> 4
                                                                                       | (
                                                                                             (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                                | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                                          )
                                                                                          << 12
                                                                                 )
                                                                                 & 65408
                                                                           )
                                                                           >> 7
                                                                        | (
                                                                              (
                                                                                       (
                                                                                             (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                                | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                                          )
                                                                                          & 65520
                                                                                    )
                                                                                    >> 4
                                                                                 | (
                                                                                       (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                          | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                                    )
                                                                                    << 12
                                                                           )
                                                                           << 9
                                                                  )
                                                                  ^ 210
                                                            )
                                                            + 34
                                                         & 63488
                                                   )
                                                   >> 11
                                                | (
                                                         (
                                                               (
                                                                        (
                                                                              (
                                                                                       (
                                                                                             (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                                | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                                          )
                                                                                          & 65520
                                                                                    )
                                                                                    >> 4
                                                                                 | (
                                                                                       (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                          | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                                    )
                                                                                    << 12
                                                                           )
                                                                           & 65408
                                                                     )
                                                                     >> 7
                                                                  | (
                                                                        (
                                                                                 (
                                                                                       (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                          | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                                    )
                                                                                    & 65520
                                                                              )
                                                                              >> 4
                                                                           | (
                                                                                 (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                    | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                              )
                                                                              << 12
                                                                     )
                                                                     << 9
                                                            )
                                                            ^ 210
                                                      )
                                                      + 34
                                                   << 5
                                          )
                                          << 13
                                 )
                                 + 17
                              & 65504
                        )
                        >> 5
                     | (
                              (
                                       (
                                             (
                                                      (
                                                               (
                                                                     (
                                                                              (
                                                                                    (
                                                                                             (
                                                                                                   (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                                      | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                                                )
                                                                                                & 65520
                                                                                          )
                                                                                          >> 4
                                                                                       | (
                                                                                             (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                                | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                                          )
                                                                                          << 12
                                                                                 )
                                                                                 & 65408
                                                                           )
                                                                           >> 7
                                                                        | (
                                                                              (
                                                                                       (
                                                                                             (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                                | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                                          )
                                                                                          & 65520
                                                                                    )
                                                                                    >> 4
                                                                                 | (
                                                                                       (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                          | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                                    )
                                                                                    << 12
                                                                           )
                                                                           << 9
                                                                  )
                                                                  ^ 210
                                                            )
                                                            + 34
                                                         & 63488
                                                   )
                                                   >> 11
                                                | (
                                                         (
                                                               (
                                                                        (
                                                                              (
                                                                                       (
                                                                                             (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                                | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                                          )
                                                                                          & 65520
                                                                                    )
                                                                                    >> 4
                                                                                 | (
                                                                                       (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                          | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                                    )
                                                                                    << 12
                                                                           )
                                                                           & 65408
                                                                     )
                                                                     >> 7
                                                                  | (
                                                                        (
                                                                                 (
                                                                                       (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                          | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                                    )
                                                                                    & 65520
                                                                              )
                                                                              >> 4
                                                                           | (
                                                                                 (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                    | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                              )
                                                                              << 12
                                                                     )
                                                                     << 9
                                                            )
                                                            ^ 210
                                                      )
                                                      + 34
                                                   << 5
                                          )
                                          & 65528
                                    )
                                    >> 3
                                 | (
                                       (
                                                (
                                                         (
                                                               (
                                                                        (
                                                                              (
                                                                                       (
                                                                                             (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                                | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                                          )
                                                                                          & 65520
                                                                                    )
                                                                                    >> 4
                                                                                 | (
                                                                                       (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                          | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                                    )
                                                                                    << 12
                                                                           )
                                                                           & 65408
                                                                     )
                                                                     >> 7
                                                                  | (
                                                                        (
                                                                                 (
                                                                                       (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                          | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                                    )
                                                                                    & 65520
                                                                              )
                                                                              >> 4
                                                                           | (
                                                                                 (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                    | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                              )
                                                                              << 12
                                                                     )
                                                                     << 9
                                                            )
                                                            ^ 210
                                                      )
                                                      + 34
                                                   & 63488
                                             )
                                             >> 11
                                          | (
                                                   (
                                                         (
                                                                  (
                                                                        (
                                                                                 (
                                                                                       (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                          | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                                    )
                                                                                    & 65520
                                                                              )
                                                                              >> 4
                                                                           | (
                                                                                 (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                    | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                              )
                                                                              << 12
                                                                     )
                                                                     & 65408
                                                               )
                                                               >> 7
                                                            | (
                                                                  (
                                                                           (
                                                                                 (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                                    | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                              )
                                                                              & 65520
                                                                        )
                                                                        >> 4
                                                                     | (
                                                                           (((var50 & '￠') >> 5 | var50 << 11) & 64512) >> 10
                                                                              | ((var50 & '￠') >> 5 | var50 << 11) << 6
                                                                        )
                                                                        << 12
                                                               )
                                                               << 9
                                                      )
                                                      ^ 210
                                                )
                                                + 34
                                             << 5
                                    )
                                    << 13
                           )
                           + 17
                        << 11
               )
            );
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_334.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = 1995788703 * 1198380735 ^ -1393176671; var35 < var19.length(); var35 += 1861699397 >>> 318437448 ^ 7272262) {
            int var62 = (var19.charAt(var35) - 3 - 147 + 96 + 33 ^ 74) - 65 - 39 + 51;
            char var63 = (char)(((var62 & 65024) >> 9 | var62 << 7) - 189);
            var19.setCharAt(var35, (char)(((var62 & 65024) >> 9 | var62 << 7) - 189));
         }

         Class var7 = Class.forName(var19.toString(), false, Class_334.class.getClassLoader());
         switch (((var4 + 1095552733 ^ 711259634) - 63443403 - 232669855 + 1861903201 - 2017780311 - 1801920830 + 743602673 ^ 861834691) + 1235905424) {
            case 117376089:
            case 2129357685:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 129727560:
               var10000 = var0.findConstructor(var7, var6);
               break;
            case 1628614906:
               var10000 = var0.findSpecial(var7, var5, var6, Class_334.class);
               break;
            case 2087694629:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_1046[((var10 ^ 876270992) + 871010179 - 1187076165 + 836729691 ^ 1841025727 ^ 296238568) - 50725952 - 359412598 - 1811084623 ^ 1179309272] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1159(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 + 131604769 ^ 570132681) + 521980907 - 921902464 ^ 711075964 ^ 1214228443 ^ 2073198097) + 1449158788 - 1105041915;
      MethodHandle var10000 = field_1046[((var10 + 131604769 ^ 570132681) + 521980907 - 921902464 ^ 711075964 ^ 1214228443 ^ 2073198097)
         + 1449158788
         - 1105041915
         + 613902042];
      if (field_1046[var10001 + 613902042] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = -234967648 ^ -234967648 ^ 0; var24 < var14.length(); var24 += (-1695310322 | -364519151 | 0) & 83886177) {
            int var43 = var14.charAt(var24) + 130;
            int var10004 = (var43 & 65504) >> 5;
            int var44 = ((var43 & 65504) >> 5 | var43 << 11) + 26 - 161 - 85;
            int var82 = (((var43 & 65504) >> 5 | var43 << 11) + 26 - 161 - 85 & 65024) >> 9;
            var43 = ((var10004 | var43 << 11) + 26 - 161 - 85 & 65024) >> 9 | ((var43 & 65504) >> 5 | var43 << 11) + 26 - 161 - 85 << 7;
            var10004 = ((var82 | var44 << 7) & 65532) >> 2;
            int var46 = (((var82 | var44 << 7) & 65532) >> 2 | var43 << 14) + 6 - 41;
            int var84 = ((((var82 | var44 << 7) & 65532) >> 2 | var43 << 14) + 6 - 41 & 65535) >> 0;
            char var47 = (char)(((var10004 | var43 << 14) + 6 - 41 & 65535) >> 0 | (((var82 | var44 << 7) & 65532) >> 2 | var43 << 14) + 6 - 41 << 16);
            var14.setCharAt(var24, (char)(var84 | var46 << 16));
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = (-900652162 ^ -900652162 + -900652162 | 0) & 823848; var30 < var17.length(); var30 += (653989552 + -1358897872 | 1) & 33819677) {
            char var52 = var17.charAt(var30);
            char var55 = (char)(
               (
                     (
                              ((((((var52 & '\uf800') >> 11 | var52 << 5) ^ 45) & 65534) >> 1 | (((var52 & '\uf800') >> 11 | var52 << 5) ^ 45) << 15) + 27 ^ 19)
                                    - 194
                                    + 197
                                 & 65024
                           )
                           >> 9
                        | ((((((var52 & '\uf800') >> 11 | var52 << 5) ^ 45) & 65534) >> 1 | (((var52 & '\uf800') >> 11 | var52 << 5) ^ 45) << 15) + 27 ^ 19)
                              - 194
                              + 197
                           << 7
                  )
                  + 201
                  - 150
            );
            var17.setCharAt(
               var30,
               (char)(
                  (
                        (
                                 (
                                          (((((var52 & '\uf800') >> 11 | var52 << 5) ^ 45) & 65534) >> 1 | (((var52 & '\uf800') >> 11 | var52 << 5) ^ 45) << 15)
                                                + 27
                                             ^ 19
                                       )
                                       - 194
                                       + 197
                                    & 65024
                              )
                              >> 9
                           | ((((((var52 & '\uf800') >> 11 | var52 << 5) ^ 45) & 65534) >> 1 | (((var52 & '\uf800') >> 11 | var52 << 5) ^ 45) << 15) + 27 ^ 19)
                                 - 194
                                 + 197
                              << 7
                     )
                     + 201
                     - 150
               )
            );
         }

         Class var6 = Class.forName(var17.toString(), false, Class_334.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = 195754131 << 195754131 ^ -996671488; var36 < var20.length(); var36 += (-1006035532 >>> 1075236068 | 1) & 1109937185) {
            int var60 = ((var20.charAt(var36) ^ 128) - 249 ^ 70) - 49;
            char var63 = (char)(
               ((((((var60 & 64512) >> 10 | var60 << 6) & 32768) >> 15 | ((var60 & 64512) >> 10 | var60 << 6) << 1) ^ 191) + 17 - 42 & 65408) >> 7
                  | (((((var60 & 64512) >> 10 | var60 << 6) & 32768) >> 15 | ((var60 & 64512) >> 10 | var60 << 6) << 1) ^ 191) + 17 - 42 << 9
            );
            var20.setCharAt(
               var36,
               (char)(
                  ((((((var60 & 64512) >> 10 | var60 << 6) & 32768) >> 15 | ((var60 & 64512) >> 10 | var60 << 6) << 1) ^ 191) + 17 - 42 & 65408) >> 7
                     | (((((var60 & 64512) >> 10 | var60 << 6) & 32768) >> 15 | ((var60 & 64512) >> 10 | var60 << 6) << 1) ^ 191) + 17 - 42 << 9
               )
            );
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_334.class.getClassLoader()).returnType();
         switch ((var4 - 942006588 ^ 1845381422 ^ 2059671 ^ 765405813 ^ 1652697718 ^ 769943035) + 1152922110 + 1993735558 - 505120497 ^ 1556863101) {
            case 45811286:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            case 73112149:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            case 220441880:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            case 2104135207:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_1046[((var10 + 131604769 ^ 570132681) + 521980907 - 921902464 ^ 711075964 ^ 1214228443 ^ 2073198097) + 1449158788 - 1105041915 + 613902042] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
