import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;

public enum Class_50 {
   // $VF: renamed from: oio Class_50
   field_1186,
   // $VF: renamed from: ma Class_50
   field_1187,
   // $VF: renamed from: yx Class_50
   field_1188,
   // $VF: renamed from: qrg Class_50
   field_1189,
   // $VF: renamed from: jbh Class_50
   field_1190,
   // $VF: renamed from: zmw Class_50
   field_1191,
   // $VF: renamed from: joe Class_50
   field_1192,
   // $VF: renamed from: vtd Class_50
   field_1193,
   // $VF: renamed from: pw Class_50
   field_1194,
   // $VF: renamed from: cu Class_50
   field_1195,
   // $VF: renamed from: dlb Class_50
   field_1196,
   // $VF: renamed from: rzw Class_50
   field_1197,
   // $VF: renamed from: rah Class_50
   field_1198,
   // $VF: renamed from: hif Class_50
   field_1199;

   // $VF: renamed from: cdz java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_1201 = new MethodHandle[87];

   // $VF: Failed to inline enum fields
   // Please report this to the Vineflower issue tracker, at https://github.com/Vineflower/vineflower/issues with a copy of the class file (if you have the rights to distribute it!)
   static {
      int var10000 = -2115015706 >> 2093040087 ^ -253;

      StringBuilder var10001;
      for (var10001 = (StringBuilder)0<"JNT",-268896753,"㠨鈨鰨鈨꠨㰨","ք֣֮薟֩薟薄֞薟֥薠薄薶֢֧薣֥薠薊薃ֹ","䧯圯䣯圯盯䙯圯䛯咯盯厯䡯䯯䤯䛯咯翯䠯䤯䙯呯启䯯",862364058>("ꘁ먁䗾揾槾現翾");
         var10000 < 7;
         var10000 += -1940516629 & -1940516629 ^ -1940516630
      ) {
         char var54 = 0<"JNT",810314456,"蘨逨舨ꐨ䈨꠨","ք薳薃薮","䧯圯䣯圯盯䙯圯䛯咯盯厯䡯䯯䤯䛯咯翯䠯䤯䙯呯启䯯",862364106>(var10001, var10000);
         char var55 = (char)((((var54 & '︀') >> 9 | var54 << 7) ^ 215) - 160 + 208 ^ 119);
         0<"JNT",810314456,"꘨訨꠨䘨逨舨ꐨ䈨꠨","ք薳薮薃ֹ","䧯圯䣯圯盯䙯圯䛯咯盯厯䡯䯯䤯䛯咯翯䠯䤯䙯呯启䯯",862364103>(
            var10001, var10000, (char)((((var54 & '︀') >> 9 | var54 << 7) ^ 215) - 160 + 208 ^ 119)
         );
      }

      field_1186 = (Class_50)0<"JNT",-268896753,"㠨鈨鰨鈨꠨㰨","ք֣֮薟֩薟薄֞薟֥薠薄薶֢֧薣֥薠薊薳薃ֹ","呯呯",862364044>(
         0<"JNT",810314456,"꠨鸨昨꠨ꐨ鈨鰨踨","ք薃֣֮薟֩薟薄֞薟֥薠薄薶֢֧薣֥薠薊","䧯圯䣯圯盯䙯圯䛯咯盯厯䡯䯯䤯䛯咯翯䠯䤯䙯呯启䯯",862364043>(var10001), 0
      );
      var10000 = (-387361146 * 1292329901 | 0) & -1577049040;

      for (var10001 = (StringBuilder)0<"JNT",-268896753,"㠨鈨鰨鈨꠨㰨","ք֣֮薟֩薟薄֞薟֥薠薄薶֢֧薣֥薠薊薃ֹ","䧯圯䣯圯盯䙯圯䛯咯盯厯䡯䯯䤯䛯咯翯䠯䤯䙯呯启䯯",862364041>("˨ϰ͠ϐɨϰϘΰ\u0380");
         var10000 < (442771411 & -1325839513 ^ 274727754);
         var10000 += (1413199835 + -1506196165 | 1) & 25166017
      ) {
         int var58 = 0<"JNT",810314456,"蘨逨舨ꐨ䈨꠨","ք薳薃薮","䧯圯䣯圯盯䙯圯䛯咯盯厯䡯䯯䤯䛯咯翯䠯䤯䙯呯启䯯",862364042>(var10001, var10000);
         int var151 = (var58 & 65408) >> 7;
         int var59 = (var58 & 65408) >> 7 | var58 << 9;
         int var152 = (((var58 & 65408) >> 7 | var58 << 9) & 65528) >> 3;
         var58 = ((var151 | var58 << 9) & 65528) >> 3 | ((var58 & 65408) >> 7 | var58 << 9) << 13;
         var151 = ((var152 | var59 << 13) & 65520) >> 4;
         int var61 = ((var152 | var59 << 13) & 65520) >> 4 | var58 << 12;
         int var154 = ((((var152 | var59 << 13) & 65520) >> 4 | var58 << 12) & 65504) >> 5;
         char var62 = (char)((((var151 | var58 << 12) & 65504) >> 5 | (((var152 | var59 << 13) & 65520) >> 4 | var58 << 12) << 11) ^ 31);
         0<"JNT",810314456,"꘨訨꠨䘨逨舨ꐨ䈨꠨","ք薳薮薃ֹ","䧯圯䣯圯盯䙯圯䛯咯盯厯䡯䯯䤯䛯咯翯䠯䤯䙯呯启䯯",862364039>(var10001, var10000, (char)((var154 | var61 << 11) ^ 31));
      }

      field_1187 = (Class_50)0<"JNT",-268896753,"㠨鈨鰨鈨꠨㰨","ք֣֮薟֩薟薄֞薟֥薠薄薶֢֧薣֥薠薊薳薃ֹ","呯呯",862364031>(
         0<"JNT",810314456,"꠨鸨昨꠨ꐨ鈨鰨踨","ք薃֣֮薟֩薟薄֞薟֥薠薄薶֢֧薣֥薠薊","䧯圯䣯圯盯䙯圯䛯咯盯厯䡯䯯䤯䛯咯翯䠯䤯䙯呯启䯯",862364034>(var10001), 1
      );
      var10000 = (1280262928 ^ 323064268 | 0) & 540018944;

      for (var10001 = (StringBuilder)0<"JNT",-268896753,"㠨鈨鰨鈨꠨㰨","ք֣֮薟֩薟薄֞薟֥薠薄薶֢֧薣֥薠薊薃ֹ","䧯圯䣯圯盯䙯圯䛯咯盯厯䡯䯯䤯䛯咯翯䠯䤯䙯呯启䯯",862364032>("胘胂胦æ胤ÜÛ×胎Ì胊胉");
         var10000 < (-1205987125 >> (207539746 & -1655052022) ^ -301496770);
         var10000 += (1057861368 ^ -1266820718 << 1057861368 | 1) & 270684165
      ) {
         int var65 = 0<"JNT",810314456,"蘨逨舨ꐨ䈨꠨","ք薳薃薮","䧯圯䣯圯盯䙯圯䛯咯盯厯䡯䯯䤯䛯咯翯䠯䤯䙯呯启䯯",862364139>(var10001, var10000) ^ '\b' ^ 246;
         char var68 = (char)(
            (((((var65 & 61440) >> 12 | var65 << 4) & 65504) >> 5 | ((var65 & 61440) >> 12 | var65 << 4) << 11) & 49152) >> 14
               | ((((var65 & 61440) >> 12 | var65 << 4) & 65504) >> 5 | ((var65 & 61440) >> 12 | var65 << 4) << 11) << 2
         );
         0<"JNT",810314456,"꘨訨꠨䘨逨舨ꐨ䈨꠨","ք薳薮薃ֹ","䧯圯䣯圯盯䙯圯䛯咯盯厯䡯䯯䤯䛯咯翯䠯䤯䙯呯启䯯",862364140>(
            var10001,
            var10000,
            (char)(
               (((((var65 & 61440) >> 12 | var65 << 4) & 65504) >> 5 | ((var65 & 61440) >> 12 | var65 << 4) << 11) & 49152) >> 14
                  | ((((var65 & 61440) >> 12 | var65 << 4) & 65504) >> 5 | ((var65 & 61440) >> 12 | var65 << 4) << 11) << 2
            )
         );
      }

      field_1188 = (Class_50)0<"JNT",-268896753,"㠨鈨鰨鈨꠨㰨","ք֣֮薟֩薟薄֞薟֥薠薄薶֢֧薣֥薠薊薳薃ֹ","呯呯",862364154>(
         0<"JNT",810314456,"꠨鸨昨꠨ꐨ鈨鰨踨","ք薃֣֮薟֩薟薄֞薟֥薠薄薶֢֧薣֥薠薊","䧯圯䣯圯盯䙯圯䛯咯盯厯䡯䯯䤯䛯咯翯䠯䤯䙯呯启䯯",862364153>(var10001), 2
      );
      var10000 = 816762008 << 210746854 ^ 733160960;

      for (var10001 = (StringBuilder)0<"JNT",-268896753,"㠨鈨鰨鈨꠨㰨","ք֣֮薟֩薟薄֞薟֥薠薄薶֢֧薣֥薠薊薃ֹ","䧯圯䣯圯盯䙯圯䛯咯盯厯䡯䯯䤯䛯咯翯䠯䤯䙯呯启䯯",862364151>(
            "\u009bócak©ßÉÃóç\u0085Ëçé\u009bëçÓÇ"
         );
         var10000 < ((-582578606 ^ -513707993 | 0) & -1073217124);
         var10000 += 1530021352 >>> -1601765794 ^ 0
      ) {
         int var71 = 0<"JNT",810314456,"蘨逨舨ꐨ䈨꠨","ք薳薃薮","䧯圯䣯圯盯䙯圯䛯咯盯厯䡯䯯䤯䛯咯翯䠯䤯䙯呯启䯯",862364144>(var10001, var10000);
         int var158 = (var71 & 32768) >> 15;
         int var72 = (var71 & 32768) >> 15 | var71 << 1;
         int var159 = (((var71 & 32768) >> 15 | var71 << 1) & 57344) >> 13;
         var71 = (((var158 | var71 << 1) & 57344) >> 13 | ((var71 & 32768) >> 15 | var71 << 1) << 3) - 16;
         var158 = ((var159 | var72 << 3) - 16 & 65534) >> 1;
         int var74 = ((var159 | var72 << 3) - 16 & 65534) >> 1 | var71 << 15;
         int var161 = ((((var159 | var72 << 3) - 16 & 65534) >> 1 | var71 << 15) & 65520) >> 4;
         char var75 = (char)(((var158 | var71 << 15) & 65520) >> 4 | (((var159 | var72 << 3) - 16 & 65534) >> 1 | var71 << 15) << 12);
         0<"JNT",810314456,"꘨訨꠨䘨逨舨ꐨ䈨꠨","ք薳薮薃ֹ","䧯圯䣯圯盯䙯圯䛯咯盯厯䡯䯯䤯䛯咯翯䠯䤯䙯呯启䯯",862364157>(var10001, var10000, (char)(var161 | var74 << 12));
      }

      field_1189 = (Class_50)0<"JNT",-268896753,"㠨鈨鰨鈨꠨㰨","ք֣֮薟֩薟薄֞薟֥薠薄薶֢֧薣֥薠薊薳薃ֹ","呯呯",862364148>(
         0<"JNT",810314456,"꠨鸨昨꠨ꐨ鈨鰨踨","ք薃֣֮薟֩薟薄֞薟֥薠薄薶֢֧薣֥薠薊","䧯圯䣯圯盯䙯圯䛯咯盯厯䡯䯯䤯䛯咯翯䠯䤯䙯呯启䯯",862364147>(var10001), 3
      );
      var10000 = (1922067501 + -2132143287 | 0) & 134480001;

      for (var10001 = (StringBuilder)0<"JNT",-268896753,"㠨鈨鰨鈨꠨㰨","ք֣֮薟֩薟薄֞薟֥薠薄薶֢֧薣֥薠薊薃ֹ","䧯圯䣯圯盯䙯圯䛯咯盯厯䡯䯯䤯䛯咯翯䠯䤯䙯呯启䯯",862364145>("\udfb8忲徽㾽\udfbdΆ㾴徴뾴뾴");
         var10000 < (-1558222671 & 1208729768 ^ 737450);
         var10000 += 768763819 << 1334837696 * 1334837696 ^ 768763818
      ) {
         int var78 = 0<"JNT",810314456,"蘨逨舨ꐨ䈨꠨","ք薳薃薮","䧯圯䣯圯盯䙯圯䛯咯盯厯䡯䯯䤯䛯咯翯䠯䤯䙯呯启䯯",862364040>(var10001, var10000) + 'L';
         char var79 = (char)((((var78 & 57344) >> 13 | var78 << 3) ^ 190 ^ 76) - 136);
         0<"JNT",810314456,"꘨訨꠨䘨逨舨ꐨ䈨꠨","ք薳薮薃ֹ","䧯圯䣯圯盯䙯圯䛯咯盯厯䡯䯯䤯䛯咯翯䠯䤯䙯呯启䯯",862364085>(
            var10001, var10000, (char)((((var78 & 57344) >> 13 | var78 << 3) ^ 190 ^ 76) - 136)
         );
      }

      field_1190 = (Class_50)0<"JNT",-268896753,"㠨鈨鰨鈨꠨㰨","ք֣֮薟֩薟薄֞薟֥薠薄薶֢֧薣֥薠薊薳薃ֹ","呯呯",862364047>(
         0<"JNT",810314456,"꠨鸨昨꠨ꐨ鈨鰨踨","ք薃֣֮薟֩薟薄֞薟֥薠薄薶֢֧薣֥薠薊","䧯圯䣯圯盯䙯圯䛯咯盯厯䡯䯯䤯䛯咯翯䠯䤯䙯呯启䯯",862364050>(var10001), 4
      );
      var10000 = -575514065 << -205249644 - -205249644 ^ -575514065;

      for (var10001 = (StringBuilder)0<"JNT",-268896753,"㠨鈨鰨鈨꠨㰨","ք֣֮薟֩薟薄֞薟֥薠薄薶֢֧薣֥薠薊薃ֹ","䧯圯䣯圯盯䙯圯䛯咯盯厯䡯䯯䤯䛯咯翯䠯䤯䙯呯启䯯",862364048>("适퀁忽俽´倂耀耀\u0003쀀က쀂퀀\u0001、");
         var10000 < (-998211744 & -29882129 ^ -1006630801);
         var10000 += (-1674677628 + 1255981644 | 1) & 297221
      ) {
         char var82 = 0<"JNT",810314456,"蘨逨舨ꐨ䈨꠨","ք薳薃薮","䧯圯䣯圯盯䙯圯䛯咯盯厯䡯䯯䤯䛯咯翯䠯䤯䙯呯启䯯",862364127>(var10001, var10000);
         int var163 = (var82 & '￠') >> 5;
         int var83 = (var82 & '￠') >> 5 | var82 << 11;
         int var164 = (((var82 & '￠') >> 5 | var82 << 11) & 65408) >> 7;
         var82 = (char)(((((var163 | var82 << 11) & 65408) >> 7 | ((var82 & '￠') >> 5 | var82 << 11) << 9) ^ 38) - 107 + 169);
         0<"JNT",810314456,"꘨訨꠨䘨逨舨ꐨ䈨꠨","ք薳薮薃ֹ","䧯圯䣯圯盯䙯圯䛯咯盯厯䡯䯯䤯䛯咯翯䠯䤯䙯呯启䯯",862364128>(var10001, var10000, (char)(((var164 | var83 << 9) ^ 38) - 107 + 169));
      }

      field_1191 = (Class_50)0<"JNT",-268896753,"㠨鈨鰨鈨꠨㰨","ք֣֮薟֩薟薄֞薟֥薠薄薶֢֧薣֥薠薊薳薃ֹ","呯呯",862364053>(
         0<"JNT",810314456,"꠨鸨昨꠨ꐨ鈨鰨踨","ք薃֣֮薟֩薟薄֞薟֥薠薄薶֢֧薣֥薠薊","䧯圯䣯圯盯䙯圯䛯咯盯厯䡯䯯䤯䛯咯翯䠯䤯䙯呯启䯯",862364136>(var10001), 5
      );
      var10000 = 1071947342 >>> 1176491860 ^ 1022;

      for (var10001 = (StringBuilder)0<"JNT",-268896753,"㠨鈨鰨鈨꠨㰨","ք֣֮薟֩薟薄֞薟֥薠薄薶֢֧薣֥薠薊薃ֹ","䧯圯䣯圯盯䙯圯䛯咯盯厯䡯䯯䤯䛯咯翯䠯䤯䙯呯启䯯",862364054>("錻餻ꔻ쌻줻팻\udf3b");
         var10000 < (-392064583 - (387707535 ^ -392064583 << 387707535) ^ 148512557);
         var10000 += (1247758280 << (-195930183 | 1247758280) | 1) & 1663657291
      ) {
         int var87 = 0<"JNT",810314456,"蘨逨舨ꐨ䈨꠨","ք薳薃薮","䧯圯䣯圯盯䙯圯䛯咯盯厯䡯䯯䤯䛯咯翯䠯䤯䙯呯启䯯",862364045>(var10001, var10000) - 207 ^ 183 ^ 180 ^ 111;
         char var88 = (char)((var87 & 65024) >> 9 | var87 << 7);
         0<"JNT",810314456,"꘨訨꠨䘨逨舨ꐨ䈨꠨","ք薳薮薃ֹ","䧯圯䣯圯盯䙯圯䛯咯盯厯䡯䯯䤯䛯咯翯䠯䤯䙯呯启䯯",862364046>(var10001, var10000, (char)((var87 & 65024) >> 9 | var87 << 7));
      }

      field_1192 = (Class_50)0<"JNT",-268896753,"㠨鈨鰨鈨꠨㰨","ք֣֮薟֩薟薄֞薟֥薠薄薶֢֧薣֥薠薊薳薃ֹ","呯呯",862364149>(
         0<"JNT",810314456,"꠨鸨昨꠨ꐨ鈨鰨踨","ք薃֣֮薟֩薟薄֞薟֥薠薄薶֢֧薣֥薠薊","䧯圯䣯圯盯䙯圯䛯咯盯厯䡯䯯䤯䛯咯翯䠯䤯䙯呯启䯯",862364104>(var10001), 6
      );
      var10000 = 1766399785 ^ -2113092203 ^ -347743556;

      for (var10001 = (StringBuilder)0<"JNT",-268896753,"㠨鈨鰨鈨꠨㰨","ք֣֮薟֩薟薄֞薟֥薠薄薶֢֧薣֥薠薊薃ֹ","䧯圯䣯圯盯䙯圯䛯咯盯厯䡯䯯䤯䛯咯翯䠯䤯䙯呯启䯯",862364150>("㱘㥘䍘ㅘᑘ❘ቘၘ");
         var10000 < ((326854643 >> -806169096 | 8) & 453873544);
         var10000 += (-816003032 >>> -36795961 | 1) & -366935509
      ) {
         char var91 = 0<"JNT",810314456,"蘨逨舨ꐨ䈨꠨","ք薳薃薮","䧯圯䣯圯盯䙯圯䛯咯盯厯䡯䯯䤯䛯咯翯䠯䤯䙯呯启䯯",862364134>(var10001, var10000);
         int var166 = (var91 & '\ufff8') >> 3;
         int var92 = (((var91 & '\ufff8') >> 3 | var91 << '\r') ^ 206) - 69;
         int var167 = ((((var91 & '\ufff8') >> 3 | var91 << '\r') ^ 206) - 69 & 65504) >> 5;
         var91 = (char)(((((var166 | var91 << '\r') ^ 206) - 69 & 65504) >> 5 | (((var91 & '\ufff8') >> 3 | var91 << '\r') ^ 206) - 69 << 11) ^ 113);
         0<"JNT",810314456,"꘨訨꠨䘨逨舨ꐨ䈨꠨","ք薳薮薃ֹ","䧯圯䣯圯盯䙯圯䛯咯盯厯䡯䯯䤯䛯咯翯䠯䤯䙯呯启䯯",862364131>(var10001, var10000, (char)((var167 | var92 << 11) ^ 113));
      }

      field_1193 = (Class_50)0<"JNT",-268896753,"㠨鈨鰨鈨꠨㰨","ք֣֮薟֩薟薄֞薟֥薠薄薶֢֧薣֥薠薊薳薃ֹ","呯呯",862364138>(
         0<"JNT",810314456,"꠨鸨昨꠨ꐨ鈨鰨踨","ք薃֣֮薟֩薟薄֞薟֥薠薄薶֢֧薣֥薠薊","䧯圯䣯圯盯䙯圯䛯咯盯厯䡯䯯䤯䛯咯翯䠯䤯䙯呯启䯯",862364137>(var10001), 7
      );
      var10000 = (2122056255 + 1228741706 | 0) & 537043042;

      for (var10001 = (StringBuilder)0<"JNT",-268896753,"㠨鈨鰨鈨꠨㰨","ք֣֮薟֩薟薄֞薟֥薠薄薶֢֧薣֥薠薊薃ֹ","䧯圯䣯圯盯䙯圯䛯咯盯厯䡯䯯䤯䛯咯翯䠯䤯䙯呯启䯯",862364135>("ºE±ZY±XY");
         var10000 < ((899798609 >> 856326623 | 8) & 560474281);
         var10000 += (1856234464 | 1856234464 | 1) & -2128869359
      ) {
         0<"JNT",810314456,"꘨訨꠨䘨逨舨ꐨ䈨꠨","ք薳薮薃ֹ","䧯圯䣯圯盯䙯圯䛯咯盯厯䡯䯯䤯䛯咯翯䠯䤯䙯呯启䯯",862364143>(
            var10001,
            var10000,
            (char)(((0<"JNT",810314456,"蘨逨舨ꐨ䈨꠨","ք薳薃薮","䧯圯䣯圯盯䙯圯䛯咯盯厯䡯䯯䤯䛯咯翯䠯䤯䙯呯启䯯",862364146>(var10001, var10000) ^ 197) + 83 + 11 ^ 69) - 79)
         );
      }

      field_1194 = (Class_50)0<"JNT",-268896753,"㠨鈨鰨鈨꠨㰨","ք֣֮薟֩薟薄֞薟֥薠薄薶֢֧薣֥薠薊薳薃ֹ","呯呯",862364052>(
         0<"JNT",810314456,"꠨鸨昨꠨ꐨ鈨鰨踨","ք薃֣֮薟֩薟薄֞薟֥薠薄薶֢֧薣֥薠薊","䧯圯䣯圯盯䙯圯䛯咯盯厯䡯䯯䤯䛯咯翯䠯䤯䙯呯启䯯",862364051>(var10001), 8
      );
      var10000 = (-725346202 * -1556626634 | 0) & -1878914960;

      for (var10001 = (StringBuilder)0<"JNT",-268896753,"㠨鈨鰨鈨꠨㰨","ք֣֮薟֩薟薄֞薟֥薠薄薶֢֧薣֥薠薊薃ֹ","䧯圯䣯圯盯䙯圯䛯咯盯厯䡯䯯䤯䛯咯翯䠯䤯䙯呯启䯯",862364049>("믿刁돿먀ሂ돿먀ਂሂ樂舂㨂");
         var10000 < (-280298944 << -1132739579 - -1132739579 ^ -280298932);
         var10000 += (25160287 + 216601545 | 1) & 285344151
      ) {
         char var98 = 0<"JNT",810314456,"蘨逨舨ꐨ䈨꠨","ք薳薃薮","䧯圯䣯圯盯䙯圯䛯咯盯厯䡯䯯䤯䛯咯翯䠯䤯䙯呯启䯯",862364036>(var10001, var10000);
         int var168 = (var98 & '︀') >> 9;
         int var99 = ((var98 & '︀') >> 9 | var98 << 7) + 61 ^ 98;
         int var169 = ((((var98 & '︀') >> 9 | var98 << 7) + 61 ^ 98) & 65532) >> 2;
         var98 = (char)(((((var168 | var98 << 7) + 61 ^ 98) & 65532) >> 2 | (((var98 & '︀') >> 9 | var98 << 7) + 61 ^ 98) << 14) + 43);
         0<"JNT",810314456,"꘨訨꠨䘨逨舨ꐨ䈨꠨","ք薳薮薃ֹ","䧯圯䣯圯盯䙯圯䛯咯盯厯䡯䯯䤯䛯咯翯䠯䤯䙯呯启䯯",862364033>(var10001, var10000, (char)((var169 | var99 << 14) + 43));
      }

      field_1195 = (Class_50)0<"JNT",-268896753,"㠨鈨鰨鈨꠨㰨","ք֣֮薟֩薟薄֞薟֥薠薄薶֢֧薣֥薠薊薳薃ֹ","呯呯",862364083>(
         0<"JNT",810314456,"꠨鸨昨꠨ꐨ鈨鰨踨","ք薃֣֮薟֩薟薄֞薟֥薠薄薶֢֧薣֥薠薊","䧯圯䣯圯盯䙯圯䛯咯盯厯䡯䯯䤯䛯咯翯䠯䤯䙯呯启䯯",862364086>(var10001), 9
      );
      var10000 = (1260889805 | -1934568912 | 0) & 268962048;

      for (var10001 = (StringBuilder)0<"JNT",-268896753,"㠨鈨鰨鈨꠨㰨","ք֣֮薟֩薟薄֞薟֥薠薄薶֢֧薣֥薠薊薃ֹ","䧯圯䣯圯盯䙯圯䛯咯盯厯䡯䯯䤯䛯咯翯䠯䤯䙯呯启䯯",862364084>("➦➆⢆ⰆⰦ⡦⸦ⵆ");
         var10000 < ((1503793599 >> 1172426144 | 0) & -2079987704);
         var10000 += (1770510869 << 2062102088 + -530418871 | 1) & 198216033
      ) {
         int var103 = 0<"JNT",810314456,"蘨逨舨ꐨ䈨꠨","ք薳薃薮","䧯圯䣯圯盯䙯圯䛯咯盯厯䡯䯯䤯䛯咯翯䠯䤯䙯呯启䯯",862364060>(var10001, var10000) + '5' + 101 ^ 192;
         char var104 = (char)(((var103 & 65504) >> 5 | var103 << 11) - 251);
         0<"JNT",810314456,"꘨訨꠨䘨逨舨ꐨ䈨꠨","ք薳薮薃ֹ","䧯圯䣯圯盯䙯圯䛯咯盯厯䡯䯯䤯䛯咯翯䠯䤯䙯呯启䯯",862364057>(var10001, var10000, (char)(((var103 & 65504) >> 5 | var103 << 11) - 251));
      }

      field_1196 = (Class_50)0<"JNT",-268896753,"㠨鈨鰨鈨꠨㰨","ք֣֮薟֩薟薄֞薟֥薠薄薶֢֧薣֥薠薊薳薃ֹ","呯呯",862364062>(
         0<"JNT",810314456,"꠨鸨昨꠨ꐨ鈨鰨踨","ք薃֣֮薟֩薟薄֞薟֥薠薄薶֢֧薣֥薠薊","䧯圯䣯圯盯䙯圯䛯咯盯厯䡯䯯䤯䛯咯翯䠯䤯䙯呯启䯯",862364061>(var10001), 10
      );
      var10000 = -2072744858 + -2014030 ^ -2074758888;

      for (var10001 = (StringBuilder)0<"JNT",-268896753,"㠨鈨鰨鈨꠨㰨","ք֣֮薟֩薟薄֞薟֥薠薄薶֢֧薣֥薠薊薃ֹ","䧯圯䣯圯盯䙯圯䛯咯盯厯䡯䯯䤯䛯咯翯䠯䤯䙯呯启䯯",862364059>("ҥӕٕڕݥօ࠵ݥܥࡕݥࡅࡕҕڥࡕࡅ");
         var10000 < ((-1111969063 ^ -1111969063 | 17) & 1030087153);
         var10000 += (1041892826 << 1041892826 | 1) & -1794738089
      ) {
         char var107 = 0<"JNT",810314456,"蘨逨舨ꐨ䈨꠨","ք薳薃薮","䧯圯䣯圯盯䙯圯䛯咯盯厯䡯䯯䤯䛯咯翯䠯䤯䙯呯启䯯",862364141>(var10001, var10000);
         int var171 = (var107 & 0) >> 16;
         int var108 = ((var107 & 0) >> 16 | var107 << 0) + 54 - 197 ^ 134;
         int var172 = ((((var107 & 0) >> 16 | var107 << 0) + 54 - 197 ^ 134) & 65520) >> 4;
         var107 = (char)((((var171 | var107 << 0) + 54 - 197 ^ 134) & 65520) >> 4 | (((var107 & 0) >> 16 | var107 << 0) + 54 - 197 ^ 134) << 12);
         0<"JNT",810314456,"꘨訨꠨䘨逨舨ꐨ䈨꠨","ք薳薮薃ֹ","䧯圯䣯圯盯䙯圯䛯咯盯厯䡯䯯䤯䛯咯翯䠯䤯䙯呯启䯯",862364142>(var10001, var10000, (char)(var172 | var108 << 12));
      }

      field_1197 = (Class_50)0<"JNT",-268896753,"㠨鈨鰨鈨꠨㰨","ք֣֮薟֩薟薄֞薟֥薠薄薶֢֧薣֥薠薊薳薃ֹ","呯呯",862364155>(
         0<"JNT",810314456,"꠨鸨昨꠨ꐨ鈨鰨踨","ք薃֣֮薟֩薟薄֞薟֥薠薄薶֢֧薣֥薠薊","䧯圯䣯圯盯䙯圯䛯咯盯厯䡯䯯䤯䛯咯翯䠯䤯䙯呯启䯯",862364158>(var10001), 11
      );
      var10000 = (1128534107 ^ -1409104910 | 0) & 589906;

      for (var10001 = (StringBuilder)0<"JNT",-268896753,"㠨鈨鰨鈨꠨㰨","ք֣֮薟֩薟薄֞薟֥薠薄薶֢֧薣֥薠薊薃ֹ","䧯圯䣯圯盯䙯圯䛯咯盯厯䡯䯯䤯䛯咯翯䠯䤯䙯呯启䯯",862364156>("ÎÉÀíîééÍôõ");
         var10000 < ((537400590 >>> 1963162366 | 10) & 1217662587);
         var10000 += 1670207057 & -1947691921 ^ 59249728
      ) {
         int var112 = 0<"JNT",810314456,"蘨逨舨ꐨ䈨꠨","ք薳薃薮","䧯圯䣯圯盯䙯圯䛯咯盯厯䡯䯯䤯䛯咯翯䠯䤯䙯呯启䯯",862364152>(var10001, var10000) ^ 'D';
         int var173 = (var112 & 65535) >> 0;
         int var113 = ((var112 & 65535) >> 0 | var112 << 16) - 45 - 20;
         int var174 = (((var112 & 65535) >> 0 | var112 << 16) - 45 - 20 & 65535) >> 0;
         char var114 = (char)(((var173 | var112 << 16) - 45 - 20 & 65535) >> 0 | ((var112 & 65535) >> 0 | var112 << 16) - 45 - 20 << 16);
         0<"JNT",810314456,"꘨訨꠨䘨逨舨ꐨ䈨꠨","ք薳薮薃ֹ","䧯圯䣯圯盯䙯圯䛯咯盯厯䡯䯯䤯䛯咯翯䠯䤯䙯呯启䯯",862364133>(var10001, var10000, (char)(var174 | var113 << 16));
      }

      field_1198 = (Class_50)0<"JNT",-268896753,"㠨鈨鰨鈨꠨㰨","ք֣֮薟֩薟薄֞薟֥薠薄薶֢֧薣֥薠薊薳薃ֹ","呯呯",862364038>(
         0<"JNT",810314456,"꠨鸨昨꠨ꐨ鈨鰨踨","ք薃֣֮薟֩薟薄֞薟֥薠薄薶֢֧薣֥薠薊","䧯圯䣯圯盯䙯圯䛯咯盯厯䡯䯯䤯䛯咯翯䠯䤯䙯呯启䯯",862364037>(var10001), 12
      );
      var10000 = 979657135 + 855870678 ^ 1835527813;

      for (var10001 = (StringBuilder)0<"JNT",-268896753,"㠨鈨鰨鈨꠨㰨","ք֣֮薟֩薟薄֞薟֥薠薄薶֢֧薣֥薠薊薃ֹ","䧯圯䣯圯盯䙯圯䛯咯盯厯䡯䯯䤯䛯咯翯䠯䤯䙯呯启䯯",862364035>("ࡸ\u0890ࡰॸরࡰনর॰ॸৈ\u09d0নী৸");
         var10000 < ((-1258295275 - 1490407291 | 15) & -2084564881);
         var10000 += 347149006 << -1540193058 * -1540193058 ^ 1259416801
      ) {
         int var117 = 0<"JNT",810314456,"蘨逨舨ꐨ䈨꠨","ք薳薃薮","䧯圯䣯圯盯䙯圯䛯咯盯厯䡯䯯䤯䛯咯翯䠯䤯䙯呯启䯯",862364055>(var10001, var10000);
         int var175 = (var117 & 61440) >> 12;
         int var118 = (var117 & 61440) >> 12 | var117 << 4;
         int var176 = (((var117 & 61440) >> 12 | var117 << 4) & 57344) >> 13;
         var117 = ((var175 | var117 << 4) & 57344) >> 13 | ((var117 & 61440) >> 12 | var117 << 4) << 3;
         var175 = ((var176 | var118 << 3) & 32768) >> 15;
         int var120 = ((var176 | var118 << 3) & 32768) >> 15 | var117 << 1;
         int var178 = ((((var176 | var118 << 3) & 32768) >> 15 | var117 << 1) & 63488) >> 11;
         char var121 = (char)((((var175 | var117 << 1) & 63488) >> 11 | (((var176 | var118 << 3) & 32768) >> 15 | var117 << 1) << 5) - 198);
         0<"JNT",810314456,"꘨訨꠨䘨逨舨ꐨ䈨꠨","ք薳薮薃ֹ","䧯圯䣯圯盯䙯圯䛯咯盯厯䡯䯯䤯䛯咯翯䠯䤯䙯呯启䯯",862364056>(var10001, var10000, (char)((var178 | var120 << 5) - 198));
      }

      field_1199 = (Class_50)0<"JNT",-268896753,"㠨鈨鰨鈨꠨㰨","ք֣֮薟֩薟薄֞薟֥薠薄薶֢֧薣֥薠薊薳薃ֹ","呯呯",862364129>(
         0<"JNT",810314456,"꠨鸨昨꠨ꐨ鈨鰨踨","ք薃֣֮薟֩薟薄֞薟֥薠薄薶֢֧薣֥薠薊","䧯圯䣯圯盯䙯圯䛯咯盯厯䡯䯯䤯䛯咯翯䠯䤯䙯呯启䯯",862364132>(var10001), 13
      );
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1245(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = (var10 + 507213398 + 1099973613 - 1880286387 - 1117652367 ^ 157599483 ^ 1539120614 ^ 1433745483) + 1548104007 - 1170118508;
      MethodHandle var10000 = field_1201[(var10 + 507213398 + 1099973613 - 1880286387 - 1117652367 ^ 157599483 ^ 1539120614 ^ 1433745483)
         + 1548104007
         - 1170118508
         + 38458264];
      if (field_1201[var10001 + 38458264] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = 1069384585 & 526317506 ^ 521962368; var23 < var13.length(); var23 += (-1241281254 & -2073315993 | 1) & 708338229) {
            int var42 = var13.charAt(var23) ^ 19;
            int var10004 = (var42 & 65504) >> 5;
            int var43 = (var42 & 65504) >> 5 | var42 << 11;
            int var83 = (((var42 & 65504) >> 5 | var42 << 11) & 61440) >> 12;
            var42 = (((var10004 | var42 << 11) & 61440) >> 12 | ((var42 & 65504) >> 5 | var42 << 11) << 4) + 249 ^ 22;
            var10004 = (((var83 | var43 << 4) + 249 ^ 22) & 65408) >> 7;
            int var45 = (((var83 | var43 << 4) + 249 ^ 22) & 65408) >> 7 | var42 << 9;
            int var85 = (((((var83 | var43 << 4) + 249 ^ 22) & 65408) >> 7 | var42 << 9) & 65532) >> 2;
            var42 = ((var10004 | var42 << 9) & 65532) >> 2 | ((((var83 | var43 << 4) + 249 ^ 22) & 65408) >> 7 | var42 << 9) << 14;
            var10004 = ((var85 | var45 << 14) & 63488) >> 11;
            int var47 = ((var85 | var45 << 14) & 63488) >> 11 | var42 << 5;
            int var87 = ((((var85 | var45 << 14) & 63488) >> 11 | var42 << 5) & 65520) >> 4;
            char var48 = (char)((((var10004 | var42 << 5) & 65520) >> 4 | (((var85 | var45 << 14) & 63488) >> 11 | var42 << 5) << 12) - 97);
            var13.setCharAt(var23, (char)((var87 | var47 << 12) - 97));
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = -106706628 * -106706628 ^ -1734916592; var29 < var16.length(); var29 += (-673932430 - -98749777 | 1) & 34116629) {
            int var53 = var16.charAt(var29) + 2 ^ 188;
            char var56 = (char)(
               (
                        (((((var53 & 65532) >> 2 | var53 << 14) + 231 & 65534) >> 1 | ((var53 & 65532) >> 2 | var53 << 14) + 231 << 15) - 251 - 23 & 61440)
                              >> 12
                           | ((((var53 & 65532) >> 2 | var53 << 14) + 231 & 65534) >> 1 | ((var53 & 65532) >> 2 | var53 << 14) + 231 << 15) - 251 - 23 << 4
                     )
                     - 25
                  ^ 91
            );
            var16.setCharAt(
               var29,
               (char)(
                  (
                           (((((var53 & 65532) >> 2 | var53 << 14) + 231 & 65534) >> 1 | ((var53 & 65532) >> 2 | var53 << 14) + 231 << 15) - 251 - 23 & 61440)
                                 >> 12
                              | ((((var53 & 65532) >> 2 | var53 << 14) + 231 & 65534) >> 1 | ((var53 & 65532) >> 2 | var53 << 14) + 231 << 15) - 251 - 23 << 4
                        )
                        - 25
                     ^ 91
               )
            );
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_50.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = (-1933863584 & 1726544612 | 0) & -669839861; var35 < var19.length(); var35 += -338408435 >> -1660973841 ^ -10327) {
            int var61 = var19.charAt(var35) ^ '/';
            int var91 = (var61 & 65024) >> 9;
            int var62 = (var61 & 65024) >> 9 | var61 << 7;
            int var92 = (((var61 & 65024) >> 9 | var61 << 7) & 57344) >> 13;
            char var63 = (char)((((((var91 | var61 << 7) & 57344) >> 13 | ((var61 & 65024) >> 9 | var61 << 7) << 3) ^ 6 ^ 131) - 30 - 8 + 74 ^ 164) - 248);
            var19.setCharAt(var35, (char)((((var92 | var62 << 3) ^ 6 ^ 131) - 30 - 8 + 74 ^ 164) - 248));
         }

         Class var7 = Class.forName(var19.toString(), false, Class_50.class.getClassLoader());
         switch ((var4 + 1526781294 + 714808973 ^ 1301972683 ^ 2048740470 ^ 1633145927) + 1595656951 - 2038225944 - 644983459 + 1041459752 + 718993103) {
            case 11288348:
            case 190047580:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 368271882:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            case 1264622115:
               var10000 = var0.findConstructor(var7, var6);
               break;
            case 1731123235:
               var10000 = var0.findSpecial(var7, var5, var6, Class_50.class);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_1201[(var10 + 507213398 + 1099973613 - 1880286387 - 1117652367 ^ 157599483 ^ 1539120614 ^ 1433745483) + 1548104007 - 1170118508 + 38458264] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1246(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = (((var10 + 1085754068 ^ 1234610876) - 2064555040 ^ 316411452 ^ 304916032) - 1116952474 ^ 164259367) + 1532996544 ^ 1717199368;
      MethodHandle var10000 = field_1201[(
            (((var10 + 1085754068 ^ 1234610876) - 2064555040 ^ 316411452 ^ 304916032) - 1116952474 ^ 164259367) + 1532996544 ^ 1717199368
         )
         - 467837301];
      if (field_1201[var10001 - 467837301] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = -2055952 & -739026254 ^ -740294480; var24 < var14.length(); var24 += -178345789 >>> 1554535570 ^ 15702) {
            char var43 = var14.charAt(var24);
            char var48 = (char)(
               (
                     (
                           (
                                    (
                                          (
                                                   (
                                                         (
                                                                  (
                                                                        (
                                                                                 (
                                                                                       (((var43 & '\uf000') >> 12 | var43 << 4) & 65024) >> 9
                                                                                          | ((var43 & '\uf000') >> 12 | var43 << 4) << 7
                                                                                    )
                                                                                    & 32768
                                                                              )
                                                                              >> 15
                                                                           | (
                                                                                 (((var43 & '\uf000') >> 12 | var43 << 4) & 65024) >> 9
                                                                                    | ((var43 & '\uf000') >> 12 | var43 << 4) << 7
                                                                              )
                                                                              << 1
                                                                     )
                                                                     ^ 125
                                                               )
                                                               - 14
                                                            ^ 21
                                                      )
                                                      & 65528
                                                )
                                                >> 3
                                             | (
                                                   (
                                                            (
                                                                  (
                                                                           (
                                                                                 (((var43 & '\uf000') >> 12 | var43 << 4) & 65024) >> 9
                                                                                    | ((var43 & '\uf000') >> 12 | var43 << 4) << 7
                                                                              )
                                                                              & 32768
                                                                        )
                                                                        >> 15
                                                                     | (
                                                                           (((var43 & '\uf000') >> 12 | var43 << 4) & 65024) >> 9
                                                                              | ((var43 & '\uf000') >> 12 | var43 << 4) << 7
                                                                        )
                                                                        << 1
                                                               )
                                                               ^ 125
                                                         )
                                                         - 14
                                                      ^ 21
                                                )
                                                << 13
                                       )
                                       & 65535
                                 )
                                 >> 0
                              | (
                                    (
                                             (
                                                   (
                                                            (
                                                                  (
                                                                           (
                                                                                 (((var43 & '\uf000') >> 12 | var43 << 4) & 65024) >> 9
                                                                                    | ((var43 & '\uf000') >> 12 | var43 << 4) << 7
                                                                              )
                                                                              & 32768
                                                                        )
                                                                        >> 15
                                                                     | (
                                                                           (((var43 & '\uf000') >> 12 | var43 << 4) & 65024) >> 9
                                                                              | ((var43 & '\uf000') >> 12 | var43 << 4) << 7
                                                                        )
                                                                        << 1
                                                               )
                                                               ^ 125
                                                         )
                                                         - 14
                                                      ^ 21
                                                )
                                                & 65528
                                          )
                                          >> 3
                                       | (
                                             (
                                                      (
                                                            (
                                                                     (
                                                                           (((var43 & '\uf000') >> 12 | var43 << 4) & 65024) >> 9
                                                                              | ((var43 & '\uf000') >> 12 | var43 << 4) << 7
                                                                        )
                                                                        & 32768
                                                                  )
                                                                  >> 15
                                                               | (
                                                                     (((var43 & '\uf000') >> 12 | var43 << 4) & 65024) >> 9
                                                                        | ((var43 & '\uf000') >> 12 | var43 << 4) << 7
                                                                  )
                                                                  << 1
                                                         )
                                                         ^ 125
                                                   )
                                                   - 14
                                                ^ 21
                                          )
                                          << 13
                                 )
                                 << 16
                        )
                        ^ 174
                  )
                  + 58
            );
            var14.setCharAt(
               var24,
               (char)(
                  (
                        (
                              (
                                       (
                                             (
                                                      (
                                                            (
                                                                     (
                                                                           (
                                                                                    (
                                                                                          (((var43 & '\uf000') >> 12 | var43 << 4) & 65024) >> 9
                                                                                             | ((var43 & '\uf000') >> 12 | var43 << 4) << 7
                                                                                       )
                                                                                       & 32768
                                                                                 )
                                                                                 >> 15
                                                                              | (
                                                                                    (((var43 & '\uf000') >> 12 | var43 << 4) & 65024) >> 9
                                                                                       | ((var43 & '\uf000') >> 12 | var43 << 4) << 7
                                                                                 )
                                                                                 << 1
                                                                        )
                                                                        ^ 125
                                                                  )
                                                                  - 14
                                                               ^ 21
                                                         )
                                                         & 65528
                                                   )
                                                   >> 3
                                                | (
                                                      (
                                                               (
                                                                     (
                                                                              (
                                                                                    (((var43 & '\uf000') >> 12 | var43 << 4) & 65024) >> 9
                                                                                       | ((var43 & '\uf000') >> 12 | var43 << 4) << 7
                                                                                 )
                                                                                 & 32768
                                                                           )
                                                                           >> 15
                                                                        | (
                                                                              (((var43 & '\uf000') >> 12 | var43 << 4) & 65024) >> 9
                                                                                 | ((var43 & '\uf000') >> 12 | var43 << 4) << 7
                                                                           )
                                                                           << 1
                                                                  )
                                                                  ^ 125
                                                            )
                                                            - 14
                                                         ^ 21
                                                   )
                                                   << 13
                                          )
                                          & 65535
                                    )
                                    >> 0
                                 | (
                                       (
                                                (
                                                      (
                                                               (
                                                                     (
                                                                              (
                                                                                    (((var43 & '\uf000') >> 12 | var43 << 4) & 65024) >> 9
                                                                                       | ((var43 & '\uf000') >> 12 | var43 << 4) << 7
                                                                                 )
                                                                                 & 32768
                                                                           )
                                                                           >> 15
                                                                        | (
                                                                              (((var43 & '\uf000') >> 12 | var43 << 4) & 65024) >> 9
                                                                                 | ((var43 & '\uf000') >> 12 | var43 << 4) << 7
                                                                           )
                                                                           << 1
                                                                  )
                                                                  ^ 125
                                                            )
                                                            - 14
                                                         ^ 21
                                                   )
                                                   & 65528
                                             )
                                             >> 3
                                          | (
                                                (
                                                         (
                                                               (
                                                                        (
                                                                              (((var43 & '\uf000') >> 12 | var43 << 4) & 65024) >> 9
                                                                                 | ((var43 & '\uf000') >> 12 | var43 << 4) << 7
                                                                           )
                                                                           & 32768
                                                                     )
                                                                     >> 15
                                                                  | (
                                                                        (((var43 & '\uf000') >> 12 | var43 << 4) & 65024) >> 9
                                                                           | ((var43 & '\uf000') >> 12 | var43 << 4) << 7
                                                                     )
                                                                     << 1
                                                            )
                                                            ^ 125
                                                      )
                                                      - 14
                                                   ^ 21
                                             )
                                             << 13
                                    )
                                    << 16
                           )
                           ^ 174
                     )
                     + 58
               )
            );
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = 1630190701 & -20510292 ^ 1610745900; var30 < var17.length(); var30 += (1769001583 + 1769001583 | 1) & 537528609) {
            int var53 = (((var17.charAt(var30) + '0' - 235 ^ 152) + 32 ^ 243) + 47 ^ 235) + 119;
            char var54 = (char)(((var53 & 65534) >> 1 | var53 << 15) ^ 177);
            var17.setCharAt(var30, (char)(((var53 & 65534) >> 1 | var53 << 15) ^ 177));
         }

         Class var6 = Class.forName(var17.toString(), false, Class_50.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = (1483004057 + 1483004057 | 0) & 1075068993; var36 < var20.length(); var36 += (-982507924 * -982507924 | 1) & 566362181) {
            int var59 = var20.charAt(var36) + 'o';
            int var83 = (var59 & 65534) >> 1;
            int var60 = (((var59 & 65534) >> 1 | var59 << 15) - 81 + 231 - 114 - 55 - 117 ^ 159) + 82;
            int var84 = ((((var59 & 65534) >> 1 | var59 << 15) - 81 + 231 - 114 - 55 - 117 ^ 159) + 82 & 65504) >> 5;
            char var61 = (char)(
               (((var83 | var59 << 15) - 81 + 231 - 114 - 55 - 117 ^ 159) + 82 & 65504) >> 5
                  | (((var59 & 65534) >> 1 | var59 << 15) - 81 + 231 - 114 - 55 - 117 ^ 159) + 82 << 11
            );
            var20.setCharAt(var36, (char)(var84 | var60 << 11));
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_50.class.getClassLoader()).returnType();
         switch (((var4 - 463059339 - 365236790 + 137163671 ^ 1123689325) + 1762139279 ^ 2097407499) + 1699708664 + 520705677 ^ 920094825 ^ 776022435) {
            case 342107726:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            case 986547369:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            case 1738168735:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            case 2111088656:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_1201[((((var10 + 1085754068 ^ 1234610876) - 2064555040 ^ 316411452 ^ 304916032) - 1116952474 ^ 164259367) + 1532996544 ^ 1717199368) - 467837301] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
