import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;
import java.util.function.Consumer;
import net.minecraft.class_11908;
import net.minecraft.class_11909;
import net.minecraft.class_310;
import net.minecraft.class_332;
import net.minecraft.class_437;

public class Class_330 extends class_437 implements Class_308 {
   // $VF: renamed from: dqv java.lang.String
   public String field_2608;
   // $VF: renamed from: pg Class_262
   public Class_262 field_2609;
   // $VF: renamed from: iai java.util.function.Consumer
   public Consumer field_2610;
   public class_437 vjrq;
   // $VF: renamed from: yqz int
   public int field_2611;
   // $VF: renamed from: ti int
   public int field_2612;
   // $VF: renamed from: laq int
   public int field_2613;
   // $VF: renamed from: zp int
   public int field_2614;
   // $VF: renamed from: ixp int
   public int field_2615;
   // $VF: renamed from: uq Class_262
   public static Class_262 field_2616 = (Class_262)0<"JNT",-431768172,"뻨廭ﻮ廭뻯ﻨ","㔎℮℮℮℮㔮⋎","戬瀬",-2066679463>(0, 0, 0, 0);
   // $VF: renamed from: ikn boolean
   public boolean field_2617;
   // $VF: renamed from: nz boolean
   public boolean field_2618;
   // $VF: renamed from: dc double
   public double field_2619;
   // $VF: renamed from: jpk double
   public double field_2620;
   // $VF: renamed from: qlj double
   public double field_2621;
   // $VF: renamed from: gek double
   public double field_2622;
   // $VF: renamed from: uik int[]
   public int[] field_2623;
   // $VF: renamed from: zgv int[]
   public int[] field_2624;
   // $VF: renamed from: mvn java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_2625 = new MethodHandle[276];

   public Class_330(String var1, Class_262 var2, Consumer var3, class_437 var4) {
      int var10 = -1458806610;
      super(
         0<"JNT",-233425411,"\udeee\udeed뻯㻭Ữ뻭Ử뻧黧뻧ủ黧","㔎㔮\u218eⷎⲮ⺎㗮ⶮ\u2d2eⷎⲮⱮ⹎ⰮⳎ⺎㗮ⱮⶎⰮ\u2e6e\u2e6e⏮㚮㙎㚮㘎㝮","帬䰬樬\ude2b尬听帬䰬䠬昬䐬丬樬\ude2b䠬娬䐬栬栬䀬\ue62b\uec2b\uee2b\ue42b",-2066678230>()
      );
      this.field_2611 = 20;
      this.field_2612 = 200;
      this.field_2613 = 20;
      this.field_2614 = 15;
      this.field_2615 = 4;
      this.field_2617 = false;
      this.field_2618 = false;
      this.field_2622 = -1.0;
      this.field_2608 = var1;
      this.field_2609 = 0<"JNT",-438714991,"黭绬廬廬","㔎㔮\u218e⸎⻮㝮","戬瀬",-2066678233>(var2);
      this.field_2610 = var3;
      this.vjrq = var4;
      float[] var5 = 0<"JNT",-233425411,"㻯㻯廯","㔎℮℮℮⍮\u20ce㔮⍮\u20ce","戬瀬",-2066678189>(
         1<"JNT",-1963550979,"鶒\ue992膒","봋紉","ܫ\u074b͋",-399797475>(var2),
         1<"JNT",-1963550979,"붒薒떒","봋紉","ܫ\u074b͋",-399797474>(var2),
         1<"JNT",-1963550979,"\ued92冒","봋紉","ܫ\u074b͋",-399797473>(var2),
         null
      );
      this.field_2619 = (double)(var5[0] * 360.0F);
      this.field_2620 = (double)var5[1];
      this.field_2621 = (double)var5[2];
      byte var6 = 50;
      this.field_2624 = new int[var6];
      int var7 = 0;

      label22:
      while (true) {
         var10 = -1171055876;

         while (true) {
            switch (var10 - 2124361793 - 1269696691 + 190511015 - 315308980 ^ 190720118 ^ 1073757640) {
               case -1557428155:
                  if (var7 < var6) {
                     double var8 = (double)var7 / (double)var6 * 360.0;
                     1<"JNT",-1963550979,"妒\ued92ꦒ","ﴏﴎ","ܫ\u074bƋ͋",-399797471>(this)[var7] = 0<"JNT",-438714991,"续绮黯","㔎㔮℮","戬瀬",-2066678190>(
                        0<"JNT",-233425411,"㻮㻮\udeed","㔎₎₎₎㔮\u218e⸎⻮㝮","戬瀬",-2066678203>(var8, 1.0, 1.0)
                     );
                     var7++;
                     continue label22;
                  }

                  var10 = 276950278;
                  break;
               case 1973052859:
               default:
                  return;
            }
         }
      }
   }

   // $VF: renamed from: rc () Class_262
   public Class_262 method_2099() {
      Class_262 var1 = 0<"JNT",-233425411,"㻮㻮\udeed","㔎₎₎₎㔮\u218e⸎⻮㝮","戬瀬",-2066678194>(
         1<"JNT",-1963550979,"\ue192ﶒ","ﴏﴎ","ܫ\u074bΫ",-399797484>(this),
         1<"JNT",-1963550979,"馒높鶒","ﴏﴎ","ܫ\u074bΫ",-399797483>(this),
         1<"JNT",-1963550979,"떒膒馒","ﴏﴎ","ܫ\u074bΫ",-399797482>(this)
      );
      1<"JNT",1619810479,"떒\ued92","봋紉","ܫ\u074b͋",-399797480>(var1, 255);
      return var1;
   }

   // $VF: renamed from: yeu () void
   public void method_2100() {
      int var8 = 1452789913;
      if (!(
         0<"JNT",-233425411,"廬绬黯","㔎₎㔮₎","嘬䐬測䐬\ude2b娬䐬帬倬\ude2bᰬ䐬樬刬",-2066678183>(
               1<"JNT",-1963550979,"\ued92\ue592鶒","ﴏﴎ","ܫ\u074bΫ",-399797428>(this) - 1<"JNT",-1963550979,"\ue192ﶒ","ﴏﴎ","ܫ\u074bΫ",-399797427>(this)
            )
            < 0.01
      )) {
         1<"JNT",1619810479,"\ued92\ue592鶒","ﴏﴎ","ܫ\u074bΫ",-399797478>(this, 1<"JNT",-1963550979,"\ue192ﶒ","ﴏﴎ","ܫ\u074bΫ",-399797479>(this));
         byte var1 = 50;
         1<"JNT",1619810479,"ꖒ閒鶒","ﴏﴎ","ܫ\u074bƋ͋",-399797477>(this, new int[var1 * var1]);
         int var2 = 0;

         label46:
         while (true) {
            var8 = -272629837 & 1937480699;

            while (true) {
               switch ((var8 ^ 1507333618 ^ 2071061962) + 666294256 - 951990226 + 1498511748 - 1816964714) {
                  case -1996366829:
                  default:
                     return;
                  case 495965891:
               }

               if (var2 < var1) {
                  int var3 = 0;

                  label43:
                  while (true) {
                     var8 = -27179987;

                     while (true) {
                        switch ((var8 - 210698451 ^ 1611659071) - 896755137 + 1984337052 + 182697839 ^ 1095822096) {
                           case -1664857665:
                              if (var3 < var1) {
                                 double var4 = (double)var3 / (double)var1;
                                 double var6 = 1.0 - (double)var2 / (double)var1;
                                 1<"JNT",-1963550979,"ꖒ閒鶒","ﴏﴎ","ܫ\u074bƋ͋",-399797425>(this)[var2 * var1 + var3] = 0<"JNT",-438714991,"续绮黯","㔎㔮℮","戬瀬",-2066678219>(
                                    0<"JNT",-233425411,"㻮㻮\udeed","㔎₎₎₎㔮\u218e⸎⻮㝮","戬瀬",-2066677888>(
                                       1<"JNT",-1963550979,"\ue192ﶒ","ﴏﴎ","ܫ\u074bΫ",-399797424>(this), var4, var6
                                    )
                                 );
                                 var3++;
                                 continue label43;
                              }

                              var8 = 664651314 >> -882105617 - -1381681125 ^ -1787114942;
                              break;
                           case 1976300977:
                           default:
                              var2++;
                              continue label46;
                        }
                     }
                  }
               }

               var8 = (-1814056187 | -1814056187 | -1944059677) & -810695429;
            }
         }
      }
   }

   // $VF: Irreducible bytecode was duplicated to produce valid code
   public void method_25394(class_332 var1, int var2, int var3, float var4) {
      int var32 = -598907689;
      0<"JNT",-233425411,"黯ﻭ","㔎㔮⋎","倬戬瘬",-2066677800>();
      var2 *= 0<"JNT",-438714991,"\udeee\udeed뻯㻭Ữ뻭Ử뻧뻧廧\udee7","㔎㔮℮","帬䰬樬\ude2b尬听帬䰬䠬昬䐬丬樬\ude2b䠬娬䐬栬栬䀬\ue42b\ue22b\uea2b\ue42b",-2066677801>(
         0<"JNT",-438714991,"\udeee\udeed뻯㻭Ữ뻭Ử绦绦ﻧ㻧黧","㔎㔮\u218eⷎⲮ⺎㗮ⶮ\u2d2eⷎⲮⱮ⹎ⰮⳎ⺎㗮ⱮⶎⰮ\u2e6e\u2e6e⏮㘮㘎㚎㘮㝮","帬䰬樬\ude2b尬听帬䰬䠬昬䐬丬樬\ude2b䠬娬䐬栬栬䀬\ue82b\ue42b\ue22b",-2066677798>(
            (class_310)1<"JNT",1606690928,"膒릒","㴌ﴎ","ܫ\u074bʫﾊK︊K܋ﻊK＊\u000b܋̋kﾊￋ\u008b\ufdca\u058b",-399796838>()
         )
      );
      var3 *= 0<"JNT",-438714991,"\udeee\udeed뻯㻭Ữ뻭Ử뻧뻧廧\udee7","㔎㔮℮","帬䰬樬\ude2b尬听帬䰬䠬昬䐬丬樬\ude2b䠬娬䐬栬栬䀬\ue42b\ue22b\uea2b\ue42b",-2066677802>(
         0<"JNT",-438714991,"\udeee\udeed뻯㻭Ữ뻭Ử绦绦ﻧ㻧黧","㔎㔮\u218eⷎⲮ⺎㗮ⶮ\u2d2eⷎⲮⱮ⹎ⰮⳎ⺎㗮ⱮⶎⰮ\u2e6e\u2e6e⏮㘮㘎㚎㘮㝮","帬䰬樬\ude2b尬听帬䰬䠬昬䐬丬樬\ude2b䠬娬䐬栬栬䀬\ue82b\ue42b\ue22b",-2066677799>(
            (class_310)1<"JNT",1606690928,"膒릒","㴌ﴎ","ܫ\u074bʫﾊK︊K܋ﻊK＊\u000b܋̋kﾊￋ\u008b\ufdca\u058b",-399796787>()
         )
      );
      0<"JNT",-824845626,"\udeee\udeed뻯㻭Ữ뻭Ử绦\udee7黧廧뻧","㔎\u218eⷎⲮ⺎㗮ⶮ\u2d2eⷎⲮⱮ⹎ⰮⳎ⺎㗮ⱮⶎⰮ\u2e6e\u2e6e⏮㙮㙮㙎㝮℮℮\u20ce㔮⋎","帬䰬樬\ude2b尬听帬䰬䠬昬䐬丬樬\ude2b䠬娬䐬栬栬䀬\uea2b\ue82b\uf02b",-2066678013>(
         this, var1, var2, var3, var4
      );
      0<"JNT",-233425411,"黯黭뻮","㔎₎₎₎₎℮㔮⋎","爬䐬",-2066677898>(
         0.0,
         0.0,
         (double)0<"JNT",-438714991,"\udeee\udeed뻯㻭Ữ뻭Ử뻧뻧㻧廧","㔎㔮℮","帬䰬樬\ude2b尬听帬䰬䠬昬䐬丬樬\ude2b䠬娬䐬栬栬䀬\ue42b\ue22b\uea2b\ue42b",-2066678014>(
            0<"JNT",-438714991,"\udeee\udeed뻯㻭Ữ뻭Ử绦绦ﻧ㻧黧","㔎㔮\u218eⷎⲮ⺎㗮ⶮ\u2d2eⷎⲮⱮ⹎ⰮⳎ⺎㗮ⱮⶎⰮ\u2e6e\u2e6e⏮㘮㘎㚎㘮㝮","帬䰬樬\ude2b尬听帬䰬䠬昬䐬丬樬\ude2b䠬娬䐬栬栬䀬\ue82b\ue42b\ue22b",-2066677835>(
               (class_310)1<"JNT",1606690928,"膒릒","㴌ﴎ","ܫ\u074bʫﾊK︊K܋ﻊK＊\u000b܋̋kﾊￋ\u008b\ufdca\u058b",-399796783>()
            )
         ),
         (double)0<"JNT",-438714991,"\udeee\udeed뻯㻭Ữ뻭Ử뻧\udee7㻦ﻧ","㔎㔮℮","帬䰬樬\ude2b尬听帬䰬䠬昬䐬丬樬\ude2b䠬娬䐬栬栬䀬\ue42b\ue22b\uea2b\ue42b",-2066678015>(
            0<"JNT",-438714991,"\udeee\udeed뻯㻭Ữ뻭Ử绦绦ﻧ㻧黧","㔎㔮\u218eⷎⲮ⺎㗮ⶮ\u2d2eⷎⲮⱮ⹎ⰮⳎ⺎㗮ⱮⶎⰮ\u2e6e\u2e6e⏮㘮㘎㚎㘮㝮","帬䰬樬\ude2b尬听帬䰬䠬昬䐬丬樬\ude2b䠬娬䐬栬栬䀬\ue82b\ue42b\ue22b",-2066678020>(
               (class_310)1<"JNT",1606690928,"膒릒","㴌ﴎ","ܫ\u074bʫﾊK︊K܋ﻊK＊\u000b܋̋kﾊￋ\u008b\ufdca\u058b",-399796796>()
            )
         ),
         0<"JNT",-438714991,"뻮廭뻮","㔎㔮℮","戬瀬",-2066677895>(
            (Class_262)0<"JNT",-431768172,"뻨廭ﻮ廭뻯ﻨ","㔎℮℮℮℮㔮⋎","戬瀬",-2066677900>(
               0, 0, 0, 0<"JNT",-438714991,"廬㻯","㔎㔮⍎","倬昬",-2066678005>(1<"JNT",1606690928,"떒궒","ﴌ㴉紈","ܫ\u074bʫ\u000bﺊ\u058b",-399796793>()) ? 180 : 0
            )
         )
      );
      int var5 = 0<"JNT",-438714991,"\udeee\udeed뻯㻭Ữ뻭Ử뻧뻧㻧廧","㔎㔮℮","帬䰬樬\ude2b尬听帬䰬䠬昬䐬丬樬\ude2b䠬娬䐬栬栬䀬\ue42b\ue22b\uea2b\ue42b",-2066677803>(
         0<"JNT",-438714991,"\udeee\udeed뻯㻭Ữ뻭Ử绦绦ﻧ㻧黧","㔎㔮\u218eⷎⲮ⺎㗮ⶮ\u2d2eⷎⲮⱮ⹎ⰮⳎ⺎㗮ⱮⶎⰮ\u2e6e\u2e6e⏮㘮㘎㚎㘮㝮","帬䰬樬\ude2b尬听帬䰬䠬昬䐬丬樬\ude2b䠬娬䐬栬栬䀬\ue82b\ue42b\ue22b",-2066677856>(
            (class_310)1<"JNT",1606690928,"膒릒","㴌ﴎ","ܫ\u074bʫﾊK︊K܋ﻊK＊\u000b܋̋kﾊￋ\u008b\ufdca\u058b",-399796816>()
         )
      );
      int var6 = 0<"JNT",-438714991,"\udeee\udeed뻯㻭Ữ뻭Ử뻧\udee7㻦ﻧ","㔎㔮℮","帬䰬樬\ude2b尬听帬䰬䠬昬䐬丬樬\ude2b䠬娬䐬栬栬䀬\ue42b\ue22b\uea2b\ue42b",-2066677860>(
         0<"JNT",-438714991,"\udeee\udeed뻯㻭Ữ뻭Ử绦绦ﻧ㻧黧","㔎㔮\u218eⷎⲮ⺎㗮ⶮ\u2d2eⷎⲮⱮ⹎ⰮⳎ⺎㗮ⱮⶎⰮ\u2e6e\u2e6e⏮㘮㘎㚎㘮㝮","帬䰬樬\ude2b尬听帬䰬䠬昬䐬丬樬\ude2b䠬娬䐬栬栬䀬\ue82b\ue42b\ue22b",-2066677857>(
            (class_310)1<"JNT",1606690928,"膒릒","㴌ﴎ","ܫ\u074bʫﾊK︊K܋ﻊK＊\u000b܋̋kﾊￋ\u008b\ufdca\u058b",-399796813>()
         )
      );
      byte var7 = 70;
      byte var8 = 8;
      int var9 = var7 * 2 + var8;
      int var10 = var9 + 40;
      short var11 = 275;
      int var12 = 0<"JNT",-233425411,"\udeee廬㻯","㔎℮℮㔮℮","嘬䐬測䐬\ude2b娬䐬帬倬\ude2bᰬ䐬樬刬",-2066677855>(var10, var11);
      short var13 = 370;
      int var14 = (var5 - var12) / 2;
      int var15 = (var6 - var13) / 2;
      0<"JNT",-233425411,"ﻯ绮㻯","㔎\u218eⷎⲮ⺎㗮ⶮ\u2d2eⷎⲮⱮ⹎ⰮⳎ⺎㗮ⱮⶎⰮ\u2e6e\u2e6e⏮㙮㙮㙎㝮₎₎₎₎₎₎₎₎\u218e⸎⻮㝮\u218e⸎⻮㝮\u218e⸎⻮㝮₎⍎㔮⋎","刬丬",-2066677859>(
         var1,
         (double)var14,
         (double)var15,
         (double)(var14 + var12),
         (double)(var15 + var13),
         0.0,
         0.0,
         8.0,
         8.0,
         (Class_262)0<"JNT",-431768172,"뻨廭ﻮ廭뻯ﻨ","㔎℮℮℮℮㔮⋎","戬瀬",-2066677858>(30, 30, 35, 240),
         1<"JNT",1606690928,"ꖒ떒","ﴏﴎ","ܫ\u074bʫ﹊︪\u058b",-399796824>(),
         1<"JNT",1606690928,"ꖒ떒","ﴏﴎ","ܫ\u074bʫ﹊︪\u058b",-399796823>(),
         0.0,
         false
      );
      0<"JNT",-233425411,"ﻯ绮㻯","㔎\u218eⷎⲮ⺎㗮ⶮ\u2d2eⷎⲮⱮ⹎ⰮⳎ⺎㗮ⱮⶎⰮ\u2e6e\u2e6e⏮㙮㙮㙎㝮₎₎₎₎₎₎₎₎\u218e⸎⻮㝮\u218e⸎⻮㝮\u218e⸎⻮㝮₎⍎㔮⋎","刬丬",-2066677847>(
         var1,
         (double)var14,
         (double)var15,
         (double)(var14 + var12),
         (double)(var15 + 30),
         0.0,
         0.0,
         0.0,
         0.0,
         (Class_262)0<"JNT",-431768172,"뻨廭ﻮ廭뻯ﻨ","㔎℮℮℮℮㔮⋎","戬瀬",-2066677846>(40, 40, 45, 255),
         1<"JNT",1606690928,"ꖒ떒","ﴏﴎ","ܫ\u074bʫ﹊︪\u058b",-399796836>(),
         1<"JNT",1606690928,"ꖒ떒","ﴏﴎ","ܫ\u074bʫ﹊︪\u058b",-399796835>(),
         0.0,
         false
      );
      0<"JNT",-233425411,"黯黭뻮","㔎₎₎₎₎℮㔮⋎","爬䐬",-2066677808>(
         (double)var14,
         (double)(var15 + 30),
         (double)(var14 + var12),
         (double)(var15 + 31),
         0<"JNT",-438714991,"뻮廭뻮","㔎㔮℮","戬瀬",-2066677805>(0<"JNT",-233425411,"绮\udeefỮ","㔎℮℮㔮\u218e⸎⻮㝮","䘬䠬",-2066677850>(255, 1))
      );
      Class_43 var10000 = 0<"JNT",-233425411,"ﻮ黮廮","㔎㔮\u218eⱮ⺮㝮","䠬氬",-2066677819>();
      String var30 = 0<"JNT",-438714991,"뻯Ữ\udeeb㻮㻮\udeed绮黩廬黯\udeed","㔎㔮\u218eⵎⰮ⻎Ⱞ㗮ⶎⰮⷎⳮ㗮≮⺎⹎\u2d2eⷎⳮ㝮","嘬䐬測䐬\ude2b娬䐬帬倬\ude2b⠬樬昬听帬倬",-2066677809>(
         1<"JNT",-1963550979,"\ue192떒ꦒ","ﴏﴎ","ܫ\u074bʫﾊK︊K܋ﻊK＊\u000b܋ʋ\ufdcaﺊｪ＊\u000b\u058b",-399796829>(this)
      );
      StringBuilder var10001 = (StringBuilder)0<"JNT",-431768172,"뻨廭ﻮ廭뻯ﻨ","㔎㔮⋎","嘬䐬測䐬\ude2b娬䐬帬倬\ude2b⠬樬昬听帬倬ج氬听娬䨬䰬昬",-2066677812>();
      int var10002 = (2127490299 + 306267289 | 0) & 618663016;

      StringBuilder var10003;
      for (var10003 = (StringBuilder)0<"JNT",-431768172,"뻨廭ﻮ廭뻯ﻨ","㔎\u218eⵎⰮ⻎Ⱞ㗮ⶎⰮⷎⳮ㗮≮⺎⹎\u2d2eⷎⳮ㝮㔮⋎","嘬䐬測䐬\ude2b娬䐬帬倬\ude2b⠬樬昬听帬倬ج氬听娬䨬䰬昬",-2066677807>("ߡुऩुख़ޙۉ");
         var10002 < (-1111727173 << 1735945267 ^ 500695047);
         var10002 += (-686051596 * 1024800154 | 1) & 798005
      ) {
         int var90 = 0<"JNT",-438714991,"黭㻭廬绮廨뻯","㔎℮㔮\u206e","嘬䐬測䐬\ude2b娬䐬帬倬\ude2b⠬樬昬听帬倬ج氬听娬䨬䰬昬",-2066677840>(var10003, var10002) - '}' - 36;
         int var10006 = (var90 & 65024) >> 9;
         int var91 = (var90 & 65024) >> 9 | var90 << 7;
         int var129 = (((var90 & 65024) >> 9 | var90 << 7) & 64512) >> 10;
         char var92 = (char)((((var10006 | var90 << 7) & 64512) >> 10 | ((var90 & 65024) >> 9 | var90 << 7) << 6) - 165);
         0<"JNT",-438714991,"黯\udeed뻯黩㻭廬绮廨뻯","㔎℮\u206e㔮⋎","嘬䐬測䐬\ude2b娬䐬帬倬\ude2b⠬樬昬听帬倬ج氬听娬䨬䰬昬",-2066677851>(
            var10003, var10002, (char)((var129 | var91 << 6) - 165)
         );
      }

      String var42 = 0<"JNT",-438714991,"뻯Ữ黫뻯绮廭ﻮử","㔎㔮\u218eⵎⰮ⻎Ⱞ㗮ⶎⰮⷎⳮ㗮≮⺎⹎\u2d2eⷎⳮ㝮","嘬䐬測䐬\ude2b娬䐬帬倬\ude2b⠬樬昬听帬倬ج氬听娬䨬䰬昬",-2066677901>(
         0<"JNT",-438714991,"廬㻮㻮\udeedﻮ뻭","㔎\u218eⵎⰮ⻎Ⱞ㗮ⶎⰮⷎⳮ㗮⇮ⱎⵎⲮⱮ⺎㝮㔮\u218eⵎⰮ⻎Ⱞ㗮ⶎⰮⷎⳮ㗮≮⺎⹎\u2d2eⷎⳮ⁎⺮\u2d2eⶎⲎⲮ⹎㝮","嘬䐬測䐬\ude2b娬䐬帬倬\ude2b⠬樬昬听帬倬ج氬听娬䨬䰬昬",-2066677818>(
            0<"JNT",-438714991,"廬㻮㻮\udeedﻮ뻭","㔎\u218eⵎⰮ⻎Ⱞ㗮ⶎⰮⷎⳮ㗮≮⺎⹎\u2d2eⷎⳮ㝮㔮\u218eⵎⰮ⻎Ⱞ㗮ⶎⰮⷎⳮ㗮≮⺎⹎\u2d2eⷎⳮ⁎⺮\u2d2eⶎⲎⲮ⹎㝮","嘬䐬測䐬\ude2b娬䐬帬倬\ude2b⠬樬昬听帬倬ج氬听娬䨬䰬昬",-2066677815>(
               var10001, 0<"JNT",-438714991,"뻯Ữ黫뻯绮廭ﻮử","㔎㔮\u218eⵎⰮ⻎Ⱞ㗮ⶎⰮⷎⳮ㗮≮⺎⹎\u2d2eⷎⳮ㝮","嘬䐬測䐬\ude2b娬䐬帬倬\ude2b⠬樬昬听帬倬ج氬听娬䨬䰬昬",-2066677820>(var10003)
            ),
            var30
         )
      );
      double var53 = (double)(var14 + var12 / 2);
      Class_43 var65 = 0<"JNT",-233425411,"ﻮ黮廮","㔎㔮\u218eⱮ⺮㝮","䠬氬",-2066677904>();
      String var31 = 0<"JNT",-438714991,"뻯Ữ\udeeb㻮㻮\udeed绮黩廬黯\udeed","㔎㔮\u218eⵎⰮ⻎Ⱞ㗮ⶎⰮⷎⳮ㗮≮⺎⹎\u2d2eⷎⳮ㝮","嘬䐬測䐬\ude2b娬䐬帬倬\ude2b⠬樬昬听帬倬",-2066677902>(
         1<"JNT",-1963550979,"\ue192떒ꦒ","ﴏﴎ","ܫ\u074bʫﾊK︊K܋ﻊK＊\u000b܋ʋ\ufdcaﺊｪ＊\u000b\u058b",-399797374>(this)
      );
      StringBuilder var94 = (StringBuilder)0<"JNT",-431768172,"뻨廭ﻮ廭뻯ﻨ","㔎㔮⋎","嘬䐬測䐬\ude2b娬䐬帬倬\ude2b⠬樬昬听帬倬ج氬听娬䨬䰬昬",-2066677905>();
      int var111 = (-332908687 >>> -756044307 | 0) & -1680859586;

      StringBuilder var130;
      for (var130 = (StringBuilder)0<"JNT",-431768172,"뻨廭ﻮ廭뻯ﻨ","㔎\u218eⵎⰮ⻎Ⱞ㗮ⶎⰮⷎⳮ㗮≮⺎⹎\u2d2eⷎⳮ㝮㔮⋎","嘬䐬測䐬\ude2b娬䐬帬倬\ude2b⠬樬昬听帬倬ج氬听娬䨬䰬昬",-2066677908>("䉢䟢䝂䟢䞂䂂㷂");
         var111 < ((1876902410 ^ 1793084471 | 3) & -771743417);
         var111 += (705516851 >> -365022940 | 0) & 1498032161
      ) {
         int var152 = 0<"JNT",-438714991,"黭㻭廬绮廨뻯","㔎℮㔮\u206e","嘬䐬測䐬\ude2b娬䐬帬倬\ude2b⠬樬昬听帬倬ج氬听娬䨬䰬昬",-2066677870>(var130, var111) ^ 'b';
         int var10009 = (var152 & 65535) >> 0;
         int var153 = (var152 & 65535) >> 0 | var152 << 16;
         int var175 = (((var152 & 65535) >> 0 | var152 << 16) & 65504) >> 5;
         char var154 = (char)((((var10009 | var152 << 16) & 65504) >> 5 | ((var152 & 65535) >> 0 | var152 << 16) << 11) - 243 - 218);
         0<"JNT",-438714991,"黯\udeed뻯黩㻭廬绮廨뻯","㔎℮\u206e㔮⋎","嘬䐬測䐬\ude2b娬䐬帬倬\ude2b⠬樬昬听帬倬ج氬听娬䨬䰬昬",-2066677873>(
            var130, var111, (char)((var175 | var153 << 11) - 243 - 218)
         );
      }

      0<"JNT",429981674,"续廮","㔎\u218eⵎⰮ⻎Ⱞ㗮ⶎⰮⷎⳮ㗮≮⺎⹎\u2d2eⷎⳮ㝮₎₎\u218e⸎⻮㝮⍎㔮₎","䠬氬",-2066677868>(
         var10000,
         var42,
         var53
            - 0<"JNT",429981674,"ﻯ绯ﻭ","㔎\u218eⵎⰮ⻎Ⱞ㗮ⶎⰮⷎⳮ㗮≮⺎⹎\u2d2eⷎⳮ㝮㔮₎","䠬氬",-2066677862>(
                  var65,
                  0<"JNT",-438714991,"뻯Ữ黫뻯绮廭ﻮử","㔎㔮\u218eⵎⰮ⻎Ⱞ㗮ⶎⰮⷎⳮ㗮≮⺎⹎\u2d2eⷎⳮ㝮","嘬䐬測䐬\ude2b娬䐬帬倬\ude2b⠬樬昬听帬倬ج氬听娬䨬䰬昬",-2066677875>(
                     0<"JNT",-438714991,"廬㻮㻮\udeedﻮ뻭","㔎\u218eⵎⰮ⻎Ⱞ㗮ⶎⰮⷎⳮ㗮⇮ⱎⵎⲮⱮ⺎㝮㔮\u218eⵎⰮ⻎Ⱞ㗮ⶎⰮⷎⳮ㗮≮⺎⹎\u2d2eⷎⳮ⁎⺮\u2d2eⶎⲎⲮ⹎㝮","嘬䐬測䐬\ude2b娬䐬帬倬\ude2b⠬樬昬听帬倬ج氬听娬䨬䰬昬",-2066677864>(
                        0<"JNT",-438714991,"廬㻮㻮\udeedﻮ뻭","㔎\u218eⵎⰮ⻎Ⱞ㗮ⶎⰮⷎⳮ㗮≮⺎⹎\u2d2eⷎⳮ㝮㔮\u218eⵎⰮ⻎Ⱞ㗮ⶎⰮⷎⳮ㗮≮⺎⹎\u2d2eⷎⳮ⁎⺮\u2d2eⶎⲎⲮ⹎㝮","嘬䐬測䐬\ude2b娬䐬帬倬\ude2b⠬樬昬听帬倬ج氬听娬䨬䰬昬",-2066677861>(
                           var94, 0<"JNT",-438714991,"뻯Ữ黫뻯绮廭ﻮử","㔎㔮\u218eⵎⰮ⻎Ⱞ㗮ⶎⰮⷎⳮ㗮≮⺎⹎\u2d2eⷎⳮ㝮","嘬䐬測䐬\ude2b娬䐬帬倬\ude2b⠬樬昬听帬倬ج氬听娬䨬䰬昬",-2066677874>(var130)
                        ),
                        var31
                     )
                  )
               )
               / 2.0,
         (double)(var15 + 8),
         (Class_262)0<"JNT",-431768172,"뻨廭ﻮ廭뻯ﻨ","㔎℮℮℮℮㔮⋎","戬瀬",-2066677865>(245, 245, 245, 255),
         false
      );
      int var16 = var15 + 45;
      int var17 = var14 + 20;
      0<"JNT",-438714991,"廯\udeed\udeef","㔎㔮⋎","氬䐬",-2066677863>(this);
      0<"JNT",-438714991,"\udeee廭ữ","㔎\u218eⷎⲮ⺎㗮ⶮ\u2d2eⷎⲮⱮ⹎ⰮⳎ⺎㗮ⱮⶎⰮ\u2e6e\u2e6e⏮㙮㙮㙎㝮℮℮℮℮㔮⋎","氬䐬",-2066677866>(this, var1, var17, var16, 200, 200);
      int var19 = var17 + 200 + 15;
      0<"JNT",-438714991,"㻭뻯ﻯ","㔎\u218eⷎⲮ⺎㗮ⶮ\u2d2eⷎⲮⱮ⹎ⰮⳎ⺎㗮ⱮⶎⰮ\u2e6e\u2e6e⏮㙮㙮㙎㝮℮℮℮℮㔮⋎","氬䐬",-2066677821>(this, var1, var19, var16, 20, 200);
      int var21 = var16 + 200 + 15;
      int var22 = (var12 - 40 - 15) / 2;
      byte var23 = 30;
      0<"JNT",-233425411,"ﻯ绮㻯","㔎\u218eⷎⲮ⺎㗮ⶮ\u2d2eⷎⲮⱮ⹎ⰮⳎ⺎㗮ⱮⶎⰮ\u2e6e\u2e6e⏮㙮㙮㙎㝮₎₎₎₎₎₎₎₎\u218e⸎⻮㝮\u218e⸎⻮㝮\u218e⸎⻮㝮₎⍎㔮⋎","刬丬",-2066677827>(
         var1,
         (double)var17,
         (double)var21,
         (double)(var17 + var22),
         (double)(var21 + var23),
         4.0,
         4.0,
         4.0,
         4.0,
         (Class_262)0<"JNT",-431768172,"뻨廭ﻮ廭뻯ﻨ","㔎℮℮℮㔮⋎","戬瀬",-2066677826>(
            1<"JNT",-1963550979,"鶒\ue992膒","봋紉","ܫ\u074b͋",-399797358>(1<"JNT",-1963550979,"높\ued92","ﴏﴎ","ܫ\u074bʫ﹊︪\u058b",-399797359>(this)),
            1<"JNT",-1963550979,"붒薒떒","봋紉","ܫ\u074b͋",-399797372>(1<"JNT",-1963550979,"높\ued92","ﴏﴎ","ܫ\u074bʫ﹊︪\u058b",-399797357>(this)),
            1<"JNT",-1963550979,"\ued92冒","봋紉","ܫ\u074b͋",-399797370>(1<"JNT",-1963550979,"높\ued92","ﴏﴎ","ܫ\u074bʫ﹊︪\u058b",-399797371>(this))
         ),
         1<"JNT",1606690928,"ꖒ떒","ﴏﴎ","ܫ\u074bʫ﹊︪\u058b",-399797368>(),
         1<"JNT",1606690928,"ꖒ떒","ﴏﴎ","ܫ\u074bʫ﹊︪\u058b",-399797367>(),
         0.0,
         false
      );
      var10000 = 0<"JNT",-233425411,"ﻮ黮廮","㔎㔮\u218eⱮ⺮㝮","䠬氬",-2066677814>();
      int var43 = (-638701912 & -350725959 & -1699682586 | 0) & 1166673681;

      for (var54 = (StringBuilder)0<"JNT",-431768172,"뻨廭ﻮ廭뻯ﻨ","㔎\u218eⵎⰮ⻎Ⱞ㗮ⶎⰮⷎⳮ㗮≮⺎⹎\u2d2eⷎⳮ㝮㔮⋎","嘬䐬測䐬\ude2b娬䐬帬倬\ude2b⠬樬昬听帬倬ج氬听娬䨬䰬昬",-2066677817>("ɿʋ˧˟˧˻ˇ˳");
         var43 < ((-1319487755 >> -1319487755 | 0) & 8);
         var43 += (1773887192 | 1566600579) ^ 2113634266
      ) {
         int var67 = 0<"JNT",-438714991,"黭㻭廬绮廨뻯","㔎℮㔮\u206e","嘬䐬測䐬\ude2b娬䐬帬倬\ude2b⠬樬昬听帬倬ج氬听娬䨬䰬昬",-2066677893>(var54, var43) ^ ']' ^ 94;
         char var68 = (char)(((var67 & 65532) >> 2 | var67 << 14) ^ 92 ^ 140);
         0<"JNT",-438714991,"黯\udeed뻯黩㻭廬绮廨뻯","㔎℮\u206e㔮⋎","嘬䐬測䐬\ude2b娬䐬帬倬\ude2b⠬樬昬听帬倬ج氬听娬䨬䰬昬",-2066677896>(
            var54, var43, (char)(((var67 & 65532) >> 2 | var67 << 14) ^ 92 ^ 140)
         );
      }

      String var45 = 0<"JNT",-438714991,"뻯Ữ黫뻯绮廭ﻮử","㔎㔮\u218eⵎⰮ⻎Ⱞ㗮ⶎⰮⷎⳮ㗮≮⺎⹎\u2d2eⷎⳮ㝮","嘬䐬測䐬\ude2b娬䐬帬倬\ude2b⠬樬昬听帬倬ج氬听娬䨬䰬昬",-2066678007>(var54);
      double var56 = (double)(var17 + var22 / 2);
      Class_43 var70 = 0<"JNT",-233425411,"ﻮ黮廮","㔎㔮\u218eⱮ⺮㝮","䠬氬",-2066678010>();
      int var96 = -746544763 >>> 1214495343 ^ 108289;

      for (var114 = (StringBuilder)0<"JNT",-431768172,"뻨廭ﻮ廭뻯ﻨ","㔎\u218eⵎⰮ⻎Ⱞ㗮ⶎⰮⷎⳮ㗮≮⺎⹎\u2d2eⷎⳮ㝮㔮⋎","嘬䐬測䐬\ude2b娬䐬帬倬\ude2b⠬樬昬听帬倬ج氬听娬䨬䰬昬",-2066677837>("开炀氀欀氀満栀涀");
         var96 < ((-610731611 & -162481213 | 8) & 7143470);
         var96 += 217204446 >>> 1124618415 ^ 6629
      ) {
         char var133 = 0<"JNT",-438714991,"黭㻭廬绮廨뻯","㔎℮㔮\u206e","嘬䐬測䐬\ude2b娬䐬帬倬\ude2b⠬樬昬听帬倬ج氬听娬䨬䰬昬",-2066677882>(var114, var96);
         int var166 = (var133 & 0) >> 16;
         int var134 = (var133 & 0) >> 16 | var133 << 0;
         int var167 = (((var133 & 0) >> 16 | var133 << 0) & 65535) >> 0;
         int var135 = ((var166 | var133 << 0) & 65535) >> 0 | ((var133 & 0) >> 16 | var133 << 0) << 16;
         var166 = ((var167 | var134 << 16) & 63488) >> 11;
         int var136 = ((var167 | var134 << 16) & 63488) >> 11 | var135 << 5;
         int var169 = ((((var167 | var134 << 16) & 63488) >> 11 | var135 << 5) & 61440) >> 12;
         char var137 = (char)((((var166 | var135 << 5) & 61440) >> 12 | (((var167 | var134 << 16) & 63488) >> 11 | var135 << 5) << 4) - 111);
         0<"JNT",-438714991,"黯\udeed뻯黩㻭廬绮廨뻯","㔎℮\u206e㔮⋎","嘬䐬測䐬\ude2b娬䐬帬倬\ude2b⠬樬昬听帬倬ج氬听娬䨬䰬昬",-2066678221>(var114, var96, (char)((var169 | var136 << 4) - 111));
      }

      0<"JNT",429981674,"续廮","㔎\u218eⵎⰮ⻎Ⱞ㗮ⶎⰮⷎⳮ㗮≮⺎⹎\u2d2eⷎⳮ㝮₎₎\u218e⸎⻮㝮⍎㔮₎","䠬氬",-2066678215>(
         var10000,
         var45,
         var56
            - 0<"JNT",429981674,"ﻯ绯ﻭ","㔎\u218eⵎⰮ⻎Ⱞ㗮ⶎⰮⷎⳮ㗮≮⺎⹎\u2d2eⷎⳮ㝮㔮₎","䠬氬",-2066678217>(
                  var70, 0<"JNT",-438714991,"뻯Ữ黫뻯绮廭ﻮử","㔎㔮\u218eⵎⰮ⻎Ⱞ㗮ⶎⰮⷎⳮ㗮≮⺎⹎\u2d2eⷎⳮ㝮","嘬䐬測䐬\ude2b娬䐬帬倬\ude2b⠬樬昬听帬倬ج氬听娬䨬䰬昬",-2066678214>(var114)
               )
               / 2.0,
         (double)(var21 + var23 + 5),
         (Class_262)0<"JNT",-431768172,"뻨廭ﻮ廭뻯ﻨ","㔎℮℮℮℮㔮⋎","戬瀬",-2066678220>(150, 150, 150, 255),
         false
      );
      Class_262 var24 = 0<"JNT",-438714991,"绮黭","㔎㔮\u218e⸎⻮㝮","氬䐬",-2066678218>(this);
      int var25 = var17 + var22 + 15;
      0<"JNT",-233425411,"ﻯ绮㻯","㔎\u218eⷎⲮ⺎㗮ⶮ\u2d2eⷎⲮⱮ⹎ⰮⳎ⺎㗮ⱮⶎⰮ\u2e6e\u2e6e⏮㙮㙮㙎㝮₎₎₎₎₎₎₎₎\u218e⸎⻮㝮\u218e⸎⻮㝮\u218e⸎⻮㝮₎⍎㔮⋎","刬丬",-2066677919>(
         var1,
         (double)var25,
         (double)var21,
         (double)(var25 + var22),
         (double)(var21 + var23),
         4.0,
         4.0,
         4.0,
         4.0,
         (Class_262)0<"JNT",-431768172,"뻨廭ﻮ廭뻯ﻨ","㔎℮℮℮㔮⋎","戬瀬",-2066677918>(
            1<"JNT",-1963550979,"鶒\ue992膒","봋紉","ܫ\u074b͋",-399797392>(var24),
            1<"JNT",-1963550979,"붒薒떒","봋紉","ܫ\u074b͋",-399797391>(var24),
            1<"JNT",-1963550979,"\ued92冒","봋紉","ܫ\u074b͋",-399797390>(var24)
         ),
         1<"JNT",1606690928,"ꖒ떒","ﴏﴎ","ܫ\u074bʫ﹊︪\u058b",-399797404>(),
         1<"JNT",1606690928,"ꖒ떒","ﴏﴎ","ܫ\u074bʫ﹊︪\u058b",-399797403>(),
         0.0,
         false
      );
      var10000 = 0<"JNT",-233425411,"ﻮ黮廮","㔎㔮\u218eⱮ⺮㝮","䠬氬",-2066677922>();
      int var46 = (1450918363 & -923837262 | 0) & 209715200;

      for (var57 = (StringBuilder)0<"JNT",-431768172,"뻨廭ﻮ廭뻯ﻨ","㔎\u218eⵎⰮ⻎Ⱞ㗮ⶎⰮⷎⳮ㗮≮⺎⹎\u2d2eⷎⳮ㝮㔮⋎","嘬䐬測䐬\ude2b娬䐬帬倬\ude2b⠬樬昬听帬倬ج氬听娬䨬䰬昬",-2066677909>("ǈŤĬ");
         var46 < ((-132576672 | 1143629737) ^ -63213590);
         var46 += (92867916 | -1714940051 | 1) & 1647370257
      ) {
         char var72 = 0<"JNT",-438714991,"黭㻭廬绮廨뻯","㔎℮㔮\u206e","嘬䐬測䐬\ude2b娬䐬帬倬\ude2b⠬樬昬听帬倬ج氬听娬䨬䰬昬",-2066677884>(var57, var46);
         var111 = (var72 & 0) >> 16;
         int var73 = ((var72 & 0) >> 16 | var72 << 0) ^ 240;
         int var117 = ((((var72 & 0) >> 16 | var72 << 0) ^ 240) & 65024) >> 9;
         int var74 = (((var111 | var72 << 0) ^ 240) & 65024) >> 9 | (((var72 & 0) >> 16 | var72 << 0) ^ 240) << 7;
         var111 = ((var117 | var73 << 7) & 65535) >> 0;
         int var75 = ((var117 | var73 << 7) & 65535) >> 0 | var74 << 16;
         int var119 = ((((var117 | var73 << 7) & 65535) >> 0 | var74 << 16) & 65024) >> 9;
         char var76 = (char)(((var111 | var74 << 16) & 65024) >> 9 | (((var117 | var73 << 7) & 65535) >> 0 | var74 << 16) << 7);
         0<"JNT",-438714991,"黯\udeed뻯黩㻭廬绮廨뻯","㔎℮\u206e㔮⋎","嘬䐬測䐬\ude2b娬䐬帬倬\ude2b⠬樬昬听帬倬ج氬听娬䨬䰬昬",-2066677879>(var57, var46, (char)(var119 | var75 << 7));
      }

      String var48 = 0<"JNT",-438714991,"뻯Ữ黫뻯绮廭ﻮử","㔎㔮\u218eⵎⰮ⻎Ⱞ㗮ⶎⰮⷎⳮ㗮≮⺎⹎\u2d2eⷎⳮ㝮","嘬䐬測䐬\ude2b娬䐬帬倬\ude2b⠬樬昬听帬倬ج氬听娬䨬䰬昬",-2066678222>(var57);
      double var59 = (double)(var25 + var22 / 2);
      Class_43 var78 = 0<"JNT",-233425411,"ﻮ黮廮","㔎㔮\u218eⱮ⺮㝮","䠬氬",-2066678225>();
      int var102 = (-1105738967 >> 1666150029 * (-1105738967 >> 1666150029) | 0) & 368832;

      for (var120 = (StringBuilder)0<"JNT",-431768172,"뻨廭ﻮ廭뻯ﻨ","㔎\u218eⵎⰮ⻎Ⱞ㗮ⶎⰮⷎⳮ㗮≮⺎⹎\u2d2eⷎⳮ㝮㔮⋎","嘬䐬測䐬\ude2b娬䐬帬倬\ude2b⠬樬昬听帬倬ج氬听娬䨬䰬昬",-2066678228>("ￎｵｗ");
         var102 < (-97057044 >> 2143064484 ^ -6066067);
         var102 += -1434932892 & -1434932892 >>> -1616579153 ^ 97
      ) {
         int var140 = 0<"JNT",-438714991,"黭㻭廬绮廨뻯","㔎℮㔮\u206e","嘬䐬測䐬\ude2b娬䐬帬倬\ude2b⠬樬昬听帬倬ج氬听娬䨬䰬昬",-2066678216>(var120, var102) + 233;
         char var141 = (char)((((var140 & 65535) >> 0 | var140 << 16) + 0 ^ 216) - 33);
         0<"JNT",-438714991,"黯\udeed뻯黩㻭廬绮廨뻯","㔎℮\u206e㔮⋎","嘬䐬測䐬\ude2b娬䐬帬倬\ude2b⠬樬昬听帬倬ج氬听娬䨬䰬昬",-2066678227>(
            var120, var102, (char)((((var140 & 65535) >> 0 | var140 << 16) + 0 ^ 216) - 33)
         );
      }

      0<"JNT",429981674,"续廮","㔎\u218eⵎⰮ⻎Ⱞ㗮ⶎⰮⷎⳮ㗮≮⺎⹎\u2d2eⷎⳮ㝮₎₎\u218e⸎⻮㝮⍎㔮₎","䠬氬",-2066677913>(
         var10000,
         var48,
         var59
            - 0<"JNT",429981674,"ﻯ绯ﻭ","㔎\u218eⵎⰮ⻎Ⱞ㗮ⶎⰮⷎⳮ㗮≮⺎⹎\u2d2eⷎⳮ㝮㔮₎","䠬氬",-2066677923>(
                  var78, 0<"JNT",-438714991,"뻯Ữ黫뻯绮廭ﻮử","㔎㔮\u218eⵎⰮ⻎Ⱞ㗮ⶎⰮⷎⳮ㗮≮⺎⹎\u2d2eⷎⳮ㝮","嘬䐬測䐬\ude2b娬䐬帬倬\ude2b⠬樬昬听帬倬ج氬听娬䨬䰬昬",-2066677912>(var120)
               )
               / 2.0,
         (double)(var21 + var23 + 5),
         (Class_262)0<"JNT",-431768172,"뻨廭ﻮ廭뻯ﻨ","㔎℮℮℮℮㔮⋎","戬瀬",-2066677910>(150, 150, 150, 255),
         false
      );
      int var26 = var15 + var13 - 45;
      byte var27 = 30;
      int var28 = var14 + var12 - var7 - 20;
      int var29 = var28 - var7 - var8;
      0<"JNT",-233425411,"ﻯ绮㻯","㔎\u218eⷎⲮ⺎㗮ⶮ\u2d2eⷎⲮⱮ⹎ⰮⳎ⺎㗮ⱮⶎⰮ\u2e6e\u2e6e⏮㙮㙮㙎㝮₎₎₎₎₎₎₎₎\u218e⸎⻮㝮\u218e⸎⻮㝮\u218e⸎⻮㝮₎⍎㔮⋎","刬丬",-2066677869>(
         var1,
         (double)var28,
         (double)var26,
         (double)(var28 + var7),
         (double)(var26 + var27),
         5.0,
         5.0,
         5.0,
         5.0,
         0<"JNT",-233425411,"绮\udeefỮ","㔎℮℮㔮\u218e⸎⻮㝮","䘬䠬",-2066677916>(255, 1),
         1<"JNT",1606690928,"ꖒ떒","ﴏﴎ","ܫ\u074bʫ﹊︪\u058b",-399797410>(),
         1<"JNT",1606690928,"ꖒ떒","ﴏﴎ","ܫ\u074bʫ﹊︪\u058b",-399797409>(),
         0.0,
         false
      );
      var10000 = 0<"JNT",-233425411,"ﻮ黮廮","㔎㔮\u218eⱮ⺮㝮","䠬氬",-2066677872>();
      int var49 = -1887843507 >> 1653824346 ^ -29;
      StringBuilder var60 = (StringBuilder)0<"JNT",-431768172,"뻨廭ﻮ廭뻯ﻨ","㔎\u218eⵎⰮ⻎Ⱞ㗮ⶎⰮⷎⳮ㗮≮⺎⹎\u2d2eⷎⳮ㝮㔮⋎","嘬䐬測䐬\ude2b娬䐬帬倬\ude2b⠬樬昬听帬倬ج氬听娬䨬䰬昬",-2066677883>("⎷⎧");

      label87:
      while (true) {
         var32 = (-1098380932 * -1098574512 | -1236748278) & -143001265;

         while (true) {
            label127: {
               switch ((var32 - 653590461 ^ 843286117 ^ 783334988 ^ 936932014) + 1828162916 ^ 478358504) {
                  case 220419206:
                  default:
                     var10001 = var60;
                     if (var49 < ((222724766 | -20130747 | 2) & 2105602)) {
                        int var85 = 0<"JNT",-438714991,"黭㻭廬绮廨뻯","㔎℮㔮\u206e","嘬䐬測䐬\ude2b娬䐬帬倬\ude2b⠬樬昬听帬倬ج氬听娬䨬䰬昬",-2066677876>(var60, var49) + 'E';
                        char var88 = (char)(
                           (((((var85 & 65535) >> 0 | var85 << 16) & 65472) >> 6 | ((var85 & 65535) >> 0 | var85 << 16) << 10) - 139 & 61440) >> 12
                              | ((((var85 & 65535) >> 0 | var85 << 16) & 65472) >> 6 | ((var85 & 65535) >> 0 | var85 << 16) << 10) - 139 << 4
                        );
                        0<"JNT",-438714991,"黯\udeed뻯黩㻭廬绮廨뻯","㔎℮\u206e㔮⋎","嘬䐬測䐬\ude2b娬䐬帬倬\ude2b⠬樬昬听帬倬ج氬听娬䨬䰬昬",-2066677871>(
                           var60,
                           var49,
                           (char)(
                              (((((var85 & 65535) >> 0 | var85 << 16) & 65472) >> 6 | ((var85 & 65535) >> 0 | var85 << 16) << 10) - 139 & 61440) >> 12
                                 | ((((var85 & 65535) >> 0 | var85 << 16) & 65472) >> 6 | ((var85 & 65535) >> 0 | var85 << 16) << 10) - 139 << 4
                           )
                        );
                        var49 += (-807371715 * (-1570157992 | -807371715) | 1) & 990396419;
                        continue label87;
                     }

                     var32 = -767539814 - -90633061 ^ -837034069;
                     break;
                  case 454575622:
                     var10001 = var60;
                     if (var49 < ((-987311771 >>> -846203060 | 2) & 1470104838)) {
                        int var80 = 0<"JNT",-438714991,"黭㻭廬绮廨뻯","㔎℮㔮\u206e","嘬䐬測䐬\ude2b娬䐬帬倬\ude2b⠬樬昬听帬倬ج氬听娬䨬䰬昬",-2066677810>(var60, var49)
                           + 'a'
                           + 214
                           - 89
                           - 123;
                        char var81 = (char)((var80 & 65520) >> 4 | var80 << 12);
                        0<"JNT",-438714991,"黯\udeed뻯黩㻭廬绮廨뻯","㔎℮\u206e㔮⋎","嘬䐬測䐬\ude2b娬䐬帬倬\ude2b⠬樬昬听帬倬ج氬听娬䨬䰬昬",-2066677797>(
                           var60, var49, (char)((var80 & 65520) >> 4 | var80 << 12)
                        );
                        var49 += (-1393859336 >>> -1494274923 | 0) & 156482201;
                        break label127;
                     }

                     var32 = -1112854533 ^ -794688433 ^ -866070423;
               }

               String var51;
               double var63;
               Class_43 var84;
               int var105;
               StringBuilder var123;
               switch (((var32 ^ 1190849030) - 1975094835 ^ 1266713929) - 157770090 + 30568785 ^ 2077757359) {
                  case -509606510:
                  default:
                     var51 = 0<"JNT",-438714991,"뻯Ữ黫뻯绮廭ﻮử","㔎㔮\u218eⵎⰮ⻎Ⱞ㗮ⶎⰮⷎⳮ㗮≮⺎⹎\u2d2eⷎⳮ㝮","嘬䐬測䐬\ude2b娬䐬帬倬\ude2b⠬樬昬听帬倬ج氬听娬䨬䰬昬",-2066677907>(var10001);
                     var63 = (double)(var28 + var7 / 2);
                     var84 = 0<"JNT",-233425411,"ﻮ黮廮","㔎㔮\u218eⱮ⺮㝮","䠬氬",-2066677894>();
                     var105 = -145029884 * 1831811270 ^ -650460904;
                     var123 = (StringBuilder)0<"JNT",-431768172,"뻨廭ﻮ廭뻯ﻨ","㔎\u218eⵎⰮ⻎Ⱞ㗮ⶎⰮⷎⳮ㗮≮⺎⹎\u2d2eⷎⳮ㝮㔮⋎","嘬䐬測䐬\ude2b娬䐬帬倬\ude2b⠬樬昬听帬倬ج氬听娬䨬䰬昬",-2066677897>(
                        "－ａ"
                     );
                     var32 = 1563259078 >> 1224776642 ^ 1865937981;
                     break;
                  case 1226578279:
                     var51 = 0<"JNT",-438714991,"뻯Ữ黫뻯绮廭ﻮử","㔎㔮\u218eⵎⰮ⻎Ⱞ㗮ⶎⰮⷎⳮ㗮≮⺎⹎\u2d2eⷎⳮ㝮","嘬䐬測䐬\ude2b娬䐬帬倬\ude2b⠬樬昬听帬倬ج氬听娬䨬䰬昬",-2066678223>(var10001);
                     var63 = (double)(var29 + var7 / 2);
                     var84 = 0<"JNT",-233425411,"ﻮ黮廮","㔎㔮\u218eⱮ⺮㝮","䠬氬",-2066678226>();
                     var105 = (913208964 - 913208964 | 0) & 1005151376;
                     var123 = (StringBuilder)0<"JNT",-431768172,"뻨廭ﻮ廭뻯ﻨ","㔎\u218eⵎⰮ⻎Ⱞ㗮ⶎⰮⷎⳮ㗮≮⺎⹎\u2d2eⷎⳮ㝮㔮⋎","嘬䐬測䐬\ude2b娬䐬帬倬\ude2b⠬樬昬听帬倬ج氬听娬䨬䰬昬",-2066678213>(
                        "0ĠƈİŀŸ"
                     );
                     var32 = -1778609084 & 2067913716 ^ 832413353;
               }

               label79:
               while (true) {
                  switch ((var32 + 90318931 - 661909598 ^ 859736760 ^ 1463633615) - 1993672392 - 1765103060) {
                     case -1161941511:
                        var94 = var123;
                        if (var105 >= ((1700731555 >>> -232468903 | 4) & 631499087)) {
                           var32 = 973105357 >> 973105357 ^ -867169838;
                           break label79;
                        }

                        char var146 = 0<"JNT",-438714991,"黭㻭廬绮廨뻯","㔎℮㔮\u206e","嘬䐬測䐬\ude2b娬䐬帬倬\ude2b⠬樬昬听帬倬ج氬听娬䨬䰬昬",-2066678224>(var123, var105);
                        int var171 = (var146 & 'ﾀ') >> 7;
                        int var147 = (var146 & 'ﾀ') >> 7 | var146 << '\t';
                        int var172 = (((var146 & 'ﾀ') >> 7 | var146 << '\t') & 65024) >> 9;
                        int var148 = ((var171 | var146 << '\t') & 65024) >> 9 | ((var146 & 'ﾀ') >> 7 | var146 << '\t') << 7;
                        var171 = ((var172 | var147 << 7) & 65520) >> 4;
                        int var149 = ((var172 | var147 << 7) & 65520) >> 4 | var148 << 12;
                        int var174 = ((((var172 | var147 << 7) & 65520) >> 4 | var148 << 12) & 32768) >> 15;
                        char var150 = (char)((((var171 | var148 << 12) & 32768) >> 15 | (((var172 | var147 << 7) & 65520) >> 4 | var148 << 12) << 1) + 61);
                        0<"JNT",-438714991,"黯\udeed뻯黩㻭廬绮廨뻯","㔎℮\u206e㔮⋎","嘬䐬測䐬\ude2b娬䐬帬倬\ude2b⠬樬昬听帬倬ج氬听娬䨬䰬昬",-2066678235>(
                           var123, var105, (char)((var174 | var149 << 1) + 61)
                        );
                        var105 += (-144049196 & 305476362 >>> -975402920 | 1) & 363285473;
                        var32 = -1778609084 & 2067913716 ^ 832413353;
                        break;
                     case 1381945306:
                     default:
                        var94 = var123;
                        if (var105 >= (-2124596102 << -2124596102 ^ -402653182)) {
                           var32 = 872670380;
                           break label79;
                        }

                        0<"JNT",-438714991,"黯\udeed뻯黩㻭廬绮廨뻯","㔎℮\u206e㔮⋎","嘬䐬測䐬\ude2b娬䐬帬倬\ude2b⠬樬昬听帬倬ج氬听娬䨬䰬昬",-2066677906>(
                           var123,
                           var105,
                           (char)(
                              (0<"JNT",-438714991,"黭㻭廬绮廨뻯","㔎℮㔮\u206e","嘬䐬測䐬\ude2b娬䐬帬倬\ude2b⠬樬昬听帬倬ج氬听娬䨬䰬昬",-2066677903>(var123, var105) + '9' ^ 141 ^ 40) + 66
                                 ^ 106
                           )
                        );
                        var105 += -164074655 + -1283665913 ^ -1447740567;
                        var32 = 1563259078 >> 1224776642 ^ 1865937981;
                  }
               }

               switch ((var32 ^ 148516005) + 309423461 + 39263512 - 536009111 - 1164338038 + 176739992) {
                  case -154014703:
                  default:
                     0<"JNT",429981674,"续廮","㔎\u218eⵎⰮ⻎Ⱞ㗮ⶎⰮⷎⳮ㗮≮⺎⹎\u2d2eⷎⳮ㝮₎₎\u218e⸎⻮㝮⍎㔮₎","䠬氬",-2066677887>(
                        var10000,
                        var51,
                        var63
                           - 0<"JNT",429981674,"ﻯ绯ﻭ","㔎\u218eⵎⰮ⻎Ⱞ㗮ⶎⰮⷎⳮ㗮≮⺎⹎\u2d2eⷎⳮ㝮㔮₎","䠬氬",-2066677889>(
                                 var84, 0<"JNT",-438714991,"뻯Ữ黫뻯绮廭ﻮử","㔎㔮\u218eⵎⰮ⻎Ⱞ㗮ⶎⰮⷎⳮ㗮≮⺎⹎\u2d2eⷎⳮ㝮","嘬䐬測䐬\ude2b娬䐬帬倬\ude2b⠬樬昬听帬倬ج氬听娬䨬䰬昬",-2066677886>(var94)
                              )
                              / 2.0,
                        (double)(var26 + 8),
                        (Class_262)0<"JNT",-431768172,"뻨廭ﻮ廭뻯ﻨ","㔎℮℮℮℮㔮⋎","戬瀬",-2066677892>(245, 245, 245, 255),
                        false
                     );
                     0<"JNT",-233425411,"ﻯ绮㻯","㔎\u218eⷎⲮ⺎㗮ⶮ\u2d2eⷎⲮⱮ⹎ⰮⳎ⺎㗮ⱮⶎⰮ\u2e6e\u2e6e⏮㙮㙮㙎㝮₎₎₎₎₎₎₎₎\u218e⸎⻮㝮\u218e⸎⻮㝮\u218e⸎⻮㝮₎⍎㔮⋎","刬丬",-2066677891>(
                        var1,
                        (double)var29,
                        (double)var26,
                        (double)(var29 + var7),
                        (double)(var26 + var27),
                        5.0,
                        5.0,
                        5.0,
                        5.0,
                        (Class_262)0<"JNT",-431768172,"뻨廭ﻮ廭뻯ﻨ","㔎℮℮℮℮㔮⋎","戬瀬",-2066677890>(60, 60, 65, 255),
                        1<"JNT",1606690928,"ꖒ떒","ﴏﴎ","ܫ\u074bʫ﹊︪\u058b",-399797432>(),
                        1<"JNT",1606690928,"ꖒ떒","ﴏﴎ","ܫ\u074bʫ﹊︪\u058b",-399797431>(),
                        0.0,
                        false
                     );
                     var10000 = 0<"JNT",-233425411,"ﻮ黮廮","㔎㔮\u218eⱮ⺮㝮","䠬氬",-2066677878>();
                     var49 = 0;
                     var60 = (StringBuilder)0<"JNT",-431768172,"뻨廭ﻮ廭뻯ﻨ","㔎\u218eⵎⰮ⻎Ⱞ㗮ⶎⰮⷎⳮ㗮≮⺎⹎\u2d2eⷎⳮ㝮㔮⋎","嘬䐬測䐬\ude2b娬䐬帬倬\ude2b⠬樬昬听帬倬ج氬听娬䨬䰬昬",-2066677881>(
                        "ύ֭ٽ\u05cd\u05edٝ"
                     );
                     break;
                  case 2122586492:
                     0<"JNT",429981674,"续廮","㔎\u218eⵎⰮ⻎Ⱞ㗮ⶎⰮⷎⳮ㗮≮⺎⹎\u2d2eⷎⳮ㝮₎₎\u218e⸎⻮㝮⍎㔮₎","䠬氬",-2066678009>(
                        var10000,
                        var51,
                        var63
                           - 0<"JNT",429981674,"ﻯ绯ﻭ","㔎\u218eⵎⰮ⻎Ⱞ㗮ⶎⰮⷎⳮ㗮≮⺎⹎\u2d2eⷎⳮ㝮㔮₎","䠬氬",-2066678019>(
                                 var84, 0<"JNT",-438714991,"뻯Ữ黫뻯绮廭ﻮử","㔎㔮\u218eⵎⰮ⻎Ⱞ㗮ⶎⰮⷎⳮ㗮≮⺎⹎\u2d2eⷎⳮ㝮","嘬䐬測䐬\ude2b娬䐬帬倬\ude2b⠬樬昬听帬倬ج氬听娬䨬䰬昬",-2066678008>(var94)
                              )
                              / 2.0,
                        (double)(var26 + 8),
                        (Class_262)0<"JNT",-431768172,"뻨廭ﻮ廭뻯ﻨ","㔎℮℮℮℮㔮⋎","戬瀬",-2066678006>(245, 245, 245, 255),
                        false
                     );
                     0<"JNT",-233425411,"ữ廭ﻮ","㔎㔮⋎","倬戬瘬",-2066678012>();
                     return;
               }
            }

            var32 = (277173827 | 2096627201 | -2146958904) & -662853138;
         }
      }
   }

   // $VF: renamed from: miw (net.minecraft.class_332, int, int, int, int) void
   public void method_2101(class_332 var1, int var2, int var3, int var4, int var5) {
      int var11 = -740135797;
      int var6 = var4 / 4;
      0<"JNT",-438714991,"\udeee㻯뻮","㔎㔮⋎","爬䐬",-2066679585>(1<"JNT",1606690928,"붒趒","봉ﴎ","ܫ\u074bʫ﵊K\u058b",-399796749>());
      int var7 = 0;

      label42:
      while (true) {
         var11 = 1975019589;

         while (true) {
            switch (((var11 ^ 224451262) - 583909272 + 1855797865 ^ 483023587) + 789806231 + 994935660) {
               case -976776354:
               default:
                  0<"JNT",-438714991,"黯ﻯ뻮","㔎㔮⋎","爬䐬",-2066677841>(1<"JNT",1606690928,"붒趒","봉ﴎ","ܫ\u074bʫ﵊K\u058b",-399796797>());
                  0<"JNT",-233425411,"绮뻯廯","㔎\u218eⷎⲮ⺎㗮ⶮ\u2d2eⷎⲮⱮ⹎ⰮⳎ⺎㗮ⱮⶎⰮ\u2e6e\u2e6e⏮㙮㙮㙎㝮\u218e⸎⻮㝮₎₎₎₎₎₎₎₎₎㔮⋎","爬䐬",-2066677839>(
                     var1,
                     (Class_262)0<"JNT",-431768172,"뻨廭ﻮ廭뻯ﻨ","㔎℮℮℮㔮⋎","戬瀬",-2066677844>(50, 50, 55),
                     (double)(var2 - 1),
                     (double)(var3 - 1),
                     (double)(var2 + var4 + 1),
                     (double)(var3 + var5 + 1),
                     2.0,
                     2.0,
                     2.0,
                     2.0,
                     1.0
                  );
                  var7 = var2 + (int)(1<"JNT",-1963550979,"馒높鶒","ﴏﴎ","ܫ\u074bΫ",-399796809>(this) * (double)var4);
                  int var13 = var3 + (int)((1.0 - 1<"JNT",-1963550979,"떒膒馒","ﴏﴎ","ܫ\u074bΫ",-399796808>(this)) * (double)var5);
                  0<"JNT",-233425411,"黭㻭黯","㔎\u218eⷎⲮ⺎㗮ⶮ\u2d2eⷎⲮⱮ⹎ⰮⳎ⺎㗮ⱮⶎⰮ\u2e6e\u2e6e⏮㙮㙮㙎㝮\u218e⸎⻮㝮₎₎₎㔮⋎","爬䐬",-2066677843>(
                     var1, (Class_262)0<"JNT",-431768172,"뻨廭ﻮ廭뻯ﻨ","㔎℮℮℮℮㔮⋎","戬瀬",-2066677832>(0, 0, 0, 200), (double)var7, (double)var13, 6.0
                  );
                  0<"JNT",-233425411,"黭㻭黯","㔎\u218eⷎⲮ⺎㗮ⶮ\u2d2eⷎⲮⱮ⹎ⰮⳎ⺎㗮ⱮⶎⰮ\u2e6e\u2e6e⏮㙮㙮㙎㝮\u218e⸎⻮㝮₎₎₎㔮⋎","爬䐬",-2066677833>(
                     var1, (Class_262)0<"JNT",-431768172,"뻨廭ﻮ廭뻯ﻨ","㔎℮℮℮㔮⋎","戬瀬",-2066677830>(255, 255, 255), (double)var7, (double)var13, 5.0
                  );
                  Class_262 var14 = 0<"JNT",-438714991,"绮黭","㔎㔮\u218e⸎⻮㝮","氬䐬",-2066677836>(this);
                  0<"JNT",-233425411,"黭㻭黯","㔎\u218eⷎⲮ⺎㗮ⶮ\u2d2eⷎⲮⱮ⹎ⰮⳎ⺎㗮ⱮⶎⰮ\u2e6e\u2e6e⏮㙮㙮㙎㝮\u218e⸎⻮㝮₎₎₎㔮⋎","爬䐬",-2066679531>(
                     var1,
                     (Class_262)0<"JNT",-431768172,"뻨廭ﻮ廭뻯ﻨ","㔎℮℮℮㔮⋎","戬瀬",-2066679584>(
                        1<"JNT",-1963550979,"鶒\ue992膒","봋紉","ܫ\u074b͋",-399796754>(var14),
                        1<"JNT",-1963550979,"붒薒떒","봋紉","ܫ\u074b͋",-399796753>(var14),
                        1<"JNT",-1963550979,"\ued92冒","봋紉","ܫ\u074b͋",-399796752>(var14)
                     ),
                     (double)var7,
                     (double)var13,
                     4.0
                  );
                  return;
               case 1120106290:
            }

            if (var7 < var6) {
               int var8 = 0;

               while (true) {
                  var11 = -1546767959 ^ -1919782100 ^ -1310186623;

                  while (true) {
                     switch ((var11 ^ 1314725065 ^ 1227618234) - 1202225457 ^ 499897697 ^ 970618248 ^ 1121140515) {
                        case -2082907539:
                        default:
                           var7++;
                           continue label42;
                        case 936941196:
                     }

                     if (var8 < var6) {
                        int var9 = 1<"JNT",-1963550979,"ꖒ閒鶒","ﴏﴎ","ܫ\u074bƋ͋",-399796763>(this)[var7 * var6 + var8];
                        Class_262 var10 = (Class_262)0<"JNT",-431768172,"뻨廭ﻮ廭뻯ﻨ","㔎℮㔮⋎","戬瀬",-2066679583>(var9);
                        0<"JNT",-438714991,"\udeed续黯绯","㔎₎₎₎₎\u218e⸎⻮㝮㔮⋎","爬䐬",-2066679573>(
                           1<"JNT",1606690928,"붒趒","봉ﴎ","ܫ\u074bʫ﵊K\u058b",-399796761>(), (double)(var2 + var8 * 4), (double)(var3 + var7 * 4), 4.0, 4.0, var10
                        );
                        var8++;
                        break;
                     }

                     var11 = (-848277543 | 578988459) & 1001631147;
                  }
               }
            }

            var11 = -155347879;
         }
      }
   }

   // $VF: renamed from: htv (net.minecraft.class_332, int, int, int, int) void
   public void method_2102(class_332 var1, int var2, int var3, int var4, int var5) {
      int var10 = -1059634076;
      int var6 = var5 / 4;
      0<"JNT",-438714991,"\udeee㻯뻮","㔎㔮⋎","爬䐬",-2066679575>(1<"JNT",1606690928,"붒趒","봉ﴎ","ܫ\u074bʫ﵊K\u058b",-399796771>());
      int var7 = 0;

      while (true) {
         var10 = -865681817;

         while (true) {
            switch (((var10 + 2023220971 ^ 138925985) - 352140355 + 1673141980 ^ 2056870740) + 2002849117) {
               case 875870715:
                  0<"JNT",-438714991,"黯ﻯ뻮","㔎㔮⋎","爬䐬",-2066679533>(1<"JNT",1606690928,"붒趒","봉ﴎ","ܫ\u074bʫ﵊K\u058b",-399796769>());
                  0<"JNT",-233425411,"绮뻯廯","㔎\u218eⷎⲮ⺎㗮ⶮ\u2d2eⷎⲮⱮ⹎ⰮⳎ⺎㗮ⱮⶎⰮ\u2e6e\u2e6e⏮㙮㙮㙎㝮\u218e⸎⻮㝮₎₎₎₎₎₎₎₎₎㔮⋎","爬䐬",-2066679547>(
                     var1,
                     (Class_262)0<"JNT",-431768172,"뻨廭ﻮ廭뻯ﻨ","㔎℮℮℮㔮⋎","戬瀬",-2066679536>(50, 50, 55),
                     (double)(var2 - 1),
                     (double)(var3 - 1),
                     (double)(var2 + var4 + 1),
                     (double)(var3 + var5 + 1),
                     2.0,
                     2.0,
                     2.0,
                     2.0,
                     1.0
                  );
                  var7 = var3 + (int)(1<"JNT",-1963550979,"\ue192ﶒ","ﴏﴎ","ܫ\u074bΫ",-399796765>(this) / 360.0 * (double)var5);
                  0<"JNT",-233425411,"ﻯ黯㻮","㔎\u218eⷎⲮ⺎㗮ⶮ\u2d2eⷎⲮⱮ⹎ⰮⳎ⺎㗮ⱮⶎⰮ\u2e6e\u2e6e⏮㙮㙮㙎㝮\u218e⸎⻮㝮₎₎₎₎₎₎₎₎㔮⋎","爬䐬",-2066679540>(
                     var1,
                     (Class_262)0<"JNT",-431768172,"뻨廭ﻮ廭뻯ﻨ","㔎℮℮℮℮㔮⋎","戬瀬",-2066679537>(0, 0, 0, 180),
                     (double)(var2 - 2),
                     (double)(var7 - 2),
                     (double)(var2 + var4 + 2),
                     (double)(var7 + 2),
                     2.0,
                     2.0,
                     2.0,
                     2.0
                  );
                  0<"JNT",-233425411,"ﻯ黯㻮","㔎\u218eⷎⲮ⺎㗮ⶮ\u2d2eⷎⲮⱮ⹎ⰮⳎ⺎㗮ⱮⶎⰮ\u2e6e\u2e6e⏮㙮㙮㙎㝮\u218e⸎⻮㝮₎₎₎₎₎₎₎₎㔮⋎","爬䐬",-2066679538>(
                     var1,
                     (Class_262)0<"JNT",-431768172,"뻨廭ﻮ廭뻯ﻨ","㔎℮℮℮㔮⋎","戬瀬",-2066679535>(255, 255, 255),
                     (double)(var2 - 1),
                     (double)(var7 - 1),
                     (double)(var2 + var4 + 1),
                     (double)(var7 + 1),
                     1.0,
                     1.0,
                     1.0,
                     1.0
                  );
                  return;
               case 1498422325:
            }

            if (var7 < var6) {
               int var8 = 1<"JNT",-1963550979,"妒\ued92ꦒ","ﴏﴎ","ܫ\u074bƋ͋",-399796759>(this)[var7];
               Class_262 var9 = (Class_262)0<"JNT",-431768172,"뻨廭ﻮ廭뻯ﻨ","㔎℮㔮⋎","戬瀬",-2066679587>(var8);
               0<"JNT",-438714991,"\udeed续黯绯","㔎₎₎₎₎\u218e⸎⻮㝮㔮⋎","爬䐬",-2066679577>(
                  1<"JNT",1606690928,"붒趒","봉ﴎ","ܫ\u074bʫ﵊K\u058b",-399796757>(), (double)var2, (double)(var3 + var7 * 4), (double)var4, 4.0, var9
               );
               var7++;
               break;
            }

            var10 = 108500963 >> 108500963 ^ 134162777;
         }
      }
   }

   public boolean method_25402(class_11909 var1, boolean var2) {
      int var25 = 498849256;
      int var3 = (int)(
         0<"JNT",-438714991,"黭Ữ\udeee㻮Ử뻧ủ廧㻧","㔎㔮₎","帬䰬樬\ude2b尬听帬䰬䠬昬䐬丬樬\ude2b䠬娬䐬栬栬䀬\ue42b\ue42b\uf42b\ue22b\uf42b",-2066679530>(var1)
            * (double)0<"JNT",-438714991,"\udeee\udeed뻯㻭Ữ뻭Ử뻧뻧廧\udee7","㔎㔮℮","帬䰬樬\ude2b尬听帬䰬䠬昬䐬丬樬\ude2b䠬娬䐬栬栬䀬\ue42b\ue22b\uea2b\ue42b",-2066679563>(
               0<"JNT",-438714991,"\udeee\udeed뻯㻭Ữ뻭Ử绦绦ﻧ㻧黧","㔎㔮\u218eⷎⲮ⺎㗮ⶮ\u2d2eⷎⲮⱮ⹎ⰮⳎ⺎㗮ⱮⶎⰮ\u2e6e\u2e6e⏮㘮㘎㚎㘮㝮","帬䰬樬\ude2b尬听帬䰬䠬昬䐬丬樬\ude2b䠬娬䐬栬栬䀬\ue82b\ue42b\ue22b",-2066679488>(
                  (class_310)1<"JNT",1606690928,"膒릒","㴌ﴎ","ܫ\u074bʫﾊK︊K܋ﻊK＊\u000b܋̋kﾊￋ\u008b\ufdca\u058b",-399796720>()
               )
            )
      );
      int var4 = (int)(
         0<"JNT",-438714991,"黭Ữ\udeee㻮Ử뻧ủ廧廧","㔎㔮₎","帬䰬樬\ude2b尬听帬䰬䠬昬䐬丬樬\ude2b䠬娬䐬栬栬䀬\ue42b\ue42b\uf42b\ue22b\uf42b",-2066679486>(var1)
            * (double)0<"JNT",-438714991,"\udeee\udeed뻯㻭Ữ뻭Ử뻧뻧廧\udee7","㔎㔮℮","帬䰬樬\ude2b尬听帬䰬䠬昬䐬丬樬\ude2b䠬娬䐬栬栬䀬\ue42b\ue22b\uea2b\ue42b",-2066679487>(
               0<"JNT",-438714991,"\udeee\udeed뻯㻭Ữ뻭Ử绦绦ﻧ㻧黧","㔎㔮\u218eⷎⲮ⺎㗮ⶮ\u2d2eⷎⲮⱮ⹎ⰮⳎ⺎㗮ⱮⶎⰮ\u2e6e\u2e6e⏮㘮㘎㚎㘮㝮","帬䰬樬\ude2b尬听帬䰬䠬昬䐬丬樬\ude2b䠬娬䐬栬栬䀬\ue82b\ue42b\ue22b",-2066679492>(
                  (class_310)1<"JNT",1606690928,"膒릒","㴌ﴎ","ܫ\u074bʫﾊK︊K܋ﻊK＊\u000b܋̋kﾊￋ\u008b\ufdca\u058b",-399796732>()
               )
            )
      );
      int var5 = 0<"JNT",-438714991,"\udeee\udeed뻯㻭Ữ뻭Ử뻧뻧㻧廧","㔎㔮℮","帬䰬樬\ude2b尬听帬䰬䠬昬䐬丬樬\ude2b䠬娬䐬栬栬䀬\ue42b\ue22b\uea2b\ue42b",-2066679480>(
         0<"JNT",-438714991,"\udeee\udeed뻯㻭Ữ뻭Ử绦绦ﻧ㻧黧","㔎㔮\u218eⷎⲮ⺎㗮ⶮ\u2d2eⷎⲮⱮ⹎ⰮⳎ⺎㗮ⱮⶎⰮ\u2e6e\u2e6e⏮㘮㘎㚎㘮㝮","帬䰬樬\ude2b尬听帬䰬䠬昬䐬丬樬\ude2b䠬娬䐬栬栬䀬\ue82b\ue42b\ue22b",-2066679477>(
            (class_310)1<"JNT",1606690928,"膒릒","㴌ﴎ","ܫ\u074bʫﾊK︊K܋ﻊK＊\u000b܋̋kﾊￋ\u008b\ufdca\u058b",-399796729>()
         )
      );
      int var6 = 0<"JNT",-438714991,"\udeee\udeed뻯㻭Ữ뻭Ử뻧\udee7㻦ﻧ","㔎㔮℮","帬䰬樬\ude2b尬听帬䰬䠬昬䐬丬樬\ude2b䠬娬䐬栬栬䀬\ue42b\ue22b\uea2b\ue42b",-2066679481>(
         0<"JNT",-438714991,"\udeee\udeed뻯㻭Ữ뻭Ử绦绦ﻧ㻧黧","㔎㔮\u218eⷎⲮ⺎㗮ⶮ\u2d2eⷎⲮⱮ⹎ⰮⳎ⺎㗮ⱮⶎⰮ\u2e6e\u2e6e⏮㘮㘎㚎㘮㝮","帬䰬樬\ude2b尬听帬䰬䠬昬䐬丬樬\ude2b䠬娬䐬栬栬䀬\ue82b\ue42b\ue22b",-2066679478>(
            (class_310)1<"JNT",1606690928,"膒릒","㴌ﴎ","ܫ\u074bʫﾊK︊K܋ﻊK＊\u000b܋̋kﾊￋ\u008b\ufdca\u058b",-399796726>()
         )
      );
      byte var7 = 70;
      byte var8 = 8;
      int var9 = var7 * 2 + var8;
      int var10 = var9 + 40;
      short var11 = 275;
      int var12 = 0<"JNT",-233425411,"\udeee廬㻯","㔎℮℮㔮℮","嘬䐬測䐬\ude2b娬䐬帬倬\ude2bᰬ䐬樬刬",-2066679484>(var10, var11);
      short var13 = 370;
      int var14 = (var5 - var12) / 2;
      int var15 = (var6 - var13) / 2;
      int var16 = var15 + 45;
      int var17 = var14 + 20;
      if (0<"JNT",-438714991,"뻭ử续","㔎₎₎℮℮℮℮㔮⍎","氬䐬",-2066679479>(this, (double)var3, (double)var4, var17, var16, 200, 200)) {
         1<"JNT",1619810479,"覒妒","ﴏﴎ","ܫ\u074bū",-399796737>(this, true);
         0<"JNT",-438714991,"㻮ửﻭ","㔎₎₎℮℮℮℮㔮⋎","氬䐬",-2066679565>(this, (double)var3, (double)var4, var17, var16, 200, 200);
         return true;
      } else {
         int var19 = var17 + 200 + 15;
         if (0<"JNT",-438714991,"뻭ử续","㔎₎₎℮℮℮℮㔮⍎","氬䐬",-2066679525>(this, (double)var3, (double)var4, var19, var16, 20, 200)) {
            1<"JNT",1619810479,"閒鶒覒","ﴏﴎ","ܫ\u074bū",-399796775>(this, true);
            0<"JNT",-438714991,"뻮续ﻮ","㔎₎℮℮㔮⋎","氬䐬",-2066679539>(this, (double)var4, var16, 200);
            return true;
         } else {
            int var21 = var15 + var13 - 45;
            byte var22 = 30;
            int var23 = var14 + var12 - var7 - 20;
            int var24 = var23 - var7 - var8;
            if (0<"JNT",-438714991,"뻭ử续","㔎₎₎℮℮℮℮㔮⍎","氬䐬",-2066679568>(this, (double)var3, (double)var4, var23, var21, var7, var22)) {
               0<"JNT",429981674,"廬黭黭\udeed㻮뻯","㔎\u218eⵎⰮ⻎Ⱞ㗮ⶎⰮⷎⳮ㗮⇮ⱎⵎⲮⱮ⺎㝮㔮⋎","嘬䐬測䐬\ude2b氬樬听娬\ude2b丬氬帬䠬樬听怬帬\ude2bࠬ怬帬栬氬尬䰬昬",-2066679569>(
                  1<"JNT",-1963550979,"閒\uf592閒","ﴏﴎ","ܫ\u074bʫﾊK︊K܋\ufdea\ufdcaｪﻊ܋￫\ufdea＊\u008b\ufdcaｪＪ＊܋ҋＪ＊ﺪ\ufdeaﻪￋﺊ\u058b",-399796734>(this),
                  0<"JNT",-438714991,"绮黭","㔎㔮\u218e⸎⻮㝮","氬䐬",-2066679566>(this)
               );
               0<"JNT",-438714991,"\udeee\udeed뻯㻭Ữ뻭Ử廦\udee7㻦ủ","㔎\u218eⷎⲮ⺎㗮ⶮ\u2d2eⷎⲮⱮ⹎ⰮⳎ⺎㗮ⱮⶎⰮ\u2e6e\u2e6e⏮㚎㙮㛮㝮㔮⋎","帬䰬樬\ude2b尬听帬䰬䠬昬䐬丬樬\ude2b䠬娬䐬栬栬䀬\ue82b\ue42b\ue22b",-2066679570>(
                  (class_310)1<"JNT",1606690928,"膒릒","㴌ﴎ","ܫ\u074bʫﾊK︊K܋ﻊK＊\u000b܋̋kﾊￋ\u008b\ufdca\u058b",-399796747>(),
                  1<"JNT",-1963550979,"ꦒ馒릒떒","ﴏﴎ","ܫ\u074bʫ＊ￋ\ufdca܋ﻪｪ＊ￋ\u008bﺊK￫\ufdca܋\u008bﻊKﺪﺪċ֫ڋ؋\u058b",-399796746>(this)
               );
               return true;
            } else {
               var25 = (-277762566 & -277762566 | 162141193) & 699022925;

               while (true) {
                  switch ((var25 - 97584000 - 874376093 + 580890285 ^ 554139638) - 1501965529 - 598423190) {
                     case -1238622016:
                        if (0<"JNT",-438714991,"뻭ử续","㔎₎₎℮℮℮℮㔮⍎","氬䐬",-2066679526>(this, (double)var3, (double)var4, var24, var21, var7, var22)) {
                           0<"JNT",-438714991,"\udeee\udeed뻯㻭Ữ뻭Ử廦\udee7㻦ủ","㔎\u218eⷎⲮ⺎㗮ⶮ\u2d2eⷎⲮⱮ⹎ⰮⳎ⺎㗮ⱮⶎⰮ\u2e6e\u2e6e⏮㚎㙮㛮㝮㔮⋎","帬䰬樬\ude2b尬听帬䰬䠬昬䐬丬樬\ude2b䠬娬䐬栬栬䀬\ue82b\ue42b\ue22b",-2066679527>(
                              (class_310)1<"JNT",1606690928,"膒릒","㴌ﴎ","ܫ\u074bʫﾊK︊K܋ﻊK＊\u000b܋̋kﾊￋ\u008b\ufdca\u058b",-399796724>(),
                              1<"JNT",-1963550979,"ꦒ馒릒떒","ﴏﴎ","ܫ\u074bʫ＊ￋ\ufdca܋ﻪｪ＊ￋ\u008bﺊK￫\ufdca܋\u008bﻊKﺪﺪċ֫ڋ؋\u058b",-399796723>(this)
                           );
                           return true;
                        }

                        var25 = -2041641213;
                        break;
                     case -758688266:
                     default:
                        return false;
                  }
               }
            }
         }
      }
   }

   public boolean method_25406(class_11909 var1) {
      1<"JNT",1619810479,"閒鶒覒","ﴏﴎ","ܫ\u074bū",-399796744>(this, false);
      1<"JNT",1619810479,"覒妒","ﴏﴎ","ܫ\u074bū",-399796743>(this, false);
      return false;
   }

   public boolean method_25403(class_11909 var1, double var2, double var4) {
      int var22 = -1101780658;
      int var6 = (int)(
         0<"JNT",-438714991,"黭Ữ\udeee㻮Ử뻧ủ廧㻧","㔎㔮₎","帬䰬樬\ude2b尬听帬䰬䠬昬䐬丬樬\ude2b䠬娬䐬栬栬䀬\ue42b\ue42b\uf42b\ue22b\uf42b",-2066679561>(var1)
            * (double)0<"JNT",-438714991,"\udeee\udeed뻯㻭Ữ뻭Ử뻧뻧廧\udee7","㔎㔮℮","帬䰬樬\ude2b尬听帬䰬䠬昬䐬丬樬\ude2b䠬娬䐬栬栬䀬\ue42b\ue22b\uea2b\ue42b",-2066679562>(
               0<"JNT",-438714991,"\udeee\udeed뻯㻭Ữ뻭Ử绦绦ﻧ㻧黧","㔎㔮\u218eⷎⲮ⺎㗮ⶮ\u2d2eⷎⲮⱮ⹎ⰮⳎ⺎㗮ⱮⶎⰮ\u2e6e\u2e6e⏮㘮㘎㚎㘮㝮","帬䰬樬\ude2b尬听帬䰬䠬昬䐬丬樬\ude2b䠬娬䐬栬栬䀬\ue82b\ue42b\ue22b",-2066679559>(
                  (class_310)1<"JNT",1606690928,"膒릒","㴌ﴎ","ܫ\u074bʫﾊK︊K܋ﻊK＊\u000b܋̋kﾊￋ\u008b\ufdca\u058b",-399796691>()
               )
            )
      );
      int var7 = (int)(
         0<"JNT",-438714991,"黭Ữ\udeee㻮Ử뻧ủ廧廧","㔎㔮₎","帬䰬樬\ude2b尬听帬䰬䠬昬䐬丬樬\ude2b䠬娬䐬栬栬䀬\ue42b\ue42b\uf42b\ue22b\uf42b",-2066679517>(var1)
            * (double)0<"JNT",-438714991,"\udeee\udeed뻯㻭Ữ뻭Ử뻧뻧廧\udee7","㔎㔮℮","帬䰬樬\ude2b尬听帬䰬䠬昬䐬丬樬\ude2b䠬娬䐬栬栬䀬\ue42b\ue22b\uea2b\ue42b",-2066679518>(
               0<"JNT",-438714991,"\udeee\udeed뻯㻭Ữ뻭Ử绦绦ﻧ㻧黧","㔎㔮\u218eⷎⲮ⺎㗮ⶮ\u2d2eⷎⲮⱮ⹎ⰮⳎ⺎㗮ⱮⶎⰮ\u2e6e\u2e6e⏮㘮㘎㚎㘮㝮","帬䰬樬\ude2b尬听帬䰬䠬昬䐬丬樬\ude2b䠬娬䐬栬栬䀬\ue82b\ue42b\ue22b",-2066679467>(
                  (class_310)1<"JNT",1606690928,"膒릒","㴌ﴎ","ܫ\u074bʫﾊK︊K܋ﻊK＊\u000b܋̋kﾊￋ\u008b\ufdca\u058b",-399796687>()
               )
            )
      );
      int var8 = 0<"JNT",-438714991,"\udeee\udeed뻯㻭Ữ뻭Ử뻧뻧㻧廧","㔎㔮℮","帬䰬樬\ude2b尬听帬䰬䠬昬䐬丬樬\ude2b䠬娬䐬栬栬䀬\ue42b\ue22b\uea2b\ue42b",-2066679519>(
         0<"JNT",-438714991,"\udeee\udeed뻯㻭Ữ뻭Ử绦绦ﻧ㻧黧","㔎㔮\u218eⷎⲮ⺎㗮ⶮ\u2d2eⷎⲮⱮ⹎ⰮⳎ⺎㗮ⱮⶎⰮ\u2e6e\u2e6e⏮㘮㘎㚎㘮㝮","帬䰬樬\ude2b尬听帬䰬䠬昬䐬丬樬\ude2b䠬娬䐬栬栬䀬\ue82b\ue42b\ue22b",-2066679524>(
            (class_310)1<"JNT",1606690928,"膒릒","㴌ﴎ","ܫ\u074bʫﾊK︊K܋ﻊK＊\u000b܋̋kﾊￋ\u008b\ufdca\u058b",-399796700>()
         )
      );
      int var9 = 0<"JNT",-438714991,"\udeee\udeed뻯㻭Ữ뻭Ử뻧\udee7㻦ﻧ","㔎㔮℮","帬䰬樬\ude2b尬听帬䰬䠬昬䐬丬樬\ude2b䠬娬䐬栬栬䀬\ue42b\ue22b\uea2b\ue42b",-2066679512>(
         0<"JNT",-438714991,"\udeee\udeed뻯㻭Ữ뻭Ử绦绦ﻧ㻧黧","㔎㔮\u218eⷎⲮ⺎㗮ⶮ\u2d2eⷎⲮⱮ⹎ⰮⳎ⺎㗮ⱮⶎⰮ\u2e6e\u2e6e⏮㘮㘎㚎㘮㝮","帬䰬樬\ude2b尬听帬䰬䠬昬䐬丬樬\ude2b䠬娬䐬栬栬䀬\ue82b\ue42b\ue22b",-2066679509>(
            (class_310)1<"JNT",1606690928,"膒릒","㴌ﴎ","ܫ\u074bʫﾊK︊K܋ﻊK＊\u000b܋̋kﾊￋ\u008b\ufdca\u058b",-399796697>()
         )
      );
      byte var10 = 70;
      byte var11 = 8;
      int var12 = var10 * 2 + var11;
      int var13 = var12 + 40;
      short var14 = 275;
      int var15 = 0<"JNT",-233425411,"\udeee廬㻯","㔎℮℮㔮℮","嘬䐬測䐬\ude2b娬䐬帬倬\ude2bᰬ䐬樬刬",-2066679523>(var13, var14);
      short var16 = 370;
      int var17 = (var8 - var15) / 2;
      int var18 = (var9 - var16) / 2;
      int var19 = var18 + 45;
      int var20 = var17 + 20;
      if (1<"JNT",-1963550979,"覒妒","ﴏﴎ","ܫ\u074bū",-399796693>(this)) {
         0<"JNT",-438714991,"㻮ửﻭ","㔎₎₎℮℮℮℮㔮⋎","氬䐬",-2066679513>(this, (double)var6, (double)var7, var20, var19, 200, 200);
         return true;
      } else {
         var22 = -1833074068;

         while (true) {
            switch ((var22 ^ 66175015 ^ 978925816) - 1016990988 + 205953636 + 1863809739 + 2100757472) {
               case -1625959940:
               default:
                  return false;
               case 1728874166:
            }

            if (1<"JNT",-1963550979,"閒鶒覒","ﴏﴎ","ܫ\u074bū",-399796742>(this)) {
               0<"JNT",-438714991,"뻮续ﻮ","㔎₎℮℮㔮⋎","氬䐬",-2066679558>(this, (double)var7, var19, 200);
               return true;
            }

            var22 = 582462485 << 582462485 ^ 1477852454;
         }
      }
   }

   // $VF: renamed from: pgf (double, double, int, int, int, int) void
   public void method_2103(double var1, double var3, int var5, int var6, int var7, int var8) {
      1<"JNT",1619810479,"馒높鶒","ﴏﴎ","ܫ\u074bΫ",-399796706>(
         this,
         0<"JNT",-233425411,"\udeee\udeed뻯㻭Ữ뻭Ử廦\udee7黧\udee7㻦","㔎₎₎₎㔮₎","帬䰬樬\ude2b尬听帬䰬䠬昬䐬丬樬\ude2b䠬娬䐬栬栬䀬\ue82b\uec2b\ue82b\ue62b",-2066679516>(
            (var1 - (double)var5) / (double)var7, 0.0, 1.0
         )
      );
      1<"JNT",1619810479,"떒膒馒","ﴏﴎ","ܫ\u074bΫ",-399796704>(
         this,
         0<"JNT",-233425411,"\udeee\udeed뻯㻭Ữ뻭Ử廦\udee7黧\udee7㻦","㔎₎₎₎㔮₎","帬䰬樬\ude2b尬听帬䰬䠬昬䐬丬樬\ude2b䠬娬䐬栬栬䀬\ue82b\uec2b\ue82b\ue62b",-2066679514>(
            1.0 - (var3 - (double)var6) / (double)var8, 0.0, 1.0
         )
      );
   }

   // $VF: renamed from: ljn (double, int, int) void
   public void method_2104(double var1, int var3, int var4) {
      1<"JNT",1619810479,"\ue192ﶒ","ﴏﴎ","ܫ\u074bΫ",-399796702>(
         this,
         0<"JNT",-233425411,"\udeee\udeed뻯㻭Ữ뻭Ử廦\udee7黧\udee7㻦","㔎₎₎₎㔮₎","帬䰬樬\ude2b尬听帬䰬䠬昬䐬丬樬\ude2b䠬娬䐬栬栬䀬\ue82b\uec2b\ue82b\ue62b",-2066679472>(
            (var1 - (double)var3) / (double)var4 * 360.0, 0.0, 359.99
         )
      );
   }

   public boolean method_25404(class_11908 var1) {
      int var2 = 1245803353;
      if (0<"JNT",-438714991,"\udeee\udeed뻯㻭Ữ뻭Ửủ뻧绦绦㻧","㔎㔮℮","帬䰬樬\ude2b尬听帬䰬䠬昬䐬丬樬\ude2b䠬娬䐬栬栬䀬\ue42b\ue42b\uf42b\ue22b\uf22b",-2066679470>(var1) == 256) {
         0<"JNT",-438714991,"\udeee\udeed뻯㻭Ữ뻭Ử廦\udee7㻦ủ","㔎\u218eⷎⲮ⺎㗮ⶮ\u2d2eⷎⲮⱮ⹎ⰮⳎ⺎㗮ⱮⶎⰮ\u2e6e\u2e6e⏮㚎㙮㛮㝮㔮⋎","帬䰬樬\ude2b尬听帬䰬䠬昬䐬丬樬\ude2b䠬娬䐬栬栬䀬\ue82b\ue42b\ue22b",-2066679471>(
            (class_310)1<"JNT",1606690928,"膒릒","㴌ﴎ","ܫ\u074bʫﾊK︊K܋ﻊK＊\u000b܋̋kﾊￋ\u008b\ufdca\u058b",-399796716>(),
            1<"JNT",-1963550979,"ꦒ馒릒떒","ﴏﴎ","ܫ\u074bʫ＊ￋ\ufdca܋ﻪｪ＊ￋ\u008bﺊK￫\ufdca܋\u008bﻊKﺪﺪċ֫ڋ؋\u058b",-399796715>(this)
         );
         return true;
      } else {
         var2 = -1469832706 + (1315409476 >>> 1315409476) ^ 1409449863;

         while (true) {
            switch ((var2 + 1786462932 ^ 1442965914) - 1394897238 - 1406664650 + 20845942 - 1786750990) {
               case 629652971:
                  if (0<"JNT",-438714991,"\udeee\udeed뻯㻭Ữ뻭Ửủ뻧绦绦㻧","㔎㔮℮","帬䰬樬\ude2b尬听帬䰬䠬昬䐬丬樬\ude2b䠬娬䐬栬栬䀬\ue42b\ue42b\uf42b\ue22b\uf22b",-2066679474>(var1)
                     == 257) {
                     0<"JNT",429981674,"廬黭黭\udeed㻮뻯","㔎\u218eⵎⰮ⻎Ⱞ㗮ⶎⰮⷎⳮ㗮⇮ⱎⵎⲮⱮ⺎㝮㔮⋎","嘬䐬測䐬\ude2b氬樬听娬\ude2b丬氬帬䠬樬听怬帬\ude2bࠬ怬帬栬氬尬䰬昬",-2066679475>(
                        1<"JNT",-1963550979,"閒\uf592閒","ﴏﴎ","ܫ\u074bʫﾊK︊K܋\ufdea\ufdcaｪﻊ܋￫\ufdea＊\u008b\ufdcaｪＪ＊܋ҋＪ＊ﺪ\ufdeaﻪￋﺊ\u058b",-399796712>(this),
                        0<"JNT",-438714991,"绮黭","㔎㔮\u218e⸎⻮㝮","氬䐬",-2066679464>(this)
                     );
                     0<"JNT",-438714991,"\udeee\udeed뻯㻭Ữ뻭Ử廦\udee7㻦ủ","㔎\u218eⷎⲮ⺎㗮ⶮ\u2d2eⷎⲮⱮ⹎ⰮⳎ⺎㗮ⱮⶎⰮ\u2e6e\u2e6e⏮㚎㙮㛮㝮㔮⋎","帬䰬樬\ude2b尬听帬䰬䠬昬䐬丬樬\ude2b䠬娬䐬栬栬䀬\ue82b\ue42b\ue22b",-2066679468>(
                        (class_310)1<"JNT",1606690928,"膒릒","㴌ﴎ","ܫ\u074bʫﾊK︊K܋ﻊK＊\u000b܋̋kﾊￋ\u008b\ufdca\u058b",-399796709>(),
                        1<"JNT",-1963550979,"ꦒ馒릒떒","ﴏﴎ","ܫ\u074bʫ＊ￋ\ufdca܋ﻪｪ＊ￋ\u008bﺊK￫\ufdca܋\u008bﻊKﺪﺪċ֫ڋ؋\u058b",-399796660>(this)
                     );
                     return true;
                  }

                  var2 = -863938707;
                  break;
               case 1354723363:
               default:
                  return false;
            }
         }
      }
   }

   // $VF: renamed from: dgj (double, double, int, int, int, int) boolean
   public boolean method_2105(double var1, double var3, int var5, int var6, int var7, int var8) {
      return var1 >= (double)var5 && var1 <= (double)(var5 + var7) && var3 >= (double)var6 && var3 <= (double)(var6 + var8);
   }

   public void method_25420(class_332 var1, int var2, int var3, float var4) {
   }

   public boolean method_25422() {
      return false;
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_2106(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 + 446346341 - 204624961 ^ 1726459853 ^ 960686740) + 1371931335 - 1856600632 ^ 287922976 ^ 1936284621) + 2015127620;
      MethodHandle var10000 = field_2625[((var10 + 446346341 - 204624961 ^ 1726459853 ^ 960686740) + 1371931335 - 1856600632 ^ 287922976 ^ 1936284621)
         + 2015127620
         - 1175784335];
      if (field_2625[var10001 - 1175784335] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = -124345031 ^ -124345031 ^ 0; var23 < var13.length(); var23 += (-1861443824 & 2028753715 | 1) & -1997428667) {
            char var42 = var13.charAt(var23);
            char var47 = (char)(
               (
                        (
                              (
                                       (
                                             (
                                                      (
                                                               (
                                                                     (((var42 & '￠') >> 5 | var42 << 11) - 78 - 14 + 21 & 65520) >> 4
                                                                        | ((var42 & '￠') >> 5 | var42 << 11) - 78 - 14 + 21 << 12
                                                                  )
                                                                  ^ 67
                                                            )
                                                            - 88
                                                         & 65532
                                                   )
                                                   >> 2
                                                | (
                                                         (
                                                               (((var42 & '￠') >> 5 | var42 << 11) - 78 - 14 + 21 & 65520) >> 4
                                                                  | ((var42 & '￠') >> 5 | var42 << 11) - 78 - 14 + 21 << 12
                                                            )
                                                            ^ 67
                                                      )
                                                      - 88
                                                   << 14
                                          )
                                          & 65534
                                    )
                                    >> 1
                                 | (
                                       (
                                                (
                                                         (
                                                               (((var42 & '￠') >> 5 | var42 << 11) - 78 - 14 + 21 & 65520) >> 4
                                                                  | ((var42 & '￠') >> 5 | var42 << 11) - 78 - 14 + 21 << 12
                                                            )
                                                            ^ 67
                                                      )
                                                      - 88
                                                   & 65532
                                             )
                                             >> 2
                                          | (
                                                   (
                                                         (((var42 & '￠') >> 5 | var42 << 11) - 78 - 14 + 21 & 65520) >> 4
                                                            | ((var42 & '￠') >> 5 | var42 << 11) - 78 - 14 + 21 << 12
                                                      )
                                                      ^ 67
                                                )
                                                - 88
                                             << 14
                                    )
                                    << 15
                           )
                           & 65534
                     )
                     >> 1
                  | (
                        (
                                 (
                                       (
                                                (
                                                         (
                                                               (((var42 & '￠') >> 5 | var42 << 11) - 78 - 14 + 21 & 65520) >> 4
                                                                  | ((var42 & '￠') >> 5 | var42 << 11) - 78 - 14 + 21 << 12
                                                            )
                                                            ^ 67
                                                      )
                                                      - 88
                                                   & 65532
                                             )
                                             >> 2
                                          | (
                                                   (
                                                         (((var42 & '￠') >> 5 | var42 << 11) - 78 - 14 + 21 & 65520) >> 4
                                                            | ((var42 & '￠') >> 5 | var42 << 11) - 78 - 14 + 21 << 12
                                                      )
                                                      ^ 67
                                                )
                                                - 88
                                             << 14
                                    )
                                    & 65534
                              )
                              >> 1
                           | (
                                 (
                                          (
                                                   (
                                                         (((var42 & '￠') >> 5 | var42 << 11) - 78 - 14 + 21 & 65520) >> 4
                                                            | ((var42 & '￠') >> 5 | var42 << 11) - 78 - 14 + 21 << 12
                                                      )
                                                      ^ 67
                                                )
                                                - 88
                                             & 65532
                                       )
                                       >> 2
                                    | (
                                             (
                                                   (((var42 & '￠') >> 5 | var42 << 11) - 78 - 14 + 21 & 65520) >> 4
                                                      | ((var42 & '￠') >> 5 | var42 << 11) - 78 - 14 + 21 << 12
                                                )
                                                ^ 67
                                          )
                                          - 88
                                       << 14
                              )
                              << 15
                     )
                     << 15
            );
            var13.setCharAt(
               var23,
               (char)(
                  (
                           (
                                 (
                                          (
                                                (
                                                         (
                                                                  (
                                                                        (((var42 & '￠') >> 5 | var42 << 11) - 78 - 14 + 21 & 65520) >> 4
                                                                           | ((var42 & '￠') >> 5 | var42 << 11) - 78 - 14 + 21 << 12
                                                                     )
                                                                     ^ 67
                                                               )
                                                               - 88
                                                            & 65532
                                                      )
                                                      >> 2
                                                   | (
                                                            (
                                                                  (((var42 & '￠') >> 5 | var42 << 11) - 78 - 14 + 21 & 65520) >> 4
                                                                     | ((var42 & '￠') >> 5 | var42 << 11) - 78 - 14 + 21 << 12
                                                               )
                                                               ^ 67
                                                         )
                                                         - 88
                                                      << 14
                                             )
                                             & 65534
                                       )
                                       >> 1
                                    | (
                                          (
                                                   (
                                                            (
                                                                  (((var42 & '￠') >> 5 | var42 << 11) - 78 - 14 + 21 & 65520) >> 4
                                                                     | ((var42 & '￠') >> 5 | var42 << 11) - 78 - 14 + 21 << 12
                                                               )
                                                               ^ 67
                                                         )
                                                         - 88
                                                      & 65532
                                                )
                                                >> 2
                                             | (
                                                      (
                                                            (((var42 & '￠') >> 5 | var42 << 11) - 78 - 14 + 21 & 65520) >> 4
                                                               | ((var42 & '￠') >> 5 | var42 << 11) - 78 - 14 + 21 << 12
                                                         )
                                                         ^ 67
                                                   )
                                                   - 88
                                                << 14
                                       )
                                       << 15
                              )
                              & 65534
                        )
                        >> 1
                     | (
                           (
                                    (
                                          (
                                                   (
                                                            (
                                                                  (((var42 & '￠') >> 5 | var42 << 11) - 78 - 14 + 21 & 65520) >> 4
                                                                     | ((var42 & '￠') >> 5 | var42 << 11) - 78 - 14 + 21 << 12
                                                               )
                                                               ^ 67
                                                         )
                                                         - 88
                                                      & 65532
                                                )
                                                >> 2
                                             | (
                                                      (
                                                            (((var42 & '￠') >> 5 | var42 << 11) - 78 - 14 + 21 & 65520) >> 4
                                                               | ((var42 & '￠') >> 5 | var42 << 11) - 78 - 14 + 21 << 12
                                                         )
                                                         ^ 67
                                                   )
                                                   - 88
                                                << 14
                                       )
                                       & 65534
                                 )
                                 >> 1
                              | (
                                    (
                                             (
                                                      (
                                                            (((var42 & '￠') >> 5 | var42 << 11) - 78 - 14 + 21 & 65520) >> 4
                                                               | ((var42 & '￠') >> 5 | var42 << 11) - 78 - 14 + 21 << 12
                                                         )
                                                         ^ 67
                                                   )
                                                   - 88
                                                & 65532
                                          )
                                          >> 2
                                       | (
                                                (
                                                      (((var42 & '￠') >> 5 | var42 << 11) - 78 - 14 + 21 & 65520) >> 4
                                                         | ((var42 & '￠') >> 5 | var42 << 11) - 78 - 14 + 21 << 12
                                                   )
                                                   ^ 67
                                             )
                                             - 88
                                          << 14
                                 )
                                 << 15
                        )
                        << 15
               )
            );
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = -1831480166 ^ 696265632 ^ -1151992006; var29 < var16.length(); var29 += -1180269677 >>> -185177295 ^ 23762) {
            char var52 = var16.charAt(var29);
            int var85 = (var52 & 'ﰀ') >> 10;
            int var53 = ((((var52 & 'ﰀ') >> 10 | var52 << 6) ^ 158) - 102 - 193 ^ 181) + 89 - 22 - 253 - 158;
            int var86 = (((((var52 & 'ﰀ') >> 10 | var52 << 6) ^ 158) - 102 - 193 ^ 181) + 89 - 22 - 253 - 158 & 63488) >> 11;
            var52 = (char)(
               ((((var85 | var52 << 6) ^ 158) - 102 - 193 ^ 181) + 89 - 22 - 253 - 158 & 63488) >> 11
                  | ((((var52 & 'ﰀ') >> 10 | var52 << 6) ^ 158) - 102 - 193 ^ 181) + 89 - 22 - 253 - 158 << 5
            );
            var16.setCharAt(var29, (char)(var86 | var53 << 5));
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_330.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = 521650511 >> -2005875750 * -360313647 ^ 7; var35 < var19.length(); var35 += 1410323618 >>> (1410323618 & 780235087) ^ 352580905) {
            int var59 = var19.charAt(var35) - 'x' - 47 - 55;
            char var62 = (char)(
               (
                     (((((var59 & 65532) >> 2 | var59 << 14) + 236 & 65520) >> 4 | ((var59 & 65532) >> 2 | var59 << 14) + 236 << 12) + 164 & 65528) >> 3
                        | ((((var59 & 65532) >> 2 | var59 << 14) + 236 & 65520) >> 4 | ((var59 & 65532) >> 2 | var59 << 14) + 236 << 12) + 164 << 13
                  )
                  + 111
                  + 187
            );
            var19.setCharAt(
               var35,
               (char)(
                  (
                        (((((var59 & 65532) >> 2 | var59 << 14) + 236 & 65520) >> 4 | ((var59 & 65532) >> 2 | var59 << 14) + 236 << 12) + 164 & 65528) >> 3
                           | ((((var59 & 65532) >> 2 | var59 << 14) + 236 & 65520) >> 4 | ((var59 & 65532) >> 2 | var59 << 14) + 236 << 12) + 164 << 13
                     )
                     + 111
                     + 187
               )
            );
         }

         Class var7 = Class.forName(var19.toString(), false, Class_330.class.getClassLoader());
         switch (((var4 ^ 980087575) - 541718412 ^ 285363406) - 198920886 + 121910916 - 849648165 + 1732985854 + 1436731650 + 716045378 - 1394661011) {
            case 136093329:
               var10000 = var0.findConstructor(var7, var6);
               break;
            case 195731084:
            case 1874976279:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 376440808:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            case 582419171:
               var10000 = var0.findSpecial(var7, var5, var6, Class_330.class);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_2625[((var10 + 446346341 - 204624961 ^ 1726459853 ^ 960686740) + 1371931335 - 1856600632 ^ 287922976 ^ 1936284621) + 2015127620 - 1175784335] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_2107(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = (var10 + 1066501162 - 427585663 - 386755346 + 1715300870 - 1187493683 ^ 1210442008) - 1655336219 - 184618953 + 1512019288;
      MethodHandle var10000 = field_2625[(var10 + 1066501162 - 427585663 - 386755346 + 1715300870 - 1187493683 ^ 1210442008)
         - 1655336219
         - 184618953
         + 1512019288
         - 1258366979];
      if (field_2625[var10001 - 1258366979] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = 559306095 & -236725823 ^ 557994305; var24 < var14.length(); var24 += 1527244485 >> 1940145554 ^ 5824) {
            int var43 = var14.charAt(var24);
            int var10004 = (var43 & 61440) >> 12;
            int var44 = ((var43 & 61440) >> 12 | var43 << 4) ^ 45;
            int var88 = ((((var43 & 61440) >> 12 | var43 << 4) ^ 45) & 0) >> 16;
            var43 = ((((var10004 | var43 << 4) ^ 45) & 0) >> 16 | (((var43 & 61440) >> 12 | var43 << 4) ^ 45) << 0) + 7 - 17;
            var10004 = ((var88 | var44 << 0) + 7 - 17 & 65504) >> 5;
            int var46 = (((var88 | var44 << 0) + 7 - 17 & 65504) >> 5 | var43 << 11) ^ 32 ^ 60 ^ 219;
            int var90 = (((((var88 | var44 << 0) + 7 - 17 & 65504) >> 5 | var43 << 11) ^ 32 ^ 60 ^ 219) & 65024) >> 9;
            char var47 = (char)(
               (((var10004 | var43 << 11) ^ 32 ^ 60 ^ 219) & 65024) >> 9 | ((((var88 | var44 << 0) + 7 - 17 & 65504) >> 5 | var43 << 11) ^ 32 ^ 60 ^ 219) << 7
            );
            var14.setCharAt(var24, (char)(var90 | var46 << 7));
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = 1938110251 >> 1519687881 ^ 3785371; var30 < var17.length(); var30 += 2126337399 << -723888204 ^ 1466957825) {
            int var52 = var17.charAt(var30);
            int var91 = (var52 & 65528) >> 3;
            int var53 = (((var52 & 65528) >> 3 | var52 << 13) ^ 236) + 186;
            int var92 = ((((var52 & 65528) >> 3 | var52 << 13) ^ 236) + 186 & 32768) >> 15;
            var52 = (((var91 | var52 << 13) ^ 236) + 186 & 32768) >> 15 | (((var52 & 65528) >> 3 | var52 << 13) ^ 236) + 186 << 1;
            var91 = ((var92 | var53 << 1) & 65535) >> 0;
            int var55 = ((var92 | var53 << 1) & 65535) >> 0 | var52 << 16;
            int var94 = ((((var92 | var53 << 1) & 65535) >> 0 | var52 << 16) & 61440) >> 12;
            char var56 = (char)(((((var91 | var52 << 16) & 61440) >> 12 | (((var92 | var53 << 1) & 65535) >> 0 | var52 << 16) << 4) ^ 192 ^ 26) + 242 - 183);
            var17.setCharAt(var30, (char)(((var94 | var55 << 4) ^ 192 ^ 26) + 242 - 183));
         }

         Class var6 = Class.forName(var17.toString(), false, Class_330.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = (208263695 | 1566208057 | 0) & -1577058048; var36 < var20.length(); var36 += -1584221299 ^ -42916370 ^ 1558419042) {
            int var61 = var20.charAt(var36) + 'u';
            char var66 = (char)(
               (
                        (
                                 (
                                          (
                                                   (
                                                         (
                                                                  (
                                                                        (((var61 & 61440) >> 12 | var61 << 4) & 65528) >> 3
                                                                           | ((var61 & 61440) >> 12 | var61 << 4) << 13
                                                                     )
                                                                     & 65534
                                                               )
                                                               >> 1
                                                            | ((((var61 & 61440) >> 12 | var61 << 4) & 65528) >> 3 | ((var61 & 61440) >> 12 | var61 << 4) << 13)
                                                               << 15
                                                      )
                                                      & 65504
                                                )
                                                >> 5
                                             | (
                                                   (((((var61 & 61440) >> 12 | var61 << 4) & 65528) >> 3 | ((var61 & 61440) >> 12 | var61 << 4) << 13) & 65534)
                                                         >> 1
                                                      | ((((var61 & 61440) >> 12 | var61 << 4) & 65528) >> 3 | ((var61 & 61440) >> 12 | var61 << 4) << 13)
                                                         << 15
                                                )
                                                << 11
                                       )
                                       + 190
                                    & 0
                              )
                              >> 16
                           | (
                                    (
                                             (
                                                   (((((var61 & 61440) >> 12 | var61 << 4) & 65528) >> 3 | ((var61 & 61440) >> 12 | var61 << 4) << 13) & 65534)
                                                         >> 1
                                                      | ((((var61 & 61440) >> 12 | var61 << 4) & 65528) >> 3 | ((var61 & 61440) >> 12 | var61 << 4) << 13)
                                                         << 15
                                                )
                                                & 65504
                                          )
                                          >> 5
                                       | (
                                             (((((var61 & 61440) >> 12 | var61 << 4) & 65528) >> 3 | ((var61 & 61440) >> 12 | var61 << 4) << 13) & 65534) >> 1
                                                | ((((var61 & 61440) >> 12 | var61 << 4) & 65528) >> 3 | ((var61 & 61440) >> 12 | var61 << 4) << 13) << 15
                                          )
                                          << 11
                                 )
                                 + 190
                              << 0
                     )
                     - 172
                     + 5
                  ^ 124
            );
            var20.setCharAt(
               var36,
               (char)(
                  (
                           (
                                    (
                                             (
                                                      (
                                                            (
                                                                     (
                                                                           (((var61 & 61440) >> 12 | var61 << 4) & 65528) >> 3
                                                                              | ((var61 & 61440) >> 12 | var61 << 4) << 13
                                                                        )
                                                                        & 65534
                                                                  )
                                                                  >> 1
                                                               | (
                                                                     (((var61 & 61440) >> 12 | var61 << 4) & 65528) >> 3
                                                                        | ((var61 & 61440) >> 12 | var61 << 4) << 13
                                                                  )
                                                                  << 15
                                                         )
                                                         & 65504
                                                   )
                                                   >> 5
                                                | (
                                                      (
                                                               (
                                                                     (((var61 & 61440) >> 12 | var61 << 4) & 65528) >> 3
                                                                        | ((var61 & 61440) >> 12 | var61 << 4) << 13
                                                                  )
                                                                  & 65534
                                                            )
                                                            >> 1
                                                         | ((((var61 & 61440) >> 12 | var61 << 4) & 65528) >> 3 | ((var61 & 61440) >> 12 | var61 << 4) << 13)
                                                            << 15
                                                   )
                                                   << 11
                                          )
                                          + 190
                                       & 0
                                 )
                                 >> 16
                              | (
                                       (
                                                (
                                                      (
                                                               (
                                                                     (((var61 & 61440) >> 12 | var61 << 4) & 65528) >> 3
                                                                        | ((var61 & 61440) >> 12 | var61 << 4) << 13
                                                                  )
                                                                  & 65534
                                                            )
                                                            >> 1
                                                         | ((((var61 & 61440) >> 12 | var61 << 4) & 65528) >> 3 | ((var61 & 61440) >> 12 | var61 << 4) << 13)
                                                            << 15
                                                   )
                                                   & 65504
                                             )
                                             >> 5
                                          | (
                                                (((((var61 & 61440) >> 12 | var61 << 4) & 65528) >> 3 | ((var61 & 61440) >> 12 | var61 << 4) << 13) & 65534)
                                                      >> 1
                                                   | ((((var61 & 61440) >> 12 | var61 << 4) & 65528) >> 3 | ((var61 & 61440) >> 12 | var61 << 4) << 13) << 15
                                             )
                                             << 11
                                    )
                                    + 190
                                 << 0
                        )
                        - 172
                        + 5
                     ^ 124
               )
            );
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_330.class.getClassLoader()).returnType();
         switch ((var4 + 899285762 + 2054319259 - 1045257920 - 742541506 - 4868058 - 16780841 ^ 1916156679) + 1203582914 - 331686044 + 1867260969) {
            case 357658523:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            case 1617128801:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            case 1963252958:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            case 2043489551:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_2625[(var10 + 1066501162 - 427585663 - 386755346 + 1715300870 - 1187493683 ^ 1210442008) - 1655336219 - 184618953 + 1512019288 - 1258366979] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
