import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;
import java.util.List;
import net.minecraft.class_11909;

public class Class_84 extends Class_375 {
   // $VF: renamed from: mz Class_87
   public Class_87 field_1342;
   // $VF: renamed from: ury Class_262
   public Class_262 field_1343 = (Class_262)0<"JNT",198048649,"즄馇\ue987馇䦈\ue984","ਦࢢࢢࢢਢࡎ","ᆺႚ",-435202276>(30, 30, 35);
   // $VF: renamed from: uph Class_262
   public Class_262 field_1344 = (Class_262)0<"JNT",198048649,"즄馇\ue987馇䦈\ue984","ਦࢢࢢࢢਢࡎ","ᆺႚ",-435202275>(60, 60, 65);
   // $VF: renamed from: ce float
   public float field_1345 = 4.0F;
   // $VF: renamed from: yl int
   public int field_1346 = 15;
   // $VF: renamed from: jqv java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_1347 = new MethodHandle[(2029877838 + -1250251726 | 77) & -1861809825];

   public Class_84(Class_199 var1, Class_271 var2, int var3) {
      super(var1, var2, var3);
      this.field_1342 = (Class_87)var2;
   }

   // $VF: renamed from: vk (RenderEngine_216, int, int, float) void
   @Override
   public void method_1268(RenderEngine_216 var1, int var2, int var3, float var4) {
      int var5 = 0<"JNT",-1508369598,"覈ঈ覈","ਦਢࢢ","ዺᇺ",-435202274>(this) + 5;
      int var6 = 0<"JNT",-1508369598,"ᦈ⦈\ue987","ਦਢࢢ","ዺᇺ",-435202273>(this)
         + 0<"JNT",-1508369598,"\ud987\ud987榇","ਦਢࢢ","ዺᇺ",-435202208>(this)
         + 1<"JNT",689275377,"嵖帶幖","튌튴","䷽䧽짦",-248847224>(this)
         + 9;
      String var15 = 0<"JNT",-1508369598,"榇䦇馈","ਦਢࢶञं࣎ंਪशंमऊਪ࠺ࣖࢾढमऊ\u09da","ዺᆺᅺ",-435202205>(1<"JNT",689275377,"嶖弶","튌튴","䷽䧽\udde6藦ⷦ痦ᇽ",-248847221>(this));
      String var7 = 0<"JNT",-1508369598,"䦈驪㦆䦈⦈馇\ue987禇","ਦਢࢶञं࣎ंਪशंमऊਪ࠺ࣖࢾढमऊ\u09da","ၺᅚჺᅚ᧺်ᅚᇺኚ᧺ᬚ༺ེၚᇺኚᵺლၚ်ᄺዚེ",-435202089>(
         0<"JNT",-1508369598,"ᦇঈঈ妇\ue987䦇","ਦࢶञं࣎ंਪशंमऊਪ࠺ࣖࢾढमऊ\u09daਢࢶञं࣎ंਪशंमऊਪ࠺ࣖࢾढमऊࡾ࣒ढशखऒࢾ\u09da","ၺᅚჺᅚ᧺်ᅚᇺኚ᧺ᬚ༺ེၚᇺኚᵺლၚ်ᄺዚེ",-435202090>(
            0<"JNT",-1508369598,"ᦇঈঈ妇\ue987䦇","ਦࢶञं࣎ंਪशंमऊਪࢪࣾञऒࣺࣖ\u09daਢࢶञं࣎ंਪशंमऊਪ࠺ࣖࢾढमऊࡾ࣒ढशखऒࢾ\u09da","ၺᅚჺᅚ᧺်ᅚᇺኚ᧺ᬚ༺ེၚᇺኚᵺლၚ်ᄺዚེ",-435202091>(
               (StringBuilder)0<"JNT",198048649,"즄馇\ue987馇䦈\ue984","ਦਢࡎ","ၺᅚჺᅚ᧺်ᅚᇺኚ᧺ᬚ༺ེၚᇺኚᵺლၚ်ᄺዚེ",-435202092>(), var15
            ),
            ":"
         )
      );
      0<"JNT",-1508369598,"禇覇","ਦࢶञं࣎ंਪशंमऊਪ࠺ࣖࢾढमऊ\u09da\u0896\u0896ࢶࣆ࣊\u09daਢ\u0896","ᇚჺ",-435202087>(
         var1, var7, (double)var5, (double)var6, 1<"JNT",1497147534,"嵖尖","튌튴","䷽䧽\udde6ⷦ䇦ᇽ",-248847231>()
      );
      String var16 = 0<"JNT",-1508369598,"榇䦇馈","ਦਢࢶञं࣎ंਪशंमऊਪ࠺ࣖࢾढमऊ\u09da","ዺᆺᅺ",-435202085>(1<"JNT",689275377,"嶖弶","튌튴","䷽䧽\udde6藦ⷦ痦ᇽ",-248847229>(this));
      StringBuilder var10000 = 0<"JNT",-1508369598,"ᦇঈঈ妇\ue987䦇","ਦࢶञं࣎ंਪशंमऊਪࢪࣾञऒࣺࣖ\u09daਢࢶञं࣎ंਪशंमऊਪ࠺ࣖࢾढमऊࡾ࣒ढशखऒࢾ\u09da","ၺᅚჺᅚ᧺်ᅚᇺኚ᧺ᬚ༺ེၚᇺኚᵺლၚ်ᄺዚེ",-435202259>(
         (StringBuilder)0<"JNT",198048649,"즄馇\ue987馇䦈\ue984","ਦਢࡎ","ၺᅚჺᅚ᧺်ᅚᇺኚ᧺ᬚ༺ེၚᇺኚᵺლၚ်ᄺዚེ",-435202260>(), var16
      );
      int var10001 = 0;

      StringBuilder var10002;
      for (var10002 = (StringBuilder)0<"JNT",198048649,"즄馇\ue987馇䦈\ue984","ਦࢶञं࣎ंਪशंमऊਪ࠺ࣖࢾढमऊ\u09daਢࡎ","ၺᅚჺᅚ᧺်ᅚᇺኚ᧺ᬚ༺ེၚᇺኚᵺლၚ်ᄺዚེ",-435202258>("ຂୂ");
         var10001 < ((-2042646408 | -2042646408) ^ -2042646406);
         var10001 += 1044934981 & -1047262557
      ) {
         int var19 = 0<"JNT",-1508369598,"㦇覇ᦇ⦈ᦅ䦈","ਦࢢਢࡺ","ၺᅚჺᅚ᧺်ᅚᇺኚ᧺ᬚ༺ེၚᇺኚᵺლၚ်ᄺዚེ",-435202244>(var10002, var10001) - '_' + 132 ^ 7;
         char var20 = (char)(((var19 & 65504) >> 5 | var19 << 11) - 59);
         0<"JNT",-1508369598,"㦈妇䦈㦅覇ᦇ⦈ᦅ䦈","ਦࢢࡺਢࡎ","ၺᅚჺᅚ᧺်ᅚᇺኚ᧺ᬚ༺ེၚᇺኚᵺლၚ်ᄺዚེ",-435202243>(var10002, var10001, (char)(((var19 & 65504) >> 5 | var19 << 11) - 59));
      }

      String var8 = 0<"JNT",-1508369598,"䦈驪㦆䦈⦈馇\ue987禇","ਦਢࢶञं࣎ंਪशंमऊਪ࠺ࣖࢾढमऊ\u09da","ၺᅚჺᅚ᧺်ᅚᇺኚ᧺ᬚ༺ེၚᇺኚᵺლၚ်ᄺዚེ",-435202255>(
         0<"JNT",-1508369598,"ᦇঈঈ妇\ue987䦇","ਦࢶञं࣎ंਪशंमऊਪ࠺ࣖࢾढमऊ\u09daਢࢶञं࣎ंਪशंमऊਪ࠺ࣖࢾढमऊࡾ࣒ढशखऒࢾ\u09da","ၺᅚჺᅚ᧺်ᅚᇺኚ᧺ᬚ༺ེၚᇺኚᵺლၚ်ᄺዚེ",-435202256>(
            var10000, 0<"JNT",-1508369598,"䦈驪㦆䦈⦈馇\ue987禇","ਦਢࢶञं࣎ंਪशंमऊਪ࠺ࣖࢾढमऊ\u09da","ၺᅚჺᅚ᧺်ᅚᇺኚ᧺ᬚ༺ེၚᇺኚᵺლၚ်ᄺዚེ",-435202257>(var10002)
         )
      );
      double var9 = (double)var5 + 0<"JNT",-1508369598,"馈妈ꦇ","ਦࢶञं࣎ंਪशंमऊਪ࠺ࣖࢾढमऊ\u09daਢ\u0896","ᇚჺ",-435202254>(var1, var8) + 5.0;
      int var11 = (int)(
         (double)0<"JNT",-1508369598,"ꦇ覇","ਦਢࢢ","ዺᇺ",-435202253>(this) - var9 + (double)0<"JNT",-1508369598,"覈ঈ覈","ਦਢࢢ","ዺᇺ",-435202268>(this) - 5.0
      );
      int var12 = var6 - 2;
      byte var13 = 18;
      0<"JNT",-1508369598,"\ue987㦇䦇","ਦࢶࣆ࣊\u09da\u0896\u0896\u0896\u0896\u0896\u0896\u0896\u0896ਢࡎ","ᇚჺ",-435202266>(
         var1,
         1<"JNT",689275377,"庖巶島","튌튴","䷽䧽\udde6ⷦ䇦ᇽ",-248847108>(this),
         var9,
         (double)var12,
         var9 + (double)var11,
         (double)(var12 + var13),
         4.0,
         4.0,
         4.0,
         4.0
      );
      0<"JNT",-1508369598,"\ue987㦇䦇","ਦࢶࣆ࣊\u09da\u0896\u0896\u0896\u0896\u0896\u0896\u0896\u0896ਢࡎ","ᇚჺ",-435202264>(
         var1,
         1<"JNT",689275377,"庖帶弖","튌튴","䷽䧽\udde6ⷦ䇦ᇽ",-248847106>(this),
         var9 + 1.0,
         (double)(var12 + 1),
         var9 + (double)var11 - 1.0,
         (double)(var12 + var13 - 1),
         3.5,
         3.5,
         3.5,
         3.5
      );
      String var14 = 0<"JNT",-1508369598,"ᦇ릇","ਦਢࢶञं࣎ंਪशंमऊਪ࠺ࣖࢾढमऊ\u09da","ዺᇺ",-435202263>(this);
      0<"JNT",-1508369598,"禇覇","ਦࢶञं࣎ंਪशंमऊਪ࠺ࣖࢾढमऊ\u09da\u0896\u0896ࢶࣆ࣊\u09daਢ\u0896","ᇚჺ",-435202261>(
         var1, var14, var9 + 4.0, (double)(var12 + 3), 1<"JNT",689275377,"嵖庶嵖","튌튴","䷽䧽\udde6ⷦ䇦ᇽ",-248847117>(this)
      );
   }

   // $VF: renamed from: ak () java.lang.String
   // $VF: Irreducible bytecode was duplicated to produce valid code
   public String method_1311() {
      String var2;
      int var9;
      label94: {
         var9 = 1862533629;
         List var1 = 0<"JNT",-1508369598,"ꦇ릇","ਦਢࢶञं࣎ंਪ࣒ࣖढशਪࢶढࢺࣖ\u09da","ዺᆺᅺ",-435202099>(1<"JNT",689275377,"嶖弶","튌튴","䷽䧽\udde6藦ⷦ痦ᇽ",-248847131>(this));
         int var10000;
         StringBuilder var10001;
         if (0<"JNT",-1558674708,"馇㦈妅\ud987ঈ䦈馈","ਦਢ࡞","ၺᅚჺᅚ᧺ლ༺ၚ်᧺\u1c3aၚ༚༺",-435202098>(var1)) {
            var10000 = (270817494 * -206026719 | 0) & -1602223039;
            var10001 = (StringBuilder)0<"JNT",198048649,"즄馇\ue987馇䦈\ue984","ਦࢶञं࣎ंਪशंमऊਪ࠺ࣖࢾढमऊ\u09daਢࡎ","ၺᅚჺᅚ᧺်ᅚᇺኚ᧺ᬚ༺ེၚᇺኚᵺლၚ်ᄺዚེ",-435202097>(
               "\ueb93\ueb93\ueb93"
            );
            var9 = 1202829801 << 1202829801 ^ 130919585;
         } else {
            var9 = (586990077 | 1023654749) ^ -1822740023;

            label78:
            while (true) {
               switch ((var9 + 529027590 - 1165955308 ^ 1652604598 ^ 515023705 ^ 295326922) - 1593892659) {
                  case -1945803976:
                     if (0<"JNT",-1558674708,"㦈馇ꦈ妇","ਦਢࢢ","ၺᅚჺᅚ᧺ლ༺ၚ်᧺\u1c3aၚ༚༺",-435202058>(var1) == 1) {
                        var2 = (String)0<"JNT",-1558674708,"禇妇䦈","ਦࢢਢࢶञं࣎ंਪशंमऊਪࢪࣾञऒࣺࣖ\u09da","ၺᅚჺᅚ᧺ლ༺ၚ်᧺\u1c3aၚ༚༺",-435202057>(var1, 0);
                        if (0<"JNT",-1508369598,"즇妇\ue987禇䦈覇","ਦਢࢢ","ၺᅚჺᅚ᧺်ᅚᇺኚ᧺ᬚ༺ེၚᇺኚ",-435202056>(var2) <= 15) {
                           return var2;
                        }

                        var9 = -1074712945 & -1074712945 ^ 1872614550;
                        break label94;
                     }

                     var9 = 1250630844 & 879755947 ^ -133696150;
                     break;
                  case 1622712518:
                  default:
                     var10000 = -1464190506 >>> (-1839544270 >> -723366831) ^ 345553;
                     var10001 = (StringBuilder)0<"JNT",198048649,"즄馇\ue987馇䦈\ue984","ਦࢶञं࣎ंਪशंमऊਪ࠺ࣖࢾढमऊ\u09daਢࡎ","ၺᅚჺᅚ᧺်ᅚᇺኚ᧺ᬚ༺ེၚᇺኚᵺლၚ်ᄺዚེ",-435202302>("밯믏");
                     var9 = (69515699 >>> (902857106 >> 1913305639) | -1239620288) & -142805555;
                     break label78;
               }
            }
         }

         label93:
         while (true) {
            switch (((var9 - 796778719 ^ 511287046) - 305244763 ^ 431011222) - 1479792081 ^ 1856831559) {
               case -970385303:
               default:
                  if (var10000 >= (950932042 - -1170315058 ^ 2121247103)) {
                     var9 = 473357866 >>> 196145645 ^ -848350302;
                     switch ((var9 ^ 1076703682 ^ 1455418541) - 1154255836 + 1569726375 ^ 446495036 ^ 708159703) {
                        case -1566652292:
                           var2 = 0<"JNT",-1681397081,"ꦇ驪馇\ue987","ਦࢶञं࣎ंਪशंमऊਪࡺदंࢾ࠺ऒࣂ࣒ऒमࣺऒ\u09daࢶञं࣎ंਪशंमऊਪࢢࣖऒࢾंࣾशऒ\u09daਢࢶञं࣎ंਪशंमऊਪ࠺ࣖࢾढमऊ\u09da","ၺᅚჺᅚ᧺်ᅚᇺኚ᧺ᬚ༺ེၚᇺኚ",-435202060>(
                              0<"JNT",-1508369598,"䦈驪㦆䦈⦈馇\ue987禇","ਦਢࢶञं࣎ंਪशंमऊਪ࠺ࣖࢾढमऊ\u09da","ၺᅚჺᅚ᧺်ᅚᇺኚ᧺ᬚ༺ེၚᇺኚᵺლၚ်ᄺዚེ",-435202301>(var10001), var1
                           );
                           if (0<"JNT",-1508369598,"즇妇\ue987禇䦈覇","ਦਢࢢ","ၺᅚჺᅚ᧺်ᅚᇺኚ᧺ᬚ༺ེၚᇺኚ",-435202059>(var2) <= 15) {
                              return var2;
                           }

                           var9 = 492857375;
                           break label93;
                        case -999689555:
                        default:
                           return 0<"JNT",-1508369598,"䦈驪㦆䦈⦈馇\ue987禇","ਦਢࢶञं࣎ंਪशंमऊਪ࠺ࣖࢾढमऊ\u09da","ၺᅚჺᅚ᧺်ᅚᇺኚ᧺ᬚ༺ེၚᇺኚᵺლၚ်ᄺዚེ",-435202053>(var10001);
                     }
                  }

                  int var26 = 0<"JNT",-1508369598,"㦇覇ᦇ⦈ᦅ䦈","ਦࢢਢࡺ","ၺᅚჺᅚ᧺်ᅚᇺኚ᧺ᬚ༺ེၚᇺኚᵺლၚ်ᄺዚེ",-435202107>(var10001, var10000) + 27;
                  int var48 = (var26 & 65520) >> 4;
                  int var27 = ((var26 & 65520) >> 4 | var26 << 12) ^ 186;
                  int var49 = ((((var26 & 65520) >> 4 | var26 << 12) ^ 186) & 65024) >> 9;
                  char var28 = (char)(((((var48 | var26 << 12) ^ 186) & 65024) >> 9 | (((var26 & 65520) >> 4 | var26 << 12) ^ 186) << 7) - 73);
                  0<"JNT",-1508369598,"㦈妇䦈㦅覇ᦇ⦈ᦅ䦈","ਦࢢࡺਢࡎ","ၺᅚჺᅚ᧺်ᅚᇺኚ᧺ᬚ༺ེၚᇺኚᵺლၚ်ᄺዚེ",-435202106>(var10001, var10000, (char)((var49 | var27 << 7) - 73));
                  var10000 += 1943670136 >> 1943670136 ^ 114;
                  var9 = 1202829801 << 1202829801 ^ 130919585;
                  continue;
               case 679313034:
            }

            if (var10000 >= ((-973139239 >>> 756203939 | 2) & -2042620922)) {
               var9 = (-1827560567 | -908911604 | 740610083) & 1877399731;
               switch ((var9 ^ 1076703682 ^ 1455418541) - 1154255836 + 1569726375 ^ 446495036 ^ 708159703) {
                  case -1566652292:
                     var2 = 0<"JNT",-1681397081,"ꦇ驪馇\ue987","ਦࢶञं࣎ंਪशंमऊਪࡺदंࢾ࠺ऒࣂ࣒ऒमࣺऒ\u09daࢶञं࣎ंਪशंमऊਪࢢࣖऒࢾंࣾशऒ\u09daਢࢶञं࣎ंਪशंमऊਪ࠺ࣖࢾढमऊ\u09da","ၺᅚჺᅚ᧺်ᅚᇺኚ᧺ᬚ༺ེၚᇺኚ",-435202060>(
                        0<"JNT",-1508369598,"䦈驪㦆䦈⦈馇\ue987禇","ਦਢࢶञं࣎ंਪशंमऊਪ࠺ࣖࢾढमऊ\u09da","ၺᅚჺᅚ᧺်ᅚᇺኚ᧺ᬚ༺ེၚᇺኚᵺლၚ်ᄺዚེ",-435202301>(var10001), var1
                     );
                     if (0<"JNT",-1508369598,"즇妇\ue987禇䦈覇","ਦਢࢢ","ၺᅚჺᅚ᧺်ᅚᇺኚ᧺ᬚ༺ེၚᇺኚ",-435202059>(var2) <= 15) {
                        return var2;
                     }

                     var9 = 492857375;
                     break label93;
                  case -999689555:
                  default:
                     return 0<"JNT",-1508369598,"䦈驪㦆䦈⦈馇\ue987禇","ਦਢࢶञं࣎ंਪशंमऊਪ࠺ࣖࢾढमऊ\u09da","ၺᅚჺᅚ᧺်ᅚᇺኚ᧺ᬚ༺ེၚᇺኚᵺლၚ်ᄺዚེ",-435202053>(var10001);
               }
            }

            char var21 = 0<"JNT",-1508369598,"㦇覇ᦇ⦈ᦅ䦈","ਦࢢਢࡺ","ၺᅚჺᅚ᧺်ᅚᇺኚ᧺ᬚ༺ེၚᇺኚᵺლၚ်ᄺዚེ",-435202093>(var10001, var10000);
            int var10004 = (var21 & '쀀') >> 14;
            int var22 = ((var21 & '쀀') >> 14 | var21 << 2) + 91 + 166;
            int var47 = (((var21 & '쀀') >> 14 | var21 << 2) + 91 + 166 & 65504) >> 5;
            var21 = (char)((((var10004 | var21 << 2) + 91 + 166 & 65504) >> 5 | ((var21 & '쀀') >> 14 | var21 << 2) + 91 + 166 << 11) + 159);
            0<"JNT",-1508369598,"㦈妇䦈㦅覇ᦇ⦈ᦅ䦈","ਦࢢࡺਢࡎ","ၺᅚჺᅚ᧺်ᅚᇺኚ᧺ᬚ༺ེၚᇺኚᵺლၚ်ᄺዚེ",-435202108>(var10001, var10000, (char)((var47 | var22 << 11) + 159));
            var10000 += (-1208711363 << -1208711363 | 1) & 315810487;
            var9 = (69515699 >>> (902857106 >> 1913305639) | -1239620288) & -142805555;
         }
      }

      switch ((var9 - 718022495 + 38532767 - 938207244 ^ 1420483962 ^ 765260907) + 1191716528) {
         case 214600946:
         default:
            String var4 = 0<"JNT",-1508369598,"㦈妈⦇㦈䦈⦈馇\ue987禇","ਦࢢࢢਢࢶञं࣎ंਪशंमऊਪ࠺ࣖࢾढमऊ\u09da","ၺᅚჺᅚ᧺်ᅚᇺኚ᧺ᬚ༺ེၚᇺኚ",-435202242>(var2, 0, 12);
            StringBuilder var14 = 0<"JNT",-1508369598,"ᦇঈঈ妇\ue987䦇","ਦࢶञं࣎ंਪशंमऊਪࢪࣾञऒࣺࣖ\u09daਢࢶञं࣎ंਪशंमऊਪ࠺ࣖࢾढमऊࡾ࣒ढशखऒࢾ\u09da","ၺᅚჺᅚ᧺်ᅚᇺኚ᧺ᬚ༺ེၚᇺኚᵺლၚ်ᄺዚེ",-435202304>(
               (StringBuilder)0<"JNT",198048649,"즄馇\ue987馇䦈\ue984","ਦਢࡎ","ၺᅚჺᅚ᧺်ᅚᇺኚ᧺ᬚ༺ེၚᇺኚᵺლၚ်ᄺዚེ",-435202241>(), var4
            );
            int var19 = (-1917836879 | 0) & 1917011464;

            StringBuilder var32;
            for (var32 = (StringBuilder)0<"JNT",198048649,"즄馇\ue987馇䦈\ue984","ਦࢶञं࣎ंਪशंमऊਪ࠺ࣖࢾढमऊ\u09daਢࡎ","ၺᅚჺᅚ᧺်ᅚᇺኚ᧺ᬚ༺ེၚᇺኚᵺლၚ်ᄺዚེ",-435202303>(
                  "\udc9f\udc9f\udc9f"
               );
               var19 < ((-997314985 - 679462245 | 1) & 1114735119);
               var19 += (571404270 * -1803926654 | 1) & 1345506305
            ) {
               char var43 = 0<"JNT",-1508369598,"㦇覇ᦇ⦈ᦅ䦈","ਦࢢਢࡺ","ၺᅚჺᅚ᧺်ᅚᇺኚ᧺ᬚ༺ེၚᇺኚᵺლၚ်ᄺዚེ",-435202055>(var32, var19);
               int var55 = (var43 & '︀') >> 9;
               int var44 = ((var43 & '︀') >> 9 | var43 << 7) + 42;
               int var56 = (((var43 & '︀') >> 9 | var43 << 7) + 42 & 61440) >> 12;
               var43 = (char)((((var55 | var43 << 7) + 42 & 61440) >> 12 | ((var43 & '︀') >> 9 | var43 << 7) + 42 << 4) - 172 - 171);
               0<"JNT",-1508369598,"㦈妇䦈㦅覇ᦇ⦈ᦅ䦈","ਦࢢࡺਢࡎ","ၺᅚჺᅚ᧺်ᅚᇺኚ᧺ᬚ༺ེၚᇺኚᵺლၚ်ᄺዚེ",-435202054>(var32, var19, (char)((var56 | var44 << 4) - 172 - 171));
            }

            return 0<"JNT",-1508369598,"䦈驪㦆䦈⦈馇\ue987禇","ਦਢࢶञं࣎ंਪशंमऊਪ࠺ࣖࢾढमऊ\u09da","ၺᅚჺᅚ᧺်ᅚᇺኚ᧺ᬚ༺ེၚᇺኚᵺლၚ်ᄺዚེ",-435202094>(
               0<"JNT",-1508369598,"ᦇঈঈ妇\ue987䦇","ਦࢶञं࣎ंਪशंमऊਪ࠺ࣖࢾढमऊ\u09daਢࢶञं࣎ंਪशंमऊਪ࠺ࣖࢾढमऊࡾ࣒ढशखऒࢾ\u09da","ၺᅚჺᅚ᧺်ᅚᇺኚ᧺ᬚ༺ེၚᇺኚᵺლၚ်ᄺዚེ",-435202095>(
                  var14, 0<"JNT",-1508369598,"䦈驪㦆䦈⦈馇\ue987禇","ਦਢࢶञं࣎ंਪशंमऊਪ࠺ࣖࢾढमऊ\u09da","ၺᅚჺᅚ᧺်ᅚᇺኚ᧺ᬚ༺ེၚᇺኚᵺლၚ်ᄺዚེ",-435202096>(var32)
               )
            );
         case 1346301708:
            String var3 = 0<"JNT",-1508369598,"㦈妈⦇㦈䦈⦈馇\ue987禇","ਦࢢࢢਢࢶञं࣎ंਪशंमऊਪ࠺ࣖࢾढमऊ\u09da","ၺᅚჺᅚ᧺်ᅚᇺኚ᧺ᬚ༺ེၚᇺኚ",-435202084>(var2, 0, 12);
            StringBuilder var13 = 0<"JNT",-1508369598,"ᦇঈঈ妇\ue987䦇","ਦࢶञं࣎ंਪशंमऊਪࢪࣾञऒࣺࣖ\u09daਢࢶञं࣎ंਪशंमऊਪ࠺ࣖࢾढमऊࡾ࣒ढशखऒࢾ\u09da","ၺᅚჺᅚ᧺်ᅚᇺኚ᧺ᬚ༺ེၚᇺኚᵺლၚ်ᄺዚེ",-435202082>(
               (StringBuilder)0<"JNT",198048649,"즄馇\ue987馇䦈\ue984","ਦਢࡎ","ၺᅚჺᅚ᧺်ᅚᇺኚ᧺ᬚ༺ེၚᇺኚᵺლၚ်ᄺዚེ",-435202083>(), var3
            );
            int var17 = (-1759205237 ^ 1267245220 | 0) & 591619024;

            StringBuilder var30;
            for (var30 = (StringBuilder)0<"JNT",198048649,"즄馇\ue987馇䦈\ue984","ਦࢶञं࣎ंਪशंमऊਪ࠺ࣖࢾढमऊ\u09daਢࡎ","ၺᅚჺᅚ᧺်ᅚᇺኚ᧺ᬚ༺ེၚᇺኚᵺლၚ်ᄺዚེ",-435202081>("固固固");
               var17 < (1895625437 - 616413497 ^ 1279211943);
               var17 += 294808633 >> -1414574666 ^ 71
            ) {
               int var38 = 0<"JNT",-1508369598,"㦇覇ᦇ⦈ᦅ䦈","ਦࢢਢࡺ","ၺᅚჺᅚ᧺်ᅚᇺኚ᧺ᬚ༺ེၚᇺኚᵺლၚ်ᄺዚེ",-435202105>(var30, var17) ^ 251;
               int var10005 = (var38 & 32768) >> 15;
               int var39 = (var38 & 32768) >> 15 | var38 << 1;
               int var54 = (((var38 & 32768) >> 15 | var38 << 1) & 65024) >> 9;
               char var40 = (char)((((var10005 | var38 << 1) & 65024) >> 9 | ((var38 & 32768) >> 15 | var38 << 1) << 7) - 127 ^ 249);
               0<"JNT",-1508369598,"㦈妇䦈㦅覇ᦇ⦈ᦅ䦈","ਦࢢࡺਢࡎ","ၺᅚჺᅚ᧺်ᅚᇺኚ᧺ᬚ༺ེၚᇺኚᵺლၚ်ᄺዚེ",-435202104>(var30, var17, (char)((var54 | var39 << 7) - 127 ^ 249));
            }

            return 0<"JNT",-1508369598,"䦈驪㦆䦈⦈馇\ue987禇","ਦਢࢶञं࣎ंਪशंमऊਪ࠺ࣖࢾढमऊ\u09da","ၺᅚჺᅚ᧺်ᅚᇺኚ᧺ᬚ༺ེၚᇺኚᵺლၚ်ᄺዚེ",-435202101>(
               0<"JNT",-1508369598,"ᦇঈঈ妇\ue987䦇","ਦࢶञं࣎ंਪशंमऊਪ࠺ࣖࢾढमऊ\u09daਢࢶञं࣎ंਪशंमऊਪ࠺ࣖࢾढमऊࡾ࣒ढशखऒࢾ\u09da","ၺᅚჺᅚ᧺်ᅚᇺኚ᧺ᬚ༺ེၚᇺኚᵺლၚ်ᄺዚེ",-435202102>(
                  var13, 0<"JNT",-1508369598,"䦈驪㦆䦈⦈馇\ue987禇","ਦਢࢶञं࣎ंਪशंमऊਪ࠺ࣖࢾढमऊ\u09da","ၺᅚჺᅚ᧺်ᅚᇺኚ᧺ᬚ༺ེၚᇺኚᵺლၚ်ᄺዚེ",-435202103>(var30)
               )
            );
      }
   }

   // $VF: renamed from: yr (net.minecraft.class_11909, boolean) void
   @Override
   public void method_1272(class_11909 var1, boolean var2) {
      if (0<"JNT",-1508369598,"禇覈妈","ਦ\u0896\u0896ਢ࡞","ዺᇺ",-435202270>(
            this,
            0<"JNT",-1508369598,"㦇驪\ud987ঈ閭䦄禄馄覄","ਦਢ\u0896","ᇺዚ༺᧺ᇚၚᇺዚᄚེᅚዺ༺᧺ᄚ်ᅚ༚༚\u139a\u175a\u175aṚᦺṚ",-435202272>(var1),
            0<"JNT",-1508369598,"㦇驪\ud987ঈ閭䦄禄馄馄","ਦਢ\u0896","ᇺዚ༺᧺ᇚၚᇺዚᄚེᅚዺ༺᧺ᄚ်ᅚ༚༚\u139a\u175a\u175aṚᦺṚ",-435202271>(var1)
         )
         && 0<"JNT",-1508369598,"\ud987妇䦈覇驪䦇閭禄䦄⦄䦄妄","ਦਢࢢ","ᇺዚ༺᧺ᇚၚᇺዚᄚེᅚዺ༺᧺ᄚ်ᅚ༚༚\u139a\u175a\u175aṚᦺṚ",-435202269>(var1) == 0) {
         0<"JNT",-1508369598,"\ud987妇䦈覇驪䦇閭ᦄ妄\u0984禄","ਦࢶमऒࣖਪलढमऒࣺࢾंऎࣖਪࣺशंࢺࢺࡪ\u09d6\u09ba\u09ca\u09daਢࡎ","ᇺዚ༺᧺ᇚၚᇺዚᄚེᅚዺ༺᧺ᄚ်ᅚ༚༚\u139a\u171a\u175aᦺ",-435202665>(
            1<"JNT",689275377,"嵶帶","튌튴","䷽䧽\udde6旦秦㷦懽姦䧦旦秦燦㗦槦藦㷦懽燦左槦\u31e6\u31e6ꇦㇽ⧽ⷽᇽ",-248847155>(this),
            (Class_122)0<"JNT",198048649,"즄馇\ue987馇䦈\ue984","ਦࢶऎम\u09daࢶऎࣆࣾ\u09daਢࡎ","ၚዚ",-435202666>(
               this, 1<"JNT",689275377,"嶖弶","튌튴","䷽䧽\udde6藦ⷦ痦ᇽ",-248847156>(this)
            )
         );
      }

      0<"JNT",933021507,"馈⦈","ਦࢶमऒࣖਪलढमऒࣺࢾंऎࣖਪࣺशंࢺࢺࡪূূৢ\u09c6ৢ\u09da࡞ਢࡎ","ႚၺ",-435202664>(this, var1, var2);
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1293(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 ^ 315141214) - 963624876 ^ 234061469 ^ 570477970) - 1481258557 - 1390673533 - 506494321 + 1593305715 ^ 1703290905;
      MethodHandle var10000 = field_1347[(
            ((var10 ^ 315141214) - 963624876 ^ 234061469 ^ 570477970) - 1481258557 - 1390673533 - 506494321 + 1593305715 ^ 1703290905
         )
         - 1338173688];
      if (field_1347[var10001 - 1338173688] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = 365851205 << -1874363370 ^ -1858076672; var23 < var13.length(); var23 += (1899485511 + -806813140 | 1) & 874054657) {
            char var42 = var13.charAt(var23);
            char var49 = (char)(
               (
                        (
                              (
                                       (
                                                (
                                                         (
                                                               (
                                                                        (
                                                                              (
                                                                                       (
                                                                                                (((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0
                                                                                                   | ((var42 & '￠') >> 5 | var42 << 11) << 16
                                                                                             )
                                                                                             + 180
                                                                                          & 61440
                                                                                    )
                                                                                    >> 12
                                                                                 | (
                                                                                          (((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0
                                                                                             | ((var42 & '￠') >> 5 | var42 << 11) << 16
                                                                                       )
                                                                                       + 180
                                                                                    << 4
                                                                           )
                                                                           & 65535
                                                                     )
                                                                     >> 0
                                                                  | (
                                                                        (
                                                                                 (
                                                                                          (((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0
                                                                                             | ((var42 & '￠') >> 5 | var42 << 11) << 16
                                                                                       )
                                                                                       + 180
                                                                                    & 61440
                                                                              )
                                                                              >> 12
                                                                           | (
                                                                                    (((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0
                                                                                       | ((var42 & '￠') >> 5 | var42 << 11) << 16
                                                                                 )
                                                                                 + 180
                                                                              << 4
                                                                     )
                                                                     << 16
                                                            )
                                                            & 65408
                                                      )
                                                      >> 7
                                                   | (
                                                         (
                                                                  (
                                                                        (
                                                                                 (
                                                                                          (((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0
                                                                                             | ((var42 & '￠') >> 5 | var42 << 11) << 16
                                                                                       )
                                                                                       + 180
                                                                                    & 61440
                                                                              )
                                                                              >> 12
                                                                           | (
                                                                                    (((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0
                                                                                       | ((var42 & '￠') >> 5 | var42 << 11) << 16
                                                                                 )
                                                                                 + 180
                                                                              << 4
                                                                     )
                                                                     & 65535
                                                               )
                                                               >> 0
                                                            | (
                                                                  (
                                                                           (
                                                                                    (((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0
                                                                                       | ((var42 & '￠') >> 5 | var42 << 11) << 16
                                                                                 )
                                                                                 + 180
                                                                              & 61440
                                                                        )
                                                                        >> 12
                                                                     | (
                                                                              (((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0
                                                                                 | ((var42 & '￠') >> 5 | var42 << 11) << 16
                                                                           )
                                                                           + 180
                                                                        << 4
                                                               )
                                                               << 16
                                                      )
                                                      << 9
                                             )
                                             - 126
                                             - 162
                                          & 63488
                                    )
                                    >> 11
                                 | (
                                          (
                                                   (
                                                         (
                                                                  (
                                                                        (
                                                                                 (
                                                                                          (((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0
                                                                                             | ((var42 & '￠') >> 5 | var42 << 11) << 16
                                                                                       )
                                                                                       + 180
                                                                                    & 61440
                                                                              )
                                                                              >> 12
                                                                           | (
                                                                                    (((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0
                                                                                       | ((var42 & '￠') >> 5 | var42 << 11) << 16
                                                                                 )
                                                                                 + 180
                                                                              << 4
                                                                     )
                                                                     & 65535
                                                               )
                                                               >> 0
                                                            | (
                                                                  (
                                                                           (
                                                                                    (((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0
                                                                                       | ((var42 & '￠') >> 5 | var42 << 11) << 16
                                                                                 )
                                                                                 + 180
                                                                              & 61440
                                                                        )
                                                                        >> 12
                                                                     | (
                                                                              (((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0
                                                                                 | ((var42 & '￠') >> 5 | var42 << 11) << 16
                                                                           )
                                                                           + 180
                                                                        << 4
                                                               )
                                                               << 16
                                                      )
                                                      & 65408
                                                )
                                                >> 7
                                             | (
                                                   (
                                                            (
                                                                  (
                                                                           (
                                                                                    (((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0
                                                                                       | ((var42 & '￠') >> 5 | var42 << 11) << 16
                                                                                 )
                                                                                 + 180
                                                                              & 61440
                                                                        )
                                                                        >> 12
                                                                     | (
                                                                              (((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0
                                                                                 | ((var42 & '￠') >> 5 | var42 << 11) << 16
                                                                           )
                                                                           + 180
                                                                        << 4
                                                               )
                                                               & 65535
                                                         )
                                                         >> 0
                                                      | (
                                                            (
                                                                     (
                                                                              (((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0
                                                                                 | ((var42 & '￠') >> 5 | var42 << 11) << 16
                                                                           )
                                                                           + 180
                                                                        & 61440
                                                                  )
                                                                  >> 12
                                                               | ((((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0 | ((var42 & '￠') >> 5 | var42 << 11) << 16)
                                                                     + 180
                                                                  << 4
                                                         )
                                                         << 16
                                                )
                                                << 9
                                       )
                                       - 126
                                       - 162
                                    << 5
                           )
                           & 65024
                     )
                     >> 9
                  | (
                        (
                                 (
                                          (
                                                   (
                                                         (
                                                                  (
                                                                        (
                                                                                 (
                                                                                          (((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0
                                                                                             | ((var42 & '￠') >> 5 | var42 << 11) << 16
                                                                                       )
                                                                                       + 180
                                                                                    & 61440
                                                                              )
                                                                              >> 12
                                                                           | (
                                                                                    (((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0
                                                                                       | ((var42 & '￠') >> 5 | var42 << 11) << 16
                                                                                 )
                                                                                 + 180
                                                                              << 4
                                                                     )
                                                                     & 65535
                                                               )
                                                               >> 0
                                                            | (
                                                                  (
                                                                           (
                                                                                    (((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0
                                                                                       | ((var42 & '￠') >> 5 | var42 << 11) << 16
                                                                                 )
                                                                                 + 180
                                                                              & 61440
                                                                        )
                                                                        >> 12
                                                                     | (
                                                                              (((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0
                                                                                 | ((var42 & '￠') >> 5 | var42 << 11) << 16
                                                                           )
                                                                           + 180
                                                                        << 4
                                                               )
                                                               << 16
                                                      )
                                                      & 65408
                                                )
                                                >> 7
                                             | (
                                                   (
                                                            (
                                                                  (
                                                                           (
                                                                                    (((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0
                                                                                       | ((var42 & '￠') >> 5 | var42 << 11) << 16
                                                                                 )
                                                                                 + 180
                                                                              & 61440
                                                                        )
                                                                        >> 12
                                                                     | (
                                                                              (((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0
                                                                                 | ((var42 & '￠') >> 5 | var42 << 11) << 16
                                                                           )
                                                                           + 180
                                                                        << 4
                                                               )
                                                               & 65535
                                                         )
                                                         >> 0
                                                      | (
                                                            (
                                                                     (
                                                                              (((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0
                                                                                 | ((var42 & '￠') >> 5 | var42 << 11) << 16
                                                                           )
                                                                           + 180
                                                                        & 61440
                                                                  )
                                                                  >> 12
                                                               | ((((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0 | ((var42 & '￠') >> 5 | var42 << 11) << 16)
                                                                     + 180
                                                                  << 4
                                                         )
                                                         << 16
                                                )
                                                << 9
                                       )
                                       - 126
                                       - 162
                                    & 63488
                              )
                              >> 11
                           | (
                                    (
                                             (
                                                   (
                                                            (
                                                                  (
                                                                           (
                                                                                    (((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0
                                                                                       | ((var42 & '￠') >> 5 | var42 << 11) << 16
                                                                                 )
                                                                                 + 180
                                                                              & 61440
                                                                        )
                                                                        >> 12
                                                                     | (
                                                                              (((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0
                                                                                 | ((var42 & '￠') >> 5 | var42 << 11) << 16
                                                                           )
                                                                           + 180
                                                                        << 4
                                                               )
                                                               & 65535
                                                         )
                                                         >> 0
                                                      | (
                                                            (
                                                                     (
                                                                              (((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0
                                                                                 | ((var42 & '￠') >> 5 | var42 << 11) << 16
                                                                           )
                                                                           + 180
                                                                        & 61440
                                                                  )
                                                                  >> 12
                                                               | ((((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0 | ((var42 & '￠') >> 5 | var42 << 11) << 16)
                                                                     + 180
                                                                  << 4
                                                         )
                                                         << 16
                                                )
                                                & 65408
                                          )
                                          >> 7
                                       | (
                                             (
                                                      (
                                                            (
                                                                     (
                                                                              (((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0
                                                                                 | ((var42 & '￠') >> 5 | var42 << 11) << 16
                                                                           )
                                                                           + 180
                                                                        & 61440
                                                                  )
                                                                  >> 12
                                                               | ((((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0 | ((var42 & '￠') >> 5 | var42 << 11) << 16)
                                                                     + 180
                                                                  << 4
                                                         )
                                                         & 65535
                                                   )
                                                   >> 0
                                                | (
                                                      (
                                                               ((((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0 | ((var42 & '￠') >> 5 | var42 << 11) << 16)
                                                                     + 180
                                                                  & 61440
                                                            )
                                                            >> 12
                                                         | ((((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0 | ((var42 & '￠') >> 5 | var42 << 11) << 16) + 180
                                                            << 4
                                                   )
                                                   << 16
                                          )
                                          << 9
                                 )
                                 - 126
                                 - 162
                              << 5
                     )
                     << 7
            );
            var13.setCharAt(
               var23,
               (char)(
                  (
                           (
                                 (
                                          (
                                                   (
                                                            (
                                                                  (
                                                                           (
                                                                                 (
                                                                                          (
                                                                                                   (((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0
                                                                                                      | ((var42 & '￠') >> 5 | var42 << 11) << 16
                                                                                                )
                                                                                                + 180
                                                                                             & 61440
                                                                                       )
                                                                                       >> 12
                                                                                    | (
                                                                                             (((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0
                                                                                                | ((var42 & '￠') >> 5 | var42 << 11) << 16
                                                                                          )
                                                                                          + 180
                                                                                       << 4
                                                                              )
                                                                              & 65535
                                                                        )
                                                                        >> 0
                                                                     | (
                                                                           (
                                                                                    (
                                                                                             (((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0
                                                                                                | ((var42 & '￠') >> 5 | var42 << 11) << 16
                                                                                          )
                                                                                          + 180
                                                                                       & 61440
                                                                                 )
                                                                                 >> 12
                                                                              | (
                                                                                       (((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0
                                                                                          | ((var42 & '￠') >> 5 | var42 << 11) << 16
                                                                                    )
                                                                                    + 180
                                                                                 << 4
                                                                        )
                                                                        << 16
                                                               )
                                                               & 65408
                                                         )
                                                         >> 7
                                                      | (
                                                            (
                                                                     (
                                                                           (
                                                                                    (
                                                                                             (((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0
                                                                                                | ((var42 & '￠') >> 5 | var42 << 11) << 16
                                                                                          )
                                                                                          + 180
                                                                                       & 61440
                                                                                 )
                                                                                 >> 12
                                                                              | (
                                                                                       (((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0
                                                                                          | ((var42 & '￠') >> 5 | var42 << 11) << 16
                                                                                    )
                                                                                    + 180
                                                                                 << 4
                                                                        )
                                                                        & 65535
                                                                  )
                                                                  >> 0
                                                               | (
                                                                     (
                                                                              (
                                                                                       (((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0
                                                                                          | ((var42 & '￠') >> 5 | var42 << 11) << 16
                                                                                    )
                                                                                    + 180
                                                                                 & 61440
                                                                           )
                                                                           >> 12
                                                                        | (
                                                                                 (((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0
                                                                                    | ((var42 & '￠') >> 5 | var42 << 11) << 16
                                                                              )
                                                                              + 180
                                                                           << 4
                                                                  )
                                                                  << 16
                                                         )
                                                         << 9
                                                )
                                                - 126
                                                - 162
                                             & 63488
                                       )
                                       >> 11
                                    | (
                                             (
                                                      (
                                                            (
                                                                     (
                                                                           (
                                                                                    (
                                                                                             (((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0
                                                                                                | ((var42 & '￠') >> 5 | var42 << 11) << 16
                                                                                          )
                                                                                          + 180
                                                                                       & 61440
                                                                                 )
                                                                                 >> 12
                                                                              | (
                                                                                       (((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0
                                                                                          | ((var42 & '￠') >> 5 | var42 << 11) << 16
                                                                                    )
                                                                                    + 180
                                                                                 << 4
                                                                        )
                                                                        & 65535
                                                                  )
                                                                  >> 0
                                                               | (
                                                                     (
                                                                              (
                                                                                       (((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0
                                                                                          | ((var42 & '￠') >> 5 | var42 << 11) << 16
                                                                                    )
                                                                                    + 180
                                                                                 & 61440
                                                                           )
                                                                           >> 12
                                                                        | (
                                                                                 (((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0
                                                                                    | ((var42 & '￠') >> 5 | var42 << 11) << 16
                                                                              )
                                                                              + 180
                                                                           << 4
                                                                  )
                                                                  << 16
                                                         )
                                                         & 65408
                                                   )
                                                   >> 7
                                                | (
                                                      (
                                                               (
                                                                     (
                                                                              (
                                                                                       (((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0
                                                                                          | ((var42 & '￠') >> 5 | var42 << 11) << 16
                                                                                    )
                                                                                    + 180
                                                                                 & 61440
                                                                           )
                                                                           >> 12
                                                                        | (
                                                                                 (((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0
                                                                                    | ((var42 & '￠') >> 5 | var42 << 11) << 16
                                                                              )
                                                                              + 180
                                                                           << 4
                                                                  )
                                                                  & 65535
                                                            )
                                                            >> 0
                                                         | (
                                                               (
                                                                        (
                                                                                 (((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0
                                                                                    | ((var42 & '￠') >> 5 | var42 << 11) << 16
                                                                              )
                                                                              + 180
                                                                           & 61440
                                                                     )
                                                                     >> 12
                                                                  | (
                                                                           (((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0
                                                                              | ((var42 & '￠') >> 5 | var42 << 11) << 16
                                                                        )
                                                                        + 180
                                                                     << 4
                                                            )
                                                            << 16
                                                   )
                                                   << 9
                                          )
                                          - 126
                                          - 162
                                       << 5
                              )
                              & 65024
                        )
                        >> 9
                     | (
                           (
                                    (
                                             (
                                                      (
                                                            (
                                                                     (
                                                                           (
                                                                                    (
                                                                                             (((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0
                                                                                                | ((var42 & '￠') >> 5 | var42 << 11) << 16
                                                                                          )
                                                                                          + 180
                                                                                       & 61440
                                                                                 )
                                                                                 >> 12
                                                                              | (
                                                                                       (((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0
                                                                                          | ((var42 & '￠') >> 5 | var42 << 11) << 16
                                                                                    )
                                                                                    + 180
                                                                                 << 4
                                                                        )
                                                                        & 65535
                                                                  )
                                                                  >> 0
                                                               | (
                                                                     (
                                                                              (
                                                                                       (((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0
                                                                                          | ((var42 & '￠') >> 5 | var42 << 11) << 16
                                                                                    )
                                                                                    + 180
                                                                                 & 61440
                                                                           )
                                                                           >> 12
                                                                        | (
                                                                                 (((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0
                                                                                    | ((var42 & '￠') >> 5 | var42 << 11) << 16
                                                                              )
                                                                              + 180
                                                                           << 4
                                                                  )
                                                                  << 16
                                                         )
                                                         & 65408
                                                   )
                                                   >> 7
                                                | (
                                                      (
                                                               (
                                                                     (
                                                                              (
                                                                                       (((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0
                                                                                          | ((var42 & '￠') >> 5 | var42 << 11) << 16
                                                                                    )
                                                                                    + 180
                                                                                 & 61440
                                                                           )
                                                                           >> 12
                                                                        | (
                                                                                 (((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0
                                                                                    | ((var42 & '￠') >> 5 | var42 << 11) << 16
                                                                              )
                                                                              + 180
                                                                           << 4
                                                                  )
                                                                  & 65535
                                                            )
                                                            >> 0
                                                         | (
                                                               (
                                                                        (
                                                                                 (((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0
                                                                                    | ((var42 & '￠') >> 5 | var42 << 11) << 16
                                                                              )
                                                                              + 180
                                                                           & 61440
                                                                     )
                                                                     >> 12
                                                                  | (
                                                                           (((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0
                                                                              | ((var42 & '￠') >> 5 | var42 << 11) << 16
                                                                        )
                                                                        + 180
                                                                     << 4
                                                            )
                                                            << 16
                                                   )
                                                   << 9
                                          )
                                          - 126
                                          - 162
                                       & 63488
                                 )
                                 >> 11
                              | (
                                       (
                                                (
                                                      (
                                                               (
                                                                     (
                                                                              (
                                                                                       (((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0
                                                                                          | ((var42 & '￠') >> 5 | var42 << 11) << 16
                                                                                    )
                                                                                    + 180
                                                                                 & 61440
                                                                           )
                                                                           >> 12
                                                                        | (
                                                                                 (((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0
                                                                                    | ((var42 & '￠') >> 5 | var42 << 11) << 16
                                                                              )
                                                                              + 180
                                                                           << 4
                                                                  )
                                                                  & 65535
                                                            )
                                                            >> 0
                                                         | (
                                                               (
                                                                        (
                                                                                 (((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0
                                                                                    | ((var42 & '￠') >> 5 | var42 << 11) << 16
                                                                              )
                                                                              + 180
                                                                           & 61440
                                                                     )
                                                                     >> 12
                                                                  | (
                                                                           (((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0
                                                                              | ((var42 & '￠') >> 5 | var42 << 11) << 16
                                                                        )
                                                                        + 180
                                                                     << 4
                                                            )
                                                            << 16
                                                   )
                                                   & 65408
                                             )
                                             >> 7
                                          | (
                                                (
                                                         (
                                                               (
                                                                        (
                                                                                 (((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0
                                                                                    | ((var42 & '￠') >> 5 | var42 << 11) << 16
                                                                              )
                                                                              + 180
                                                                           & 61440
                                                                     )
                                                                     >> 12
                                                                  | (
                                                                           (((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0
                                                                              | ((var42 & '￠') >> 5 | var42 << 11) << 16
                                                                        )
                                                                        + 180
                                                                     << 4
                                                            )
                                                            & 65535
                                                      )
                                                      >> 0
                                                   | (
                                                         (
                                                                  ((((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0 | ((var42 & '￠') >> 5 | var42 << 11) << 16)
                                                                        + 180
                                                                     & 61440
                                                               )
                                                               >> 12
                                                            | ((((var42 & '￠') >> 5 | var42 << 11) & 65535) >> 0 | ((var42 & '￠') >> 5 | var42 << 11) << 16)
                                                                  + 180
                                                               << 4
                                                      )
                                                      << 16
                                             )
                                             << 9
                                    )
                                    - 126
                                    - 162
                                 << 5
                        )
                        << 7
               )
            );
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = (154438525 & 728284499 | 0) & 5067406; var29 < var16.length(); var29 += (-40847476 >>> -770139578 | 1) & 872514593) {
            char var54 = var16.charAt(var29);
            char var59 = (char)(
               (
                     (
                              (
                                    (
                                             (
                                                      (
                                                            (
                                                                     (
                                                                           (
                                                                                 (((var54 & '쀀') >> 14 | var54 << 2) - 226 & 65024) >> 9
                                                                                    | ((var54 & '쀀') >> 14 | var54 << 2) - 226 << 7
                                                                              )
                                                                              ^ 199
                                                                        )
                                                                        & 32768
                                                                  )
                                                                  >> 15
                                                               | (
                                                                     (
                                                                           (((var54 & '쀀') >> 14 | var54 << 2) - 226 & 65024) >> 9
                                                                              | ((var54 & '쀀') >> 14 | var54 << 2) - 226 << 7
                                                                        )
                                                                        ^ 199
                                                                  )
                                                                  << 1
                                                         )
                                                         & 65528
                                                   )
                                                   >> 3
                                                | (
                                                      (
                                                               (
                                                                     (
                                                                           (((var54 & '쀀') >> 14 | var54 << 2) - 226 & 65024) >> 9
                                                                              | ((var54 & '쀀') >> 14 | var54 << 2) - 226 << 7
                                                                        )
                                                                        ^ 199
                                                                  )
                                                                  & 32768
                                                            )
                                                            >> 15
                                                         | (
                                                               (
                                                                     (((var54 & '쀀') >> 14 | var54 << 2) - 226 & 65024) >> 9
                                                                        | ((var54 & '쀀') >> 14 | var54 << 2) - 226 << 7
                                                                  )
                                                                  ^ 199
                                                            )
                                                            << 1
                                                   )
                                                   << 13
                                          )
                                          - 100
                                       ^ 145
                                 )
                                 & 65024
                           )
                           >> 9
                        | (
                              (
                                       (
                                                (
                                                      (
                                                               (
                                                                     (
                                                                           (((var54 & '쀀') >> 14 | var54 << 2) - 226 & 65024) >> 9
                                                                              | ((var54 & '쀀') >> 14 | var54 << 2) - 226 << 7
                                                                        )
                                                                        ^ 199
                                                                  )
                                                                  & 32768
                                                            )
                                                            >> 15
                                                         | (
                                                               (
                                                                     (((var54 & '쀀') >> 14 | var54 << 2) - 226 & 65024) >> 9
                                                                        | ((var54 & '쀀') >> 14 | var54 << 2) - 226 << 7
                                                                  )
                                                                  ^ 199
                                                            )
                                                            << 1
                                                   )
                                                   & 65528
                                             )
                                             >> 3
                                          | (
                                                (
                                                         (
                                                               (
                                                                     (((var54 & '쀀') >> 14 | var54 << 2) - 226 & 65024) >> 9
                                                                        | ((var54 & '쀀') >> 14 | var54 << 2) - 226 << 7
                                                                  )
                                                                  ^ 199
                                                            )
                                                            & 32768
                                                      )
                                                      >> 15
                                                   | (
                                                         (
                                                               (((var54 & '쀀') >> 14 | var54 << 2) - 226 & 65024) >> 9
                                                                  | ((var54 & '쀀') >> 14 | var54 << 2) - 226 << 7
                                                            )
                                                            ^ 199
                                                      )
                                                      << 1
                                             )
                                             << 13
                                    )
                                    - 100
                                 ^ 145
                           )
                           << 7
                  )
                  ^ 51
            );
            var16.setCharAt(
               var29,
               (char)(
                  (
                        (
                                 (
                                       (
                                                (
                                                         (
                                                               (
                                                                        (
                                                                              (
                                                                                    (((var54 & '쀀') >> 14 | var54 << 2) - 226 & 65024) >> 9
                                                                                       | ((var54 & '쀀') >> 14 | var54 << 2) - 226 << 7
                                                                                 )
                                                                                 ^ 199
                                                                           )
                                                                           & 32768
                                                                     )
                                                                     >> 15
                                                                  | (
                                                                        (
                                                                              (((var54 & '쀀') >> 14 | var54 << 2) - 226 & 65024) >> 9
                                                                                 | ((var54 & '쀀') >> 14 | var54 << 2) - 226 << 7
                                                                           )
                                                                           ^ 199
                                                                     )
                                                                     << 1
                                                            )
                                                            & 65528
                                                      )
                                                      >> 3
                                                   | (
                                                         (
                                                                  (
                                                                        (
                                                                              (((var54 & '쀀') >> 14 | var54 << 2) - 226 & 65024) >> 9
                                                                                 | ((var54 & '쀀') >> 14 | var54 << 2) - 226 << 7
                                                                           )
                                                                           ^ 199
                                                                     )
                                                                     & 32768
                                                               )
                                                               >> 15
                                                            | (
                                                                  (
                                                                        (((var54 & '쀀') >> 14 | var54 << 2) - 226 & 65024) >> 9
                                                                           | ((var54 & '쀀') >> 14 | var54 << 2) - 226 << 7
                                                                     )
                                                                     ^ 199
                                                               )
                                                               << 1
                                                      )
                                                      << 13
                                             )
                                             - 100
                                          ^ 145
                                    )
                                    & 65024
                              )
                              >> 9
                           | (
                                 (
                                          (
                                                   (
                                                         (
                                                                  (
                                                                        (
                                                                              (((var54 & '쀀') >> 14 | var54 << 2) - 226 & 65024) >> 9
                                                                                 | ((var54 & '쀀') >> 14 | var54 << 2) - 226 << 7
                                                                           )
                                                                           ^ 199
                                                                     )
                                                                     & 32768
                                                               )
                                                               >> 15
                                                            | (
                                                                  (
                                                                        (((var54 & '쀀') >> 14 | var54 << 2) - 226 & 65024) >> 9
                                                                           | ((var54 & '쀀') >> 14 | var54 << 2) - 226 << 7
                                                                     )
                                                                     ^ 199
                                                               )
                                                               << 1
                                                      )
                                                      & 65528
                                                )
                                                >> 3
                                             | (
                                                   (
                                                            (
                                                                  (
                                                                        (((var54 & '쀀') >> 14 | var54 << 2) - 226 & 65024) >> 9
                                                                           | ((var54 & '쀀') >> 14 | var54 << 2) - 226 << 7
                                                                     )
                                                                     ^ 199
                                                               )
                                                               & 32768
                                                         )
                                                         >> 15
                                                      | (
                                                            (
                                                                  (((var54 & '쀀') >> 14 | var54 << 2) - 226 & 65024) >> 9
                                                                     | ((var54 & '쀀') >> 14 | var54 << 2) - 226 << 7
                                                               )
                                                               ^ 199
                                                         )
                                                         << 1
                                                )
                                                << 13
                                       )
                                       - 100
                                    ^ 145
                              )
                              << 7
                     )
                     ^ 51
               )
            );
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_84.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = 427453561 + 1903431363 ^ -1964082372;
            var35 < var19.length();
            var35 += (-1960365409 >> (-1587827977 << (-1960365409 & -1587827977)) | 1) & 1423444065
         ) {
            int var64 = (var19.charAt(var35) ^ 215) - 189;
            int var104 = (var64 & 57344) >> 13;
            int var65 = (var64 & 57344) >> 13 | var64 << 3;
            int var105 = (((var64 & 57344) >> 13 | var64 << 3) & 61440) >> 12;
            var64 = ((var104 | var64 << 3) & 61440) >> 12 | ((var64 & 57344) >> 13 | var64 << 3) << 4;
            var104 = ((var105 | var65 << 4) & 64512) >> 10;
            int var67 = (((var105 | var65 << 4) & 64512) >> 10 | var64 << 6) + 38;
            int var107 = ((((var105 | var65 << 4) & 64512) >> 10 | var64 << 6) + 38 & 65532) >> 2;
            char var68 = (char)(
               ((((var104 | var64 << 6) + 38 & 65532) >> 2 | (((var105 | var65 << 4) & 64512) >> 10 | var64 << 6) + 38 << 14) ^ 39 ^ 127) - 103
            );
            var19.setCharAt(var35, (char)(((var107 | var67 << 14) ^ 39 ^ 127) - 103));
         }

         Class var7 = Class.forName(var19.toString(), false, Class_84.class.getClassLoader());
         switch (((var4 + 1137956163 + 807778106 ^ 117383745) + 948200800 - 982442560 ^ 1199487082) - 605189001 + 1638783010 - 1641266308 + 1113221043) {
            case 172121235:
               var10000 = var0.findSpecial(var7, var5, var6, Class_84.class);
               break;
            case 1316136149:
               var10000 = var0.findConstructor(var7, var6);
               break;
            case 1584361655:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            case 1723733994:
            case 2075967804:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_1347[(((var10 ^ 315141214) - 963624876 ^ 234061469 ^ 570477970) - 1481258557 - 1390673533 - 506494321 + 1593305715 ^ 1703290905) - 1338173688] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1294(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = (var10 ^ 1285428400 ^ 2052363529) + 1679277881 - 1461563527 + 1928709554 - 398691496 + 635186037 - 2022134329 - 473724500;
      MethodHandle var10000 = field_1347[(var10 ^ 1285428400 ^ 2052363529)
         + 1679277881
         - 1461563527
         + 1928709554
         - 398691496
         + 635186037
         - 2022134329
         - 473724500
         + 1054535728];
      if (field_1347[var10001 + 1054535728] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = (192885364 | -548286852) ^ -545259908; var24 < var14.length(); var24 += (72477573 * -936541628 | 1) & 1375773867) {
            char var43 = var14.charAt(var24);
            char var48 = (char)(
               (
                        (
                              (
                                       (
                                             (
                                                      (
                                                            (
                                                                     ((((var43 & '쀀') >> 14 | var43 << 2) ^ 4) - 47 + 93 & 49152) >> 14
                                                                        | (((var43 & '쀀') >> 14 | var43 << 2) ^ 4) - 47 + 93 << 2
                                                                  )
                                                                  + 15
                                                               ^ 60
                                                         )
                                                         & 65504
                                                   )
                                                   >> 5
                                                | (
                                                      (
                                                               ((((var43 & '쀀') >> 14 | var43 << 2) ^ 4) - 47 + 93 & 49152) >> 14
                                                                  | (((var43 & '쀀') >> 14 | var43 << 2) ^ 4) - 47 + 93 << 2
                                                            )
                                                            + 15
                                                         ^ 60
                                                   )
                                                   << 11
                                          )
                                          & 0
                                    )
                                    >> 16
                                 | (
                                       (
                                                (
                                                      (
                                                               ((((var43 & '쀀') >> 14 | var43 << 2) ^ 4) - 47 + 93 & 49152) >> 14
                                                                  | (((var43 & '쀀') >> 14 | var43 << 2) ^ 4) - 47 + 93 << 2
                                                            )
                                                            + 15
                                                         ^ 60
                                                   )
                                                   & 65504
                                             )
                                             >> 5
                                          | (
                                                (
                                                         ((((var43 & '쀀') >> 14 | var43 << 2) ^ 4) - 47 + 93 & 49152) >> 14
                                                            | (((var43 & '쀀') >> 14 | var43 << 2) ^ 4) - 47 + 93 << 2
                                                      )
                                                      + 15
                                                   ^ 60
                                             )
                                             << 11
                                    )
                                    << 0
                           )
                           & 65520
                     )
                     >> 4
                  | (
                        (
                                 (
                                       (
                                                (
                                                      (
                                                               ((((var43 & '쀀') >> 14 | var43 << 2) ^ 4) - 47 + 93 & 49152) >> 14
                                                                  | (((var43 & '쀀') >> 14 | var43 << 2) ^ 4) - 47 + 93 << 2
                                                            )
                                                            + 15
                                                         ^ 60
                                                   )
                                                   & 65504
                                             )
                                             >> 5
                                          | (
                                                (
                                                         ((((var43 & '쀀') >> 14 | var43 << 2) ^ 4) - 47 + 93 & 49152) >> 14
                                                            | (((var43 & '쀀') >> 14 | var43 << 2) ^ 4) - 47 + 93 << 2
                                                      )
                                                      + 15
                                                   ^ 60
                                             )
                                             << 11
                                    )
                                    & 0
                              )
                              >> 16
                           | (
                                 (
                                          (
                                                (
                                                         ((((var43 & '쀀') >> 14 | var43 << 2) ^ 4) - 47 + 93 & 49152) >> 14
                                                            | (((var43 & '쀀') >> 14 | var43 << 2) ^ 4) - 47 + 93 << 2
                                                      )
                                                      + 15
                                                   ^ 60
                                             )
                                             & 65504
                                       )
                                       >> 5
                                    | (
                                          (
                                                   ((((var43 & '쀀') >> 14 | var43 << 2) ^ 4) - 47 + 93 & 49152) >> 14
                                                      | (((var43 & '쀀') >> 14 | var43 << 2) ^ 4) - 47 + 93 << 2
                                                )
                                                + 15
                                             ^ 60
                                       )
                                       << 11
                              )
                              << 0
                     )
                     << 12
            );
            var14.setCharAt(
               var24,
               (char)(
                  (
                           (
                                 (
                                          (
                                                (
                                                         (
                                                               (
                                                                        ((((var43 & '쀀') >> 14 | var43 << 2) ^ 4) - 47 + 93 & 49152) >> 14
                                                                           | (((var43 & '쀀') >> 14 | var43 << 2) ^ 4) - 47 + 93 << 2
                                                                     )
                                                                     + 15
                                                                  ^ 60
                                                            )
                                                            & 65504
                                                      )
                                                      >> 5
                                                   | (
                                                         (
                                                                  ((((var43 & '쀀') >> 14 | var43 << 2) ^ 4) - 47 + 93 & 49152) >> 14
                                                                     | (((var43 & '쀀') >> 14 | var43 << 2) ^ 4) - 47 + 93 << 2
                                                               )
                                                               + 15
                                                            ^ 60
                                                      )
                                                      << 11
                                             )
                                             & 0
                                       )
                                       >> 16
                                    | (
                                          (
                                                   (
                                                         (
                                                                  ((((var43 & '쀀') >> 14 | var43 << 2) ^ 4) - 47 + 93 & 49152) >> 14
                                                                     | (((var43 & '쀀') >> 14 | var43 << 2) ^ 4) - 47 + 93 << 2
                                                               )
                                                               + 15
                                                            ^ 60
                                                      )
                                                      & 65504
                                                )
                                                >> 5
                                             | (
                                                   (
                                                            ((((var43 & '쀀') >> 14 | var43 << 2) ^ 4) - 47 + 93 & 49152) >> 14
                                                               | (((var43 & '쀀') >> 14 | var43 << 2) ^ 4) - 47 + 93 << 2
                                                         )
                                                         + 15
                                                      ^ 60
                                                )
                                                << 11
                                       )
                                       << 0
                              )
                              & 65520
                        )
                        >> 4
                     | (
                           (
                                    (
                                          (
                                                   (
                                                         (
                                                                  ((((var43 & '쀀') >> 14 | var43 << 2) ^ 4) - 47 + 93 & 49152) >> 14
                                                                     | (((var43 & '쀀') >> 14 | var43 << 2) ^ 4) - 47 + 93 << 2
                                                               )
                                                               + 15
                                                            ^ 60
                                                      )
                                                      & 65504
                                                )
                                                >> 5
                                             | (
                                                   (
                                                            ((((var43 & '쀀') >> 14 | var43 << 2) ^ 4) - 47 + 93 & 49152) >> 14
                                                               | (((var43 & '쀀') >> 14 | var43 << 2) ^ 4) - 47 + 93 << 2
                                                         )
                                                         + 15
                                                      ^ 60
                                                )
                                                << 11
                                       )
                                       & 0
                                 )
                                 >> 16
                              | (
                                    (
                                             (
                                                   (
                                                            ((((var43 & '쀀') >> 14 | var43 << 2) ^ 4) - 47 + 93 & 49152) >> 14
                                                               | (((var43 & '쀀') >> 14 | var43 << 2) ^ 4) - 47 + 93 << 2
                                                         )
                                                         + 15
                                                      ^ 60
                                                )
                                                & 65504
                                          )
                                          >> 5
                                       | (
                                             (
                                                      ((((var43 & '쀀') >> 14 | var43 << 2) ^ 4) - 47 + 93 & 49152) >> 14
                                                         | (((var43 & '쀀') >> 14 | var43 << 2) ^ 4) - 47 + 93 << 2
                                                   )
                                                   + 15
                                                ^ 60
                                          )
                                          << 11
                                 )
                                 << 0
                        )
                        << 12
               )
            );
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = 573356215 - 1345091305 ^ -771735090; var30 < var17.length(); var30 += (-1458604636 >>> -1458604636 | 1) & 1950875781) {
            int var53 = var17.charAt(var30) ^ 210;
            int var92 = (var53 & 65532) >> 2;
            int var54 = (var53 & 65532) >> 2 | var53 << 14;
            int var93 = (((var53 & 65532) >> 2 | var53 << 14) & 65535) >> 0;
            var53 = (((var92 | var53 << 14) & 65535) >> 0 | ((var53 & 65532) >> 2 | var53 << 14) << 16) + 62 ^ 242;
            var92 = (((var93 | var54 << 16) + 62 ^ 242) & 65520) >> 4;
            int var56 = ((((var93 | var54 << 16) + 62 ^ 242) & 65520) >> 4 | var53 << 12) + 25 + 168;
            int var95 = (((((var93 | var54 << 16) + 62 ^ 242) & 65520) >> 4 | var53 << 12) + 25 + 168 & 64512) >> 10;
            char var57 = (char)(
               (((var92 | var53 << 12) + 25 + 168 & 64512) >> 10 | ((((var93 | var54 << 16) + 62 ^ 242) & 65520) >> 4 | var53 << 12) + 25 + 168 << 6) ^ 185
            );
            var17.setCharAt(var30, (char)((var95 | var56 << 6) ^ 185));
         }

         Class var6 = Class.forName(var17.toString(), false, Class_84.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = (-2068792496 * (977587611 >>> -2011334805) | 0) & 1375767594;
            var36 < var20.length();
            var36 += (-930784356 * 1747762154 | 1) & 18566663
         ) {
            int var62 = var20.charAt(var36);
            int var96 = (var62 & 63488) >> 11;
            int var63 = ((var62 & 63488) >> 11 | var62 << 5) - 238 + 173 ^ 28;
            int var97 = ((((var62 & 63488) >> 11 | var62 << 5) - 238 + 173 ^ 28) & 65504) >> 5;
            var62 = (((((var96 | var62 << 5) - 238 + 173 ^ 28) & 65504) >> 5 | (((var62 & 63488) >> 11 | var62 << 5) - 238 + 173 ^ 28) << 11) ^ 116) + 177;
            var96 = (((var97 | var63 << 11) ^ 116) + 177 & 65528) >> 3;
            int var65 = ((((var97 | var63 << 11) ^ 116) + 177 & 65528) >> 3 | var62 << 13) ^ 200;
            int var99 = ((((((var97 | var63 << 11) ^ 116) + 177 & 65528) >> 3 | var62 << 13) ^ 200) & 65408) >> 7;
            char var66 = (char)((((var96 | var62 << 13) ^ 200) & 65408) >> 7 | (((((var97 | var63 << 11) ^ 116) + 177 & 65528) >> 3 | var62 << 13) ^ 200) << 9);
            var20.setCharAt(var36, (char)(var99 | var65 << 9));
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_84.class.getClassLoader()).returnType();
         switch (((var4 + 1998415514 - 1027161195 ^ 1159343438) + 1826417487 ^ 1243916159 ^ 803233960) - 353859712 + 2051861561 - 1740774023 + 1151268616) {
            case 296737711:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            case 857144228:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            case 1609629131:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            case 1759870159:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_1347[(var10 ^ 1285428400 ^ 2052363529) + 1679277881 - 1461563527 + 1928709554 - 398691496 + 635186037 - 2022134329 - 473724500 + 1054535728] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
