import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;

public enum Class_265 {
   // $VF: renamed from: ktd Class_265
   field_1088,
   // $VF: renamed from: uz Class_265
   field_1089;

   // $VF: renamed from: xyu java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_1091 = new MethodHandle[16];

   @Override
   public String toString() {
      return 0<"JNT",1775439921,"糽㳺㳽㳻","擄敄盄ׄń\u0bc4ń桄ۄń߄ф桄穄ૄৄՄ߄ф湄","ⲭҭ",2048609796>(this);
   }

   // $VF: Failed to inline enum fields
   // Please report this to the Vineflower issue tracker, at https://github.com/Vineflower/vineflower/issues with a copy of the class file (if you have the rights to distribute it!)
   static {
      int var10000 = (1564950374 >> 1564950374 | 0) & -99982848;

      StringBuilder var10001;
      for (var10001 = (StringBuilder)0<"JNT",-1875155568,"ﳰ㳼糽㳼ﳾ糱","擄盄ׄń\u0bc4ń桄ۄń߄ф桄穄ૄৄՄ߄ф湄敄範","쒭\ue0ad㒭\ue0ad풬\udcad\ue0ad풭좭풬뢭㲭⒭삭풭좭撬キ삭\udcadﲭ\uf0ad⒭",2048609798>(
            "ૐ\u0a50࣐\u09d0ૐܰ"
         );
         var10000 < ((-340258744 | 2138999865 & 2138999865) ^ -91009);
         var10000 += (1601570452 + 1152410156 | 1) & 1119949105
      ) {
         int var6 = 0<"JNT",1775439921,"볺ﳻ㳺糾㳲ﳾ","擄畄敄牄","쒭\ue0ad㒭\ue0ad풬\udcad\ue0ad풭좭풬뢭㲭⒭삭풭좭撬キ삭\udcadﲭ\uf0ad⒭",2048609804>(var10001, var10000) - 238 + 100 ^ 38;
         int var10004 = (var6 & 61440) >> 12;
         int var7 = (var6 & 61440) >> 12 | var6 << 4;
         int var20 = (((var6 & 61440) >> 12 | var6 << 4) & 65024) >> 9;
         char var8 = (char)(((var10004 | var6 << 4) & 65024) >> 9 | ((var6 & 61440) >> 12 | var6 << 4) << 7);
         0<"JNT",1775439921,"볾㳻ﳾ볲ﳻ㳺糾㳲ﳾ","擄畄牄敄範","쒭\ue0ad㒭\ue0ad풬\udcad\ue0ad풭좭풬뢭㲭⒭삭풭좭撬キ삭\udcadﲭ\uf0ad⒭",2048609803>(
            var10001, var10000, (char)(var20 | var7 << 7)
         );
      }

      field_1088 = (Class_265)0<"JNT",-1875155568,"ﳰ㳼糽㳼ﳾ糱","擄盄ׄń\u0bc4ń桄ۄń߄ф桄穄ૄৄՄ߄ф湄畄敄範","ⲭҭ",2048609800>(
         0<"JNT",1775439921,"ﳾ볽볶ﳾ糾㳼糽볻","擄敄盄ׄń\u0bc4ń桄ۄń߄ф桄穄ૄৄՄ߄ф湄","쒭\ue0ad㒭\ue0ad풬\udcad\ue0ad풭좭풬뢭㲭⒭삭풭좭撬キ삭\udcadﲭ\uf0ad⒭",2048609797>(var10001), 0
      );
      var10000 = 31094354 - (31094354 >>> 1071551293) ^ 31094354;

      for (var10001 = (StringBuilder)0<"JNT",-1875155568,"ﳰ㳼糽㳼ﳾ糱","擄盄ׄń\u0bc4ń桄ۄń߄ф桄穄ૄৄՄ߄ф湄敄範","쒭\ue0ad㒭\ue0ad풬\udcad\ue0ad풭좭풬뢭㲭⒭삭풭좭撬キ삭\udcadﲭ\uf0ad⒭",2048609799>(
            "㕄㑄ㅄ㍄㕄ⷄ"
         );
         var10000 < ((-1686754932 | -1686754932) ^ -1686754934);
         var10000 += 70665143 & -1576428543
      ) {
         int var11 = 0<"JNT",1775439921,"볺ﳻ㳺糾㳲ﳾ","擄畄敄牄","쒭\ue0ad㒭\ue0ad풬\udcad\ue0ad풭좭풬뢭㲭⒭삭풭좭撬キ삭\udcadﲭ\uf0ad⒭",2048609802>(var10001, var10000) - 127;
         char var14 = (char)(
            ((((((var11 & 57344) >> 13 | var11 << 3) ^ 41) & 65024) >> 9 | (((var11 & 57344) >> 13 | var11 << 3) ^ 41) << 7) & 65535) >> 0
               | (((((var11 & 57344) >> 13 | var11 << 3) ^ 41) & 65024) >> 9 | (((var11 & 57344) >> 13 | var11 << 3) ^ 41) << 7) << 16
         );
         0<"JNT",1775439921,"볾㳻ﳾ볲ﳻ㳺糾㳲ﳾ","擄畄牄敄範","쒭\ue0ad㒭\ue0ad풬\udcad\ue0ad풭좭풬뢭㲭⒭삭풭좭撬キ삭\udcadﲭ\uf0ad⒭",2048609801>(
            var10001,
            var10000,
            (char)(
               ((((((var11 & 57344) >> 13 | var11 << 3) ^ 41) & 65024) >> 9 | (((var11 & 57344) >> 13 | var11 << 3) ^ 41) << 7) & 65535) >> 0
                  | (((((var11 & 57344) >> 13 | var11 << 3) ^ 41) & 65024) >> 9 | (((var11 & 57344) >> 13 | var11 << 3) ^ 41) << 7) << 16
            )
         );
      }

      field_1089 = (Class_265)0<"JNT",-1875155568,"ﳰ㳼糽㳼ﳾ糱","擄盄ׄń\u0bc4ń桄ۄń߄ф桄穄ૄৄՄ߄ф湄畄敄範","ⲭҭ",2048609792>(
         0<"JNT",1775439921,"ﳾ볽볶ﳾ糾㳼糽볻","擄敄盄ׄń\u0bc4ń桄ۄń߄ф桄穄ૄৄՄ߄ф湄","쒭\ue0ad㒭\ue0ad풬\udcad\ue0ad풭좭풬뢭㲭⒭삭풭좭撬キ삭\udcadﲭ\uf0ad⒭",2048609789>(var10001), 1
      );
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1188(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = var10 + 1943263741 - 141562905 - 1922840892 + 400083336 + 1836883317 - 187842997 - 1207819013 - 1847759951 - 245027001;
      MethodHandle var10000 = field_1091[var10 + 1943263741 - 141562905 - 1922840892 + 400083336 + 1836883317 - 187842997 - 1207819013 - 1847759951 - 245027001
         ^ 675987429];
      if (field_1091[var10001 ^ 675987429] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = -378693316 ^ -67746990 ^ 312203886; var23 < var13.length(); var23 += -1114301234 >> 293596853 ^ -531) {
            char var42 = var13.charAt(var23);
            char var49 = (char)(
               (
                        (
                              (
                                       (
                                             (
                                                      (
                                                               (
                                                                        (
                                                                                 (
                                                                                          (
                                                                                                   (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                                      | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                                                )
                                                                                                - 26
                                                                                             & 65534
                                                                                       )
                                                                                       >> 1
                                                                                    | (
                                                                                             (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                                | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                                          )
                                                                                          - 26
                                                                                       << 15
                                                                              )
                                                                              + 157
                                                                           & 49152
                                                                     )
                                                                     >> 14
                                                                  | (
                                                                           (
                                                                                    (
                                                                                             (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                                | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                                          )
                                                                                          - 26
                                                                                       & 65534
                                                                                 )
                                                                                 >> 1
                                                                              | (
                                                                                       (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                          | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                                    )
                                                                                    - 26
                                                                                 << 15
                                                                        )
                                                                        + 157
                                                                     << 2
                                                            )
                                                            - 177
                                                         & 32768
                                                   )
                                                   >> 15
                                                | (
                                                         (
                                                                  (
                                                                           (
                                                                                    (
                                                                                             (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                                | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                                          )
                                                                                          - 26
                                                                                       & 65534
                                                                                 )
                                                                                 >> 1
                                                                              | (
                                                                                       (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                          | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                                    )
                                                                                    - 26
                                                                                 << 15
                                                                        )
                                                                        + 157
                                                                     & 49152
                                                               )
                                                               >> 14
                                                            | (
                                                                     (
                                                                              (
                                                                                       (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                          | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                                    )
                                                                                    - 26
                                                                                 & 65534
                                                                           )
                                                                           >> 1
                                                                        | (
                                                                                 (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                    | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                              )
                                                                              - 26
                                                                           << 15
                                                                  )
                                                                  + 157
                                                               << 2
                                                      )
                                                      - 177
                                                   << 1
                                          )
                                          & 65504
                                    )
                                    >> 5
                                 | (
                                       (
                                                (
                                                         (
                                                                  (
                                                                           (
                                                                                    (
                                                                                             (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                                | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                                          )
                                                                                          - 26
                                                                                       & 65534
                                                                                 )
                                                                                 >> 1
                                                                              | (
                                                                                       (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                          | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                                    )
                                                                                    - 26
                                                                                 << 15
                                                                        )
                                                                        + 157
                                                                     & 49152
                                                               )
                                                               >> 14
                                                            | (
                                                                     (
                                                                              (
                                                                                       (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                          | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                                    )
                                                                                    - 26
                                                                                 & 65534
                                                                           )
                                                                           >> 1
                                                                        | (
                                                                                 (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                    | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                              )
                                                                              - 26
                                                                           << 15
                                                                  )
                                                                  + 157
                                                               << 2
                                                      )
                                                      - 177
                                                   & 32768
                                             )
                                             >> 15
                                          | (
                                                   (
                                                            (
                                                                     (
                                                                              (
                                                                                       (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                          | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                                    )
                                                                                    - 26
                                                                                 & 65534
                                                                           )
                                                                           >> 1
                                                                        | (
                                                                                 (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                    | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                              )
                                                                              - 26
                                                                           << 15
                                                                  )
                                                                  + 157
                                                               & 49152
                                                         )
                                                         >> 14
                                                      | (
                                                               (
                                                                        (
                                                                                 (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                    | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                              )
                                                                              - 26
                                                                           & 65534
                                                                     )
                                                                     >> 1
                                                                  | (
                                                                           (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                              | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                        )
                                                                        - 26
                                                                     << 15
                                                            )
                                                            + 157
                                                         << 2
                                                )
                                                - 177
                                             << 1
                                    )
                                    << 11
                           )
                           & 65024
                     )
                     >> 9
                  | (
                        (
                                 (
                                       (
                                                (
                                                         (
                                                                  (
                                                                           (
                                                                                    (
                                                                                             (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                                | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                                          )
                                                                                          - 26
                                                                                       & 65534
                                                                                 )
                                                                                 >> 1
                                                                              | (
                                                                                       (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                          | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                                    )
                                                                                    - 26
                                                                                 << 15
                                                                        )
                                                                        + 157
                                                                     & 49152
                                                               )
                                                               >> 14
                                                            | (
                                                                     (
                                                                              (
                                                                                       (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                          | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                                    )
                                                                                    - 26
                                                                                 & 65534
                                                                           )
                                                                           >> 1
                                                                        | (
                                                                                 (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                    | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                              )
                                                                              - 26
                                                                           << 15
                                                                  )
                                                                  + 157
                                                               << 2
                                                      )
                                                      - 177
                                                   & 32768
                                             )
                                             >> 15
                                          | (
                                                   (
                                                            (
                                                                     (
                                                                              (
                                                                                       (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                          | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                                    )
                                                                                    - 26
                                                                                 & 65534
                                                                           )
                                                                           >> 1
                                                                        | (
                                                                                 (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                    | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                              )
                                                                              - 26
                                                                           << 15
                                                                  )
                                                                  + 157
                                                               & 49152
                                                         )
                                                         >> 14
                                                      | (
                                                               (
                                                                        (
                                                                                 (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                    | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                              )
                                                                              - 26
                                                                           & 65534
                                                                     )
                                                                     >> 1
                                                                  | (
                                                                           (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                              | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                        )
                                                                        - 26
                                                                     << 15
                                                            )
                                                            + 157
                                                         << 2
                                                )
                                                - 177
                                             << 1
                                    )
                                    & 65504
                              )
                              >> 5
                           | (
                                 (
                                          (
                                                   (
                                                            (
                                                                     (
                                                                              (
                                                                                       (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                          | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                                    )
                                                                                    - 26
                                                                                 & 65534
                                                                           )
                                                                           >> 1
                                                                        | (
                                                                                 (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                    | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                              )
                                                                              - 26
                                                                           << 15
                                                                  )
                                                                  + 157
                                                               & 49152
                                                         )
                                                         >> 14
                                                      | (
                                                               (
                                                                        (
                                                                                 (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                    | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                              )
                                                                              - 26
                                                                           & 65534
                                                                     )
                                                                     >> 1
                                                                  | (
                                                                           (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                              | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                        )
                                                                        - 26
                                                                     << 15
                                                            )
                                                            + 157
                                                         << 2
                                                )
                                                - 177
                                             & 32768
                                       )
                                       >> 15
                                    | (
                                             (
                                                      (
                                                               (
                                                                        (
                                                                                 (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                    | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                              )
                                                                              - 26
                                                                           & 65534
                                                                     )
                                                                     >> 1
                                                                  | (
                                                                           (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                              | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                        )
                                                                        - 26
                                                                     << 15
                                                            )
                                                            + 157
                                                         & 49152
                                                   )
                                                   >> 14
                                                | (
                                                         (
                                                                  ((((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4 | ((var42 & '쀀') >> 14 | var42 << 2) << 12)
                                                                        - 26
                                                                     & 65534
                                                               )
                                                               >> 1
                                                            | ((((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4 | ((var42 & '쀀') >> 14 | var42 << 2) << 12)
                                                                  - 26
                                                               << 15
                                                      )
                                                      + 157
                                                   << 2
                                          )
                                          - 177
                                       << 1
                              )
                              << 11
                     )
                     << 7
            );
            var13.setCharAt(
               var23,
               (char)(
                  (
                           (
                                 (
                                          (
                                                (
                                                         (
                                                                  (
                                                                           (
                                                                                    (
                                                                                             (
                                                                                                      (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                                         | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                                                   )
                                                                                                   - 26
                                                                                                & 65534
                                                                                          )
                                                                                          >> 1
                                                                                       | (
                                                                                                (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                                   | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                                             )
                                                                                             - 26
                                                                                          << 15
                                                                                 )
                                                                                 + 157
                                                                              & 49152
                                                                        )
                                                                        >> 14
                                                                     | (
                                                                              (
                                                                                       (
                                                                                                (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                                   | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                                             )
                                                                                             - 26
                                                                                          & 65534
                                                                                    )
                                                                                    >> 1
                                                                                 | (
                                                                                          (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                             | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                                       )
                                                                                       - 26
                                                                                    << 15
                                                                           )
                                                                           + 157
                                                                        << 2
                                                               )
                                                               - 177
                                                            & 32768
                                                      )
                                                      >> 15
                                                   | (
                                                            (
                                                                     (
                                                                              (
                                                                                       (
                                                                                                (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                                   | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                                             )
                                                                                             - 26
                                                                                          & 65534
                                                                                    )
                                                                                    >> 1
                                                                                 | (
                                                                                          (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                             | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                                       )
                                                                                       - 26
                                                                                    << 15
                                                                           )
                                                                           + 157
                                                                        & 49152
                                                                  )
                                                                  >> 14
                                                               | (
                                                                        (
                                                                                 (
                                                                                          (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                             | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                                       )
                                                                                       - 26
                                                                                    & 65534
                                                                              )
                                                                              >> 1
                                                                           | (
                                                                                    (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                       | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                                 )
                                                                                 - 26
                                                                              << 15
                                                                     )
                                                                     + 157
                                                                  << 2
                                                         )
                                                         - 177
                                                      << 1
                                             )
                                             & 65504
                                       )
                                       >> 5
                                    | (
                                          (
                                                   (
                                                            (
                                                                     (
                                                                              (
                                                                                       (
                                                                                                (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                                   | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                                             )
                                                                                             - 26
                                                                                          & 65534
                                                                                    )
                                                                                    >> 1
                                                                                 | (
                                                                                          (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                             | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                                       )
                                                                                       - 26
                                                                                    << 15
                                                                           )
                                                                           + 157
                                                                        & 49152
                                                                  )
                                                                  >> 14
                                                               | (
                                                                        (
                                                                                 (
                                                                                          (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                             | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                                       )
                                                                                       - 26
                                                                                    & 65534
                                                                              )
                                                                              >> 1
                                                                           | (
                                                                                    (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                       | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                                 )
                                                                                 - 26
                                                                              << 15
                                                                     )
                                                                     + 157
                                                                  << 2
                                                         )
                                                         - 177
                                                      & 32768
                                                )
                                                >> 15
                                             | (
                                                      (
                                                               (
                                                                        (
                                                                                 (
                                                                                          (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                             | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                                       )
                                                                                       - 26
                                                                                    & 65534
                                                                              )
                                                                              >> 1
                                                                           | (
                                                                                    (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                       | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                                 )
                                                                                 - 26
                                                                              << 15
                                                                     )
                                                                     + 157
                                                                  & 49152
                                                            )
                                                            >> 14
                                                         | (
                                                                  (
                                                                           (
                                                                                    (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                       | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                                 )
                                                                                 - 26
                                                                              & 65534
                                                                        )
                                                                        >> 1
                                                                     | (
                                                                              (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                 | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                           )
                                                                           - 26
                                                                        << 15
                                                               )
                                                               + 157
                                                            << 2
                                                   )
                                                   - 177
                                                << 1
                                       )
                                       << 11
                              )
                              & 65024
                        )
                        >> 9
                     | (
                           (
                                    (
                                          (
                                                   (
                                                            (
                                                                     (
                                                                              (
                                                                                       (
                                                                                                (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                                   | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                                             )
                                                                                             - 26
                                                                                          & 65534
                                                                                    )
                                                                                    >> 1
                                                                                 | (
                                                                                          (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                             | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                                       )
                                                                                       - 26
                                                                                    << 15
                                                                           )
                                                                           + 157
                                                                        & 49152
                                                                  )
                                                                  >> 14
                                                               | (
                                                                        (
                                                                                 (
                                                                                          (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                             | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                                       )
                                                                                       - 26
                                                                                    & 65534
                                                                              )
                                                                              >> 1
                                                                           | (
                                                                                    (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                       | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                                 )
                                                                                 - 26
                                                                              << 15
                                                                     )
                                                                     + 157
                                                                  << 2
                                                         )
                                                         - 177
                                                      & 32768
                                                )
                                                >> 15
                                             | (
                                                      (
                                                               (
                                                                        (
                                                                                 (
                                                                                          (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                             | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                                       )
                                                                                       - 26
                                                                                    & 65534
                                                                              )
                                                                              >> 1
                                                                           | (
                                                                                    (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                       | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                                 )
                                                                                 - 26
                                                                              << 15
                                                                     )
                                                                     + 157
                                                                  & 49152
                                                            )
                                                            >> 14
                                                         | (
                                                                  (
                                                                           (
                                                                                    (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                       | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                                 )
                                                                                 - 26
                                                                              & 65534
                                                                        )
                                                                        >> 1
                                                                     | (
                                                                              (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                 | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                           )
                                                                           - 26
                                                                        << 15
                                                               )
                                                               + 157
                                                            << 2
                                                   )
                                                   - 177
                                                << 1
                                       )
                                       & 65504
                                 )
                                 >> 5
                              | (
                                    (
                                             (
                                                      (
                                                               (
                                                                        (
                                                                                 (
                                                                                          (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                             | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                                       )
                                                                                       - 26
                                                                                    & 65534
                                                                              )
                                                                              >> 1
                                                                           | (
                                                                                    (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                       | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                                 )
                                                                                 - 26
                                                                              << 15
                                                                     )
                                                                     + 157
                                                                  & 49152
                                                            )
                                                            >> 14
                                                         | (
                                                                  (
                                                                           (
                                                                                    (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                       | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                                 )
                                                                                 - 26
                                                                              & 65534
                                                                        )
                                                                        >> 1
                                                                     | (
                                                                              (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                 | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                           )
                                                                           - 26
                                                                        << 15
                                                               )
                                                               + 157
                                                            << 2
                                                   )
                                                   - 177
                                                & 32768
                                          )
                                          >> 15
                                       | (
                                                (
                                                         (
                                                                  (
                                                                           (
                                                                                    (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                       | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                                 )
                                                                                 - 26
                                                                              & 65534
                                                                        )
                                                                        >> 1
                                                                     | (
                                                                              (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                 | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                           )
                                                                           - 26
                                                                        << 15
                                                               )
                                                               + 157
                                                            & 49152
                                                      )
                                                      >> 14
                                                   | (
                                                            (
                                                                     (
                                                                              (((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4
                                                                                 | ((var42 & '쀀') >> 14 | var42 << 2) << 12
                                                                           )
                                                                           - 26
                                                                        & 65534
                                                                  )
                                                                  >> 1
                                                               | ((((var42 & '쀀') >> 14 | var42 << 2) & 65520) >> 4 | ((var42 & '쀀') >> 14 | var42 << 2) << 12)
                                                                     - 26
                                                                  << 15
                                                         )
                                                         + 157
                                                      << 2
                                             )
                                             - 177
                                          << 1
                                 )
                                 << 11
                        )
                        << 7
               )
            );
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = -1380807946 - (-1254992493 + 605993856) ^ -731809309; var29 < var16.length(); var29 += (-500894690 << -1534847795 | 1) & 560993399) {
            int var54 = var16.charAt(var29);
            int var103 = (var54 & 63488) >> 11;
            int var55 = ((var54 & 63488) >> 11 | var54 << 5) ^ 136;
            int var104 = ((((var54 & 63488) >> 11 | var54 << 5) ^ 136) & 64512) >> 10;
            var54 = ((((var103 | var54 << 5) ^ 136) & 64512) >> 10 | (((var54 & 63488) >> 11 | var54 << 5) ^ 136) << 6) + 198;
            var103 = ((var104 | var55 << 6) + 198 & 65535) >> 0;
            int var57 = (((var104 | var55 << 6) + 198 & 65535) >> 0 | var54 << 16) - 43 - 207 + 127 - 209;
            int var106 = ((((var104 | var55 << 6) + 198 & 65535) >> 0 | var54 << 16) - 43 - 207 + 127 - 209 & 65532) >> 2;
            char var58 = (char)(
               ((var103 | var54 << 16) - 43 - 207 + 127 - 209 & 65532) >> 2
                  | (((var104 | var55 << 6) + 198 & 65535) >> 0 | var54 << 16) - 43 - 207 + 127 - 209 << 14
            );
            var16.setCharAt(var29, (char)(var106 | var57 << 14));
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_265.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = (-1675912813 << 775061128 | 0) & 1679821847; var35 < var19.length(); var35 += 1757078944 ^ 1757078944 ^ 1) {
            char var63 = var19.charAt(var35);
            char var70 = (char)(
               (
                        (
                              (
                                       (
                                             (
                                                      (
                                                            (
                                                                     (
                                                                              (
                                                                                       (
                                                                                                ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                                                   | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                                             )
                                                                                             - 170
                                                                                          & 64512
                                                                                    )
                                                                                    >> 10
                                                                                 | (
                                                                                          ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                                             | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                                       )
                                                                                       - 170
                                                                                    << 6
                                                                           )
                                                                           + 15
                                                                        & 65532
                                                                  )
                                                                  >> 2
                                                               | (
                                                                        (
                                                                                 (
                                                                                          ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                                             | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                                       )
                                                                                       - 170
                                                                                    & 64512
                                                                              )
                                                                              >> 10
                                                                           | (
                                                                                    ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                                       | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                                 )
                                                                                 - 170
                                                                              << 6
                                                                     )
                                                                     + 15
                                                                  << 14
                                                         )
                                                         & 65472
                                                   )
                                                   >> 6
                                                | (
                                                      (
                                                               (
                                                                        (
                                                                                 (
                                                                                          ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                                             | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                                       )
                                                                                       - 170
                                                                                    & 64512
                                                                              )
                                                                              >> 10
                                                                           | (
                                                                                    ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                                       | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                                 )
                                                                                 - 170
                                                                              << 6
                                                                     )
                                                                     + 15
                                                                  & 65532
                                                            )
                                                            >> 2
                                                         | (
                                                                  (
                                                                           (
                                                                                    ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                                       | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                                 )
                                                                                 - 170
                                                                              & 64512
                                                                        )
                                                                        >> 10
                                                                     | (
                                                                              ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                                 | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                           )
                                                                           - 170
                                                                        << 6
                                                               )
                                                               + 15
                                                            << 14
                                                   )
                                                   << 10
                                          )
                                          & 65520
                                    )
                                    >> 4
                                 | (
                                       (
                                                (
                                                      (
                                                               (
                                                                        (
                                                                                 (
                                                                                          ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                                             | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                                       )
                                                                                       - 170
                                                                                    & 64512
                                                                              )
                                                                              >> 10
                                                                           | (
                                                                                    ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                                       | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                                 )
                                                                                 - 170
                                                                              << 6
                                                                     )
                                                                     + 15
                                                                  & 65532
                                                            )
                                                            >> 2
                                                         | (
                                                                  (
                                                                           (
                                                                                    ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                                       | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                                 )
                                                                                 - 170
                                                                              & 64512
                                                                        )
                                                                        >> 10
                                                                     | (
                                                                              ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                                 | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                           )
                                                                           - 170
                                                                        << 6
                                                               )
                                                               + 15
                                                            << 14
                                                   )
                                                   & 65472
                                             )
                                             >> 6
                                          | (
                                                (
                                                         (
                                                                  (
                                                                           (
                                                                                    ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                                       | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                                 )
                                                                                 - 170
                                                                              & 64512
                                                                        )
                                                                        >> 10
                                                                     | (
                                                                              ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                                 | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                           )
                                                                           - 170
                                                                        << 6
                                                               )
                                                               + 15
                                                            & 65532
                                                      )
                                                      >> 2
                                                   | (
                                                            (
                                                                     (
                                                                              ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                                 | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                           )
                                                                           - 170
                                                                        & 64512
                                                                  )
                                                                  >> 10
                                                               | (
                                                                        ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                           | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                     )
                                                                     - 170
                                                                  << 6
                                                         )
                                                         + 15
                                                      << 14
                                             )
                                             << 10
                                    )
                                    << 12
                           )
                           & 65520
                     )
                     >> 4
                  | (
                        (
                                 (
                                       (
                                                (
                                                      (
                                                               (
                                                                        (
                                                                                 (
                                                                                          ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                                             | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                                       )
                                                                                       - 170
                                                                                    & 64512
                                                                              )
                                                                              >> 10
                                                                           | (
                                                                                    ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                                       | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                                 )
                                                                                 - 170
                                                                              << 6
                                                                     )
                                                                     + 15
                                                                  & 65532
                                                            )
                                                            >> 2
                                                         | (
                                                                  (
                                                                           (
                                                                                    ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                                       | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                                 )
                                                                                 - 170
                                                                              & 64512
                                                                        )
                                                                        >> 10
                                                                     | (
                                                                              ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                                 | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                           )
                                                                           - 170
                                                                        << 6
                                                               )
                                                               + 15
                                                            << 14
                                                   )
                                                   & 65472
                                             )
                                             >> 6
                                          | (
                                                (
                                                         (
                                                                  (
                                                                           (
                                                                                    ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                                       | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                                 )
                                                                                 - 170
                                                                              & 64512
                                                                        )
                                                                        >> 10
                                                                     | (
                                                                              ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                                 | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                           )
                                                                           - 170
                                                                        << 6
                                                               )
                                                               + 15
                                                            & 65532
                                                      )
                                                      >> 2
                                                   | (
                                                            (
                                                                     (
                                                                              ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                                 | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                           )
                                                                           - 170
                                                                        & 64512
                                                                  )
                                                                  >> 10
                                                               | (
                                                                        ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                           | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                     )
                                                                     - 170
                                                                  << 6
                                                         )
                                                         + 15
                                                      << 14
                                             )
                                             << 10
                                    )
                                    & 65520
                              )
                              >> 4
                           | (
                                 (
                                          (
                                                (
                                                         (
                                                                  (
                                                                           (
                                                                                    ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                                       | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                                 )
                                                                                 - 170
                                                                              & 64512
                                                                        )
                                                                        >> 10
                                                                     | (
                                                                              ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                                 | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                           )
                                                                           - 170
                                                                        << 6
                                                               )
                                                               + 15
                                                            & 65532
                                                      )
                                                      >> 2
                                                   | (
                                                            (
                                                                     (
                                                                              ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                                 | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                           )
                                                                           - 170
                                                                        & 64512
                                                                  )
                                                                  >> 10
                                                               | (
                                                                        ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                           | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                     )
                                                                     - 170
                                                                  << 6
                                                         )
                                                         + 15
                                                      << 14
                                             )
                                             & 65472
                                       )
                                       >> 6
                                    | (
                                          (
                                                   (
                                                            (
                                                                     (
                                                                              ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                                 | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                           )
                                                                           - 170
                                                                        & 64512
                                                                  )
                                                                  >> 10
                                                               | (
                                                                        ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                           | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                     )
                                                                     - 170
                                                                  << 6
                                                         )
                                                         + 15
                                                      & 65532
                                                )
                                                >> 2
                                             | (
                                                      (
                                                               (
                                                                        ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                           | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                     )
                                                                     - 170
                                                                  & 64512
                                                            )
                                                            >> 10
                                                         | (
                                                                  ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                     | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                               )
                                                               - 170
                                                            << 6
                                                   )
                                                   + 15
                                                << 14
                                       )
                                       << 10
                              )
                              << 12
                     )
                     << 12
            );
            var19.setCharAt(
               var35,
               (char)(
                  (
                           (
                                 (
                                          (
                                                (
                                                         (
                                                               (
                                                                        (
                                                                                 (
                                                                                          (
                                                                                                   ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504)
                                                                                                         >> 5
                                                                                                      | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                                                )
                                                                                                - 170
                                                                                             & 64512
                                                                                       )
                                                                                       >> 10
                                                                                    | (
                                                                                             ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                                                | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                                          )
                                                                                          - 170
                                                                                       << 6
                                                                              )
                                                                              + 15
                                                                           & 65532
                                                                     )
                                                                     >> 2
                                                                  | (
                                                                           (
                                                                                    (
                                                                                             ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                                                | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                                          )
                                                                                          - 170
                                                                                       & 64512
                                                                                 )
                                                                                 >> 10
                                                                              | (
                                                                                       ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                                          | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                                    )
                                                                                    - 170
                                                                                 << 6
                                                                        )
                                                                        + 15
                                                                     << 14
                                                            )
                                                            & 65472
                                                      )
                                                      >> 6
                                                   | (
                                                         (
                                                                  (
                                                                           (
                                                                                    (
                                                                                             ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                                                | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                                          )
                                                                                          - 170
                                                                                       & 64512
                                                                                 )
                                                                                 >> 10
                                                                              | (
                                                                                       ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                                          | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                                    )
                                                                                    - 170
                                                                                 << 6
                                                                        )
                                                                        + 15
                                                                     & 65532
                                                               )
                                                               >> 2
                                                            | (
                                                                     (
                                                                              (
                                                                                       ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                                          | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                                    )
                                                                                    - 170
                                                                                 & 64512
                                                                           )
                                                                           >> 10
                                                                        | (
                                                                                 ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                                    | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                              )
                                                                              - 170
                                                                           << 6
                                                                  )
                                                                  + 15
                                                               << 14
                                                      )
                                                      << 10
                                             )
                                             & 65520
                                       )
                                       >> 4
                                    | (
                                          (
                                                   (
                                                         (
                                                                  (
                                                                           (
                                                                                    (
                                                                                             ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                                                | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                                          )
                                                                                          - 170
                                                                                       & 64512
                                                                                 )
                                                                                 >> 10
                                                                              | (
                                                                                       ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                                          | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                                    )
                                                                                    - 170
                                                                                 << 6
                                                                        )
                                                                        + 15
                                                                     & 65532
                                                               )
                                                               >> 2
                                                            | (
                                                                     (
                                                                              (
                                                                                       ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                                          | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                                    )
                                                                                    - 170
                                                                                 & 64512
                                                                           )
                                                                           >> 10
                                                                        | (
                                                                                 ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                                    | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                              )
                                                                              - 170
                                                                           << 6
                                                                  )
                                                                  + 15
                                                               << 14
                                                      )
                                                      & 65472
                                                )
                                                >> 6
                                             | (
                                                   (
                                                            (
                                                                     (
                                                                              (
                                                                                       ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                                          | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                                    )
                                                                                    - 170
                                                                                 & 64512
                                                                           )
                                                                           >> 10
                                                                        | (
                                                                                 ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                                    | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                              )
                                                                              - 170
                                                                           << 6
                                                                  )
                                                                  + 15
                                                               & 65532
                                                         )
                                                         >> 2
                                                      | (
                                                               (
                                                                        (
                                                                                 ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                                    | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                              )
                                                                              - 170
                                                                           & 64512
                                                                     )
                                                                     >> 10
                                                                  | (
                                                                           ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                              | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                        )
                                                                        - 170
                                                                     << 6
                                                            )
                                                            + 15
                                                         << 14
                                                )
                                                << 10
                                       )
                                       << 12
                              )
                              & 65520
                        )
                        >> 4
                     | (
                           (
                                    (
                                          (
                                                   (
                                                         (
                                                                  (
                                                                           (
                                                                                    (
                                                                                             ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                                                | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                                          )
                                                                                          - 170
                                                                                       & 64512
                                                                                 )
                                                                                 >> 10
                                                                              | (
                                                                                       ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                                          | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                                    )
                                                                                    - 170
                                                                                 << 6
                                                                        )
                                                                        + 15
                                                                     & 65532
                                                               )
                                                               >> 2
                                                            | (
                                                                     (
                                                                              (
                                                                                       ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                                          | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                                    )
                                                                                    - 170
                                                                                 & 64512
                                                                           )
                                                                           >> 10
                                                                        | (
                                                                                 ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                                    | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                              )
                                                                              - 170
                                                                           << 6
                                                                  )
                                                                  + 15
                                                               << 14
                                                      )
                                                      & 65472
                                                )
                                                >> 6
                                             | (
                                                   (
                                                            (
                                                                     (
                                                                              (
                                                                                       ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                                          | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                                    )
                                                                                    - 170
                                                                                 & 64512
                                                                           )
                                                                           >> 10
                                                                        | (
                                                                                 ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                                    | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                              )
                                                                              - 170
                                                                           << 6
                                                                  )
                                                                  + 15
                                                               & 65532
                                                         )
                                                         >> 2
                                                      | (
                                                               (
                                                                        (
                                                                                 ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                                    | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                              )
                                                                              - 170
                                                                           & 64512
                                                                     )
                                                                     >> 10
                                                                  | (
                                                                           ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                              | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                        )
                                                                        - 170
                                                                     << 6
                                                            )
                                                            + 15
                                                         << 14
                                                )
                                                << 10
                                       )
                                       & 65520
                                 )
                                 >> 4
                              | (
                                    (
                                             (
                                                   (
                                                            (
                                                                     (
                                                                              (
                                                                                       ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                                          | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                                    )
                                                                                    - 170
                                                                                 & 64512
                                                                           )
                                                                           >> 10
                                                                        | (
                                                                                 ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                                    | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                              )
                                                                              - 170
                                                                           << 6
                                                                  )
                                                                  + 15
                                                               & 65532
                                                         )
                                                         >> 2
                                                      | (
                                                               (
                                                                        (
                                                                                 ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                                    | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                              )
                                                                              - 170
                                                                           & 64512
                                                                     )
                                                                     >> 10
                                                                  | (
                                                                           ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                              | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                        )
                                                                        - 170
                                                                     << 6
                                                            )
                                                            + 15
                                                         << 14
                                                )
                                                & 65472
                                          )
                                          >> 6
                                       | (
                                             (
                                                      (
                                                               (
                                                                        (
                                                                                 ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                                    | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                              )
                                                                              - 170
                                                                           & 64512
                                                                     )
                                                                     >> 10
                                                                  | (
                                                                           ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                              | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                        )
                                                                        - 170
                                                                     << 6
                                                            )
                                                            + 15
                                                         & 65532
                                                   )
                                                   >> 2
                                                | (
                                                         (
                                                                  (
                                                                           ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                              | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                        )
                                                                        - 170
                                                                     & 64512
                                                               )
                                                               >> 10
                                                            | (
                                                                     ((((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) & 65504) >> 5
                                                                        | (((var63 & '\uf800') >> 11 | var63 << 5) ^ 213) << 11
                                                                  )
                                                                  - 170
                                                               << 6
                                                      )
                                                      + 15
                                                   << 14
                                          )
                                          << 10
                                 )
                                 << 12
                        )
                        << 12
               )
            );
         }

         Class var7 = Class.forName(var19.toString(), false, Class_265.class.getClassLoader());
         switch (((var4 + 866761513 - 1011328752 ^ 2142183042) - 840274578 ^ 1955690863 ^ 1731014732 ^ 1798453220) + 1647819149 - 652822802 + 1348536005) {
            case 532303313:
            case 639545821:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 1199534002:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            case 1219938372:
               var10000 = var0.findSpecial(var7, var5, var6, Class_265.class);
               break;
            case 1245847998:
               var10000 = var0.findConstructor(var7, var6);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_1091[var10 + 1943263741 - 141562905 - 1922840892 + 400083336 + 1836883317 - 187842997 - 1207819013 - 1847759951 - 245027001 ^ 675987429] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1189(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = (var10 - 398117785 - 464450778 - 2045881701 ^ 858170635) + 1677300426 - 1550977403 + 373993505 + 395615021 + 977914647;
      MethodHandle var10000 = field_1091[(var10 - 398117785 - 464450778 - 2045881701 ^ 858170635)
         + 1677300426
         - 1550977403
         + 373993505
         + 395615021
         + 977914647
         - 645203387];
      if (field_1091[var10001 - 645203387] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = (-1225378750 ^ -1225378750 | 0) & 771999237; var24 < var14.length(); var24 += (161454101 << -2018783543 | 1) & -1061022401) {
            int var43 = var14.charAt(var24) + 232 + 120 - 128;
            int var10004 = (var43 & 65532) >> 2;
            int var44 = (var43 & 65532) >> 2 | var43 << 14;
            int var86 = (((var43 & 65532) >> 2 | var43 << 14) & 65408) >> 7;
            var43 = (((var10004 | var43 << 14) & 65408) >> 7 | ((var43 & 65532) >> 2 | var43 << 14) << 9) - 194 + 141;
            var10004 = ((var86 | var44 << 9) - 194 + 141 & 65024) >> 9;
            int var46 = ((var86 | var44 << 9) - 194 + 141 & 65024) >> 9 | var43 << 7;
            int var88 = ((((var86 | var44 << 9) - 194 + 141 & 65024) >> 9 | var43 << 7) & 65535) >> 0;
            char var47 = (char)((((var10004 | var43 << 7) & 65535) >> 0 | (((var86 | var44 << 9) - 194 + 141 & 65024) >> 9 | var43 << 7) << 16) ^ 111);
            var14.setCharAt(var24, (char)((var88 | var46 << 16) ^ 111));
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = 206435991 + -1132277866 ^ -925841875; var30 < var17.length(); var30 += (168718164 | -1703580963 | 1) & 36897) {
            int var52 = var17.charAt(var30) ^ 'h' ^ 205;
            int var89 = (var52 & 65472) >> 6;
            int var53 = ((var52 & 65472) >> 6 | var52 << 10) - 33 + 60;
            int var90 = (((var52 & 65472) >> 6 | var52 << 10) - 33 + 60 & 65472) >> 6;
            var52 = (((var89 | var52 << 10) - 33 + 60 & 65472) >> 6 | ((var52 & 65472) >> 6 | var52 << 10) - 33 + 60 << 10) + 32 - 188;
            var89 = ((var90 | var53 << 10) + 32 - 188 & 65504) >> 5;
            int var55 = ((var90 | var53 << 10) + 32 - 188 & 65504) >> 5 | var52 << 11;
            int var92 = ((((var90 | var53 << 10) + 32 - 188 & 65504) >> 5 | var52 << 11) & 32768) >> 15;
            char var56 = (char)(((var89 | var52 << 11) & 32768) >> 15 | (((var90 | var53 << 10) + 32 - 188 & 65504) >> 5 | var52 << 11) << 1);
            var17.setCharAt(var30, (char)(var92 | var55 << 1));
         }

         Class var6 = Class.forName(var17.toString(), false, Class_265.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = (1477702320 & 1477702320 | 0) & -2057305015; var36 < var20.length(); var36 += (-2103940718 + 2058706546 | 1) & 36712585) {
            int var61 = var20.charAt(var36);
            int var93 = (var61 & 49152) >> 14;
            int var62 = ((((var61 & 49152) >> 14 | var61 << 2) ^ 214) + 20 ^ 102) + 213;
            int var94 = (((((var61 & 49152) >> 14 | var61 << 2) ^ 214) + 20 ^ 102) + 213 & 65024) >> 9;
            var61 = ((((var93 | var61 << 2) ^ 214) + 20 ^ 102) + 213 & 65024) >> 9 | ((((var61 & 49152) >> 14 | var61 << 2) ^ 214) + 20 ^ 102) + 213 << 7;
            var93 = ((var94 | var62 << 7) & 64512) >> 10;
            int var64 = (((var94 | var62 << 7) & 64512) >> 10 | var61 << 6) - 75 - 204;
            int var96 = ((((var94 | var62 << 7) & 64512) >> 10 | var61 << 6) - 75 - 204 & 65535) >> 0;
            char var65 = (char)(((var93 | var61 << 6) - 75 - 204 & 65535) >> 0 | (((var94 | var62 << 7) & 64512) >> 10 | var61 << 6) - 75 - 204 << 16);
            var20.setCharAt(var36, (char)(var96 | var64 << 16));
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_265.class.getClassLoader()).returnType();
         switch (((var4 ^ 2037518557 ^ 1729744) + 438365469 ^ 1511942227) - 1669186119 + 1422782647 - 905697420 + 2038106298 + 847882423 ^ 372494339) {
            case 368479982:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            case 1269030098:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            case 1422345951:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            case 1867386393:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_1091[(var10 - 398117785 - 464450778 - 2045881701 ^ 858170635) + 1677300426 - 1550977403 + 373993505 + 395615021 + 977914647 - 645203387] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
