import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;

public class Class_372 extends Class_342 {
   // $VF: renamed from: xk Class_49
   public Class_49 field_1625;
   // $VF: renamed from: nyd java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_1626 = new MethodHandle[228257686 - 228257686 ^ 25];

   public Class_372() {
      int var10001 = (-2125150198 + -1339456105 | 0) & -1065344512;

      StringBuilder var10002;
      for (var10002 = (StringBuilder)0<"JNT",-1286488056,"䊤㽴㿄㽴㼤䋄","\ue8fc뫼짼쑼뿼쑼\ueb7c쫼쑼쯼일\ueb7c굼뻼뷼졼쯼일\ue17c\ue87c꿼","ᏐᚈᎰᚈ॰Ꮰᚈ፰ጸ॰ဘጠጐᏈ፰ጸ᎐ጨᏈᏠᚠᚨጐ",1062274323>(
            "䱵\udc75ꑵ롵鱵䱵쁵鑵鑵遵"
         );
         var10001 < (52058888 * 52058888 ^ -838946742);
         var10001 += (498657842 ^ 498657842 | 1) & -1644144145
      ) {
         int var13 = 0<"JNT",1760795528,"䀔㽤㿴㼄㷴㼤","\ue8fc롼\ue87c땼","ᏐᚈᎰᚈ॰Ꮰᚈ፰ጸ॰ဘጠጐᏈ፰ጸ᎐ጨᏈᏠᚠᚨጐ",1062274140>(var10002, var10001) - '>';
         char var16 = (char)(
            ((((((var13 & 65534) >> 1 | var13 << 15) ^ 27) & 65535) >> 0 | (((var13 & 65534) >> 1 | var13 << 15) ^ 27) << 16) & 65024) >> 9
               | (((((var13 & 65534) >> 1 | var13 << 15) ^ 27) & 65535) >> 0 | (((var13 & 65534) >> 1 | var13 << 15) ^ 27) << 16) << 7
         );
         0<"JNT",1760795528,"㼔䀴㼤㸔㽤㿴㼄㷴㼤","\ue8fc롼땼\ue87c꿼","ᏐᚈᎰᚈ॰Ꮰᚈ፰ጸ॰ဘጠጐᏈ፰ጸ᎐ጨᏈᏠᚠᚨጐ",1062274125>(
            var10002,
            var10001,
            (char)(
               ((((((var13 & 65534) >> 1 | var13 << 15) ^ 27) & 65535) >> 0 | (((var13 & 65534) >> 1 | var13 << 15) ^ 27) << 16) & 65024) >> 9
                  | (((((var13 & 65534) >> 1 | var13 << 15) ^ 27) & 65535) >> 0 | (((var13 & 65534) >> 1 | var13 << 15) ^ 27) << 16) << 7
            )
         );
      }

      String var2 = 0<"JNT",1760795528,"㼤㿔㴔㼤㼄㽴㿄䁔","\ue8fc\ue87c뫼짼쑼뿼쑼\ueb7c쫼쑼쯼일\ueb7c굼뻼뷼졼쯼일\ue17c","ᏐᚈᎰᚈ॰Ꮰᚈ፰ጸ॰ဘጠጐᏈ፰ጸ᎐ጨᏈᏠᚠᚨጐ",1062274126>(var10002);
      int var7 = (-1418969933 | -1169300138 | 0) & 1074790400;

      StringBuilder var18;
      for (var18 = (StringBuilder)0<"JNT",-1286488056,"䊤㽴㿄㽴㼤䋄","\ue8fc뫼짼쑼뿼쑼\ueb7c쫼쑼쯼일\ueb7c굼뻼뷼졼쯼일\ue17c\ue87c꿼","ᏐᚈᎰᚈ॰Ꮰᚈ፰ጸ॰ဘጠጐᏈ፰ጸ᎐ጨᏈᏠᚠᚨጐ",1062274135>(
            "䀐怒뀑\u0012퀑\u0012쀑ꀒ瀍\u0013怒쀒递瀍ꀒ\ue012\u0012倒\ue011瀍耑倒\u0012䀒耑뀒\u0012怒倒瀍ꀒ瀒쀑쀑뀑瀍\uf00d퀒\u0012ꀒ쀒耑〒瀍怒倒〒\u0013\u000e"
         );
         var7 < ((-1950487288 & 1257172680 << -1950487288 | 49) & 289612025);
         var7 += -155809841 * -155809841 ^ 912259424
      ) {
         char var29 = 0<"JNT",1760795528,"䀔㽤㿴㼄㷴㼤","\ue8fc롼\ue87c땼","ᏐᚈᎰᚈ॰Ꮰᚈ፰ጸ॰ဘጠጐᏈ፰ጸ᎐ጨᏈᏠᚠᚨጐ",1062274127>(var18, var7);
         char var32 = (char)(
            (
                  (((((var29 & '\ufff0') >> 4 | var29 << '\f') & 65534) >> 1 | ((var29 & '\ufff0') >> 4 | var29 << '\f') << 15) & 65408) >> 7
                     | ((((var29 & '\ufff0') >> 4 | var29 << '\f') & 65534) >> 1 | ((var29 & '\ufff0') >> 4 | var29 << '\f') << 15) << 9
               )
               - 164
               - 19
         );
         0<"JNT",1760795528,"㼔䀴㼤㸔㽤㿴㼄㷴㼤","\ue8fc롼땼\ue87c꿼","ᏐᚈᎰᚈ॰Ꮰᚈ፰ጸ॰ဘጠጐᏈ፰ጸ᎐ጨᏈᏠᚠᚨጐ",1062274128>(
            var18,
            var7,
            (char)(
               (
                     (((((var29 & '\ufff0') >> 4 | var29 << '\f') & 65534) >> 1 | ((var29 & '\ufff0') >> 4 | var29 << '\f') << 15) & 65408) >> 7
                        | ((((var29 & '\ufff0') >> 4 | var29 << '\f') & 65534) >> 1 | ((var29 & '\ufff0') >> 4 | var29 << '\f') << 15) << 9
                  )
                  - 164
                  - 19
            )
         );
      }

      super(
         var2,
         0<"JNT",1760795528,"㼤㿔㴔㼤㼄㽴㿄䁔","\ue8fc\ue87c뫼짼쑼뿼쑼\ueb7c쫼쑼쯼일\ueb7c굼뻼뷼졼쯼일\ue17c","ᏐᚈᎰᚈ॰Ꮰᚈ፰ጸ॰ဘጠጐᏈ፰ጸ᎐ጨᏈᏠᚠᚨጐ",1062274129>(var18),
         -1,
         1<"JNT",-1463327861,"䩋剋","칟쮟","⇷∷⫷㘷ぷ⚷",-295596721>()
      );
      var10001 = (1909640047 >> 1059706114 | 0) & -2138895100;

      for (var10002 = (StringBuilder)0<"JNT",-1286488056,"䊤㽴㿄㽴㼤䋄","\ue8fc뫼짼쑼뿼쑼\ueb7c쫼쑼쯼일\ueb7c굼뻼뷼졼쯼일\ue17c\ue87c꿼","ᏐᚈᎰᚈ॰Ꮰᚈ፰ጸ॰ဘጠጐᏈ፰ጸ᎐ጨᏈᏠᚠᚨጐ",1062274139>(
            "颧肦⢦⢦₦"
         );
         var10001 < 5;
         var10001 += 1
      ) {
         int var21 = ((0<"JNT",1760795528,"䀔㽤㿴㼄㷴㼤","\ue8fc롼\ue87c땼","ᏐᚈᎰᚈ॰Ꮰᚈ፰ጸ॰ဘጠጐᏈ፰ጸ᎐ጨᏈᏠᚠᚨጐ",1062274313>(var10002, var10001) ^ 'i') - 4 ^ 80) - 152;
         char var22 = (char)((var21 & 63488) >> 11 | var21 << 5);
         0<"JNT",1760795528,"㼔䀴㼤㸔㽤㿴㼄㷴㼤","\ue8fc롼땼\ue87c꿼","ᏐᚈᎰᚈ॰Ꮰᚈ፰ጸ॰ဘጠጐᏈ፰ጸ᎐ጨᏈᏠᚠᚨጐ",1062274314>(var10002, var10001, (char)((var21 & 63488) >> 11 | var21 << 5));
      }

      Class_49 var5 = (Class_49)0<"JNT",-1286488056,"䊤㽴㿄㽴㼤䋄","\ue8fc뫼짼쑼뿼쑼\ueb7c쫼쑼쯼일\ueb7c굼뻼뷼졼쯼일\ue17c뛼뛼뛼뛼\ue87c꿼","ᚠᚘ",1062274309>(
         0<"JNT",1760795528,"㼤㿔㴔㼤㼄㽴㿄䁔","\ue8fc\ue87c뫼짼쑼뿼쑼\ueb7c쫼쑼쯼일\ueb7c굼뻼뷼졼쯼일\ue17c","ᏐᚈᎰᚈ॰Ꮰᚈ፰ጸ॰ဘጠጐᏈ፰ጸ᎐ጨᏈᏠᚠᚨጐ",1062274324>(var10002), 1.0, 20.0, 15.0, 1.0
      );
      int var11 = (597724127 - 399710391 | 0) & 1076887697;

      for (var18 = (StringBuilder)0<"JNT",-1286488056,"䊤㽴㿄㽴㼤䋄","\ue8fc뫼짼쑼뿼쑼\ueb7c쫼쑼쯼일\ueb7c굼뻼뷼졼쯼일\ue17c\ue87c꿼","ᏐᚈᎰᚈ॰Ꮰᚈ፰ጸ॰ဘጠጐᏈ፰ጸ᎐ጨᏈᏠᚠᚨጐ",1062274310>(
            "삛삔䂙肚삘\u0087䂗肚䂙䂚䂗\u0094䂙삚肚\u0087삓\u0093䂘䂘\u0098"
         );
         var11 < ((1455184242 >>> 1455184242 | 16) & -884465067);
         var11 += (-1329880349 & -1329880349 | 1) & 1258554641
      ) {
         int var36 = 0<"JNT",1760795528,"䀔㽤㿴㼄㷴㼤","\ue8fc롼\ue87c땼","ᏐᚈᎰᚈ॰Ꮰᚈ፰ጸ॰ဘጠጐᏈ፰ጸ᎐ጨᏈᏠᚠᚨጐ",1062274311>(var18, var11) - 'c';
         char var39 = (char)(
            ((((((var36 & 0) >> 16 | var36 << 0) ^ 44) & 65504) >> 5 | (((var36 & 0) >> 16 | var36 << 0) ^ 44) << 11) & 65024) >> 9
               | (((((var36 & 0) >> 16 | var36 << 0) ^ 44) & 65504) >> 5 | (((var36 & 0) >> 16 | var36 << 0) ^ 44) << 11) << 7
         );
         0<"JNT",1760795528,"㼔䀴㼤㸔㽤㿴㼄㷴㼤","\ue8fc롼땼\ue87c꿼","ᏐᚈᎰᚈ॰Ꮰᚈ፰ጸ॰ဘጠጐᏈ፰ጸ᎐ጨᏈᏠᚠᚨጐ",1062274312>(
            var18,
            var11,
            (char)(
               ((((((var36 & 0) >> 16 | var36 << 0) ^ 44) & 65504) >> 5 | (((var36 & 0) >> 16 | var36 << 0) ^ 44) << 11) & 65024) >> 9
                  | (((((var36 & 0) >> 16 | var36 << 0) ^ 44) & 65504) >> 5 | (((var36 & 0) >> 16 | var36 << 0) ^ 44) << 11) << 7
            )
         );
      }

      this.field_1625 = 0<"JNT",1760795528,"㿔㽴㽤","\ue8fc뫼짼쑼뿼쑼\ueb7c쫼쑼쯼일\ueb7c굼뻼뷼졼쯼일\ue17c\ue87c뫼웼야\ue17c","ᚠᚘ",1062274316>(
         var5, 0<"JNT",1760795528,"㼤㿔㴔㼤㼄㽴㿄䁔","\ue8fc\ue87c뫼짼쑼뿼쑼\ueb7c쫼쑼쯼일\ueb7c굼뻼뷼졼쯼일\ue17c","ᏐᚈᎰᚈ॰Ꮰᚈ፰ጸ॰ဘጠጐᏈ፰ጸ᎐ጨᏈᏠᚠᚨጐ",1062274315>(var18)
      );
      0<"JNT",1760795528,"㻴㼴","\ue8fc논뫼뱼왼왼\ue17c\ue87c꿼","Ꮈጰጨ",1062274110>(this, new Class_271[]{1<"JNT",-1297702919,"桋之","컟쪟콟","⇷∷⫷ヷシ⚷",-295596734>(this)});
   }

   // $VF: renamed from: sh () int
   public int method_1461() {
      return 21 - 0<"JNT",1760795528,"䁄㺄䁔","\ue8fc\ue87c롼","ᚠᚘ",1062274137>(1<"JNT",-1297702919,"桋之","컟쪟콟","⇷∷⫷ヷシ⚷",-295596715>(this));
   }

   // $VF: renamed from: mg () void
   @Override
   public void method_1407() {
      0<"JNT",2117333348,"㾴䁔","\ue8fc\ue87c꿼","ጨጘጰ",1062274138>(this);
   }

   // $VF: renamed from: q () void
   @Override
   public void method_1408() {
      0<"JNT",2117333348,"㻴","\ue8fc\ue87c꿼","ጨጘጰ",1062274147>(this);
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1413(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 - 91050133 - 367596788 + 363075428 ^ 250733158) + 1745172086 ^ 154452574) + 1160642024 + 2105538610 - 1358521606;
      MethodHandle var10000 = field_1626[((var10 - 91050133 - 367596788 + 363075428 ^ 250733158) + 1745172086 ^ 154452574)
            + 1160642024
            + 2105538610
            - 1358521606
         ^ 133487036];
      if (field_1626[var10001 ^ 133487036] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = -578779543 >> (-578779543 & -578779543) ^ -1130429; var23 < var13.length(); var23 += (1293748311 * -2116758229 | 1) & 86124035) {
            int var42 = var13.charAt(var23);
            int var10004 = (var42 & 65408) >> 7;
            int var43 = ((var42 & 65408) >> 7 | var42 << 9) - 57;
            int var85 = (((var42 & 65408) >> 7 | var42 << 9) - 57 & 65024) >> 9;
            var42 = ((var10004 | var42 << 9) - 57 & 65024) >> 9 | ((var42 & 65408) >> 7 | var42 << 9) - 57 << 7;
            var10004 = ((var85 | var43 << 7) & 65520) >> 4;
            int var45 = ((var85 | var43 << 7) & 65520) >> 4 | var42 << 12;
            int var87 = ((((var85 | var43 << 7) & 65520) >> 4 | var42 << 12) & 65024) >> 9;
            var42 = ((((var10004 | var42 << 12) & 65024) >> 9 | (((var85 | var43 << 7) & 65520) >> 4 | var42 << 12) << 7) ^ 65) + 160;
            var10004 = (((var87 | var45 << 7) ^ 65) + 160 & 61440) >> 12;
            int var47 = (((var87 | var45 << 7) ^ 65) + 160 & 61440) >> 12 | var42 << 4;
            int var89 = (((((var87 | var45 << 7) ^ 65) + 160 & 61440) >> 12 | var42 << 4) & 63488) >> 11;
            char var48 = (char)((((var10004 | var42 << 4) & 63488) >> 11 | ((((var87 | var45 << 7) ^ 65) + 160 & 61440) >> 12 | var42 << 4) << 5) ^ 88);
            var13.setCharAt(var23, (char)((var89 | var47 << 5) ^ 88));
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = -581850918 << 280962685 ^ 1073741824; var29 < var16.length(); var29 += (-1221951040 >>> 205928584 | 0) & 302548005) {
            int var53 = ((var16.charAt(var29) - 180 - 245 ^ 72) + 181 ^ 195) + 24 - 171;
            char var54 = (char)(((var53 & 65408) >> 7 | var53 << 9) - 213 ^ 208);
            var16.setCharAt(var29, (char)(((var53 & 65408) >> 7 | var53 << 9) - 213 ^ 208));
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_372.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = (-528030438 << 301538837 | 0) & 406164942; var35 < var19.length(); var35 += -1717304931 & -1717304931 ^ -1717304932) {
            char var59 = var19.charAt(var35);
            char var64 = (char)(
               (
                        (
                              (
                                       (
                                                (
                                                         (
                                                               (
                                                                        (
                                                                              ((((var59 & '\ufff0') >> 4 | var59 << '\f') ^ 107) & 32768) >> 15
                                                                                 | (((var59 & '\ufff0') >> 4 | var59 << '\f') ^ 107) << 1
                                                                           )
                                                                           & 32768
                                                                     )
                                                                     >> 15
                                                                  | (
                                                                        ((((var59 & '\ufff0') >> 4 | var59 << '\f') ^ 107) & 32768) >> 15
                                                                           | (((var59 & '\ufff0') >> 4 | var59 << '\f') ^ 107) << 1
                                                                     )
                                                                     << 1
                                                            )
                                                            & 65532
                                                      )
                                                      >> 2
                                                   | (
                                                         (
                                                                  (
                                                                        ((((var59 & '\ufff0') >> 4 | var59 << '\f') ^ 107) & 32768) >> 15
                                                                           | (((var59 & '\ufff0') >> 4 | var59 << '\f') ^ 107) << 1
                                                                     )
                                                                     & 32768
                                                               )
                                                               >> 15
                                                            | (
                                                                  ((((var59 & '\ufff0') >> 4 | var59 << '\f') ^ 107) & 32768) >> 15
                                                                     | (((var59 & '\ufff0') >> 4 | var59 << '\f') ^ 107) << 1
                                                               )
                                                               << 1
                                                      )
                                                      << 14
                                             )
                                             - 45
                                          ^ 43
                                    )
                                    - 29
                                 ^ 208
                           )
                           & 32768
                     )
                     >> 15
                  | (
                        (
                                 (
                                          (
                                                   (
                                                         (
                                                                  (
                                                                        ((((var59 & '\ufff0') >> 4 | var59 << '\f') ^ 107) & 32768) >> 15
                                                                           | (((var59 & '\ufff0') >> 4 | var59 << '\f') ^ 107) << 1
                                                                     )
                                                                     & 32768
                                                               )
                                                               >> 15
                                                            | (
                                                                  ((((var59 & '\ufff0') >> 4 | var59 << '\f') ^ 107) & 32768) >> 15
                                                                     | (((var59 & '\ufff0') >> 4 | var59 << '\f') ^ 107) << 1
                                                               )
                                                               << 1
                                                      )
                                                      & 65532
                                                )
                                                >> 2
                                             | (
                                                   (
                                                            (
                                                                  ((((var59 & '\ufff0') >> 4 | var59 << '\f') ^ 107) & 32768) >> 15
                                                                     | (((var59 & '\ufff0') >> 4 | var59 << '\f') ^ 107) << 1
                                                               )
                                                               & 32768
                                                         )
                                                         >> 15
                                                      | (
                                                            ((((var59 & '\ufff0') >> 4 | var59 << '\f') ^ 107) & 32768) >> 15
                                                               | (((var59 & '\ufff0') >> 4 | var59 << '\f') ^ 107) << 1
                                                         )
                                                         << 1
                                                )
                                                << 14
                                       )
                                       - 45
                                    ^ 43
                              )
                              - 29
                           ^ 208
                     )
                     << 1
            );
            var19.setCharAt(
               var35,
               (char)(
                  (
                           (
                                 (
                                          (
                                                   (
                                                            (
                                                                  (
                                                                           (
                                                                                 ((((var59 & '\ufff0') >> 4 | var59 << '\f') ^ 107) & 32768) >> 15
                                                                                    | (((var59 & '\ufff0') >> 4 | var59 << '\f') ^ 107) << 1
                                                                              )
                                                                              & 32768
                                                                        )
                                                                        >> 15
                                                                     | (
                                                                           ((((var59 & '\ufff0') >> 4 | var59 << '\f') ^ 107) & 32768) >> 15
                                                                              | (((var59 & '\ufff0') >> 4 | var59 << '\f') ^ 107) << 1
                                                                        )
                                                                        << 1
                                                               )
                                                               & 65532
                                                         )
                                                         >> 2
                                                      | (
                                                            (
                                                                     (
                                                                           ((((var59 & '\ufff0') >> 4 | var59 << '\f') ^ 107) & 32768) >> 15
                                                                              | (((var59 & '\ufff0') >> 4 | var59 << '\f') ^ 107) << 1
                                                                        )
                                                                        & 32768
                                                                  )
                                                                  >> 15
                                                               | (
                                                                     ((((var59 & '\ufff0') >> 4 | var59 << '\f') ^ 107) & 32768) >> 15
                                                                        | (((var59 & '\ufff0') >> 4 | var59 << '\f') ^ 107) << 1
                                                                  )
                                                                  << 1
                                                         )
                                                         << 14
                                                )
                                                - 45
                                             ^ 43
                                       )
                                       - 29
                                    ^ 208
                              )
                              & 32768
                        )
                        >> 15
                     | (
                           (
                                    (
                                             (
                                                      (
                                                            (
                                                                     (
                                                                           ((((var59 & '\ufff0') >> 4 | var59 << '\f') ^ 107) & 32768) >> 15
                                                                              | (((var59 & '\ufff0') >> 4 | var59 << '\f') ^ 107) << 1
                                                                        )
                                                                        & 32768
                                                                  )
                                                                  >> 15
                                                               | (
                                                                     ((((var59 & '\ufff0') >> 4 | var59 << '\f') ^ 107) & 32768) >> 15
                                                                        | (((var59 & '\ufff0') >> 4 | var59 << '\f') ^ 107) << 1
                                                                  )
                                                                  << 1
                                                         )
                                                         & 65532
                                                   )
                                                   >> 2
                                                | (
                                                      (
                                                               (
                                                                     ((((var59 & '\ufff0') >> 4 | var59 << '\f') ^ 107) & 32768) >> 15
                                                                        | (((var59 & '\ufff0') >> 4 | var59 << '\f') ^ 107) << 1
                                                                  )
                                                                  & 32768
                                                            )
                                                            >> 15
                                                         | (
                                                               ((((var59 & '\ufff0') >> 4 | var59 << '\f') ^ 107) & 32768) >> 15
                                                                  | (((var59 & '\ufff0') >> 4 | var59 << '\f') ^ 107) << 1
                                                            )
                                                            << 1
                                                   )
                                                   << 14
                                          )
                                          - 45
                                       ^ 43
                                 )
                                 - 29
                              ^ 208
                        )
                        << 1
               )
            );
         }

         Class var7 = Class.forName(var19.toString(), false, Class_372.class.getClassLoader());
         switch (var4 + 48346485 + 1338101395 - 763427866 - 1982655871 + 1431782031 - 987339248 + 1598415896 + 1261670064 + 1499039337 - 643058553) {
            case 54075502:
            case 266701902:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 623239722:
               var10000 = var0.findSpecial(var7, var5, var6, Class_372.class);
               break;
            case 1161451949:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            case 1514385614:
               var10000 = var0.findConstructor(var7, var6);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_1626[((var10 - 91050133 - 367596788 + 363075428 ^ 250733158) + 1745172086 ^ 154452574) + 1160642024 + 2105538610 - 1358521606 ^ 133487036] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1414(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 ^ 1552642594 ^ 1523064139 ^ 1455751828) - 1950214176 ^ 158875517) + 658540446 + 1169159259 - 964569393 + 1048004160;
      MethodHandle var10000 = field_1626[((var10 ^ 1552642594 ^ 1523064139 ^ 1455751828) - 1950214176 ^ 158875517)
         + 658540446
         + 1169159259
         - 964569393
         + 1048004160
         + 1246011160];
      if (field_1626[var10001 + 1246011160] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = (321631858 | 321631858) ^ 321631858; var24 < var14.length(); var24 += (-1147539786 - 1743999005 | 0) & -2078801887) {
            int var43 = var14.charAt(var24);
            int var10004 = (var43 & 32768) >> 15;
            int var44 = ((var43 & 32768) >> 15 | var43 << 1) - 85;
            int var98 = (((var43 & 32768) >> 15 | var43 << 1) - 85 & 65472) >> 6;
            var43 = (((var10004 | var43 << 1) - 85 & 65472) >> 6 | ((var43 & 32768) >> 15 | var43 << 1) - 85 << 10) + 63;
            var10004 = ((var98 | var44 << 10) + 63 & 65408) >> 7;
            int var46 = ((var98 | var44 << 10) + 63 & 65408) >> 7 | var43 << 9;
            int var100 = ((((var98 | var44 << 10) + 63 & 65408) >> 7 | var43 << 9) & 65408) >> 7;
            var43 = ((var10004 | var43 << 9) & 65408) >> 7 | (((var98 | var44 << 10) + 63 & 65408) >> 7 | var43 << 9) << 9;
            var10004 = ((var100 | var46 << 9) & 49152) >> 14;
            int var48 = ((var100 | var46 << 9) & 49152) >> 14 | var43 << 2;
            int var102 = ((((var100 | var46 << 9) & 49152) >> 14 | var43 << 2) & 65472) >> 6;
            var43 = ((var10004 | var43 << 2) & 65472) >> 6 | (((var100 | var46 << 9) & 49152) >> 14 | var43 << 2) << 10;
            var10004 = ((var102 | var48 << 10) & 61440) >> 12;
            int var50 = ((var102 | var48 << 10) & 61440) >> 12 | var43 << 4;
            int var104 = ((((var102 | var48 << 10) & 61440) >> 12 | var43 << 4) & 65472) >> 6;
            char var51 = (char)(((var10004 | var43 << 4) & 65472) >> 6 | (((var102 | var48 << 10) & 61440) >> 12 | var43 << 4) << 10);
            var14.setCharAt(var24, (char)(var104 | var50 << 10));
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = (-729359985 & -343838987 | 0) & 545231200; var30 < var17.length(); var30 += (-1508339429 >> 2038500246 | 1) & 3) {
            char var56 = var17.charAt(var30);
            char var63 = (char)(
               (
                        (
                              (
                                       (
                                             (
                                                   (
                                                            (
                                                                  (
                                                                           (
                                                                                 (
                                                                                          (
                                                                                                   (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                                      | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                                                )
                                                                                                + 77
                                                                                             & 65024
                                                                                       )
                                                                                       >> 9
                                                                                    | (
                                                                                             (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                                | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                                          )
                                                                                          + 77
                                                                                       << 7
                                                                              )
                                                                              & 0
                                                                        )
                                                                        >> 16
                                                                     | (
                                                                           (
                                                                                    (
                                                                                             (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                                | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                                          )
                                                                                          + 77
                                                                                       & 65024
                                                                                 )
                                                                                 >> 9
                                                                              | (
                                                                                       (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                          | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                                    )
                                                                                    + 77
                                                                                 << 7
                                                                        )
                                                                        << 0
                                                               )
                                                               & 65472
                                                         )
                                                         >> 6
                                                      | (
                                                            (
                                                                     (
                                                                           (
                                                                                    (
                                                                                             (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                                | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                                          )
                                                                                          + 77
                                                                                       & 65024
                                                                                 )
                                                                                 >> 9
                                                                              | (
                                                                                       (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                          | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                                    )
                                                                                    + 77
                                                                                 << 7
                                                                        )
                                                                        & 0
                                                                  )
                                                                  >> 16
                                                               | (
                                                                     (
                                                                              (
                                                                                       (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                          | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                                    )
                                                                                    + 77
                                                                                 & 65024
                                                                           )
                                                                           >> 9
                                                                        | (
                                                                                 (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                    | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                              )
                                                                              + 77
                                                                           << 7
                                                                  )
                                                                  << 0
                                                         )
                                                         << 10
                                                )
                                                ^ 111
                                          )
                                          & 64512
                                    )
                                    >> 10
                                 | (
                                       (
                                             (
                                                      (
                                                            (
                                                                     (
                                                                           (
                                                                                    (
                                                                                             (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                                | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                                          )
                                                                                          + 77
                                                                                       & 65024
                                                                                 )
                                                                                 >> 9
                                                                              | (
                                                                                       (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                          | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                                    )
                                                                                    + 77
                                                                                 << 7
                                                                        )
                                                                        & 0
                                                                  )
                                                                  >> 16
                                                               | (
                                                                     (
                                                                              (
                                                                                       (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                          | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                                    )
                                                                                    + 77
                                                                                 & 65024
                                                                           )
                                                                           >> 9
                                                                        | (
                                                                                 (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                    | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                              )
                                                                              + 77
                                                                           << 7
                                                                  )
                                                                  << 0
                                                         )
                                                         & 65472
                                                   )
                                                   >> 6
                                                | (
                                                      (
                                                               (
                                                                     (
                                                                              (
                                                                                       (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                          | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                                    )
                                                                                    + 77
                                                                                 & 65024
                                                                           )
                                                                           >> 9
                                                                        | (
                                                                                 (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                    | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                              )
                                                                              + 77
                                                                           << 7
                                                                  )
                                                                  & 0
                                                            )
                                                            >> 16
                                                         | (
                                                               (
                                                                        (
                                                                                 (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                    | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                              )
                                                                              + 77
                                                                           & 65024
                                                                     )
                                                                     >> 9
                                                                  | (
                                                                           (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                              | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                        )
                                                                        + 77
                                                                     << 7
                                                            )
                                                            << 0
                                                   )
                                                   << 10
                                          )
                                          ^ 111
                                    )
                                    << 6
                           )
                           & 65472
                     )
                     >> 6
                  | (
                        (
                                 (
                                       (
                                             (
                                                      (
                                                            (
                                                                     (
                                                                           (
                                                                                    (
                                                                                             (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                                | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                                          )
                                                                                          + 77
                                                                                       & 65024
                                                                                 )
                                                                                 >> 9
                                                                              | (
                                                                                       (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                          | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                                    )
                                                                                    + 77
                                                                                 << 7
                                                                        )
                                                                        & 0
                                                                  )
                                                                  >> 16
                                                               | (
                                                                     (
                                                                              (
                                                                                       (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                          | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                                    )
                                                                                    + 77
                                                                                 & 65024
                                                                           )
                                                                           >> 9
                                                                        | (
                                                                                 (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                    | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                              )
                                                                              + 77
                                                                           << 7
                                                                  )
                                                                  << 0
                                                         )
                                                         & 65472
                                                   )
                                                   >> 6
                                                | (
                                                      (
                                                               (
                                                                     (
                                                                              (
                                                                                       (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                          | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                                    )
                                                                                    + 77
                                                                                 & 65024
                                                                           )
                                                                           >> 9
                                                                        | (
                                                                                 (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                    | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                              )
                                                                              + 77
                                                                           << 7
                                                                  )
                                                                  & 0
                                                            )
                                                            >> 16
                                                         | (
                                                               (
                                                                        (
                                                                                 (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                    | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                              )
                                                                              + 77
                                                                           & 65024
                                                                     )
                                                                     >> 9
                                                                  | (
                                                                           (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                              | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                        )
                                                                        + 77
                                                                     << 7
                                                            )
                                                            << 0
                                                   )
                                                   << 10
                                          )
                                          ^ 111
                                    )
                                    & 64512
                              )
                              >> 10
                           | (
                                 (
                                       (
                                                (
                                                      (
                                                               (
                                                                     (
                                                                              (
                                                                                       (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                          | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                                    )
                                                                                    + 77
                                                                                 & 65024
                                                                           )
                                                                           >> 9
                                                                        | (
                                                                                 (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                    | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                              )
                                                                              + 77
                                                                           << 7
                                                                  )
                                                                  & 0
                                                            )
                                                            >> 16
                                                         | (
                                                               (
                                                                        (
                                                                                 (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                    | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                              )
                                                                              + 77
                                                                           & 65024
                                                                     )
                                                                     >> 9
                                                                  | (
                                                                           (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                              | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                        )
                                                                        + 77
                                                                     << 7
                                                            )
                                                            << 0
                                                   )
                                                   & 65472
                                             )
                                             >> 6
                                          | (
                                                (
                                                         (
                                                               (
                                                                        (
                                                                                 (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                    | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                              )
                                                                              + 77
                                                                           & 65024
                                                                     )
                                                                     >> 9
                                                                  | (
                                                                           (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                              | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                        )
                                                                        + 77
                                                                     << 7
                                                            )
                                                            & 0
                                                      )
                                                      >> 16
                                                   | (
                                                         (
                                                                  (
                                                                           (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                              | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                        )
                                                                        + 77
                                                                     & 65024
                                                               )
                                                               >> 9
                                                            | (
                                                                     (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                        | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                  )
                                                                  + 77
                                                               << 7
                                                      )
                                                      << 0
                                             )
                                             << 10
                                    )
                                    ^ 111
                              )
                              << 6
                     )
                     << 10
            );
            var17.setCharAt(
               var30,
               (char)(
                  (
                           (
                                 (
                                          (
                                                (
                                                      (
                                                               (
                                                                     (
                                                                              (
                                                                                    (
                                                                                             (
                                                                                                      (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                                         | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                                                   )
                                                                                                   + 77
                                                                                                & 65024
                                                                                          )
                                                                                          >> 9
                                                                                       | (
                                                                                                (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                                   | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                                             )
                                                                                             + 77
                                                                                          << 7
                                                                                 )
                                                                                 & 0
                                                                           )
                                                                           >> 16
                                                                        | (
                                                                              (
                                                                                       (
                                                                                                (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                                   | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                                             )
                                                                                             + 77
                                                                                          & 65024
                                                                                    )
                                                                                    >> 9
                                                                                 | (
                                                                                          (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                             | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                                       )
                                                                                       + 77
                                                                                    << 7
                                                                           )
                                                                           << 0
                                                                  )
                                                                  & 65472
                                                            )
                                                            >> 6
                                                         | (
                                                               (
                                                                        (
                                                                              (
                                                                                       (
                                                                                                (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                                   | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                                             )
                                                                                             + 77
                                                                                          & 65024
                                                                                    )
                                                                                    >> 9
                                                                                 | (
                                                                                          (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                             | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                                       )
                                                                                       + 77
                                                                                    << 7
                                                                           )
                                                                           & 0
                                                                     )
                                                                     >> 16
                                                                  | (
                                                                        (
                                                                                 (
                                                                                          (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                             | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                                       )
                                                                                       + 77
                                                                                    & 65024
                                                                              )
                                                                              >> 9
                                                                           | (
                                                                                    (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                       | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                                 )
                                                                                 + 77
                                                                              << 7
                                                                     )
                                                                     << 0
                                                            )
                                                            << 10
                                                   )
                                                   ^ 111
                                             )
                                             & 64512
                                       )
                                       >> 10
                                    | (
                                          (
                                                (
                                                         (
                                                               (
                                                                        (
                                                                              (
                                                                                       (
                                                                                                (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                                   | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                                             )
                                                                                             + 77
                                                                                          & 65024
                                                                                    )
                                                                                    >> 9
                                                                                 | (
                                                                                          (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                             | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                                       )
                                                                                       + 77
                                                                                    << 7
                                                                           )
                                                                           & 0
                                                                     )
                                                                     >> 16
                                                                  | (
                                                                        (
                                                                                 (
                                                                                          (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                             | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                                       )
                                                                                       + 77
                                                                                    & 65024
                                                                              )
                                                                              >> 9
                                                                           | (
                                                                                    (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                       | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                                 )
                                                                                 + 77
                                                                              << 7
                                                                     )
                                                                     << 0
                                                            )
                                                            & 65472
                                                      )
                                                      >> 6
                                                   | (
                                                         (
                                                                  (
                                                                        (
                                                                                 (
                                                                                          (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                             | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                                       )
                                                                                       + 77
                                                                                    & 65024
                                                                              )
                                                                              >> 9
                                                                           | (
                                                                                    (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                       | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                                 )
                                                                                 + 77
                                                                              << 7
                                                                     )
                                                                     & 0
                                                               )
                                                               >> 16
                                                            | (
                                                                  (
                                                                           (
                                                                                    (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                       | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                                 )
                                                                                 + 77
                                                                              & 65024
                                                                        )
                                                                        >> 9
                                                                     | (
                                                                              (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                 | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                           )
                                                                           + 77
                                                                        << 7
                                                               )
                                                               << 0
                                                      )
                                                      << 10
                                             )
                                             ^ 111
                                       )
                                       << 6
                              )
                              & 65472
                        )
                        >> 6
                     | (
                           (
                                    (
                                          (
                                                (
                                                         (
                                                               (
                                                                        (
                                                                              (
                                                                                       (
                                                                                                (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                                   | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                                             )
                                                                                             + 77
                                                                                          & 65024
                                                                                    )
                                                                                    >> 9
                                                                                 | (
                                                                                          (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                             | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                                       )
                                                                                       + 77
                                                                                    << 7
                                                                           )
                                                                           & 0
                                                                     )
                                                                     >> 16
                                                                  | (
                                                                        (
                                                                                 (
                                                                                          (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                             | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                                       )
                                                                                       + 77
                                                                                    & 65024
                                                                              )
                                                                              >> 9
                                                                           | (
                                                                                    (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                       | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                                 )
                                                                                 + 77
                                                                              << 7
                                                                     )
                                                                     << 0
                                                            )
                                                            & 65472
                                                      )
                                                      >> 6
                                                   | (
                                                         (
                                                                  (
                                                                        (
                                                                                 (
                                                                                          (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                             | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                                       )
                                                                                       + 77
                                                                                    & 65024
                                                                              )
                                                                              >> 9
                                                                           | (
                                                                                    (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                       | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                                 )
                                                                                 + 77
                                                                              << 7
                                                                     )
                                                                     & 0
                                                               )
                                                               >> 16
                                                            | (
                                                                  (
                                                                           (
                                                                                    (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                       | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                                 )
                                                                                 + 77
                                                                              & 65024
                                                                        )
                                                                        >> 9
                                                                     | (
                                                                              (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                 | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                           )
                                                                           + 77
                                                                        << 7
                                                               )
                                                               << 0
                                                      )
                                                      << 10
                                             )
                                             ^ 111
                                       )
                                       & 64512
                                 )
                                 >> 10
                              | (
                                    (
                                          (
                                                   (
                                                         (
                                                                  (
                                                                        (
                                                                                 (
                                                                                          (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                             | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                                       )
                                                                                       + 77
                                                                                    & 65024
                                                                              )
                                                                              >> 9
                                                                           | (
                                                                                    (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                       | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                                 )
                                                                                 + 77
                                                                              << 7
                                                                     )
                                                                     & 0
                                                               )
                                                               >> 16
                                                            | (
                                                                  (
                                                                           (
                                                                                    (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                       | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                                 )
                                                                                 + 77
                                                                              & 65024
                                                                        )
                                                                        >> 9
                                                                     | (
                                                                              (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                 | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                           )
                                                                           + 77
                                                                        << 7
                                                               )
                                                               << 0
                                                      )
                                                      & 65472
                                                )
                                                >> 6
                                             | (
                                                   (
                                                            (
                                                                  (
                                                                           (
                                                                                    (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                       | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                                 )
                                                                                 + 77
                                                                              & 65024
                                                                        )
                                                                        >> 9
                                                                     | (
                                                                              (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                 | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                           )
                                                                           + 77
                                                                        << 7
                                                               )
                                                               & 0
                                                         )
                                                         >> 16
                                                      | (
                                                            (
                                                                     (
                                                                              (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                                 | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                           )
                                                                           + 77
                                                                        & 65024
                                                                  )
                                                                  >> 9
                                                               | (
                                                                        (((var56 & '￠') >> 5 | var56 << 11) + 137 & 65532) >> 2
                                                                           | ((var56 & '￠') >> 5 | var56 << 11) + 137 << 14
                                                                     )
                                                                     + 77
                                                                  << 7
                                                         )
                                                         << 0
                                                )
                                                << 10
                                       )
                                       ^ 111
                                 )
                                 << 6
                        )
                        << 10
               )
            );
         }

         Class var6 = Class.forName(var17.toString(), false, Class_372.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = -1457363465 & -1507614469 & 243503261 ^ 131217; var36 < var20.length(); var36 += 1280373884 - 1280373884 ^ 1) {
            char var68 = var20.charAt(var36);
            char var71 = (char)(
               (
                        ((((var68 & '\uf000') >> 12 | var68 << 4) + 134 & 49152) >> 14 | ((var68 & '\uf000') >> 12 | var68 << 4) + 134 << 2)
                              + 208
                              + 5
                              + 48
                              - 212
                              - 245
                              + 230
                           & 61440
                     )
                     >> 12
                  | ((((var68 & '\uf000') >> 12 | var68 << 4) + 134 & 49152) >> 14 | ((var68 & '\uf000') >> 12 | var68 << 4) + 134 << 2)
                        + 208
                        + 5
                        + 48
                        - 212
                        - 245
                        + 230
                     << 4
            );
            var20.setCharAt(
               var36,
               (char)(
                  (
                           ((((var68 & '\uf000') >> 12 | var68 << 4) + 134 & 49152) >> 14 | ((var68 & '\uf000') >> 12 | var68 << 4) + 134 << 2)
                                 + 208
                                 + 5
                                 + 48
                                 - 212
                                 - 245
                                 + 230
                              & 61440
                        )
                        >> 12
                     | ((((var68 & '\uf000') >> 12 | var68 << 4) + 134 & 49152) >> 14 | ((var68 & '\uf000') >> 12 | var68 << 4) + 134 << 2)
                           + 208
                           + 5
                           + 48
                           - 212
                           - 245
                           + 230
                        << 4
               )
            );
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_372.class.getClassLoader()).returnType();
         switch (((var4 ^ 661799774 ^ 1142552257) - 1040800678 - 1992960233 ^ 42602847 ^ 733603733) - 439436012 + 1908132282 + 588095216 - 1696980001) {
            case 288752724:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            case 1007603771:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            case 1262263482:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            case 1432154348:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_1626[((var10 ^ 1552642594 ^ 1523064139 ^ 1455751828) - 1950214176 ^ 158875517) + 658540446 + 1169159259 - 964569393 + 1048004160 + 1246011160] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
