import com.google.gson.JsonElement;
import com.google.gson.JsonObject;
import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;

public class Class_414 extends Class_271 {
   // $VF: renamed from: v Class_262
   public Class_262 field_893;
   // $VF: renamed from: u Class_262
   public Class_262 field_894;
   // $VF: renamed from: dc double
   public double field_895 = 0.0;
   // $VF: renamed from: uqr java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_896 = new MethodHandle[(-172825875 + -39854697 + -172825875 | 2) & 382866555];

   public Class_414(String var1, Class_262 var2) {
      super(var1);
      this.field_894 = 0<"JNT",-2061331602,"\ueb22쬢ꬢꬢ","誙躙㪘ꪘ횘욙","䍒䌶",-2128887384>(var2);
      this.field_893 = 0<"JNT",-2061331602,"\ueb22쬢ꬢꬢ","誙躙㪘ꪘ횘욙","䍒䌶",-2128887377>(var2);
      float[] var3 = 0<"JNT",-1811836566,"謥謥ꬥ","誙ຘຘຘ䚘ኘ躙䚘ኘ","䍒䌶",-2128887485>(
         1<"JNT",-2012065188,"翽藼燽","ﰡ\udc22","↘≨⑨",1733042334>(var2),
         1<"JNT",-2012065188,"濽珽篽","ﰡ\udc22","↘≨⑨",1733042333>(var2),
         1<"JNT",-2012065188,"蟼槽","ﰡ\udc22","↘≨⑨",1733042340>(var2),
         null
      );
      this.field_895 = (double)(var3[0] * 360.0F);
   }

   public Class_414(String var1, int var2, int var3, int var4) {
      this(var1, (Class_262)0<"JNT",1932703991,"ମꬣ䬤ꬣଥ䬮","誙ຘຘຘຘ躙劘","䍒䌶",-2128887378>(var2, var3, var4, 255));
   }

   public Class_414(String var1, int var2, int var3, int var4, int var5) {
      this(var1, (Class_262)0<"JNT",1932703991,"ମꬣ䬤ꬣଥ䬮","誙ຘຘຘຘ躙劘","䍒䌶",-2128887379>(var2, var3, var4, var5));
   }

   // $VF: renamed from: m () Class_262
   public Class_262 method_970() {
      return 1<"JNT",-2012065188,"揽","㰣밠","↘≨\u2458☘⚈⍈",1733042344>(this);
   }

   // $VF: renamed from: o (Class_262) void
   public void method_971(Class_262 var1) {
      0<"JNT",-2061331602,"ଥ⬥","誙㪘ꪘ횘욙躙㪘ꪘ횘욙","䍒䌶",-2128887486>(1<"JNT",-2012065188,"揽","㰣밠","↘≨\u2458☘⚈⍈",1733042343>(this), var1);
      0<"JNT",-2061331602,"ଣꬢꬤ","誙躙劘","䌺㲊",-2128887487>(this);
   }

   // $VF: renamed from: c (int, int, int, int) void
   public void method_972(int var1, int var2, int var3, int var4) {
      0<"JNT",-2061331602,"欤쬣\ueb23","誙ຘຘຘຘ躙㪘ꪘ횘욙","䍒䌶",-2128887493>(1<"JNT",-2012065188,"揽","㰣밠","↘≨\u2458☘⚈⍈",1733042348>(this), var1, var2, var3, var4);
      0<"JNT",-2061331602,"ଣꬢꬤ","誙躙劘","䌺㲊",-2128887482>(this);
   }

   // $VF: renamed from: j () Class_262
   public Class_262 method_973() {
      return 1<"JNT",-2012065188,"旽","㰣밠","↘≨\u2458☘⚈⍈",1733042345>(this);
   }

   // $VF: renamed from: y () int
   public int method_974() {
      return 1<"JNT",-2012065188,"翽藼燽","ﰡ\udc22","↘≨⑨",1733042319>(1<"JNT",-2012065188,"揽","㰣밠","↘≨\u2458☘⚈⍈",1733042320>(this));
   }

   // $VF: renamed from: qq () int
   public int method_975() {
      return 1<"JNT",-2012065188,"濽珽篽","ﰡ\udc22","↘≨⑨",1733042317>(1<"JNT",-2012065188,"揽","㰣밠","↘≨\u2458☘⚈⍈",1733042318>(this));
   }

   // $VF: renamed from: d () int
   public int method_976() {
      return 1<"JNT",-2012065188,"蟼槽","ﰡ\udc22","↘≨⑨",1733042323>(1<"JNT",-2012065188,"揽","㰣밠","↘≨\u2458☘⚈⍈",1733042324>(this));
   }

   // $VF: renamed from: t () int
   public int method_977() {
      return 1<"JNT",-2012065188,"篽蟼","ﰡ\udc22","↘≨⑨",1733042321>(1<"JNT",-2012065188,"揽","㰣밠","↘≨\u2458☘⚈⍈",1733042322>(this));
   }

   // $VF: renamed from: f () int
   public int method_978() {
      return 0<"JNT",-2061331602,"쬣쬤\ueb24","誙躙ຘ","䍒䌶",-2128887369>(1<"JNT",-2012065188,"揽","㰣밠","↘≨\u2458☘⚈⍈",1733042328>(this));
   }

   // $VF: renamed from: hh () Class_262
   public Class_262 method_979() {
      return (Class_262)0<"JNT",1932703991,"ମꬣ䬤ꬣଥ䬮","誙ຘຘຘຘ躙劘","䍒䌶",-2128887414>(
         1<"JNT",-2012065188,"翽藼燽","ﰡ\udc22","↘≨⑨",1733042325>(1<"JNT",-2012065188,"揽","㰣밠","↘≨\u2458☘⚈⍈",1733042326>(this)),
         1<"JNT",-2012065188,"濽珽篽","ﰡ\udc22","↘≨⑨",1733042331>(1<"JNT",-2012065188,"揽","㰣밠","↘≨\u2458☘⚈⍈",1733042332>(this)),
         1<"JNT",-2012065188,"蟼槽","ﰡ\udc22","↘≨⑨",1733042329>(1<"JNT",-2012065188,"揽","㰣밠","↘≨\u2458☘⚈⍈",1733042330>(this)),
         1<"JNT",-2012065188,"篽蟼","ﰡ\udc22","↘≨⑨",1733042431>(1<"JNT",-2012065188,"揽","㰣밠","↘≨\u2458☘⚈⍈",1733042304>(this))
      );
   }

   // $VF: renamed from: k () double
   public double method_980() {
      return 1<"JNT",-2012065188,"臼迼","㰣밠","↘≨⏘",1733042429>(this);
   }

   // $VF: renamed from: si (double) void
   public void method_981(double var1) {
      1<"JNT",-1076329544,"臼迼","㰣밠","↘≨⏘",1733042308>(this, var1);
   }

   // $VF: renamed from: s () boolean
   @Override
   public boolean method_923() {
      return 1<"JNT",-2012065188,"翽藼燽","ﰡ\udc22","↘≨⑨",1733042306>(1<"JNT",-2012065188,"揽","㰣밠","↘≨\u2458☘⚈⍈",1733042307>(this))
            == 1<"JNT",-2012065188,"翽藼燽","ﰡ\udc22","↘≨⑨",1733042312>(1<"JNT",-2012065188,"旽","㰣밠","↘≨\u2458☘⚈⍈",1733042305>(this))
         && 1<"JNT",-2012065188,"濽珽篽","ﰡ\udc22","↘≨⑨",1733042310>(1<"JNT",-2012065188,"揽","㰣밠","↘≨\u2458☘⚈⍈",1733042311>(this))
            == 1<"JNT",-2012065188,"濽珽篽","ﰡ\udc22","↘≨⑨",1733042316>(1<"JNT",-2012065188,"旽","㰣밠","↘≨\u2458☘⚈⍈",1733042309>(this))
         && 1<"JNT",-2012065188,"蟼槽","ﰡ\udc22","↘≨⑨",1733042314>(1<"JNT",-2012065188,"揽","㰣밠","↘≨\u2458☘⚈⍈",1733042315>(this))
            == 1<"JNT",-2012065188,"蟼槽","ﰡ\udc22","↘≨⑨",1733042416>(1<"JNT",-2012065188,"旽","㰣밠","↘≨\u2458☘⚈⍈",1733042313>(this))
         && 1<"JNT",-2012065188,"篽蟼","ﰡ\udc22","↘≨⑨",1733042414>(1<"JNT",-2012065188,"揽","㰣밠","↘≨\u2458☘⚈⍈",1733042415>(this))
            == 1<"JNT",-2012065188,"篽蟼","ﰡ\udc22","↘≨⑨",1733042420>(1<"JNT",-2012065188,"旽","㰣밠","↘≨\u2458☘⚈⍈",1733042413>(this));
   }

   // $VF: renamed from: r () com.google.gson.JsonElement
   @Override
   public JsonElement method_924() {
      JsonObject var1 = (JsonObject)0<"JNT",1932703991,"ମꬣ䬤ꬣଥ䬮","誙躙劘","㲆㱖㱮㵪㱶㱖㱖㱶㱢㲎㵪㱶䍆㱖㱪㵪㷺䍆㱖㱪㷖㲚㱺㲎㲆䍂",-2128887407>();
      0<"JNT",-2061331602,"ꬢଣଣ謠쬤欤謤⬣쬤ଥꬥ","誙㪘芘溘튘溘뚙몘溘늘隘뚙⚘\uda98ꊘ躘늘隘욙㪘芘溘튘溘뚙몘溘늘隘뚙㊘\ude98뺘折麘ꊘ욙躙劘","㲆㱖㱮㵪㱶㱖㱖㱶㱢㲎㵪㱶䍆㱖㱪㵪㷺䍆㱖㱪㷖㲚㱺㲎㲆䍂",-2128887403>(
         var1,
         "r",
         0<"JNT",-1811836566,"䬥ꬢତ⬥⬣欠䬣","誙ຘ躙㪘芘溘튘溘뚙몘溘늘隘뚙ຘ늘\uda98麘隘麘ꊘ욙","㱺㲞䍊㲞㵪㱢㲞㱪㱶㵪㷾㱪䍂㲎㱶㲎䍚",-2128887402>(
            1<"JNT",-2012065188,"翽藼燽","ﰡ\udc22","↘≨⑨",1733042427>(1<"JNT",-2012065188,"揽","㰣밠","↘≨\u2458☘⚈⍈",1733042428>(this))
         )
      );
      0<"JNT",-2061331602,"ꬢଣଣ謠쬤欤謤⬣쬤ଥꬥ","誙㪘芘溘튘溘뚙몘溘늘隘뚙⚘\uda98ꊘ躘늘隘욙㪘芘溘튘溘뚙몘溘늘隘뚙㊘\ude98뺘折麘ꊘ욙躙劘","㲆㱖㱮㵪㱶㱖㱖㱶㱢㲎㵪㱶䍆㱖㱪㵪㷺䍆㱖㱪㷖㲚㱺㲎㲆䍂",-2128887319>(
         var1,
         "g",
         0<"JNT",-1811836566,"䬥ꬢତ⬥⬣欠䬣","誙ຘ躙㪘芘溘튘溘뚙몘溘늘隘뚙ຘ늘\uda98麘隘麘ꊘ욙","㱺㲞䍊㲞㵪㱢㲞㱪㱶㵪㷾㱪䍂㲎㱶㲎䍚",-2128887318>(
            1<"JNT",-2012065188,"濽珽篽","ﰡ\udc22","↘≨⑨",1733042271>(1<"JNT",-2012065188,"揽","㰣밠","↘≨\u2458☘⚈⍈",1733042272>(this))
         )
      );
      0<"JNT",-2061331602,"ꬢଣଣ謠쬤欤謤⬣쬤ଥꬥ","誙㪘芘溘튘溘뚙몘溘늘隘뚙⚘\uda98ꊘ躘늘隘욙㪘芘溘튘溘뚙몘溘늘隘뚙㊘\ude98뺘折麘ꊘ욙躙劘","㲆㱖㱮㵪㱶㱖㱖㱶㱢㲎㵪㱶䍆㱖㱪㵪㷺䍆㱖㱪㷖㲚㱺㲎㲆䍂",-2128887315>(
         var1,
         "b",
         0<"JNT",-1811836566,"䬥ꬢତ⬥⬣欠䬣","誙ຘ躙㪘芘溘튘溘뚙몘溘늘隘뚙ຘ늘\uda98麘隘麘ꊘ욙","㱺㲞䍊㲞㵪㱢㲞㱪㱶㵪㷾㱪䍂㲎㱶㲎䍚",-2128887314>(
            1<"JNT",-2012065188,"蟼槽","ﰡ\udc22","↘≨⑨",1733042275>(1<"JNT",-2012065188,"揽","㰣밠","↘≨\u2458☘⚈⍈",1733042276>(this))
         )
      );
      0<"JNT",-2061331602,"ꬢଣଣ謠쬤欤謤⬣쬤ଥꬥ","誙㪘芘溘튘溘뚙몘溘늘隘뚙⚘\uda98ꊘ躘늘隘욙㪘芘溘튘溘뚙몘溘늘隘뚙㊘\ude98뺘折麘ꊘ욙躙劘","㲆㱖㱮㵪㱶㱖㱖㱶㱢㲎㵪㱶䍆㱖㱪㵪㷺䍆㱖㱪㷖㲚㱺㲎㲆䍂",-2128887423>(
         var1,
         "a",
         0<"JNT",-1811836566,"䬥ꬢତ⬥⬣欠䬣","誙ຘ躙㪘芘溘튘溘뚙몘溘늘隘뚙ຘ늘\uda98麘隘麘ꊘ욙","㱺㲞䍊㲞㵪㱢㲞㱪㱶㵪㷾㱪䍂㲎㱶㲎䍚",-2128887422>(
            1<"JNT",-2012065188,"篽蟼","ﰡ\udc22","↘≨⑨",1733042279>(1<"JNT",-2012065188,"揽","㰣밠","↘≨\u2458☘⚈⍈",1733042280>(this))
         )
      );
      int var10001 = 1784672750 - (-550835984 << -550835984) ^ -2123370002;

      StringBuilder var10002;
      for (var10002 = (StringBuilder)0<"JNT",1932703991,"ମꬣ䬤ꬣଥ䬮","誙㪘芘溘튘溘뚙몘溘늘隘뚙⚘\uda98ꊘ躘늘隘욙躙劘","㱺㲞䍊㲞㵪㱢㲞㱪㱶㵪㳆䍂䍚㱾㱪㱶㰚䍎㱾㱢㲂㲎䍚",-2128887420>("ᤌ\u1c4cᡌ");
         var10001 < 3;
         var10001 += 1
      ) {
         int var4 = (0<"JNT",-2061331602,"\ueb22謣ꬢ쬤ꬮଥ","誙ຘ躙\ue699","㱺㲞䍊㲞㵪㱢㲞㱪㱶㵪㳆䍂䍚㱾㱪㱶㰚䍎㱾㱢㲂㲎䍚",-2128887401>(var10002, var10001) ^ 168) - 26;
         int var10005 = (var4 & 0) >> 16;
         int var5 = ((var4 & 0) >> 16 | var4 << 0) + 118;
         int var9 = (((var4 & 0) >> 16 | var4 << 0) + 118 & 65472) >> 6;
         char var6 = (char)(((var10005 | var4 << 0) + 118 & 65472) >> 6 | ((var4 & 0) >> 16 | var4 << 0) + 118 << 10);
         0<"JNT",-2061331602,"\ueb24⬣ଥ\ueb2e謣ꬢ쬤ꬮଥ","誙ຘ\ue699躙劘","㱺㲞䍊㲞㵪㱢㲞㱪㱶㵪㳆䍂䍚㱾㱪㱶㰚䍎㱾㱢㲂㲎䍚",-2128887406>(var10002, var10001, (char)(var9 | var5 << 10));
      }

      0<"JNT",-2061331602,"ꬢଣଣ謠쬤欤謤⬣쬤ଥꬥ","誙㪘芘溘튘溘뚙몘溘늘隘뚙⚘\uda98ꊘ躘늘隘욙㪘芘溘튘溘뚙몘溘늘隘뚙㊘\ude98뺘折麘ꊘ욙躙劘","㲆㱖㱮㵪㱶㱖㱖㱶㱢㲎㵪㱶䍆㱖㱪㵪㷺䍆㱖㱪㷖㲚㱺㲎㲆䍂",-2128887408>(
         var1,
         0<"JNT",-2061331602,"ଥ欤\ueb20ଥ쬤ꬣ䬤欣","誙躙㪘芘溘튘溘뚙몘溘늘隘뚙⚘\uda98ꊘ躘늘隘욙","㱺㲞䍊㲞㵪㱢㲞㱪㱶㵪㳆䍂䍚㱾㱪㱶㰚䍎㱾㱢㲂㲎䍚",-2128887405>(var10002),
         0<"JNT",-1811836566,"䬥ꬢତ⬥⬣欠䬣","誙᪘躙㪘芘溘튘溘뚙몘溘늘隘뚙᪘뚘\ude98折몘麘욙","㱺㲞䍊㲞㵪㱢㲞㱪㱶㵪㰂㱖䍎㲚㱢㲎",-2128887427>(1<"JNT",-2012065188,"臼迼","㰣밠","↘≨⏘",1733042418>(this))
      );
      return var1;
   }

   // $VF: renamed from: vz (com.google.gson.JsonElement) void
   @Override
   public void method_925(JsonElement var1) {
      if (0<"JNT",-2061331602,"ꬣ\ueb24쬯\ueb24欤䬤欠쬢쬣⬣\ueb22ଥ","誙躙䊘","㲆㱖㱮㵪㱶㱖㱖㱶㱢㲎㵪㱶䍆㱖㱪㵪㷺䍆㱖㱪㰎㱢㲎㱮㲎㱪䍂",-2128887317>(var1)) {
         JsonObject var2 = 0<"JNT",-2061331602,"欣⬣ଥꬮ\ueb24쬯\ueb24欤䬤欠쬢쬣⬣\ueb22ଥ","誙躙㪘暘뚘뺘뚙隘뚘뚘隘몘麘뚙隘Ꚙ뚘늘뚙ʘꚘ뚘늘㚘折芘麘暘\uda98욙","㲆㱖㱮㵪㱶㱖㱖㱶㱢㲎㵪㱶䍆㱖㱪㵪㷺䍆㱖㱪㰎㱢㲎㱮㲎㱪䍂",-2128887306>(
            var1
         );
         int var3 = 0<"JNT",-2061331602,"謣ꬢ\ueb24","誙㪘芘溘튘溘뚙몘溘늘隘뚙⚘\uda98ꊘ躘늘隘욙躙䊘","㲆㱖㱮㵪㱶㱖㱖㱶㱢㲎㵪㱶䍆㱖㱪㵪㷺䍆㱖㱪㷖㲚㱺㲎㲆䍂",-2128887307>(var2, "r")
            ? 0<"JNT",-2061331602,"欣⬣ଥꬮ\ueb24\uab2f䬤ଥ","誙躙ຘ","㲆㱖㱮㵪㱶㱖㱖㱶㱢㲎㵪㱶䍆㱖㱪㵪㷺䍆㱖㱪㰎㱢㲎㱮㲎㱪䍂",-2128887345>(
               0<"JNT",-2061331602,"欣⬣ଥ","誙㪘芘溘튘溘뚙몘溘늘隘뚙⚘\uda98ꊘ躘늘隘욙躙㪘暘뚘뺘뚙隘뚘뚘隘몘麘뚙隘Ꚙ뚘늘뚙ʘꚘ뚘늘ẘ몘麘뺘麘늘\uda98욙","㲆㱖㱮㵪㱶㱖㱖㱶㱢㲎㵪㱶䍆㱖㱪㵪㷺䍆㱖㱪㷖㲚㱺㲎㲆䍂",-2128887352>(var2, "r")
            )
            : 255;
         int var4 = 0<"JNT",-2061331602,"謣ꬢ\ueb24","誙㪘芘溘튘溘뚙몘溘늘隘뚙⚘\uda98ꊘ躘늘隘욙躙䊘","㲆㱖㱮㵪㱶㱖㱖㱶㱢㲎㵪㱶䍆㱖㱪㵪㷺䍆㱖㱪㷖㲚㱺㲎㲆䍂",-2128887329>(var2, "g")
            ? 0<"JNT",-2061331602,"欣⬣ଥꬮ\ueb24\uab2f䬤ଥ","誙躙ຘ","㲆㱖㱮㵪㱶㱖㱖㱶㱢㲎㵪㱶䍆㱖㱪㵪㷺䍆㱖㱪㰎㱢㲎㱮㲎㱪䍂",-2128887335>(
               0<"JNT",-2061331602,"欣⬣ଥ","誙㪘芘溘튘溘뚙몘溘늘隘뚙⚘\uda98ꊘ躘늘隘욙躙㪘暘뚘뺘뚙隘뚘뚘隘몘麘뚙隘Ꚙ뚘늘뚙ʘꚘ뚘늘ẘ몘麘뺘麘늘\uda98욙","㲆㱖㱮㵪㱶㱖㱖㱶㱢㲎㵪㱶䍆㱖㱪㵪㷺䍆㱖㱪㷖㲚㱺㲎㲆䍂",-2128887334>(var2, "g")
            )
            : 255;
         int var5 = 0<"JNT",-2061331602,"謣ꬢ\ueb24","誙㪘芘溘튘溘뚙몘溘늘隘뚙⚘\uda98ꊘ躘늘隘욙躙䊘","㲆㱖㱮㵪㱶㱖㱖㱶㱢㲎㵪㱶䍆㱖㱪㵪㷺䍆㱖㱪㷖㲚㱺㲎㲆䍂",-2128887325>(var2, "b")
            ? 0<"JNT",-2061331602,"欣⬣ଥꬮ\ueb24\uab2f䬤ଥ","誙躙ຘ","㲆㱖㱮㵪㱶㱖㱖㱶㱢㲎㵪㱶䍆㱖㱪㵪㷺䍆㱖㱪㰎㱢㲎㱮㲎㱪䍂",-2128887347>(
               0<"JNT",-2061331602,"欣⬣ଥ","誙㪘芘溘튘溘뚙몘溘늘隘뚙⚘\uda98ꊘ躘늘隘욙躙㪘暘뚘뺘뚙隘뚘뚘隘몘麘뚙隘Ꚙ뚘늘뚙ʘꚘ뚘늘ẘ몘麘뺘麘늘\uda98욙","㲆㱖㱮㵪㱶㱖㱖㱶㱢㲎㵪㱶䍆㱖㱪㵪㷺䍆㱖㱪㷖㲚㱺㲎㲆䍂",-2128887346>(var2, "b")
            )
            : 255;
         int var6 = 0<"JNT",-2061331602,"謣ꬢ\ueb24","誙㪘芘溘튘溘뚙몘溘늘隘뚙⚘\uda98ꊘ躘늘隘욙躙䊘","㲆㱖㱮㵪㱶㱖㱖㱶㱢㲎㵪㱶䍆㱖㱪㵪㷺䍆㱖㱪㷖㲚㱺㲎㲆䍂",-2128887310>(var2, "a")
            ? 0<"JNT",-2061331602,"欣⬣ଥꬮ\ueb24\uab2f䬤ଥ","誙躙ຘ","㲆㱖㱮㵪㱶㱖㱖㱶㱢㲎㵪㱶䍆㱖㱪㵪㷺䍆㱖㱪㰎㱢㲎㱮㲎㱪䍂",-2128887308>(
               0<"JNT",-2061331602,"欣⬣ଥ","誙㪘芘溘튘溘뚙몘溘늘隘뚙⚘\uda98ꊘ躘늘隘욙躙㪘暘뚘뺘뚙隘뚘뚘隘몘麘뚙隘Ꚙ뚘늘뚙ʘꚘ뚘늘ẘ몘麘뺘麘늘\uda98욙","㲆㱖㱮㵪㱶㱖㱖㱶㱢㲎㵪㱶䍆㱖㱪㵪㷺䍆㱖㱪㷖㲚㱺㲎㲆䍂",-2128887311>(var2, "a")
            )
            : 255;
         0<"JNT",-2061331602,"\ueb22","誙ຘຘຘຘ躙劘","䌺㲊",-2128887312>(this, var3, var4, var5, var6);
         int var10001 = (-1453319447 + -1453319447 | 0) & -2127214579;

         StringBuilder var10002;
         for (var10002 = (StringBuilder)0<"JNT",1932703991,"ମꬣ䬤ꬣଥ䬮","誙㪘芘溘튘溘뚙몘溘늘隘뚙⚘\uda98ꊘ躘늘隘욙躙劘","㱺㲞䍊㲞㵪㱢㲞㱪㱶㵪㳆䍂䍚㱾㱪㱶㰚䍎㱾㱢㲂㲎䍚",-2128887305>("ꪠ\uab00꤀");
            var10001 < 3;
            var10001 += -345414700 * -345414700 ^ 1121298321
         ) {
            char var11 = 0<"JNT",-2061331602,"\ueb22謣ꬢ쬤ꬮଥ","誙ຘ躙\ue699","㱺㲞䍊㲞㵪㱢㲞㱪㱶㵪㳆䍂䍚㱾㱪㱶㰚䍎㱾㱢㲂㲎䍚",-2128887429>(var10002, var10001);
            int var10005 = (var11 & '︀') >> 9;
            int var12 = ((var11 & '︀') >> 9 | var11 << 7) - 70;
            int var22 = (((var11 & '︀') >> 9 | var11 << 7) - 70 & 61440) >> 12;
            var11 = (char)(((((var10005 | var11 << 7) - 70 & 61440) >> 12 | ((var11 & '︀') >> 9 | var11 << 7) - 70 << 4) ^ 199) + 54);
            0<"JNT",-2061331602,"\ueb24⬣ଥ\ueb2e謣ꬢ쬤ꬮଥ","誙ຘ\ue699躙劘","㱺㲞䍊㲞㵪㱢㲞㱪㱶㵪㳆䍂䍚㱾㱪㱶㰚䍎㱾㱢㲂㲎䍚",-2128887418>(
               var10002, var10001, (char)(((var22 | var12 << 4) ^ 199) + 54)
            );
         }

         if (0<"JNT",-2061331602,"謣ꬢ\ueb24","誙㪘芘溘튘溘뚙몘溘늘隘뚙⚘\uda98ꊘ躘늘隘욙躙䊘","㲆㱖㱮㵪㱶㱖㱖㱶㱢㲎㵪㱶䍆㱖㱪㵪㷺䍆㱖㱪㷖㲚㱺㲎㲆䍂",-2128887351>(
            var2, 0<"JNT",-2061331602,"ଥ欤\ueb20ଥ쬤ꬣ䬤欣","誙躙㪘芘溘튘溘뚙몘溘늘隘뚙⚘\uda98ꊘ躘늘隘욙","㱺㲞䍊㲞㵪㱢㲞㱪㱶㵪㳆䍂䍚㱾㱪㱶㰚䍎㱾㱢㲂㲎䍚",-2128887350>(var10002)
         )) {
            int var9 = (1137704219 - -796109450 | 0) & 10750016;

            StringBuilder var15;
            for (var15 = (StringBuilder)0<"JNT",1932703991,"ମꬣ䬤ꬣଥ䬮","誙㪘芘溘튘溘뚙몘溘늘隘뚙⚘\uda98ꊘ躘늘隘욙躙劘","㱺㲞䍊㲞㵪㱢㲞㱪㱶㵪㳆䍂䍚㱾㱪㱶㰚䍎㱾㱢㲂㲎䍚",-2128887348>("胓탒탓");
               var9 < ((-1903975107 - -1903975107 | 3) & -903091041);
               var9 += -2062286847 & 973843973
            ) {
               int var19 = 0<"JNT",-2061331602,"\ueb22謣ꬢ쬤ꬮଥ","誙ຘ躙\ue699","㱺㲞䍊㲞㵪㱢㲞㱪㱶㵪㳆䍂䍚㱾㱪㱶㰚䍎㱾㱢㲂㲎䍚",-2128887419>(var15, var9) - 201;
               char var20 = (char)((((var19 & 61440) >> 12 | var19 << 4) ^ 204) + 118 ^ 178);
               0<"JNT",-2061331602,"\ueb24⬣ଥ\ueb2e謣ꬢ쬤ꬮଥ","誙ຘ\ue699躙劘","㱺㲞䍊㲞㵪㱢㲞㱪㱶㵪㳆䍂䍚㱾㱪㱶㰚䍎㱾㱢㲂㲎䍚",-2128887336>(
                  var15, var9, (char)((((var19 & 61440) >> 12 | var19 << 4) ^ 204) + 118 ^ 178)
               );
            }

            0<"JNT",-2061331602,"\ueb24ꬣ","誙᪘躙劘","䌺㲊",-2128887331>(
               this,
               0<"JNT",-2061331602,"欣⬣ଥꬮ\ueb24ଯ欤⬥쬢ତ⬣","誙躙᪘","㲆㱖㱮㵪㱶㱖㱖㱶㱢㲎㵪㱶䍆㱖㱪㵪㷺䍆㱖㱪㰎㱢㲎㱮㲎㱪䍂",-2128887330>(
                  0<"JNT",-2061331602,"欣⬣ଥ","誙㪘芘溘튘溘뚙몘溘늘隘뚙⚘\uda98ꊘ躘늘隘욙躙㪘暘뚘뺘뚙隘뚘뚘隘몘麘뚙隘Ꚙ뚘늘뚙ʘꚘ뚘늘ẘ몘麘뺘麘늘\uda98욙","㲆㱖㱮㵪㱶㱖㱖㱶㱢㲎㵪㱶䍆㱖㱪㵪㷺䍆㱖㱪㷖㲚㱺㲎㲆䍂",-2128887309>(
                     var2, 0<"JNT",-2061331602,"ଥ欤\ueb20ଥ쬤ꬣ䬤欣","誙躙㪘芘溘튘溘뚙몘溘늘隘뚙⚘\uda98ꊘ躘늘隘욙","㱺㲞䍊㲞㵪㱢㲞㱪㱶㵪㳆䍂䍚㱾㱪㱶㰚䍎㱾㱢㲂㲎䍚",-2128887332>(var15)
                  )
               )
            );
         }
      }
   }

   // $VF: renamed from: l () void
   @Override
   public void method_926() {
      0<"JNT",-2061331602,"\ueb22","誙ຘຘຘຘ躙劘","䌺㲊",-2128887368>(
         this,
         1<"JNT",-2012065188,"翽藼燽","ﰡ\udc22","↘≨⑨",1733042247>(1<"JNT",-2012065188,"旽","㰣밠","↘≨\u2458☘⚈⍈",1733042248>(this)),
         1<"JNT",-2012065188,"濽珽篽","ﰡ\udc22","↘≨⑨",1733042245>(1<"JNT",-2012065188,"旽","㰣밠","↘≨\u2458☘⚈⍈",1733042246>(this)),
         1<"JNT",-2012065188,"蟼槽","ﰡ\udc22","↘≨⑨",1733042251>(1<"JNT",-2012065188,"旽","㰣밠","↘≨\u2458☘⚈⍈",1733042252>(this)),
         1<"JNT",-2012065188,"篽蟼","ﰡ\udc22","↘≨⑨",1733042249>(1<"JNT",-2012065188,"旽","㰣밠","↘≨\u2458☘⚈⍈",1733042250>(this))
      );
   }

   // $VF: renamed from: qy (java.lang.String) Class_414
   public Class_414 method_982(String var1) {
      0<"JNT",-855327971,"謤","誙㪘芘溘튘溘뚙몘溘늘隘뚙⚘\uda98ꊘ躘늘隘욙躙㪘꺘麘麘욙","䍞㲎㲎",-2128887361>(this, var1);
      return this;
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_937(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = (var10 - 1211769017 - 1624015359 ^ 1550294475) + 1597377003 + 1854449503 + 201230846 - 921779601 ^ 598172219 ^ 797680163;
      MethodHandle var10000 = field_896[(var10 - 1211769017 - 1624015359 ^ 1550294475) + 1597377003 + 1854449503 + 201230846 - 921779601
         ^ 598172219
         ^ 797680163
         ^ 722616554];
      if (field_896[var10001 ^ 722616554] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = (915837131 & -304092443 | 0) & 1130367516; var23 < var13.length(); var23 += 742105276 * 494474246 ^ -154110871) {
            int var42 = var13.charAt(var23);
            int var10004 = (var42 & 65472) >> 6;
            int var43 = ((var42 & 65472) >> 6 | var42 << 10) - 12;
            int var93 = (((var42 & 65472) >> 6 | var42 << 10) - 12 & 57344) >> 13;
            var42 = ((((var10004 | var42 << 10) - 12 & 57344) >> 13 | ((var42 & 65472) >> 6 | var42 << 10) - 12 << 3) ^ 23) - 18;
            var10004 = (((var93 | var43 << 3) ^ 23) - 18 & 65520) >> 4;
            int var45 = (((var93 | var43 << 3) ^ 23) - 18 & 65520) >> 4 | var42 << 12;
            int var95 = (((((var93 | var43 << 3) ^ 23) - 18 & 65520) >> 4 | var42 << 12) & 65520) >> 4;
            var42 = (((var10004 | var42 << 12) & 65520) >> 4 | ((((var93 | var43 << 3) ^ 23) - 18 & 65520) >> 4 | var42 << 12) << 12) + 47;
            var10004 = ((var95 | var45 << 12) + 47 & 65520) >> 4;
            int var47 = ((var95 | var45 << 12) + 47 & 65520) >> 4 | var42 << 12;
            int var97 = ((((var95 | var45 << 12) + 47 & 65520) >> 4 | var42 << 12) & 49152) >> 14;
            char var48 = (char)(((var10004 | var42 << 12) & 49152) >> 14 | (((var95 | var45 << 12) + 47 & 65520) >> 4 | var42 << 12) << 2);
            var13.setCharAt(var23, (char)(var97 | var47 << 2));
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = 1710738494 >> -665829166 ^ 6525; var29 < var16.length(); var29 += (-260344180 & 1072249872 | 1) & 177258599) {
            int var53 = var16.charAt(var29) + '8' - 114 ^ 95;
            char var58 = (char)(
               (
                        (
                              (
                                       (
                                             (
                                                      (
                                                            ((((var53 & 65472) >> 6 | var53 << 10) ^ 97) + 55 & 65024) >> 9
                                                               | (((var53 & 65472) >> 6 | var53 << 10) ^ 97) + 55 << 7
                                                         )
                                                         & 65535
                                                   )
                                                   >> 0
                                                | (
                                                      ((((var53 & 65472) >> 6 | var53 << 10) ^ 97) + 55 & 65024) >> 9
                                                         | (((var53 & 65472) >> 6 | var53 << 10) ^ 97) + 55 << 7
                                                   )
                                                   << 16
                                          )
                                          & 65472
                                    )
                                    >> 6
                                 | (
                                       (
                                                (
                                                      ((((var53 & 65472) >> 6 | var53 << 10) ^ 97) + 55 & 65024) >> 9
                                                         | (((var53 & 65472) >> 6 | var53 << 10) ^ 97) + 55 << 7
                                                   )
                                                   & 65535
                                             )
                                             >> 0
                                          | (
                                                ((((var53 & 65472) >> 6 | var53 << 10) ^ 97) + 55 & 65024) >> 9
                                                   | (((var53 & 65472) >> 6 | var53 << 10) ^ 97) + 55 << 7
                                             )
                                             << 16
                                    )
                                    << 10
                           )
                           & 65504
                     )
                     >> 5
                  | (
                        (
                                 (
                                       (
                                                (
                                                      ((((var53 & 65472) >> 6 | var53 << 10) ^ 97) + 55 & 65024) >> 9
                                                         | (((var53 & 65472) >> 6 | var53 << 10) ^ 97) + 55 << 7
                                                   )
                                                   & 65535
                                             )
                                             >> 0
                                          | (
                                                ((((var53 & 65472) >> 6 | var53 << 10) ^ 97) + 55 & 65024) >> 9
                                                   | (((var53 & 65472) >> 6 | var53 << 10) ^ 97) + 55 << 7
                                             )
                                             << 16
                                    )
                                    & 65472
                              )
                              >> 6
                           | (
                                 (
                                          (
                                                ((((var53 & 65472) >> 6 | var53 << 10) ^ 97) + 55 & 65024) >> 9
                                                   | (((var53 & 65472) >> 6 | var53 << 10) ^ 97) + 55 << 7
                                             )
                                             & 65535
                                       )
                                       >> 0
                                    | (((((var53 & 65472) >> 6 | var53 << 10) ^ 97) + 55 & 65024) >> 9 | (((var53 & 65472) >> 6 | var53 << 10) ^ 97) + 55 << 7)
                                       << 16
                              )
                              << 10
                     )
                     << 11
            );
            var16.setCharAt(
               var29,
               (char)(
                  (
                           (
                                 (
                                          (
                                                (
                                                         (
                                                               ((((var53 & 65472) >> 6 | var53 << 10) ^ 97) + 55 & 65024) >> 9
                                                                  | (((var53 & 65472) >> 6 | var53 << 10) ^ 97) + 55 << 7
                                                            )
                                                            & 65535
                                                      )
                                                      >> 0
                                                   | (
                                                         ((((var53 & 65472) >> 6 | var53 << 10) ^ 97) + 55 & 65024) >> 9
                                                            | (((var53 & 65472) >> 6 | var53 << 10) ^ 97) + 55 << 7
                                                      )
                                                      << 16
                                             )
                                             & 65472
                                       )
                                       >> 6
                                    | (
                                          (
                                                   (
                                                         ((((var53 & 65472) >> 6 | var53 << 10) ^ 97) + 55 & 65024) >> 9
                                                            | (((var53 & 65472) >> 6 | var53 << 10) ^ 97) + 55 << 7
                                                      )
                                                      & 65535
                                                )
                                                >> 0
                                             | (
                                                   ((((var53 & 65472) >> 6 | var53 << 10) ^ 97) + 55 & 65024) >> 9
                                                      | (((var53 & 65472) >> 6 | var53 << 10) ^ 97) + 55 << 7
                                                )
                                                << 16
                                       )
                                       << 10
                              )
                              & 65504
                        )
                        >> 5
                     | (
                           (
                                    (
                                          (
                                                   (
                                                         ((((var53 & 65472) >> 6 | var53 << 10) ^ 97) + 55 & 65024) >> 9
                                                            | (((var53 & 65472) >> 6 | var53 << 10) ^ 97) + 55 << 7
                                                      )
                                                      & 65535
                                                )
                                                >> 0
                                             | (
                                                   ((((var53 & 65472) >> 6 | var53 << 10) ^ 97) + 55 & 65024) >> 9
                                                      | (((var53 & 65472) >> 6 | var53 << 10) ^ 97) + 55 << 7
                                                )
                                                << 16
                                       )
                                       & 65472
                                 )
                                 >> 6
                              | (
                                    (
                                             (
                                                   ((((var53 & 65472) >> 6 | var53 << 10) ^ 97) + 55 & 65024) >> 9
                                                      | (((var53 & 65472) >> 6 | var53 << 10) ^ 97) + 55 << 7
                                                )
                                                & 65535
                                          )
                                          >> 0
                                       | (
                                             ((((var53 & 65472) >> 6 | var53 << 10) ^ 97) + 55 & 65024) >> 9
                                                | (((var53 & 65472) >> 6 | var53 << 10) ^ 97) + 55 << 7
                                          )
                                          << 16
                                 )
                                 << 10
                        )
                        << 11
               )
            );
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_414.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = (795453251 >> 1564016012 | 0) & -1602418399; var35 < var19.length(); var35 += (-1066721452 & -1704447752 | 1) & 1661456271) {
            int var63 = var19.charAt(var35) ^ 245;
            char var68 = (char)(
               (
                        (
                                 (
                                          (
                                                (
                                                      (
                                                               (
                                                                     (((var63 & 49152) >> 14 | var63 << 2) - 157 & 65534) >> 1
                                                                        | ((var63 & 49152) >> 14 | var63 << 2) - 157 << 15
                                                                  )
                                                                  & 65520
                                                            )
                                                            >> 4
                                                         | (
                                                               (((var63 & 49152) >> 14 | var63 << 2) - 157 & 65534) >> 1
                                                                  | ((var63 & 49152) >> 14 | var63 << 2) - 157 << 15
                                                            )
                                                            << 12
                                                   )
                                                   ^ 112
                                             )
                                             & 65532
                                       )
                                       >> 2
                                    | (
                                          (
                                                (
                                                         (
                                                               (((var63 & 49152) >> 14 | var63 << 2) - 157 & 65534) >> 1
                                                                  | ((var63 & 49152) >> 14 | var63 << 2) - 157 << 15
                                                            )
                                                            & 65520
                                                      )
                                                      >> 4
                                                   | (
                                                         (((var63 & 49152) >> 14 | var63 << 2) - 157 & 65534) >> 1
                                                            | ((var63 & 49152) >> 14 | var63 << 2) - 157 << 15
                                                      )
                                                      << 12
                                             )
                                             ^ 112
                                       )
                                       << 14
                              )
                              + 45
                              - 31
                           & 57344
                     )
                     >> 13
                  | (
                           (
                                    (
                                          (
                                                (
                                                         (
                                                               (((var63 & 49152) >> 14 | var63 << 2) - 157 & 65534) >> 1
                                                                  | ((var63 & 49152) >> 14 | var63 << 2) - 157 << 15
                                                            )
                                                            & 65520
                                                      )
                                                      >> 4
                                                   | (
                                                         (((var63 & 49152) >> 14 | var63 << 2) - 157 & 65534) >> 1
                                                            | ((var63 & 49152) >> 14 | var63 << 2) - 157 << 15
                                                      )
                                                      << 12
                                             )
                                             ^ 112
                                       )
                                       & 65532
                                 )
                                 >> 2
                              | (
                                    (
                                          (
                                                   (
                                                         (((var63 & 49152) >> 14 | var63 << 2) - 157 & 65534) >> 1
                                                            | ((var63 & 49152) >> 14 | var63 << 2) - 157 << 15
                                                      )
                                                      & 65520
                                                )
                                                >> 4
                                             | ((((var63 & 49152) >> 14 | var63 << 2) - 157 & 65534) >> 1 | ((var63 & 49152) >> 14 | var63 << 2) - 157 << 15)
                                                << 12
                                       )
                                       ^ 112
                                 )
                                 << 14
                        )
                        + 45
                        - 31
                     << 3
            );
            var19.setCharAt(
               var35,
               (char)(
                  (
                           (
                                    (
                                             (
                                                   (
                                                         (
                                                                  (
                                                                        (((var63 & 49152) >> 14 | var63 << 2) - 157 & 65534) >> 1
                                                                           | ((var63 & 49152) >> 14 | var63 << 2) - 157 << 15
                                                                     )
                                                                     & 65520
                                                               )
                                                               >> 4
                                                            | (
                                                                  (((var63 & 49152) >> 14 | var63 << 2) - 157 & 65534) >> 1
                                                                     | ((var63 & 49152) >> 14 | var63 << 2) - 157 << 15
                                                               )
                                                               << 12
                                                      )
                                                      ^ 112
                                                )
                                                & 65532
                                          )
                                          >> 2
                                       | (
                                             (
                                                   (
                                                            (
                                                                  (((var63 & 49152) >> 14 | var63 << 2) - 157 & 65534) >> 1
                                                                     | ((var63 & 49152) >> 14 | var63 << 2) - 157 << 15
                                                               )
                                                               & 65520
                                                         )
                                                         >> 4
                                                      | (
                                                            (((var63 & 49152) >> 14 | var63 << 2) - 157 & 65534) >> 1
                                                               | ((var63 & 49152) >> 14 | var63 << 2) - 157 << 15
                                                         )
                                                         << 12
                                                )
                                                ^ 112
                                          )
                                          << 14
                                 )
                                 + 45
                                 - 31
                              & 57344
                        )
                        >> 13
                     | (
                              (
                                       (
                                             (
                                                   (
                                                            (
                                                                  (((var63 & 49152) >> 14 | var63 << 2) - 157 & 65534) >> 1
                                                                     | ((var63 & 49152) >> 14 | var63 << 2) - 157 << 15
                                                               )
                                                               & 65520
                                                         )
                                                         >> 4
                                                      | (
                                                            (((var63 & 49152) >> 14 | var63 << 2) - 157 & 65534) >> 1
                                                               | ((var63 & 49152) >> 14 | var63 << 2) - 157 << 15
                                                         )
                                                         << 12
                                                )
                                                ^ 112
                                          )
                                          & 65532
                                    )
                                    >> 2
                                 | (
                                       (
                                             (
                                                      (
                                                            (((var63 & 49152) >> 14 | var63 << 2) - 157 & 65534) >> 1
                                                               | ((var63 & 49152) >> 14 | var63 << 2) - 157 << 15
                                                         )
                                                         & 65520
                                                   )
                                                   >> 4
                                                | ((((var63 & 49152) >> 14 | var63 << 2) - 157 & 65534) >> 1 | ((var63 & 49152) >> 14 | var63 << 2) - 157 << 15)
                                                   << 12
                                          )
                                          ^ 112
                                    )
                                    << 14
                           )
                           + 45
                           - 31
                        << 3
               )
            );
         }

         Class var7 = Class.forName(var19.toString(), false, Class_414.class.getClassLoader());
         switch ((var4 - 308294789 - 1194938336 ^ 1004956959) + 725181768 - 1721646488 - 907604949 - 1535595148 + 1971905668 + 2114279771 ^ 1465681713) {
            case 508886922:
               var10000 = var0.findConstructor(var7, var6);
               break;
            case 533919594:
            case 1638139509:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 944438756:
               var10000 = var0.findSpecial(var7, var5, var6, Class_414.class);
               break;
            case 2135685241:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_896[(var10 - 1211769017 - 1624015359 ^ 1550294475) + 1597377003 + 1854449503 + 201230846 - 921779601 ^ 598172219 ^ 797680163 ^ 722616554] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_938(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = (var10 ^ 966563520) - 122874404 - 3569242 + 895772748 + 1693878781 + 1585719432 ^ 688664362 ^ 2082372538 ^ 314990238;
      MethodHandle var10000 = field_896[(var10 ^ 966563520) - 122874404 - 3569242 + 895772748 + 1693878781 + 1585719432
         ^ 688664362
         ^ 2082372538
         ^ 314990238
         ^ 401767101];
      if (field_896[var10001 ^ 401767101] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = -661080764 - 1688888943 ^ 1944997589; var24 < var14.length(); var24 += (-1742599691 & 1209045197 | 0) & 1406100995) {
            int var43 = var14.charAt(var24);
            int var10004 = (var43 & 65532) >> 2;
            int var44 = (var43 & 65532) >> 2 | var43 << 14;
            int var96 = (((var43 & 65532) >> 2 | var43 << 14) & 65472) >> 6;
            var43 = ((var10004 | var43 << 14) & 65472) >> 6 | ((var43 & 65532) >> 2 | var43 << 14) << 10;
            var10004 = ((var96 | var44 << 10) & 65535) >> 0;
            int var46 = ((var96 | var44 << 10) & 65535) >> 0 | var43 << 16;
            int var98 = ((((var96 | var44 << 10) & 65535) >> 0 | var43 << 16) & 65520) >> 4;
            var43 = (((var10004 | var43 << 16) & 65520) >> 4 | (((var96 | var44 << 10) & 65535) >> 0 | var43 << 16) << 12) + 233 - 65;
            var10004 = ((var98 | var46 << 12) + 233 - 65 & 32768) >> 15;
            int var48 = (((var98 | var46 << 12) + 233 - 65 & 32768) >> 15 | var43 << 1) ^ 174;
            int var100 = (((((var98 | var46 << 12) + 233 - 65 & 32768) >> 15 | var43 << 1) ^ 174) & 49152) >> 14;
            char var49 = (char)(
               ((((var10004 | var43 << 1) ^ 174) & 49152) >> 14 | ((((var98 | var46 << 12) + 233 - 65 & 32768) >> 15 | var43 << 1) ^ 174) << 2) - 213
            );
            var14.setCharAt(var24, (char)((var100 | var48 << 2) - 213));
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = -1424740683 - 817068197 ^ 2053158416; var30 < var17.length(); var30 += 871100534 ^ -1090063152 ^ -1930623833) {
            char var54 = var17.charAt(var30);
            char var59 = (char)(
               (
                        (
                              (
                                       (
                                                (
                                                      (
                                                               (
                                                                     (((var54 & '\ufffe') >> 1 | var54 << 15) + 176 + 32 & 32768) >> 15
                                                                        | ((var54 & '\ufffe') >> 1 | var54 << 15) + 176 + 32 << 1
                                                                  )
                                                                  & 65024
                                                            )
                                                            >> 9
                                                         | (
                                                               (((var54 & '\ufffe') >> 1 | var54 << 15) + 176 + 32 & 32768) >> 15
                                                                  | ((var54 & '\ufffe') >> 1 | var54 << 15) + 176 + 32 << 1
                                                            )
                                                            << 7
                                                   )
                                                   & 65024
                                             )
                                             >> 9
                                          | (
                                                (
                                                         (
                                                               (((var54 & '\ufffe') >> 1 | var54 << 15) + 176 + 32 & 32768) >> 15
                                                                  | ((var54 & '\ufffe') >> 1 | var54 << 15) + 176 + 32 << 1
                                                            )
                                                            & 65024
                                                      )
                                                      >> 9
                                                   | (
                                                         (((var54 & '\ufffe') >> 1 | var54 << 15) + 176 + 32 & 32768) >> 15
                                                            | ((var54 & '\ufffe') >> 1 | var54 << 15) + 176 + 32 << 1
                                                      )
                                                      << 7
                                             )
                                             << 7
                                    )
                                    + 126
                                    + 203
                                 ^ 186
                           )
                           & 63488
                     )
                     >> 11
                  | (
                        (
                                 (
                                          (
                                                (
                                                         (
                                                               (((var54 & '\ufffe') >> 1 | var54 << 15) + 176 + 32 & 32768) >> 15
                                                                  | ((var54 & '\ufffe') >> 1 | var54 << 15) + 176 + 32 << 1
                                                            )
                                                            & 65024
                                                      )
                                                      >> 9
                                                   | (
                                                         (((var54 & '\ufffe') >> 1 | var54 << 15) + 176 + 32 & 32768) >> 15
                                                            | ((var54 & '\ufffe') >> 1 | var54 << 15) + 176 + 32 << 1
                                                      )
                                                      << 7
                                             )
                                             & 65024
                                       )
                                       >> 9
                                    | (
                                          (
                                                   (
                                                         (((var54 & '\ufffe') >> 1 | var54 << 15) + 176 + 32 & 32768) >> 15
                                                            | ((var54 & '\ufffe') >> 1 | var54 << 15) + 176 + 32 << 1
                                                      )
                                                      & 65024
                                                )
                                                >> 9
                                             | (
                                                   (((var54 & '\ufffe') >> 1 | var54 << 15) + 176 + 32 & 32768) >> 15
                                                      | ((var54 & '\ufffe') >> 1 | var54 << 15) + 176 + 32 << 1
                                                )
                                                << 7
                                       )
                                       << 7
                              )
                              + 126
                              + 203
                           ^ 186
                     )
                     << 5
            );
            var17.setCharAt(
               var30,
               (char)(
                  (
                           (
                                 (
                                          (
                                                   (
                                                         (
                                                                  (
                                                                        (((var54 & '\ufffe') >> 1 | var54 << 15) + 176 + 32 & 32768) >> 15
                                                                           | ((var54 & '\ufffe') >> 1 | var54 << 15) + 176 + 32 << 1
                                                                     )
                                                                     & 65024
                                                               )
                                                               >> 9
                                                            | (
                                                                  (((var54 & '\ufffe') >> 1 | var54 << 15) + 176 + 32 & 32768) >> 15
                                                                     | ((var54 & '\ufffe') >> 1 | var54 << 15) + 176 + 32 << 1
                                                               )
                                                               << 7
                                                      )
                                                      & 65024
                                                )
                                                >> 9
                                             | (
                                                   (
                                                            (
                                                                  (((var54 & '\ufffe') >> 1 | var54 << 15) + 176 + 32 & 32768) >> 15
                                                                     | ((var54 & '\ufffe') >> 1 | var54 << 15) + 176 + 32 << 1
                                                               )
                                                               & 65024
                                                         )
                                                         >> 9
                                                      | (
                                                            (((var54 & '\ufffe') >> 1 | var54 << 15) + 176 + 32 & 32768) >> 15
                                                               | ((var54 & '\ufffe') >> 1 | var54 << 15) + 176 + 32 << 1
                                                         )
                                                         << 7
                                                )
                                                << 7
                                       )
                                       + 126
                                       + 203
                                    ^ 186
                              )
                              & 63488
                        )
                        >> 11
                     | (
                           (
                                    (
                                             (
                                                   (
                                                            (
                                                                  (((var54 & '\ufffe') >> 1 | var54 << 15) + 176 + 32 & 32768) >> 15
                                                                     | ((var54 & '\ufffe') >> 1 | var54 << 15) + 176 + 32 << 1
                                                               )
                                                               & 65024
                                                         )
                                                         >> 9
                                                      | (
                                                            (((var54 & '\ufffe') >> 1 | var54 << 15) + 176 + 32 & 32768) >> 15
                                                               | ((var54 & '\ufffe') >> 1 | var54 << 15) + 176 + 32 << 1
                                                         )
                                                         << 7
                                                )
                                                & 65024
                                          )
                                          >> 9
                                       | (
                                             (
                                                      (
                                                            (((var54 & '\ufffe') >> 1 | var54 << 15) + 176 + 32 & 32768) >> 15
                                                               | ((var54 & '\ufffe') >> 1 | var54 << 15) + 176 + 32 << 1
                                                         )
                                                         & 65024
                                                   )
                                                   >> 9
                                                | (
                                                      (((var54 & '\ufffe') >> 1 | var54 << 15) + 176 + 32 & 32768) >> 15
                                                         | ((var54 & '\ufffe') >> 1 | var54 << 15) + 176 + 32 << 1
                                                   )
                                                   << 7
                                          )
                                          << 7
                                 )
                                 + 126
                                 + 203
                              ^ 186
                        )
                        << 5
               )
            );
         }

         Class var6 = Class.forName(var17.toString(), false, Class_414.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = (1037020748 + 1476745416 + -1513983219 | 0) & 1080033498; var36 < var20.length(); var36 += -566382474 >> -1454936181 ^ -276553) {
            int var64 = var20.charAt(var36) ^ 170;
            int var106 = (var64 & 57344) >> 13;
            int var65 = (var64 & 57344) >> 13 | var64 << 3;
            int var107 = (((var64 & 57344) >> 13 | var64 << 3) & 32768) >> 15;
            var64 = (((var106 | var64 << 3) & 32768) >> 15 | ((var64 & 57344) >> 13 | var64 << 3) << 1) ^ 242;
            var106 = (((var107 | var65 << 1) ^ 242) & 61440) >> 12;
            int var67 = (((var107 | var65 << 1) ^ 242) & 61440) >> 12 | var64 << 4;
            int var109 = (((((var107 | var65 << 1) ^ 242) & 61440) >> 12 | var64 << 4) & 64512) >> 10;
            var64 = ((var106 | var64 << 4) & 64512) >> 10 | ((((var107 | var65 << 1) ^ 242) & 61440) >> 12 | var64 << 4) << 6;
            var106 = ((var109 | var67 << 6) & 49152) >> 14;
            int var69 = ((((var109 | var67 << 6) & 49152) >> 14 | var64 << 2) ^ 200) + 139;
            int var111 = (((((var109 | var67 << 6) & 49152) >> 14 | var64 << 2) ^ 200) + 139 & 65520) >> 4;
            char var70 = (char)((((var106 | var64 << 2) ^ 200) + 139 & 65520) >> 4 | ((((var109 | var67 << 6) & 49152) >> 14 | var64 << 2) ^ 200) + 139 << 12);
            var20.setCharAt(var36, (char)(var111 | var69 << 12));
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_414.class.getClassLoader()).returnType();
         switch (var4 + 216714037 + 1822895226 - 2085391047 - 338186945 - 2002392344 + 329930270 + 721006088 - 1325777266 + 150839768 + 1195801479) {
            case 968341374:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            case 1242954887:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            case 1650093819:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            case 1904077018:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_896[(var10 ^ 966563520) - 122874404 - 3569242 + 895772748 + 1693878781 + 1585719432 ^ 688664362 ^ 2082372538 ^ 314990238 ^ 401767101] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
