import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;
import net.minecraft.class_11909;

public class Class_338 extends Class_375 {
   // $VF: renamed from: zsq Class_185
   public Class_185 field_1286;
   // $VF: renamed from: vmc java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_1287 = new MethodHandle[40];

   public Class_338(Class_199 var1, Class_271 var2, int var3) {
      super(var1, var2, var3);
      this.field_1286 = (Class_185)var2;
   }

   // $VF: renamed from: vk (RenderEngine_216, int, int, float) void
   @Override
   public void method_1268(RenderEngine_216 var1, int var2, int var3, float var4) {
      int var5 = 0<"JNT",184511889,"ǀЀǀ","ᅁსᓡ","솁ꅆ⅄",-681870154>(this) + 5;
      int var6 = 0<"JNT",184511889,"Ϙϰ̐","ᅁსᓡ","솁ꅆ⅄",-681870155>(this)
         + 0<"JNT",184511889,"ϸϸ͐","ᅁსᓡ","솁ꅆ⅄",-681870152>(this)
         + 1<"JNT",1488404198,"ꭠ읠쭠","窽眽紽","䐅䑅㱅",-54562172>(this)
         + 0<"JNT",184511889,"̨Ϙ","ᅁსᓡ","솁ꅆ⅄",-681870182>(this) / 2;
      int var7 = var6 - 4;
      int var8 = 0<"JNT",2019643328,"Ј̘ư̸","ᅁსᓡ","ⅆ䅃ꆁ䅃ꅾ솁\ue181䅆\ue146ꅾŽ셃\ue181",-681870165>(
         0<"JNT",184511889,"̸̀","ᅁსᗁᤁ១᪁១ሡᩡ᫁ᣡᧁሡᚡᡡ᫁Ꭱ","\ue146腆",-681870164>(1<"JNT",1488404198,"\ue760쭠썠","窽眽紽","䐅䑅㬅㌅㋅㿅",-54562170>(this))
      );
      String var12 = 0<"JNT",184511889,"͐͠Ƙ","ᅁსᗁᤁ១᪁១ሡᧁ១ᦁᤡሡᚡ᫁ᨁᣡᦁᤡᎡ","\ue146腆",-681870163>(1<"JNT",1488404198,"\ue760쭠썠","窽眽紽","䐅䑅㬅㌅㋅㿅",-54562171>(this));
      StringBuilder var10000 = 0<"JNT",184511889,"͘ЀЀ̸̐͠","ᅁᗁᤁ១᪁១ሡᧁ១ᦁᤡሡᘡ᠁ᤁᡡᢡ᫁Ꭱსᗁᤁ១᪁១ሡᧁ១ᦁᤡሡᚡ᫁ᨁᣡᦁᤡᐁᩡᣡᧁᣁᡡᨁᎡ","ⅆ䅃ꆁ䅃ꅾ\ue146䅃ꅆ腃ꅾŽ\ue181ↁ䅆ꅆ腃ⅿ솁䅆\ue146\ue143셃ↁ",-681870161>(
         (StringBuilder)0<"JNT",1308601960,"Π̘̘̐Ϡΐ","ᅁსᚁ","ⅆ䅃ꆁ䅃ꅾ\ue146䅃ꅆ腃ꅾŽ\ue181ↁ䅆ꅆ腃ⅿ솁䅆\ue146\ue143셃ↁ",-681870160>(), var12
      );
      int var10001 = (867037819 & -968901651 << -968901651 | 0) & -2066724306;

      StringBuilder var10002;
      for (var10002 = (StringBuilder)0<"JNT",1308601960,"Π̘̘̐Ϡΐ","ᅁᗁᤁ១᪁១ሡᧁ១ᦁᤡሡᚡ᫁ᨁᣡᦁᤡᎡსᚁ","ⅆ䅃ꆁ䅃ꅾ\ue146䅃ꅆ腃ꅾŽ\ue181ↁ䅆ꅆ腃ⅿ솁䅆\ue146\ue143셃ↁ",-681870158>("@\u0094");
         var10001 < 2;
         var10001 += 1
      ) {
         int var19 = 0<"JNT",184511889,"Έ̀͘ϰɘϠ","ᅁᓡსᒡ","ⅆ䅃ꆁ䅃ꅾ\ue146䅃ꅆ腃ꅾŽ\ue181ↁ䅆ꅆ腃ⅿ솁䅆\ue146\ue143셃ↁ",-681870156>(var10002, var10001) ^ 206;
         int var10005 = (var19 & 32768) >> 15;
         int var20 = ((var19 & 32768) >> 15 | var19 << 1) - 11 - 41;
         int var32 = (((var19 & 32768) >> 15 | var19 << 1) - 11 - 41 & 65532) >> 2;
         char var21 = (char)(((var10005 | var19 << 1) - 11 - 41 & 65532) >> 2 | ((var19 & 32768) >> 15 | var19 << 1) - 11 - 41 << 14);
         0<"JNT",184511889,"Ј̸Ϡʈ̀͘ϰɘϠ","ᅁᓡᒡსᚁ","ⅆ䅃ꆁ䅃ꅾ\ue146䅃ꅆ腃ꅾŽ\ue181ↁ䅆ꅆ腃ⅿ솁䅆\ue146\ue143셃ↁ",-681870157>(var10002, var10001, (char)(var32 | var20 << 14));
      }

      String var9 = 0<"JNT",184511889,"Ϡ̨̈Ϡϰ̘̐ͨ","ᅁსᗁᤁ១᪁១ሡᧁ១ᦁᤡሡᚡ᫁ᨁᣡᦁᤡᎡ","ⅆ䅃ꆁ䅃ꅾ\ue146䅃ꅆ腃ꅾŽ\ue181ↁ䅆ꅆ腃ⅿ솁䅆\ue146\ue143셃ↁ",-681870180>(
         0<"JNT",184511889,"͘ЀЀ̸̐͠","ᅁᗁᤁ១᪁១ሡᧁ១ᦁᤡሡᚡ᫁ᨁᣡᦁᤡᎡსᗁᤁ១᪁១ሡᧁ១ᦁᤡሡᚡ᫁ᨁᣡᦁᤡᐁᩡᣡᧁᣁᡡᨁᎡ","ⅆ䅃ꆁ䅃ꅾ\ue146䅃ꅆ腃ꅾŽ\ue181ↁ䅆ꅆ腃ⅿ솁䅆\ue146\ue143셃ↁ",-681870199>(
            var10000, 0<"JNT",184511889,"Ϡ̨̈Ϡϰ̘̐ͨ","ᅁსᗁᤁ១᪁១ሡᧁ១ᦁᤡሡᚡ᫁ᨁᣡᦁᤡᎡ","ⅆ䅃ꆁ䅃ꅾ\ue146䅃ꅆ腃ꅾŽ\ue181ↁ䅆ꅆ腃ⅿ솁䅆\ue146\ue143셃ↁ",-681870198>(var10002)
         )
      );
      0<"JNT",184511889,"ͨ̀","ᅁᗁᤁ១᪁១ሡᧁ១ᦁᤡሡᚡ᫁ᨁᣡᦁᤡᎡᓁᓁᗁᩁᬡᎡსᓁ","셆ꆁ",-681870178>(
         var1, var9, (double)var5, (double)var7, 1<"JNT",1448488001,"ꭠ荠","窽眽紽","䐅䑅㬅⸅ⳅ㿅",-54562136>()
      );
      double var10 = (double)var5 + 0<"JNT",184511889,"Ƙθ̰","ᅁᗁᤁ១᪁១ሡᧁ១ᦁᤡሡᚡ᫁ᨁᣡᦁᤡᎡსᓁ","셆ꆁ",-681870179>(var1, var9);
      StringBuilder var15 = 0<"JNT",184511889,"͘ЀЀ̸̐͠","ᅁᓡსᗁᤁ១᪁១ሡᧁ១ᦁᤡሡᚡ᫁ᨁᣡᦁᤡᐁᩡᣡᧁᣁᡡᨁᎡ","ⅆ䅃ꆁ䅃ꅾ\ue146䅃ꅆ腃ꅾŽ\ue181ↁ䅆ꅆ腃ⅿ솁䅆\ue146\ue143셃ↁ",-681870177>(
         (StringBuilder)0<"JNT",1308601960,"Π̘̘̐Ϡΐ","ᅁსᚁ","ⅆ䅃ꆁ䅃ꅾ\ue146䅃ꅆ腃ꅾŽ\ue181ↁ䅆ꅆ腃ⅿ솁䅆\ue146\ue143셃ↁ",-681870176>(), var8
      );
      int var17 = (-606435872 - -143998616 | 0) & 303051268;

      StringBuilder var23;
      for (var23 = (StringBuilder)0<"JNT",1308601960,"Π̘̘̐Ϡΐ","ᅁᗁᤁ១᪁១ሡᧁ១ᦁᤡሡᚡ᫁ᨁᣡᦁᤡᎡსᚁ","ⅆ䅃ꆁ䅃ꅾ\ue146䅃ꅆ腃ꅾŽ\ue181ↁ䅆ꅆ腃ⅿ솁䅆\ue146\ue143셃ↁ",-681870174>(
            "㾳\ue5b3즳ힳ즳얳\ue7b3즳잳"
         );
         var17 < (-1835161957 + -2035166905 ^ 424638443);
         var17 += 474910446 * -250157357 ^ 1067295275
      ) {
         int var27 = 0<"JNT",184511889,"Έ̀͘ϰɘϠ","ᅁᓡსᒡ","ⅆ䅃ꆁ䅃ꅾ\ue146䅃ꅆ腃ꅾŽ\ue181ↁ䅆ꅆ腃ⅿ솁䅆\ue146\ue143셃ↁ",-681870159>(var23, var17) ^ 'E';
         char var30 = (char)(
            (((((var27 & 61440) >> 12 | var27 << 4) & 65528) >> 3 | ((var27 & 61440) >> 12 | var27 << 4) << 13) + 20 & 64512) >> 10
               | ((((var27 & 61440) >> 12 | var27 << 4) & 65528) >> 3 | ((var27 & 61440) >> 12 | var27 << 4) << 13) + 20 << 6
         );
         0<"JNT",184511889,"Ј̸Ϡʈ̀͘ϰɘϠ","ᅁᓡᒡსᚁ","ⅆ䅃ꆁ䅃ꅾ\ue146䅃ꅆ腃ꅾŽ\ue181ↁ䅆ꅆ腃ⅿ솁䅆\ue146\ue143셃ↁ",-681870172>(
            var23,
            var17,
            (char)(
               (((((var27 & 61440) >> 12 | var27 << 4) & 65528) >> 3 | ((var27 & 61440) >> 12 | var27 << 4) << 13) + 20 & 64512) >> 10
                  | ((((var27 & 61440) >> 12 | var27 << 4) & 65528) >> 3 | ((var27 & 61440) >> 12 | var27 << 4) << 13) + 20 << 6
            )
         );
      }

      0<"JNT",184511889,"ͨ̀","ᅁᗁᤁ១᪁១ሡᧁ១ᦁᤡሡᚡ᫁ᨁᣡᦁᤡᎡᓁᓁᗁᩁᬡᎡსᓁ","셆ꆁ",-681870169>(
         var1,
         0<"JNT",184511889,"Ϡ̨̈Ϡϰ̘̐ͨ","ᅁსᗁᤁ១᪁១ሡᧁ១ᦁᤡሡᚡ᫁ᨁᣡᦁᤡᎡ","ⅆ䅃ꆁ䅃ꅾ\ue146䅃ꅆ腃ꅾŽ\ue181ↁ䅆ꅆ腃ⅿ솁䅆\ue146\ue143셃ↁ",-681870171>(
            0<"JNT",184511889,"͘ЀЀ̸̐͠","ᅁᗁᤁ១᪁១ሡᧁ១ᦁᤡሡᚡ᫁ᨁᣡᦁᤡᎡსᗁᤁ១᪁១ሡᧁ១ᦁᤡሡᚡ᫁ᨁᣡᦁᤡᐁᩡᣡᧁᣁᡡᨁᎡ","ⅆ䅃ꆁ䅃ꅾ\ue146䅃ꅆ腃ꅾŽ\ue181ↁ䅆ꅆ腃ⅿ솁䅆\ue146\ue143셃ↁ",-681870170>(
               var15, 0<"JNT",184511889,"Ϡ̨̈Ϡϰ̘̐ͨ","ᅁსᗁᤁ១᪁១ሡᧁ១ᦁᤡሡᚡ᫁ᨁᣡᦁᤡᎡ","ⅆ䅃ꆁ䅃ꅾ\ue146䅃ꅆ腃ꅾŽ\ue181ↁ䅆ꅆ腃ⅿ솁䅆\ue146\ue143셃ↁ",-681870173>(var23)
            )
         ),
         var10,
         (double)var7,
         1<"JNT",1488404198,"ꭠ흠ꭠ","窽眽紽","䐅䑅㬅⸅ⳅ㿅",-54562121>(this)
      );
   }

   // $VF: renamed from: yr (net.minecraft.class_11909, boolean) void
   @Override
   public void method_1272(class_11909 var1, boolean var2) {
      if (0<"JNT",184511889,"ͨǀθ","ᅁᓁᓁსᜁ","솁ꅆ⅄",-681869997>(
            this,
            0<"JNT",184511889,"Έ̨ϸЀҨנרΘπ","ᅁსᓁ","ꅆ셃\ue181ꅾ셆䅆ꅆ셃Ńↁ䅃ꅃ\ue181ꅾŃ\ue146䅃ƁƁ膀䅹䅹䅼慹䅼",-681870175>(var1),
            0<"JNT",184511889,"Έ̨ϸЀҨנרΘΘ","ᅁსᓁ","ꅆ셃\ue181ꅾ셆䅆ꅆ셃Ńↁ䅃ꅃ\ue181ꅾŃ\ue146䅃ƁƁ膀䅹䅹䅼慹䅼",-681869996>(var1)
         )
         && 0<"JNT",184511889,"ϸ̸Ϡ̨̀͠Ҩרנװנָ","ᅁსᓡ","ꅆ셃\ue181ꅾ셆䅆ꅆ셃Ńↁ䅃ꅃ\ue181ꅾŃ\ue146䅃ƁƁ膀䅹䅹䅼慹䅼",-681869994>(var1) == 0) {
         0<"JNT",184511889,"ϸ̸Ϡ̨̀͠Ҩטָ\u0600ר","ᅁᗁᦁᡡ᫁ሡᥡᣡᦁᡡᢡᨁ១ᢁ᫁ሡᢡᧁ១᪡᪡ᠡ\u12c1ኡጡᎡსᚁ","ꅆ셃\ue181ꅾ셆䅆ꅆ셃Ńↁ䅃ꅃ\ue181ꅾŃ\ue146䅃ƁƁ膀Ź䅹慹",-681870022>(
            1<"JNT",1488404198,"꽠읠","窽眽紽","䐅䑅㬅㊅ㅅⴅ䋅㍅㑅㊅ㅅ㇅ⶅ㉅ゅⴅ䋅㇅㌅㉅ⷅⷅ㛅㷅㹅㸅㿅",-54562158>(this),
            (Class_155)0<"JNT",1308601960,"Π̘̘̐Ϡΐ","ᅁᗁᩡᦁᬁᎡᗁᧁᨡᎡსᚁ","ņ䅃",-681869993>(this, 1<"JNT",1488404198,"\ue760쭠썠","窽眽紽","䐅䑅㬅㌅㋅㿅",-54562073>(this))
         );
      }

      0<"JNT",352556417,"Ƙϰ","ᅁᗁᦁᡡ᫁ሡᥡᣡᦁᡡᢡᨁ១ᢁ᫁ሡᢡᧁ១᪡᪡ᠡᇡᇡዡቁዡᎡᜁსᚁ","膁ⅆ",-681870023>(this, var1, var2);
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1293(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 - 1314127622 - 1589866250 + 1605852053 - 1785456958 ^ 1658155633) - 1072238135 ^ 1661753023) + 1116258133 - 2046075370;
      MethodHandle var10000 = field_1287[((var10 - 1314127622 - 1589866250 + 1605852053 - 1785456958 ^ 1658155633) - 1072238135 ^ 1661753023)
            + 1116258133
            - 2046075370
         ^ 655478871];
      if (field_1287[var10001 ^ 655478871] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = 741818048 + 741818048 ^ 1483636096; var23 < var13.length(); var23 += (-229494961 | -133991587 | 1) & 84705441) {
            char var42 = var13.charAt(var23);
            char var43 = (char)(((((var42 & '\ufff8') >> 3 | var42 << '\r') + 171 + 19 ^ 18) + 44 - 243 ^ 221) - 195 + 168 - 45);
            var13.setCharAt(var23, (char)(((((var42 & '\ufff8') >> 3 | var42 << '\r') + 171 + 19 ^ 18) + 44 - 243 ^ 221) - 195 + 168 - 45));
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = -1252010152 * 620706248 ^ -361048896; var29 < var16.length(); var29 += 1118004958 << -1700808744 ^ -570425343) {
            int var48 = var16.charAt(var29) + 0 + 179 ^ 92;
            int var73 = (var48 & 65520) >> 4;
            int var49 = ((var48 & 65520) >> 4 | var48 << 12) + 161;
            int var74 = (((var48 & 65520) >> 4 | var48 << 12) + 161 & 65528) >> 3;
            var48 = ((var73 | var48 << 12) + 161 & 65528) >> 3 | ((var48 & 65520) >> 4 | var48 << 12) + 161 << 13;
            var73 = ((var74 | var49 << 13) & 64512) >> 10;
            int var51 = (((var74 | var49 << 13) & 64512) >> 10 | var48 << 6) - 140;
            int var76 = ((((var74 | var49 << 13) & 64512) >> 10 | var48 << 6) - 140 & 65520) >> 4;
            char var52 = (char)((((var73 | var48 << 6) - 140 & 65520) >> 4 | (((var74 | var49 << 13) & 64512) >> 10 | var48 << 6) - 140 << 12) - 173);
            var16.setCharAt(var29, (char)((var76 | var51 << 12) - 173));
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_338.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = (-793362316 >>> -461289906 | 0) & -1828188126;
            var35 < var19.length();
            var35 += (1260974839 >>> 1260974839 * -881946648 | 1) & -808547279
         ) {
            int var57 = var19.charAt(var35) - 253 - 41 - 29;
            char var58 = (char)(((((var57 & 57344) >> 13 | var57 << 3) ^ 243) - 204 - 252 ^ 104) + 237 + 51);
            var19.setCharAt(var35, (char)(((((var57 & 57344) >> 13 | var57 << 3) ^ 243) - 204 - 252 ^ 104) + 237 + 51));
         }

         Class var7 = Class.forName(var19.toString(), false, Class_338.class.getClassLoader());
         switch (((var4 - 100607226 ^ 1063763653 ^ 325735414) - 730622053 - 560095328 + 1737285596 ^ 2061309315) - 1336663400 - 858660821 - 1431098146) {
            case 185875192:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            case 732559920:
            case 1632622809:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 743415448:
               var10000 = var0.findConstructor(var7, var6);
               break;
            case 1867763945:
               var10000 = var0.findSpecial(var7, var5, var6, Class_338.class);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_1287[((var10 - 1314127622 - 1589866250 + 1605852053 - 1785456958 ^ 1658155633) - 1072238135 ^ 1661753023) + 1116258133 - 2046075370 ^ 655478871] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1294(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = (((var10 ^ 722845912) + 746540664 ^ 879511937) + 1924544924 ^ 814866932) + 1035420739 + 1766921680 ^ 1399943258 ^ 1049122452;
      MethodHandle var10000 = field_1287[(((var10 ^ 722845912) + 746540664 ^ 879511937) + 1924544924 ^ 814866932) + 1035420739 + 1766921680
         ^ 1399943258
         ^ 1049122452
         ^ 1418501075];
      if (field_1287[var10001 ^ 1418501075] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = (-1410296229 | -1410296229) ^ -1410296229; var24 < var14.length(); var24 += -357316563 >> -357316563 ^ -43617) {
            int var43 = var14.charAt(var24) + '\f';
            char var48 = (char)(
               (
                        (
                              (
                                       (
                                                (
                                                         (
                                                                  (((var43 & 65528) >> 3 | var43 << 13) - 169 & 65534) >> 1
                                                                     | ((var43 & 65528) >> 3 | var43 << 13) - 169 << 15
                                                               )
                                                               + 83
                                                               + 15
                                                            & 63488
                                                      )
                                                      >> 11
                                                   | (
                                                            (((var43 & 65528) >> 3 | var43 << 13) - 169 & 65534) >> 1
                                                               | ((var43 & 65528) >> 3 | var43 << 13) - 169 << 15
                                                         )
                                                         + 83
                                                         + 15
                                                      << 5
                                             )
                                             - 134
                                          & 65504
                                    )
                                    >> 5
                                 | (
                                          (
                                                   (
                                                            (((var43 & 65528) >> 3 | var43 << 13) - 169 & 65534) >> 1
                                                               | ((var43 & 65528) >> 3 | var43 << 13) - 169 << 15
                                                         )
                                                         + 83
                                                         + 15
                                                      & 63488
                                                )
                                                >> 11
                                             | ((((var43 & 65528) >> 3 | var43 << 13) - 169 & 65534) >> 1 | ((var43 & 65528) >> 3 | var43 << 13) - 169 << 15)
                                                   + 83
                                                   + 15
                                                << 5
                                       )
                                       - 134
                                    << 11
                           )
                           & 65472
                     )
                     >> 6
                  | (
                        (
                                 (
                                          (
                                                   (
                                                            (((var43 & 65528) >> 3 | var43 << 13) - 169 & 65534) >> 1
                                                               | ((var43 & 65528) >> 3 | var43 << 13) - 169 << 15
                                                         )
                                                         + 83
                                                         + 15
                                                      & 63488
                                                )
                                                >> 11
                                             | ((((var43 & 65528) >> 3 | var43 << 13) - 169 & 65534) >> 1 | ((var43 & 65528) >> 3 | var43 << 13) - 169 << 15)
                                                   + 83
                                                   + 15
                                                << 5
                                       )
                                       - 134
                                    & 65504
                              )
                              >> 5
                           | (
                                    (
                                             ((((var43 & 65528) >> 3 | var43 << 13) - 169 & 65534) >> 1 | ((var43 & 65528) >> 3 | var43 << 13) - 169 << 15)
                                                   + 83
                                                   + 15
                                                & 63488
                                          )
                                          >> 11
                                       | ((((var43 & 65528) >> 3 | var43 << 13) - 169 & 65534) >> 1 | ((var43 & 65528) >> 3 | var43 << 13) - 169 << 15)
                                             + 83
                                             + 15
                                          << 5
                                 )
                                 - 134
                              << 11
                     )
                     << 10
            );
            var14.setCharAt(
               var24,
               (char)(
                  (
                           (
                                 (
                                          (
                                                   (
                                                            (
                                                                     (((var43 & 65528) >> 3 | var43 << 13) - 169 & 65534) >> 1
                                                                        | ((var43 & 65528) >> 3 | var43 << 13) - 169 << 15
                                                                  )
                                                                  + 83
                                                                  + 15
                                                               & 63488
                                                         )
                                                         >> 11
                                                      | (
                                                               (((var43 & 65528) >> 3 | var43 << 13) - 169 & 65534) >> 1
                                                                  | ((var43 & 65528) >> 3 | var43 << 13) - 169 << 15
                                                            )
                                                            + 83
                                                            + 15
                                                         << 5
                                                )
                                                - 134
                                             & 65504
                                       )
                                       >> 5
                                    | (
                                             (
                                                      (
                                                               (((var43 & 65528) >> 3 | var43 << 13) - 169 & 65534) >> 1
                                                                  | ((var43 & 65528) >> 3 | var43 << 13) - 169 << 15
                                                            )
                                                            + 83
                                                            + 15
                                                         & 63488
                                                   )
                                                   >> 11
                                                | ((((var43 & 65528) >> 3 | var43 << 13) - 169 & 65534) >> 1 | ((var43 & 65528) >> 3 | var43 << 13) - 169 << 15)
                                                      + 83
                                                      + 15
                                                   << 5
                                          )
                                          - 134
                                       << 11
                              )
                              & 65472
                        )
                        >> 6
                     | (
                           (
                                    (
                                             (
                                                      (
                                                               (((var43 & 65528) >> 3 | var43 << 13) - 169 & 65534) >> 1
                                                                  | ((var43 & 65528) >> 3 | var43 << 13) - 169 << 15
                                                            )
                                                            + 83
                                                            + 15
                                                         & 63488
                                                   )
                                                   >> 11
                                                | ((((var43 & 65528) >> 3 | var43 << 13) - 169 & 65534) >> 1 | ((var43 & 65528) >> 3 | var43 << 13) - 169 << 15)
                                                      + 83
                                                      + 15
                                                   << 5
                                          )
                                          - 134
                                       & 65504
                                 )
                                 >> 5
                              | (
                                       (
                                                ((((var43 & 65528) >> 3 | var43 << 13) - 169 & 65534) >> 1 | ((var43 & 65528) >> 3 | var43 << 13) - 169 << 15)
                                                      + 83
                                                      + 15
                                                   & 63488
                                             )
                                             >> 11
                                          | ((((var43 & 65528) >> 3 | var43 << 13) - 169 & 65534) >> 1 | ((var43 & 65528) >> 3 | var43 << 13) - 169 << 15)
                                                + 83
                                                + 15
                                             << 5
                                    )
                                    - 134
                                 << 11
                        )
                        << 10
               )
            );
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = -1143899911 * -1125776554 ^ 411012774; var30 < var17.length(); var30 += (-1348039180 >> 945015253 - -1348039180 | 1) & 673185793) {
            int var53 = var17.charAt(var30) - 252;
            int var98 = (var53 & 65504) >> 5;
            int var54 = (var53 & 65504) >> 5 | var53 << 11;
            int var99 = (((var53 & 65504) >> 5 | var53 << 11) & 65408) >> 7;
            var53 = (((var98 | var53 << 11) & 65408) >> 7 | ((var53 & 65504) >> 5 | var53 << 11) << 9) - 66 + 142;
            var98 = ((var99 | var54 << 9) - 66 + 142 & 65408) >> 7;
            int var56 = ((var99 | var54 << 9) - 66 + 142 & 65408) >> 7 | var53 << 9;
            int var101 = ((((var99 | var54 << 9) - 66 + 142 & 65408) >> 7 | var53 << 9) & 64512) >> 10;
            var53 = ((var98 | var53 << 9) & 64512) >> 10 | (((var99 | var54 << 9) - 66 + 142 & 65408) >> 7 | var53 << 9) << 6;
            var98 = ((var101 | var56 << 6) & 65528) >> 3;
            int var58 = (((var101 | var56 << 6) & 65528) >> 3 | var53 << 13) + 186;
            int var103 = ((((var101 | var56 << 6) & 65528) >> 3 | var53 << 13) + 186 & 65408) >> 7;
            char var59 = (char)(((var98 | var53 << 13) + 186 & 65408) >> 7 | (((var101 | var56 << 6) & 65528) >> 3 | var53 << 13) + 186 << 9);
            var17.setCharAt(var30, (char)(var103 | var58 << 9));
         }

         Class var6 = Class.forName(var17.toString(), false, Class_338.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = 2054467775 - (-1105654953 << 2054467775) ^ -93015873; var36 < var20.length(); var36 += (1435023024 + 773089115 | 1) & 69378341) {
            char var64 = var20.charAt(var36);
            char var69 = (char)(
               (
                     (
                              (
                                    (
                                             (
                                                   (
                                                            (
                                                                     (((var64 & '￠') >> 5 | var64 << 11) + 81 - 209 - 226 & 63488) >> 11
                                                                        | ((var64 & '￠') >> 5 | var64 << 11) + 81 - 209 - 226 << 5
                                                                  )
                                                                  - 69
                                                               & 65504
                                                         )
                                                         >> 5
                                                      | (
                                                               (((var64 & '￠') >> 5 | var64 << 11) + 81 - 209 - 226 & 63488) >> 11
                                                                  | ((var64 & '￠') >> 5 | var64 << 11) + 81 - 209 - 226 << 5
                                                            )
                                                            - 69
                                                         << 11
                                                )
                                                & 61440
                                          )
                                          >> 12
                                       | (
                                             (
                                                      (
                                                               (((var64 & '￠') >> 5 | var64 << 11) + 81 - 209 - 226 & 63488) >> 11
                                                                  | ((var64 & '￠') >> 5 | var64 << 11) + 81 - 209 - 226 << 5
                                                            )
                                                            - 69
                                                         & 65504
                                                   )
                                                   >> 5
                                                | (
                                                         (((var64 & '￠') >> 5 | var64 << 11) + 81 - 209 - 226 & 63488) >> 11
                                                            | ((var64 & '￠') >> 5 | var64 << 11) + 81 - 209 - 226 << 5
                                                      )
                                                      - 69
                                                   << 11
                                          )
                                          << 4
                                 )
                                 & 65504
                           )
                           >> 5
                        | (
                              (
                                       (
                                             (
                                                      (
                                                               (((var64 & '￠') >> 5 | var64 << 11) + 81 - 209 - 226 & 63488) >> 11
                                                                  | ((var64 & '￠') >> 5 | var64 << 11) + 81 - 209 - 226 << 5
                                                            )
                                                            - 69
                                                         & 65504
                                                   )
                                                   >> 5
                                                | (
                                                         (((var64 & '￠') >> 5 | var64 << 11) + 81 - 209 - 226 & 63488) >> 11
                                                            | ((var64 & '￠') >> 5 | var64 << 11) + 81 - 209 - 226 << 5
                                                      )
                                                      - 69
                                                   << 11
                                          )
                                          & 61440
                                    )
                                    >> 12
                                 | (
                                       (
                                                (
                                                         (((var64 & '￠') >> 5 | var64 << 11) + 81 - 209 - 226 & 63488) >> 11
                                                            | ((var64 & '￠') >> 5 | var64 << 11) + 81 - 209 - 226 << 5
                                                      )
                                                      - 69
                                                   & 65504
                                             )
                                             >> 5
                                          | (
                                                   (((var64 & '￠') >> 5 | var64 << 11) + 81 - 209 - 226 & 63488) >> 11
                                                      | ((var64 & '￠') >> 5 | var64 << 11) + 81 - 209 - 226 << 5
                                                )
                                                - 69
                                             << 11
                                    )
                                    << 4
                           )
                           << 11
                  )
                  ^ 118
            );
            var20.setCharAt(
               var36,
               (char)(
                  (
                        (
                                 (
                                       (
                                                (
                                                      (
                                                               (
                                                                        (((var64 & '￠') >> 5 | var64 << 11) + 81 - 209 - 226 & 63488) >> 11
                                                                           | ((var64 & '￠') >> 5 | var64 << 11) + 81 - 209 - 226 << 5
                                                                     )
                                                                     - 69
                                                                  & 65504
                                                            )
                                                            >> 5
                                                         | (
                                                                  (((var64 & '￠') >> 5 | var64 << 11) + 81 - 209 - 226 & 63488) >> 11
                                                                     | ((var64 & '￠') >> 5 | var64 << 11) + 81 - 209 - 226 << 5
                                                               )
                                                               - 69
                                                            << 11
                                                   )
                                                   & 61440
                                             )
                                             >> 12
                                          | (
                                                (
                                                         (
                                                                  (((var64 & '￠') >> 5 | var64 << 11) + 81 - 209 - 226 & 63488) >> 11
                                                                     | ((var64 & '￠') >> 5 | var64 << 11) + 81 - 209 - 226 << 5
                                                               )
                                                               - 69
                                                            & 65504
                                                      )
                                                      >> 5
                                                   | (
                                                            (((var64 & '￠') >> 5 | var64 << 11) + 81 - 209 - 226 & 63488) >> 11
                                                               | ((var64 & '￠') >> 5 | var64 << 11) + 81 - 209 - 226 << 5
                                                         )
                                                         - 69
                                                      << 11
                                             )
                                             << 4
                                    )
                                    & 65504
                              )
                              >> 5
                           | (
                                 (
                                          (
                                                (
                                                         (
                                                                  (((var64 & '￠') >> 5 | var64 << 11) + 81 - 209 - 226 & 63488) >> 11
                                                                     | ((var64 & '￠') >> 5 | var64 << 11) + 81 - 209 - 226 << 5
                                                               )
                                                               - 69
                                                            & 65504
                                                      )
                                                      >> 5
                                                   | (
                                                            (((var64 & '￠') >> 5 | var64 << 11) + 81 - 209 - 226 & 63488) >> 11
                                                               | ((var64 & '￠') >> 5 | var64 << 11) + 81 - 209 - 226 << 5
                                                         )
                                                         - 69
                                                      << 11
                                             )
                                             & 61440
                                       )
                                       >> 12
                                    | (
                                          (
                                                   (
                                                            (((var64 & '￠') >> 5 | var64 << 11) + 81 - 209 - 226 & 63488) >> 11
                                                               | ((var64 & '￠') >> 5 | var64 << 11) + 81 - 209 - 226 << 5
                                                         )
                                                         - 69
                                                      & 65504
                                                )
                                                >> 5
                                             | (
                                                      (((var64 & '￠') >> 5 | var64 << 11) + 81 - 209 - 226 & 63488) >> 11
                                                         | ((var64 & '￠') >> 5 | var64 << 11) + 81 - 209 - 226 << 5
                                                   )
                                                   - 69
                                                << 11
                                       )
                                       << 4
                              )
                              << 11
                     )
                     ^ 118
               )
            );
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_338.class.getClassLoader()).returnType();
         switch ((var4 - 863231773 ^ 1555673898 ^ 391816817) - 624799253 - 916277758 - 740010944 + 532816859 - 2041347069 + 252354608 - 1687871081) {
            case 182410825:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            case 831528529:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            case 925831268:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            case 1062231870:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_1287[(((var10 ^ 722845912) + 746540664 ^ 879511937) + 1924544924 ^ 814866932) + 1035420739 + 1766921680 ^ 1399943258 ^ 1049122452 ^ 1418501075] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
