import dev.krypton.native.Loader;
import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;
import net.minecraft.class_2583;
import net.minecraft.class_5250;

public class Class_30 extends Class_342 {
   // $VF: renamed from: xfp Class_168
   public Class_168 field_2269;
   // $VF: renamed from: fbv Class_168
   public Class_168 field_2270;
   // $VF: renamed from: rd Class_115
   public Class_115 field_2271;
   // $VF: renamed from: qjf Class_105
   public Class_105 field_2272;
   // $VF: renamed from: xju net.minecraft.class_2583
   public static class_2583 field_2273 = 0<"JNT",353852153,"脵焵輵眵蔵漵攵വጵव༵व","⮁\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁䮃뮅뮅\ueb85ᮅ宅讅ﮂ\udb81\ueb83讅ᮅ殆뮁鮅\udb85讅ᮅ箅䮆宅அ殆뮁箅\ueb85宅箆箆뮄䮂ᮂ⮂箂ﮂ","Ⴀတᄀಠ႐ၐႠတ\u0ff0რ࿐ဠᄀಠ\u0ff0ႀ࿐ჰჰྰೠഐീ\u0cf0",987327087>(
      0<"JNT",353852153,"脵焵輵眵蔵漵攵വጵव༵ܵ","⮁\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁䮃뮅뮅\ueb85ᮅ宅讅ﮂ\udb81\ueb83讅ᮅ殆뮁鮅\udb85讅ᮅ箅䮆宅அ殆뮁箅\ueb85宅箆箆뮄䮂ᮂ⮂箂ﮂ","Ⴀတᄀಠ႐ၐႠတ\u0ff0რ࿐ဠᄀಠ\u0ff0ႀ࿐ჰჰྰೠഐീ\u0cf0",987327429>(
         0<"JNT",353852153,"脵焵輵眵蔵漵攵വܵᤵവ᜵","⮁\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁䮃뮅뮅\ueb85ᮅ宅讅ﮂ\udb81\ueb83讅ᮅ殆뮁鮅\udb85讅ᮅ箅䮆宅அ殆뮁箅\ueb85宅箆箆뮄䮂ᮂ⮂箂ﮂ","Ⴀတᄀಠ႐ၐႠတ\u0ff0რ࿐ဠᄀಠ\u0ff0ႀ࿐ჰჰྰೠഐീ\u0cf0",987327259>(
            0<"JNT",353852153,"脵焵輵眵蔵漵攵वܵᤵᔵ᜵","⮁\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁䮃뮅뮅\ueb85ᮅ宅讅ﮂ\udb81\ueb83讅ᮅ殆뮁鮅\udb85讅ᮅ箅䮆宅அ殆뮁箅\ueb85宅箆箆뮄䮂ᮂ⮂箂ﮂ","Ⴀတᄀಠ႐ၐႠတ\u0ff0რ࿐ဠᄀಠ\u0ff0ႀ࿐ჰჰྰೠഐീ\u0cf0",987327249>(
               0<"JNT",353852153,"脵焵輵眵蔵漵攵वܵᤵ᜵ଵ","⮁\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁䮃뮅뮅\ueb85ᮅ宅讅ﮂ\udb81\ueb83讅ᮅ殆뮁鮅\udb85讅ᮅ箅䮆宅அ殆뮁箅\ueb85宅箆箆뮄䮂ᮂ⮂箂ﮂ","Ⴀတᄀಠ႐ၐႠတ\u0ff0რ࿐ဠᄀಠ\u0ff0ႀ࿐ჰჰྰೠഐീ\u0cf0",987327431>(
                  1<"JNT",608528615,"䨺䴺䤺债䠺䌺ᘺᠺ\u173aᨺᐺ","＋ﺯﻳ︋ﻏﻟ＋ﺯﺷﻻﺿﻫﻳ︋ﺷﻓﺿﻷﻷﻇﷻ\ufdefﴣﷷ","耄䀄뿡㿙翗뿓쀄翙翔㿙翗\uffd9㿖翚㿗뿓쀄\uffd9뿙翚ￕￕ\uffd8㿆翃뿠ￅ\uffdf",-502184397>(),
                  0<"JNT",-1848112657,"錵椵缵鄵焵䔵猵","⮁쮄\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁䮃뮅뮅\ueb85ᮅ宅讅ﮂ","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0de0ႰႰႀတ࿐Ⴀ",987327262>(false)
               ),
               0<"JNT",-1848112657,"錵椵缵鄵焵䔵猵","⮁쮄\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁䮃뮅뮅\ueb85ᮅ宅讅ﮂ","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0de0ႰႰႀတ࿐Ⴀ",987327248>(false)
            ),
            0<"JNT",-1848112657,"錵椵缵鄵焵䔵猵","⮁쮄\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁䮃뮅뮅\ueb85ᮅ宅讅ﮂ","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0de0ႰႰႀတ࿐Ⴀ",987327250>(false)
         ),
         0<"JNT",-1848112657,"錵椵缵鄵焵䔵猵","⮁쮄\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁䮃뮅뮅\ueb85ᮅ宅讅ﮂ","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0de0ႰႰႀတ࿐Ⴀ",987327428>(false)
      ),
      0<"JNT",-1848112657,"錵椵缵鄵焵䔵猵","⮁쮄\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁䮃뮅뮅\ueb85ᮅ宅讅ﮂ","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0de0ႰႰႀတ࿐Ⴀ",987327430>(false)
   );
   // $VF: renamed from: clp boolean
   public boolean field_2274;
   // $VF: renamed from: wxx java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_2275 = new MethodHandle[522986039 - 522986039 ^ 193];

   public Class_30() {
      int var1 = 289218399;
      int var10001 = (1460957847 - 1460957847 | 0) & -1621146964;

      StringBuilder var10002;
      for (var10002 = (StringBuilder)0<"JNT",531824449,"ἵ礵茵礵輵⌵","⮁\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ\udb81\u0b84","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987327473>(
            "Ͼ䧾巾䇾쿾\u2ffe䧾秾"
         );
         var10001 < (-346610881 ^ -346610889);
         var10001 += (2134980750 - 718998936 | 1) & 184583169
      ) {
         char var31 = 0<"JNT",353852153,"洵眵椵謵⤵輵","⮁\udb83\udb81箃","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987325850>(var10002, var10001);
         int var10005 = (var31 & '\uf800') >> 11;
         int var32 = (((var31 & '\uf800') >> 11 | var31 << 5) ^ 53 ^ 4) + 32;
         int var84 = ((((var31 & '\uf800') >> 11 | var31 << 5) ^ 53 ^ 4) + 32 & 49152) >> 14;
         var31 = (char)((((var10005 | var31 << 5) ^ 53 ^ 4) + 32 & 49152) >> 14 | (((var31 & '\uf800') >> 11 | var31 << 5) ^ 53 ^ 4) + 32 << 2);
         0<"JNT",353852153,"贵焵輵ⴵ眵椵謵⤵輵","⮁\udb83箃\udb81\u0b84","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987325859>(var10002, var10001, (char)(var84 | var32 << 2));
      }

      String var5 = 0<"JNT",353852153,"輵蔵䴵輵謵礵茵电","⮁\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987325494>(var10002);
      int var17 = -783544388 << 484714698 ^ 809431040;

      StringBuilder var35;
      for (var35 = (StringBuilder)0<"JNT",531824449,"ἵ礵茵礵輵⌵","⮁\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ\udb81\u0b84","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987325855>(
            "㨼ℼⒼ↼⨼μ⌼μ₼⌼☼ℼμ⮼⌼⼼μ┼ℼ⨼⨼⌼‼ℼμ✼Ⓖμ∼➼⌼⦼"
         );
         var17 < (-1045642392 & 240538352 ^ 279104);
         var17 += (33082824 & -358323529 | 1) & -1990875563
      ) {
         int var61 = (0<"JNT",353852153,"洵眵椵謵⤵輵","⮁\udb83\udb81箃","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987325866>(var35, var17) ^ '\t') - 52 ^ 1;
         char var62 = (char)(((var61 & 65408) >> 7 | var61 << 9) ^ 39);
         0<"JNT",353852153,"贵焵輵ⴵ眵椵謵⤵輵","⮁\udb83箃\udb81\u0b84","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987327475>(
            var35, var17, (char)(((var61 & 65408) >> 7 | var61 << 9) ^ 39)
         );
      }

      super(
         var5,
         0<"JNT",353852153,"輵蔵䴵輵謵礵茵电","⮁\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987327474>(var35),
         -1,
         1<"JNT",608528615,"吺䜺嬺","\ufe1fﺻ","耄䀄뿡翰㿚\uffdf",-502166875>()
      );
      Class_30 var10000 = this;
      var10001 = (1875206593 ^ 1875206593 | 0) & -415770258;

      for (var10002 = (StringBuilder)0<"JNT",531824449,"ἵ礵茵礵輵⌵","⮁\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ\udb81\u0b84","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987327268>(
            "큒큮큣큻큧큰"
         );
         var10001 < ((428203194 | 1548025643 | 4) & -1606811642);
         var10001 += 87123484 & 1171163936 ^ 83886593
      ) {
         char var38 = 0<"JNT",353852153,"洵眵椵謵⤵輵","⮁\udb83\udb81箃","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987325868>(var10002, var10001);
         int var86 = (var38 & '\uf000') >> 12;
         int var39 = (((var38 & '\uf000') >> 12 | var38 << 4) ^ 2 ^ 43) - 4;
         int var87 = ((((var38 & '\uf000') >> 12 | var38 << 4) ^ 2 ^ 43) - 4 & 65520) >> 4;
         char var40 = (char)((((var86 | var38 << 4) ^ 2 ^ 43) - 4 & 65520) >> 4 | (((var38 & '\uf000') >> 12 | var38 << 4) ^ 2 ^ 43) - 4 << 12);
         0<"JNT",353852153,"贵焵輵ⴵ眵椵謵⤵輵","⮁\udb83箃\udb81\u0b84","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987325869>(var10002, var10001, (char)(var87 | var39 << 12));
      }

      Class_168 var8 = (Class_168)0<"JNT",531824449,"ἵ礵茵礵輵⌵","⮁\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ\udb81\u0b84","ၰა",987325848>(
         0<"JNT",353852153,"輵蔵䴵輵謵礵茵电","⮁\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987325871>(var10002), ""
      );
      int var21 = 0;
      var35 = (StringBuilder)0<"JNT",531824449,"ἵ礵茵礵輵⌵","⮁\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ\udb81\u0b84","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987325849>(
         "㽀㑀㒀ɀ㙀㕀㎀⦀㒀㟀ɀ㛀㎀㚀㒀ɀ㝀㘀ɀ㓀㎀㔀㒀ɀ㙀㎀⦀"
      );

      label77:
      while (true) {
         var1 = (-404805823 ^ -404805823 | 1254464092) & -875585955;

         while (true) {
            label99: {
               switch ((var1 + 932586188 ^ 1325634742 ^ 1521347231) + 204919115 - 1767139472 ^ 152385153) {
                  case 744007756:
                     var10002 = var35;
                     if (var21 < (-2026008462 << -2026008462 ^ 1103626262)) {
                        int var81 = (0<"JNT",353852153,"洵眵椵謵⤵輵","⮁\udb83\udb81箃","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987327271>(var35, var21) ^ 229) - 65 - 141;
                        char var82 = (char)(((var81 & 32768) >> 15 | var81 << 1) - 172);
                        0<"JNT",353852153,"贵焵輵ⴵ眵椵謵⤵輵","⮁\udb83箃\udb81\u0b84","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987327472>(
                           var35, var21, (char)(((var81 & 32768) >> 15 | var81 << 1) - 172)
                        );
                        var21 += -1398404096 & -939204990 - -703030200 ^ -1599864831;
                        break label99;
                     }

                     var1 = (2020313428 << (2020313428 >>> -1010744208) | 813792441) & -172491331;
                     break;
                  case 869080381:
                  default:
                     var10002 = var35;
                     if (var21 < (1834561020 + -537200635 ^ 1297360410)) {
                        char var67 = 0<"JNT",353852153,"洵眵椵謵⤵輵","⮁\udb83\udb81箃","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987325496>(var35, var21);
                        char var70 = (char)(
                           (
                                 ((((((var67 & '\uffc0') >> 6 | var67 << '\n') & 65534) >> 1 | ((var67 & '\uffc0') >> 6 | var67 << '\n') << 15) ^ 49) & 32768)
                                       >> 15
                                    | (((((var67 & '\uffc0') >> 6 | var67 << '\n') & 65534) >> 1 | ((var67 & '\uffc0') >> 6 | var67 << '\n') << 15) ^ 49) << 1
                              )
                              - 75
                        );
                        0<"JNT",353852153,"贵焵輵ⴵ眵椵謵⤵輵","⮁\udb83箃\udb81\u0b84","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987325497>(
                           var35,
                           var21,
                           (char)(
                              (
                                    (
                                             (((((var67 & '\uffc0') >> 6 | var67 << '\n') & 65534) >> 1 | ((var67 & '\uffc0') >> 6 | var67 << '\n') << 15) ^ 49)
                                                & 32768
                                          )
                                          >> 15
                                       | (((((var67 & '\uffc0') >> 6 | var67 << '\n') & 65534) >> 1 | ((var67 & '\uffc0') >> 6 | var67 << '\n') << 15) ^ 49)
                                          << 1
                                 )
                                 - 75
                           )
                        );
                        var21 += 1353151801 + 185620246 ^ 1538772046;
                        continue label77;
                     }

                     var1 = -1578282652 & -1674552198 ^ 286020458;
               }

               switch (var1 + 1739342620 + 1055978754 ^ 944250775 ^ 1891805643 ^ 2090725459 ^ 1932236840) {
                  case 1545464560:
                     var10000.field_2270 = 0<"JNT",353852153,"褵缵","⮁\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ\udb81\ueb83ﮅ宆ﮂ","ၰა",987325492>(
                        var8, 0<"JNT",353852153,"輵蔵䴵輵謵礵茵电","⮁\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987325643>(var10002)
                     );
                     var10001 = 403577270 * 1512225582 ^ 92049588;

                     for (var10002 = (StringBuilder)0<"JNT",531824449,"ἵ礵茵礵輵⌵","⮁\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ\udb81\u0b84","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987325493>(
                           "Łąīđįāīĉƃŕĉı"
                        );
                        var10001 < ((-522082404 << -522082404 | 12) & 652140701);
                        var10001 += (491293827 + 491293827 | 1) & 1162003097
                     ) {
                        int var51 = 0<"JNT",353852153,"洵眵椵謵⤵輵","⮁\udb83\udb81箃","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987325870>(var10002, var10001) ^ 162;
                        int var93 = (var51 & 0) >> 16;
                        int var52 = ((var51 & 0) >> 16 | var51 << 0) ^ 103;
                        int var94 = ((((var51 & 0) >> 16 | var51 << 0) ^ 103) & 65534) >> 1;
                        char var53 = (char)(((((var93 | var51 << 0) ^ 103) & 65534) >> 1 | (((var51 & 0) >> 16 | var51 << 0) ^ 103) << 15) ^ 131);
                        0<"JNT",353852153,"贵焵輵ⴵ眵椵謵⤵輵","⮁\udb83箃\udb81\u0b84","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987325847>(
                           var10002, var10001, (char)((var94 | var52 << 15) ^ 131)
                        );
                     }

                     this.field_2271 = (Class_115)0<"JNT",531824449,"ἵ礵茵礵輵⌵","⮁\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ\udb83쮄\udb81\u0b84","၀ა",987327485>(
                        0<"JNT",353852153,"輵蔵䴵輵謵礵茵电","⮁\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987327484>(var10002),
                        -1,
                        false
                     );
                     var10001 = 1010962270 + 558156636 ^ 1569118906;

                     for (var10002 = (StringBuilder)0<"JNT",531824449,"ἵ礵茵礵輵⌵","⮁\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ\udb81\u0b84","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987327486>(
                           "8\u0011\u000b\u0015#\u0086\u0011\u0086\u0083ￒ3\u000f\r\u0082\u0011\u0086"
                        );
                        var10001 < ((-44262015 + 252731235 | 16) & 1384186129);
                        var10001 += -286539864 - 1225093282 ^ -1511633145
                     ) {
                        0<"JNT",353852153,"贵焵輵ⴵ眵椵謵⤵輵","⮁\udb83箃\udb81\u0b84","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987325504>(
                           var10002,
                           var10001,
                           (char)(
                              (0<"JNT",353852153,"洵眵椵謵⤵輵","⮁\udb83\udb81箃","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987325495>(var10002, var10001) + 'u' ^ 63)
                                    + 159
                                    - 241
                                 ^ 6
                           )
                        );
                     }

                     Class_105 var15 = (Class_105)0<"JNT",531824449,"ἵ礵茵礵輵⌵","⮁\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ쮄\udb81\u0b84","ူრ",987325857>(
                        0<"JNT",353852153,"輵蔵䴵輵謵礵茵电","⮁\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987325856>(var10002), false
                     );
                     int var29 = (-533232559 >>> -516018381 * -533232559 | 0) & 42534196;

                     for (var35 = (StringBuilder)0<"JNT",531824449,"ἵ礵茵礵輵⌵","⮁\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ\udb81\u0b84","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987325858>(
                           "￩翹\ufff9翱翶\ufff1ￗ\uffef翷翫ￗ翷翵翴翱\ufff4\ufff1ￗ\ufff8￮翴翵ￗ￨翷翲翹翞\ufff1翷\ufff1翮ￗ翵翴\ufff4翹翫"
                        );
                        var29 < (-1472235813 & 1339945173 << 1339945173 ^ 136314918);
                        var29 += (-1477348570 | 1589700314) ^ -919553
                     ) {
                        int var78 = (0<"JNT",353852153,"洵眵椵謵⤵輵","⮁\udb83\udb81箃","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987325505>(var35, var29) ^ 'A')
                              + 107
                              + 219
                           ^ 204;
                        char var79 = (char)((var78 & 32768) >> 15 | var78 << 1);
                        0<"JNT",353852153,"贵焵輵ⴵ眵椵謵⤵輵","⮁\udb83箃\udb81\u0b84","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987325506>(
                           var35, var29, (char)((var78 & 32768) >> 15 | var78 << 1)
                        );
                     }

                     this.field_2272 = 0<"JNT",353852153,"椵鄵漵","⮁\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ\udb81\ueb83㮅䮆ﮂ","ူრ",987325844>(
                        var15, 0<"JNT",353852153,"輵蔵䴵輵謵礵茵电","⮁\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987325867>(var35)
                     );
                     0<"JNT",353852153,"褵鄵","⮁ﮄ\ueb83宆ᮅᮅﮂ\udb81\u0b84","\u0fe0ა",987325865>(
                        this,
                        new Class_271[]{
                           1<"JNT",314320040,"尺䨺吺","ﺻ\ufeff","耄䀄뿡ￓ翖\uffdf",-502166901>(this),
                           1<"JNT",314320040,"䨺䘺娺","ﺻ\ufeff","耄䀄뿡ￓ翖\uffdf",-502166902>(this),
                           1<"JNT",314320040,"嘺䠺","ﺻ\ufeff","耄䀄뿡뿔翖\uffdf",-502166879>(this),
                           1<"JNT",314320040,"唺为䨺","ﺻ\ufeff","耄䀄뿡ￚ㿖\uffdf",-502166880>(this)
                        }
                     );
                     return;
                  case 1895163151:
                  default:
                     var10000.field_2269 = 0<"JNT",353852153,"褵缵","⮁\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ\udb81\ueb83ﮅ宆ﮂ","ၰა",987327270>(
                        var8, 0<"JNT",353852153,"輵蔵䴵輵謵礵茵电","⮁\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987327269>(var10002)
                     );
                     var10000 = this;
                     var10001 = -1339448649 * -1339448649 ^ 638197457;
                     var10002 = (StringBuilder)0<"JNT",531824449,"ἵ礵茵礵輵⌵","⮁\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ\udb81\u0b84","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987325647>(
                        "က倁瀁퀂态쀂"
                     );
               }

               while (var10001 < (-740569798 >>> -740569798 ^ 50)) {
                  char var46 = 0<"JNT",353852153,"洵眵椵謵⤵輵","⮁\udb83\udb81箃","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987325498>(var10002, var10001);
                  int var91 = (var46 & '\uf800') >> 11;
                  int var47 = (((var46 & '\uf800') >> 11 | var46 << 5) ^ 251) - 153 ^ 226;
                  int var92 = (((((var46 & '\uf800') >> 11 | var46 << 5) ^ 251) - 153 ^ 226) & 65534) >> 1;
                  char var48 = (char)(
                     ((((var91 | var46 << 5) ^ 251) - 153 ^ 226) & 65534) >> 1 | ((((var46 & '\uf800') >> 11 | var46 << 5) ^ 251) - 153 ^ 226) << 15
                  );
                  0<"JNT",353852153,"贵焵輵ⴵ眵椵謵⤵輵","⮁\udb83箃\udb81\u0b84","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987325507>(
                     var10002, var10001, (char)(var92 | var47 << 15)
                  );
                  var10001 += (-1643051720 ^ -788558425 | 1) & 538002177;
               }

               var8 = (Class_168)0<"JNT",531824449,"ἵ礵茵礵輵⌵","⮁\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ\udb81\u0b84","ၰა",987325645>(
                  0<"JNT",353852153,"輵蔵䴵輵謵礵茵电","⮁\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987325644>(var10002), "1"
               );
               var21 = -1334191134 ^ -1512291515 ^ 363174055;
               var35 = (StringBuilder)0<"JNT",531824449,"ἵ礵茵礵輵⌵","⮁\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ\udb81\u0b84","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987325646>(
                  "ƫƽ膳Ǒ膱膿膾膻ƾƻǑƻ膾ǑƲ膱膼膳Ǒƹ膱膅"
               );
            }

            var1 = 2040745689 - -2068325714 ^ -1799073468;
         }
      }
   }

   // $VF: renamed from: gd (Class_207) void
   @Class_21
   public void method_1902(Class_207 var1) {
      int var2 = -1318027849;
      if (1<"JNT",314320040,"䨺䴺䤺债䠺䌺ᔺᬺᘺᠺ","＋ﺯﻳ︋ﻏﻟ＋ﺯﺷﻻﺿﻫﻳ︋ﺷﻓﺿﻷﻷﻇﷷ﷿︃","耄䀄뿡㿙翗뿓쀄翙翔㿙翗\uffd9㿖翚㿗뿓쀄\uffd9뿙翚ￕￕ\uffd8ￆ뿃㿃\uffdf",-502166871>(
            1<"JNT",314320040,"债嘺","ﺻ\ufeff","耄䀄뿡㿙翗뿓쀄翙翔㿙翗\uffd9㿖翚㿗뿓쀄\uffd9뿙翚ￕￕ\uffd8ￅ翆뿆\uffdf",-502166862>(this)
         )
         != null) {
         var2 = 922087034;

         while (true) {
            switch (((var2 ^ 1032931120 ^ 1067225467) + 1352693012 ^ 2076723559) - 1652302949 - 1626173686) {
               case 29245588:
                  1<"JNT",861393262,"䜺债吺","ﺻ\ufeff","耄䀄㿘",-502166872>(this, false);
                  break;
               case 137539538:
               default:
                  return;
               case 988237511:
                  if (!0<"JNT",-1848112657,"脵洵","⮁\udb83\udb81쮄","ႀ\u0fe0",987325642>(
                     0<"JNT",353852153,"猵眵","⮁\udb81\udb83","၀ა",987325641>(1<"JNT",314320040,"嘺䠺","ﺻ\ufeff","耄䀄뿡뿔翖\uffdf",-502166720>(this))
                  )) {
                     var2 = 1816326463;
                     continue;
                  }

                  if (!1<"JNT",314320040,"䜺债吺","ﺻ\ufeff","耄䀄㿘",-502166851>(this)) {
                     1<"JNT",861393262,"䜺债吺","ﺻ\ufeff","耄䀄㿘",-502166852>(this, true);
                     0<"JNT",353852153,"猵謵欵","⮁\udb81\u0b84","\u0fe0ა",987325853>(this);
                  }
            }

            var2 = (-2013975572 >>> (-1422040760 | -2130306965) | 1571684733) & 1577009535;
         }
      }
   }

   // $VF: renamed from: frb () void
   public void method_1903() {
      String var1 = 0<"JNT",353852153,"輵謵礵脵","⮁\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ",987325651>(
         0<"JNT",353852153,"紵紵","⮁\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ","ၰა",987325450>(1<"JNT",314320040,"尺䨺吺","ﺻ\ufeff","耄䀄뿡ￓ翖\uffdf",-502165625>(this))
      );
      String var2 = 0<"JNT",353852153,"輵蔵儵蜵蜵焵謵ⴵ椵贵焵","⮁\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ",987325575>(
         0<"JNT",353852153,"輵謵礵脵","⮁\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ",987325662>(
            0<"JNT",353852153,"紵紵","⮁\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ","ၰა",987325661>(1<"JNT",314320040,"䨺䘺娺","ﺻ\ufeff","耄䀄뿡ￓ翖\uffdf",-502165508>(this))
         )
      );
      if (!0<"JNT",353852153,"礵贵ㄵ脵蜵輵餵","⮁\udb81쮄","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ",987325648>(var1)) {
         Class_385 var3 = (Class_385)0<"JNT",353852153,"礵贵","⮁\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箃\ueb85宅箆箆ﮂ\udb81\ueb83ᮆ箆அﮂ","Ⴀ\u0ff0",987325453>(
            0<"JNT",353852153,"霵蜵","⮁\udb81\ueb83讅箅ﮂ","ဠ࿐",987325452>((ScreenUI_78)1<"JNT",608528615,"䤺夺唺","ﻫﺿ","耄䀄뿡㿔翚㿓翚쀄뿙翚㿙ￚ쀄ￜ㿚㿔翗\uffd9뿓\uffdf",-502165523>()),
            Class_385.class
         );
         if (0<"JNT",353852153,"椵霵","⮁\udb81쮄","ူრ",987325559>(1<"JNT",314320040,"唺为䨺","ﺻ\ufeff","耄䀄뿡ￚ㿖\uffdf",-502165534>(this))
            && var3 != null
            && 0<"JNT",353852153,"蜵欵脵","⮁\udb81쮄","ᅀ࿐ᅀ",987325568>(var3)) {
            double var4 = 0<"JNT",-1848112657,"漵茵贵","⮁\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ\udb81殃","აႰၰ",987325569>(var2);
            double var6 = 0<"JNT",-1848112657,"漵茵贵","⮁\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ\udb81殃","აႰၰ",987325556>(
               0<"JNT",353852153,"紵紵","⮁\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ","ၰა",987325451>(
                  0<"JNT",353852153,"脵謵脵","⮁\udb81\ueb83ﮅ宆ﮂ","ᅀ࿐ᅀ",987325570>(var3)
               )
            );
            if (var4 > 0.0 && var6 > 0.0) {
               double var8 = 0<"JNT",-1848112657,"脵椵霵","⮁殃殃\udb81殃","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠຐ࿐ᄀ၀",987325557>(0.0, var6 - var4);
               0<"JNT",353852153,"鬵漵","⮁\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ\udb81\u0b84","ၰა",987325448>(
                  0<"JNT",353852153,"脵謵脵","⮁\udb81\ueb83ﮅ宆ﮂ","ᅀ࿐ᅀ",987325558>(var3),
                  0<"JNT",353852153,"焵餵焵","⮁殃\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ","\u0fe0ა",987325663>(this, var8)
               );
            }
         }

         class_5250 var10000 = 0<"JNT",-1848112657,"脵焵輵眵蔵漵攵༵വ༵ᔵവ","⮁\udb81\ueb83讅ᮅ殆뮁鮅\udb85讅ᮅ箅䮆宅அ殆뮁箅\ueb85宅箆箆뮄ᮂ䮂ᮂꮁﮂ","Ⴀတᄀಠ႐ၐႠတ\u0ff0რ࿐ဠᄀಠ\u0ff0ႀ࿐ჰჰྰೠഐഠ\u0cd0",987325561>();
         int var10001 = 0;

         StringBuilder var10002;
         for (var10002 = (StringBuilder)0<"JNT",531824449,"ἵ礵茵礵輵⌵","⮁\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ\udb81\u0b84","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987325562>(
               "⣙퓘\uf0d8뛙훘㣙죘컘뛙"
            );
            var10001 < 9;
            var10001 += (1639205729 ^ 1639205729 * 1639205729 | 1) & 76548123
         ) {
            int var15 = 0<"JNT",353852153,"洵眵椵謵⤵輵","⮁\udb83\udb81箃","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987325841>(var10002, var10001) - 172 - 46;
            char var16 = (char)((((var15 & 65024) >> 9 | var15 << 7) ^ 228) + 226);
            0<"JNT",353852153,"贵焵輵ⴵ眵椵謵⤵輵","⮁\udb83箃\udb81\u0b84","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987325842>(
               var10002, var10001, (char)((((var15 & 65024) >> 9 | var15 << 7) ^ 228) + 226)
            );
         }

         class_5250 var12 = 0<"JNT",353852153,"脵焵輵眵蔵漵攵वܵ᜵ᄵଵ","⮁\ueb83讅ᮅ殆뮁鮅\udb85讅ᮅ箅䮆宅அ殆뮁箅\ueb85宅箆箆뮄䮂ᮂஂ宂ﮂ\udb81\ueb83讅ᮅ殆뮁鮅\udb85讅ᮅ箅䮆宅அ殆뮁箅\ueb85宅箆箆뮄ᮂ䮂ᮂꮁﮂ","Ⴀတᄀಠ႐ၐႠတ\u0ff0რ࿐ဠᄀಠ\u0ff0ႀ࿐ჰჰྰഐೠഐೀ",987327333>(
            0<"JNT",353852153,"脵焵輵眵蔵漵攵वܵ᜵ᄵଵ","⮁\ueb83讅ᮅ殆뮁鮅\udb85讅ᮅ箅䮆宅அ殆뮁箅\ueb85宅箆箆뮄䮂ᮂஂ宂ﮂ\udb81\ueb83讅ᮅ殆뮁鮅\udb85讅ᮅ箅䮆宅அ殆뮁箅\ueb85宅箆箆뮄ᮂ䮂ᮂꮁﮂ","Ⴀတᄀಠ႐ၐႠတ\u0ff0რ࿐ဠᄀಠ\u0ff0ႀ࿐ჰჰྰഐೠഐೀ",987325501>(
               0<"JNT",353852153,"脵焵輵眵蔵漵攵वܵ᜵ᄵଵ","⮁\ueb83讅ᮅ殆뮁鮅\udb85讅ᮅ箅䮆宅அ殆뮁箅\ueb85宅箆箆뮄䮂ᮂஂ宂ﮂ\udb81\ueb83讅ᮅ殆뮁鮅\udb85讅ᮅ箅䮆宅அ殆뮁箅\ueb85宅箆箆뮄ᮂ䮂ᮂꮁﮂ","Ⴀတᄀಠ႐ၐႠတ\u0ff0რ࿐ဠᄀಠ\u0ff0ႀ࿐ჰჰྰഐೠഐೀ",987325675>(
                  0<"JNT",353852153,"脵焵輵眵蔵漵攵वܵ᜵ᄵଵ","⮁\ueb83讅ᮅ殆뮁鮅\udb85讅ᮅ箅䮆宅அ殆뮁箅\ueb85宅箆箆뮄䮂ᮂஂ宂ﮂ\udb81\ueb83讅ᮅ殆뮁鮅\udb85讅ᮅ箅䮆宅அ殆뮁箅\ueb85宅箆箆뮄ᮂ䮂ᮂꮁﮂ","Ⴀတᄀಠ႐ၐႠတ\u0ff0რ࿐ဠᄀಠ\u0ff0ႀ࿐ჰჰྰഐೠഐೀ",987325657>(
                     var10000,
                     0<"JNT",353852153,"脵焵輵眵蔵漵攵वܵ᜵ጵଵ","⮁\ueb83讅ᮅ殆뮁鮅\udb85讅ᮅ箅䮆宅அ殆뮁箅\ueb85宅箆箆뮄䮂ᮂ⮂箂ﮂ\udb81\ueb83讅ᮅ殆뮁鮅\udb85讅ᮅ箅䮆宅அ殆뮁箅\ueb85宅箆箆뮄ᮂ䮂ᮂꮁﮂ","Ⴀတᄀಠ႐ၐႠတ\u0ff0რ࿐ဠᄀಠ\u0ff0ႀ࿐ჰჰྰഐೠഐೀ",987325656>(
                        0<"JNT",-1848112657,"脵焵輵眵蔵漵攵༵വ༵ᔵܵ","⮁\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ\udb81\ueb83讅ᮅ殆뮁鮅\udb85讅ᮅ箅䮆宅அ殆뮁箅\ueb85宅箆箆뮄ᮂ䮂ᮂꮁﮂ","Ⴀတᄀಠ႐ၐႠတ\u0ff0რ࿐ဠᄀಠ\u0ff0ႀ࿐ჰჰྰೠഐഠ\u0cd0",987325508>(
                           0<"JNT",353852153,"輵蔵䴵輵謵礵茵电","⮁\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987325851>(var10002)
                        ),
                        0<"JNT",353852153,"脵焵輵眵蔵漵攵वܵᤵᔵᔵ","⮁\ueb83讅ᮅ殆뮁鮅\udb85讅ᮅ箅䮆宅அ殆뮁箅\ueb85宅箆箆뮄宂䮂殂ﮂ\udb81\ueb83讅ᮅ殆뮁鮅\udb85讅ᮅ箅䮆宅அ殆뮁箅\ueb85宅箆箆뮄䮂ᮂ⮂箂ﮂ","Ⴀတᄀಠ႐ၐႠတ\u0ff0რ࿐ဠᄀಠ\u0ff0ႀ࿐ჰჰྰೠഐീ\u0cf0",987325679>(
                           1<"JNT",608528615,"尺为夺","ﺻ\ufeff","耄䀄뿡㿙翗뿓쀄翙翔㿙翗\uffd9㿖翚㿗뿓쀄\uffd9뿙翚ￕￕ\uffd8㿆翃뿠ￅ\uffdf",-502166853>(),
                           1<"JNT",608528615,"䨺䴺䤺债䠺䌺ᔺᐺ\u1c3aᐺ","＋ﺯﻳ︋ﻏﻟ＋ﺯﺷﻻﺿﻫﻳ︋ﺷﻓﺿﻷﻷﻇ﷿ﷻﷳ","耄䀄뿡㿙翗뿓쀄翙翔㿙翗\uffd9㿖翚㿗뿓쀄\uffd9뿙翚ￕￕ\uffd8翆㿆뿃\uffdf",-502166854>()
                        )
                     )
                  ),
                  0<"JNT",353852153,"脵焵輵眵蔵漵攵वܵ᜵ጵଵ","⮁\ueb83讅ᮅ殆뮁鮅\udb85讅ᮅ箅䮆宅அ殆뮁箅\ueb85宅箆箆뮄䮂ᮂ⮂箂ﮂ\udb81\ueb83讅ᮅ殆뮁鮅\udb85讅ᮅ箅䮆宅அ殆뮁箅\ueb85宅箆箆뮄ᮂ䮂ᮂꮁﮂ","Ⴀတᄀಠ႐ၐႠတ\u0ff0რ࿐ဠᄀಠ\u0ff0ႀ࿐ჰჰྰഐೠഐೀ",987325666>(
                     0<"JNT",-1848112657,"脵焵輵眵蔵漵攵༵വ༵ᔵܵ","⮁\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ\udb81\ueb83讅ᮅ殆뮁鮅\udb85讅ᮅ箅䮆宅அ殆뮁箅\ueb85宅箆箆뮄ᮂ䮂ᮂꮁﮂ","Ⴀတᄀಠ႐ၐႠတ\u0ff0რ࿐ဠᄀಠ\u0ff0ႀ࿐ჰჰྰೠഐഠ\u0cd0",987325678>(
                        0<"JNT",353852153,"輵蔵䴵輵謵礵茵电","⮁\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987325677>(
                           0<"JNT",353852153,"椵蜵蜵焵茵漵","⮁\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅䮃ᮆ\udb85\ueb85殅ᮅ䮆ﮂ","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987325676>(
                              0<"JNT",353852153,"椵蜵蜵焵茵漵","⮁\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁뮃䮅쮅ᮅ箅殆ﮂ\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅䮃ᮆ\udb85\ueb85殅ᮅ䮆ﮂ","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987325667>(
                                 (StringBuilder)0<"JNT",531824449,"ἵ礵茵礵輵⌵","⮁\udb81\u0b84","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987325658>(), var1
                              ),
                              " "
                           )
                        )
                     ),
                     0<"JNT",353852153,"脵焵輵眵蔵漵攵ଵᔵᔵܵവ","⮁\ueb83讅ᮅ殆뮁鮅\udb85讅ᮅ箅䮆宅அ殆뮁箅\ueb85宅箆箆뮄ᮂ䮂ᮂ宂ﮂ\udb81\ueb83讅ᮅ殆뮁鮅\udb85讅ᮅ箅䮆宅அ殆뮁箅\ueb85宅箆箆뮄䮂ᮂ⮂箂ﮂ","Ⴀတᄀಠ႐ၐႠတ\u0ff0რ࿐ဠᄀಠ\u0ff0ႀ࿐ჰჰྰೠഐീ\u0cf0",987325665>(
                        1<"JNT",608528615,"尺为夺","ﺻ\ufeff","耄䀄뿡㿙翗뿓쀄翙翔㿙翗\uffd9㿖翚㿗뿓쀄\uffd9뿙翚ￕￕ\uffd8㿆翃뿠ￅ\uffdf",-502165703>(),
                        0<"JNT",-1848112657,"脵焵輵眵蔵漵攵ଵᔵᔵवᔵ","⮁\udb83\udb81\ueb83讅ᮅ殆뮁鮅\udb85讅ᮅ箅䮆宅அ殆뮁箅\ueb85宅箆箆뮄ᮂ䮂ᮂ宂ﮂ","Ⴀတᄀಠ႐ၐႠတ\u0ff0რ࿐ဠᄀಠ\u0ff0ႀ࿐ჰჰྰഐೠഐ\u0cd0",987325664>(
                           42751
                        )
                     )
                  )
               ),
               0<"JNT",353852153,"脵焵輵眵蔵漵攵वܵ᜵ጵଵ","⮁\ueb83讅ᮅ殆뮁鮅\udb85讅ᮅ箅䮆宅அ殆뮁箅\ueb85宅箆箆뮄䮂ᮂ⮂箂ﮂ\udb81\ueb83讅ᮅ殆뮁鮅\udb85讅ᮅ箅䮆宅அ殆뮁箅\ueb85宅箆箆뮄ᮂ䮂ᮂꮁﮂ","Ⴀတᄀಠ႐ၐႠတ\u0ff0რ࿐ဠᄀಠ\u0ff0ႀ࿐ჰჰྰഐೠഐೀ",987325500>(
                  0<"JNT",-1848112657,"脵焵輵眵蔵漵攵༵വ༵ᔵܵ","⮁\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ\udb81\ueb83讅ᮅ殆뮁鮅\udb85讅ᮅ箅䮆宅அ殆뮁箅\ueb85宅箆箆뮄ᮂ䮂ᮂꮁﮂ","Ⴀတᄀಠ႐ၐႠတ\u0ff0რ࿐ဠᄀಠ\u0ff0ႀ࿐ჰჰྰೠഐഠ\u0cd0",987325672>(
                     0<"JNT",353852153,"輵蔵䴵輵謵礵茵电","⮁\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987325503>(
                        0<"JNT",353852153,"椵蜵蜵焵茵漵","⮁\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁뮃䮅쮅ᮅ箅殆ﮂ\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅䮃ᮆ\udb85\ueb85殅ᮅ䮆ﮂ","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987325654>(
                           0<"JNT",353852153,"椵蜵蜵焵茵漵","⮁\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅䮃ᮆ\udb85\ueb85殅ᮅ䮆ﮂ","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987325653>(
                              (StringBuilder)0<"JNT",531824449,"ἵ礵茵礵輵⌵","⮁\udb81\u0b84","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987325652>(), "$"
                           ),
                           var2
                        )
                     )
                  ),
                  0<"JNT",353852153,"脵焵輵眵蔵漵攵ଵᔵᔵܵവ","⮁\ueb83讅ᮅ殆뮁鮅\udb85讅ᮅ箅䮆宅அ殆뮁箅\ueb85宅箆箆뮄ᮂ䮂ᮂ宂ﮂ\udb81\ueb83讅ᮅ殆뮁鮅\udb85讅ᮅ箅䮆宅அ殆뮁箅\ueb85宅箆箆뮄䮂ᮂ⮂箂ﮂ","Ⴀတᄀಠ႐ၐႠတ\u0ff0რ࿐ဠᄀಠ\u0ff0ႀ࿐ჰჰྰೠഐീ\u0cf0",987325491>(
                     1<"JNT",608528615,"尺为夺","ﺻ\ufeff","耄䀄뿡㿙翗뿓쀄翙翔㿙翗\uffd9㿖翚㿗뿓쀄\uffd9뿙翚ￕￕ\uffd8㿆翃뿠ￅ\uffdf",-502165529>(),
                     0<"JNT",-1848112657,"脵焵輵眵蔵漵攵ଵᔵᔵवᔵ","⮁\udb83\udb81\ueb83讅ᮅ殆뮁鮅\udb85讅ᮅ箅䮆宅அ殆뮁箅\ueb85宅箆箆뮄ᮂ䮂ᮂ宂ﮂ","Ⴀတᄀಠ႐ၐႠတ\u0ff0რ࿐ဠᄀಠ\u0ff0ႀ࿐ჰჰྰഐೠഐ\u0cd0",987325674>(
                        65280
                     )
                  )
               )
            ),
            0<"JNT",353852153,"脵焵輵眵蔵漵攵वܵ᜵ጵଵ","⮁\ueb83讅ᮅ殆뮁鮅\udb85讅ᮅ箅䮆宅அ殆뮁箅\ueb85宅箆箆뮄䮂ᮂ⮂箂ﮂ\udb81\ueb83讅ᮅ殆뮁鮅\udb85讅ᮅ箅䮆宅அ殆뮁箅\ueb85宅箆箆뮄ᮂ䮂ᮂꮁﮂ","Ⴀတᄀಠ႐ၐႠတ\u0ff0რ࿐ဠᄀಠ\u0ff0ႀ࿐ჰჰྰഐೠഐೀ",987327332>(
               0<"JNT",-1848112657,"脵焵輵眵蔵漵攵༵വ༵ᔵܵ","⮁\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ\udb81\ueb83讅ᮅ殆뮁鮅\udb85讅ᮅ箅䮆宅அ殆뮁箅\ueb85宅箆箆뮄ᮂ䮂ᮂꮁﮂ","Ⴀတᄀಠ႐ၐႠတ\u0ff0რ࿐ဠᄀಠ\u0ff0ႀ࿐ჰჰྰೠഐഠ\u0cd0",987325502>(
                  "."
               ),
               0<"JNT",353852153,"脵焵輵眵蔵漵攵वܵᤵᔵ᜵","⮁\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁䮃뮅뮅\ueb85ᮅ宅讅ﮂ\udb81\ueb83讅ᮅ殆뮁鮅\udb85讅ᮅ箅䮆宅அ殆뮁箅\ueb85宅箆箆뮄䮂ᮂ⮂箂ﮂ","Ⴀတᄀಠ႐ၐႠတ\u0ff0რ࿐ဠᄀಠ\u0ff0ႀ࿐ჰჰྰೠഐീ\u0cf0",987325499>(
                  0<"JNT",353852153,"脵焵輵眵蔵漵攵वܵᤵᔵᔵ","⮁\ueb83讅ᮅ殆뮁鮅\udb85讅ᮅ箅䮆宅அ殆뮁箅\ueb85宅箆箆뮄宂䮂殂ﮂ\udb81\ueb83讅ᮅ殆뮁鮅\udb85讅ᮅ箅䮆宅அ殆뮁箅\ueb85宅箆箆뮄䮂ᮂ⮂箂ﮂ","Ⴀတᄀಠ႐ၐႠတ\u0ff0რ࿐ဠᄀಠ\u0ff0ႀ࿐ჰჰྰೠഐീ\u0cf0",987325489>(
                     1<"JNT",608528615,"䨺䴺䤺债䠺䌺ᘺᠺ\u173aᨺᐺ","＋ﺯﻳ︋ﻏﻟ＋ﺯﺷﻻﺿﻫﻳ︋ﺷﻓﺿﻷﻷﻇﷻ\ufdefﴣﷷ","耄䀄뿡㿙翗뿓쀄翙翔㿙翗\uffd9㿖翚㿗뿓쀄\uffd9뿙翚ￕￕ\uffd8㿆翃뿠ￅ\uffdf",-502165559>(),
                     1<"JNT",608528615,"䨺䴺䤺债䠺䌺ᔺᐺ\u1c3aᐺ","＋ﺯﻳ︋ﻏﻟ＋ﺯﺷﻻﺿﻫﻳ︋ﺷﻓﺿﻷﻷﻇ﷿ﷻﷳ","耄䀄뿡㿙翗뿓쀄翙翔㿙翗\uffd9㿖翚㿗뿓쀄\uffd9뿙翚ￕￕ\uffd8翆㿆뿃\uffdf",-502165560>()
                  ),
                  0<"JNT",-1848112657,"錵椵缵鄵焵䔵猵","⮁쮄\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁䮃뮅뮅\ueb85ᮅ宅讅ﮂ","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0de0ႰႰႀတ࿐Ⴀ",987325490>(false)
               )
            )
         );
         0<"JNT",353852153,"脵焵輵眵蔵漵攵ᔵവᄵവ","⮁\ueb83讅ᮅ殆뮁鮅\udb85讅ᮅ箅䮆宅அ殆뮁箅\ueb85宅箆箆뮄䮂ᮂஂ宂ﮂ쮄\udb81\u0b84","Ⴀတᄀಠ႐ၐႠတ\u0ff0რ࿐ဠᄀಠ\u0ff0ႀ࿐ჰჰྰരഀഠ",987325560>(
            1<"JNT",314320040,"䨺䴺䤺债䠺䌺ᔺᬺᘺᠺ","＋ﺯﻳ︋ﻏﻟ＋ﺯﺷﻻﺿﻫﻳ︋ﺷﻓﺿﻷﻷﻇﷷ﷿︃","耄䀄뿡㿙翗뿓쀄翙翔㿙翗\uffd9㿖翚㿗뿓쀄\uffd9뿙翚ￕￕ\uffd8ￆ뿃㿃\uffdf",-502165519>(
               1<"JNT",314320040,"债嘺","ﺻ\ufeff","耄䀄뿡㿙翗뿓쀄翙翔㿙翗\uffd9㿖翚㿗뿓쀄\uffd9뿙翚ￕￕ\uffd8ￅ翆뿆\uffdf",-502165542>(this)
            ),
            var12,
            false
         );
      }
   }

   // $VF: renamed from: eye (double) java.lang.String
   // $VF: Irreducible bytecode was duplicated to produce valid code
   public String method_1904(double var1) {
      int var10;
      StringBuilder var14;
      label214: {
         double var3;
         label230: {
            StringBuilder var18;
            label208: {
               label207: {
                  var10 = -2093692158;
                  if (var1 >= 1.0E12) {
                     var3 = var1 / 1.0E12;
                     if (var3 == (double)((long)var3)) {
                        var10000 = (-1142359245 << -1142359245 | 0) & 639856429;
                        var18 = (StringBuilder)0<"JNT",531824449,"ἵ礵茵礵輵⌵","⮁\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ\udb81\u0b84","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987327424>(
                           "羡㾱㾭"
                        );
                        var10 = 912567544;
                        break label207;
                     }

                     var10 = 1682022294 & 1682022294 ^ 745292683;
                  } else {
                     var10 = -986669474 & -1896859940 ^ 2129199832;

                     label204:
                     while (true) {
                        switch ((var10 + 1315620322 - 1914946508 ^ 802499716) - 862007018 - 42116261 - 490293252) {
                           case -1512563061:
                              if (var1 >= 1.0E9) {
                                 var3 = var1 / 1.0E9;
                                 if (var3 == (double)((long)var3)) {
                                    var10000 = -2087045707 >>> -2087045707 ^ 1052;
                                    var18 = (StringBuilder)0<"JNT",531824449,"ἵ礵茵礵輵⌵","⮁\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ\udb81\u0b84","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987327273>(
                                       "䩭졭葭"
                                    );
                                    var10 = -454327486 * -1314987258 ^ 860689274;
                                    break label207;
                                 }

                                 var10 = (51767869 | -1701927979 | 204608274) & 212998994;
                                 break label204;
                              }

                              var10 = (2090021355 << -1061104365 | 1363351798) & -773621505;
                              break;
                           case -1178699880:
                              if (var1 >= 1000.0) {
                                 var3 = var1 / 1000.0;
                                 if (var3 == (double)((long)var3)) {
                                    var10000 = (1414610151 - -1311294468 | 0) & 276883716;
                                    var18 = (StringBuilder)0<"JNT",531824449,"ἵ礵茵礵輵⌵","⮁\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ\udb81\u0b84","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987327265>(
                                       "\u0094ƐĬ"
                                    );
                                    var10 = -499979581 ^ -28275695 ^ 937817753;
                                    break label207;
                                 }

                                 var10 = (-877008663 << 1963346347 | -1876348656) & -1867943492;
                                 break label204;
                              }

                              var10 = (656259564 >>> 1812875170 | 1083180032) & 1475412993;
                              break;
                           case -977234152:
                              var13 = (-632101513 ^ -932692379 | 0) & -373227488;
                              var18 = (StringBuilder)0<"JNT",531824449,"ἵ礵茵礵輵⌵","⮁\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ\udb81\u0b84","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987327263>(
                                 "\u0378Јиވ"
                              );
                              var10 = (1179382834 >>> (1179382834 & 1179382834) | -642283935) & -2435;
                              break label208;
                           case -558887168:
                              if (var1 == (double)((long)var1)) {
                                 var13 = (45830406 | -1832194239 ^ 45830406 >> -1832194239 | 0) & 608217145;
                                 var18 = (StringBuilder)0<"JNT",531824449,"ἵ礵茵礵輵⌵","⮁\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ\udb81\u0b84","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987327051>(
                                    "\uec96\uf086"
                                 );
                                 var10 = 323469180 & 353113117 - 353113117 ^ -1003279125;
                                 break label208;
                              }

                              var10 = (1763593079 >> -526433832 | 1522637849) & -604897383;
                              break;
                           case 792861685:
                           default:
                              if (var1 >= 1000000.0) {
                                 var3 = var1 / 1000000.0;
                                 if (var3 == (double)((long)var3)) {
                                    var10000 = (523242482 | 374967060 | 0) & 537284616;
                                    var18 = (StringBuilder)0<"JNT",531824449,"ἵ礵茵礵輵⌵","⮁\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ\udb81\u0b84","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987327260>(
                                       "ƏÐÇ"
                                    );
                                    var10 = (62696136 & -1050575328 | 1342329112) & -623478340;
                                    break label207;
                                 }

                                 var10 = (-711664725 | -711664725 | 441083476) & 441411412;
                                 break label204;
                              }

                              var10 = (1609915374 & (936219424 | 1045073666) | 1078111385) & -957891107;
                        }
                     }
                  }

                  switch ((var10 ^ 488935470 ^ 1702481484 ^ 1382879953 ^ 1830848533 ^ 349715441) - 1655078237) {
                     case -1187076627:
                        var10000 = 692277368 + 692277368 ^ 1384554736;
                        var18 = (StringBuilder)0<"JNT",531824449,"ἵ礵茵礵輵⌵","⮁\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ\udb81\u0b84","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987327258>(
                           "늏뜏뢏錏訏"
                        );
                        var10 = (1675826697 - 1675826697 | 663532277) & 1741665271;
                        break;
                     case -421520730:
                     default:
                        var10000 = (-900002478 | -2078650812 | 0) & 276869152;
                        var18 = (StringBuilder)0<"JNT",531824449,"ἵ礵茵礵輵⌵","⮁\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ\udb81\u0b84","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987327253>(
                           "ﺂﺬﺪ︼ﹲ"
                        );
                        var10 = (759740143 & 1024777154 | 1420550364) & -693114403;
                        break;
                     case -53188952:
                        var10000 = -1562151473 & -309567045 ^ -1602199157;
                        var18 = (StringBuilder)0<"JNT",531824449,"ἵ礵茵礵輵⌵","⮁\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ\udb81\u0b84","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987325605>(
                           "લઞૢாମ"
                        );
                        var10 = -1634888092 + 2035049342 ^ -681207274;
                        break;
                     case 1631260906:
                        var10000 = (1052311562 ^ 916819651 * 1052311562 * 916819651 | 0) & -2029985785;
                        var18 = (StringBuilder)0<"JNT",531824449,"ἵ礵茵礵輵⌵","⮁\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ\udb81\u0b84","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987327279>(
                           "ְܐܰฐੰ"
                        );
                        var10 = (2110182521 | 951857181 ^ -50464144 | -2088959534) & -612424206;
                  }
               }

               while (true) {
                  switch (((var10 ^ 214024205) + 61300453 - 1609257701 + 639920466 ^ 1529757363) - 859819629) {
                     case -1708107381:
                        var14 = var18;
                        if (var10000 >= ((-568284055 ^ -568284055 | 5) & -1275569937)) {
                           var10 = -1961128339 - -1988785459 ^ 1425568031;
                           break label230;
                        }

                        int var78 = 0<"JNT",353852153,"洵眵椵謵⤵輵","⮁\udb83\udb81箃","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987325606>(var18, var10000) ^ 'G' ^ 113;
                        int var126 = (var78 & 65520) >> 4;
                        int var79 = ((var78 & 65520) >> 4 | var78 << 12) ^ 161;
                        int var127 = ((((var78 & 65520) >> 4 | var78 << 12) ^ 161) & 49152) >> 14;
                        char var80 = (char)((((var126 | var78 << 12) ^ 161) & 49152) >> 14 | (((var78 & 65520) >> 4 | var78 << 12) ^ 161) << 2);
                        0<"JNT",353852153,"贵焵輵ⴵ眵椵謵⤵輵","⮁\udb83箃\udb81\u0b84","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987327055>(
                           var18, var10000, (char)(var127 | var79 << 2)
                        );
                        var10000 += -1955142130 + -128177299 ^ -2083319430;
                        var10 = -1634888092 + 2035049342 ^ -681207274;
                        break;
                     case -1243139951:
                        var14 = var18;
                        if (var10000 >= (-864046714 - 24075124 ^ -888121839)) {
                           var10 = (-1435134779 | -1435134779 | 1411402624) & 1965710248;
                           break label230;
                        }

                        int var73 = (0<"JNT",353852153,"洵眵椵謵⤵輵","⮁\udb83\udb81箃","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987327050>(var18, var10000) - 162 ^ 243)
                           + 200;
                        int var124 = (var73 & 65535) >> 0;
                        int var74 = (var73 & 65535) >> 0 | var73 << 16;
                        int var125 = (((var73 & 65535) >> 0 | var73 << 16) & 65024) >> 9;
                        char var75 = (char)(((var124 | var73 << 16) & 65024) >> 9 | ((var73 & 65535) >> 0 | var73 << 16) << 7);
                        0<"JNT",353852153,"贵焵輵ⴵ眵椵謵⤵輵","⮁\udb83箃\udb81\u0b84","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987327251>(
                           var18, var10000, (char)(var125 | var74 << 7)
                        );
                        var10000 += 1891182840 & 2024926538 ^ 1890658377;
                        var10 = -454327486 * -1314987258 ^ 860689274;
                        break;
                     case -948881547:
                        var14 = var18;
                        if (var10000 >= (1820480890 >>> 1820480890 ^ 30)) {
                           var10 = (718147239 >> -159562412 | -1602085544) & -1528127622;
                           break label230;
                        }

                        int var69 = 0<"JNT",353852153,"洵眵椵謵⤵輵","⮁\udb83\udb81箃","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987327345>(var18, var10000)
                              - 229
                              - 176
                              + 123
                           ^ 54;
                        char var70 = (char)((var69 & 65504) >> 5 | var69 << 11);
                        0<"JNT",353852153,"贵焵輵ⴵ眵椵謵⤵輵","⮁\udb83箃\udb81\u0b84","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987327346>(
                           var18, var10000, (char)((var69 & 65504) >> 5 | var69 << 11)
                        );
                        var10000 += (773692011 ^ 773692011 | 1) & 603712095;
                        var10 = (2110182521 | 951857181 ^ -50464144 | -2088959534) & -612424206;
                        break;
                     case 745279111:
                        var14 = var18;
                        if (var10000 >= (-250699722 * -1809745102 ^ -87343985)) {
                           var10 = (1172512283 >> 1172512283 | 1661421917) & 1936195039;
                           break label230;
                        }

                        char var64 = 0<"JNT",353852153,"洵眵椵謵⤵輵","⮁\udb83\udb81箃","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987327256>(var18, var10000);
                        int var121 = (var64 & '쀀') >> 14;
                        int var65 = ((var64 & '쀀') >> 14 | var64 << 2) + 212;
                        int var122 = (((var64 & '쀀') >> 14 | var64 << 2) + 212 & 65535) >> 0;
                        var64 = (char)((((var121 | var64 << 2) + 212 & 65535) >> 0 | ((var64 & '쀀') >> 14 | var64 << 2) + 212 << 16) - 19 + 223);
                        0<"JNT",353852153,"贵焵輵ⴵ眵椵謵⤵輵","⮁\udb83箃\udb81\u0b84","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987327257>(
                           var18, var10000, (char)((var122 | var65 << 16) - 19 + 223)
                        );
                        var10000 += ~(-382036354 | -389448160 >> 90937626);
                        var10 = 912567544;
                        break;
                     case 1176820259:
                        var14 = var18;
                        if (var10000 >= ((1014745699 + -409274108 | 5) & -2100809707)) {
                           var10 = (959592386 >>> -742491123 | -1262876672) & -21029064;
                           break label230;
                        }

                        char var59 = 0<"JNT",353852153,"洵眵椵謵⤵輵","⮁\udb83\udb81箃","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987327048>(var18, var10000);
                        int var119 = (var59 & 0) >> 16;
                        int var60 = (((var59 & 0) >> 16 | var59 << 0) ^ 220) + 155;
                        int var120 = ((((var59 & 0) >> 16 | var59 << 0) ^ 220) + 155 & 65534) >> 1;
                        var59 = (char)(((((var119 | var59 << 0) ^ 220) + 155 & 65534) >> 1 | (((var59 & 0) >> 16 | var59 << 0) ^ 220) + 155 << 15) + 169);
                        0<"JNT",353852153,"贵焵輵ⴵ眵椵謵⤵輵","⮁\udb83箃\udb81\u0b84","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987327049>(
                           var18, var10000, (char)((var120 | var60 << 15) + 169)
                        );
                        var10000 += (-1698284281 | -1698284281 | 0) & 20480209;
                        var10 = (759740143 & 1024777154 | 1420550364) & -693114403;
                        break;
                     case 1246380647:
                        var14 = var18;
                        if (var10000 >= ((1784724568 >>> 596073847 | 3) & 553479939)) {
                           var10 = (-1303992451 >>> 464065078 - 464065078 | 1262180352) & 1799313462;
                           break label230;
                        }

                        char var55 = 0<"JNT",353852153,"洵眵椵謵⤵輵","⮁\udb83\udb81箃","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987327425>(var18, var10000);
                        char var56 = (char)((((var55 & '\uffff') >> 0 | var55 << 16) - 225 + 37 ^ 143) - 55);
                        0<"JNT",353852153,"贵焵輵ⴵ眵椵謵⤵輵","⮁\udb83箃\udb81\u0b84","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987327426>(
                           var18, var10000, (char)((((var55 & '\uffff') >> 0 | var55 << 16) - 225 + 37 ^ 143) - 55)
                        );
                        var10000 += (-1391847196 << -1123821673 | 1) & 158653063;
                        var10 = (62696136 & -1050575328 | 1342329112) & -623478340;
                        break;
                     case 1992895678:
                        var14 = var18;
                        if (var10000 >= (-457342185 * 1473675757 ^ -1464143032)) {
                           var10 = 1014477022 ^ -532583353 ^ 1619732720;
                           break label230;
                        }

                        char var47 = 0<"JNT",353852153,"洵眵椵謵⤵輵","⮁\udb83\udb81箃","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987325607>(var18, var10000);
                        char var52 = (char)(
                           (
                                    (
                                          (
                                                   (
                                                         (
                                                                  ((((var47 & '쀀') >> 14 | var47 << 2) & 65528) >> 3 | ((var47 & '쀀') >> 14 | var47 << 2) << 13)
                                                                     & 63488
                                                               )
                                                               >> 11
                                                            | ((((var47 & '쀀') >> 14 | var47 << 2) & 65528) >> 3 | ((var47 & '쀀') >> 14 | var47 << 2) << 13)
                                                               << 5
                                                      )
                                                      & 65024
                                                )
                                                >> 9
                                             | (
                                                   (((((var47 & '쀀') >> 14 | var47 << 2) & 65528) >> 3 | ((var47 & '쀀') >> 14 | var47 << 2) << 13) & 63488)
                                                         >> 11
                                                      | ((((var47 & '쀀') >> 14 | var47 << 2) & 65528) >> 3 | ((var47 & '쀀') >> 14 | var47 << 2) << 13) << 5
                                                )
                                                << 7
                                       )
                                       & 57344
                                 )
                                 >> 13
                              | (
                                    (
                                             (
                                                   (((((var47 & '쀀') >> 14 | var47 << 2) & 65528) >> 3 | ((var47 & '쀀') >> 14 | var47 << 2) << 13) & 63488)
                                                         >> 11
                                                      | ((((var47 & '쀀') >> 14 | var47 << 2) & 65528) >> 3 | ((var47 & '쀀') >> 14 | var47 << 2) << 13) << 5
                                                )
                                                & 65024
                                          )
                                          >> 9
                                       | (
                                             (((((var47 & '쀀') >> 14 | var47 << 2) & 65528) >> 3 | ((var47 & '쀀') >> 14 | var47 << 2) << 13) & 63488) >> 11
                                                | ((((var47 & '쀀') >> 14 | var47 << 2) & 65528) >> 3 | ((var47 & '쀀') >> 14 | var47 << 2) << 13) << 5
                                          )
                                          << 7
                                 )
                                 << 3
                        );
                        0<"JNT",353852153,"贵焵輵ⴵ眵椵謵⤵輵","⮁\udb83箃\udb81\u0b84","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987327344>(
                           var18,
                           var10000,
                           (char)(
                              (
                                       (
                                             (
                                                      (
                                                            (
                                                                     (
                                                                           (((var47 & '쀀') >> 14 | var47 << 2) & 65528) >> 3
                                                                              | ((var47 & '쀀') >> 14 | var47 << 2) << 13
                                                                        )
                                                                        & 63488
                                                                  )
                                                                  >> 11
                                                               | ((((var47 & '쀀') >> 14 | var47 << 2) & 65528) >> 3 | ((var47 & '쀀') >> 14 | var47 << 2) << 13)
                                                                  << 5
                                                         )
                                                         & 65024
                                                   )
                                                   >> 9
                                                | (
                                                      (((((var47 & '쀀') >> 14 | var47 << 2) & 65528) >> 3 | ((var47 & '쀀') >> 14 | var47 << 2) << 13) & 63488)
                                                            >> 11
                                                         | ((((var47 & '쀀') >> 14 | var47 << 2) & 65528) >> 3 | ((var47 & '쀀') >> 14 | var47 << 2) << 13) << 5
                                                   )
                                                   << 7
                                          )
                                          & 57344
                                    )
                                    >> 13
                                 | (
                                       (
                                                (
                                                      (((((var47 & '쀀') >> 14 | var47 << 2) & 65528) >> 3 | ((var47 & '쀀') >> 14 | var47 << 2) << 13) & 63488)
                                                            >> 11
                                                         | ((((var47 & '쀀') >> 14 | var47 << 2) & 65528) >> 3 | ((var47 & '쀀') >> 14 | var47 << 2) << 13) << 5
                                                   )
                                                   & 65024
                                             )
                                             >> 9
                                          | (
                                                (((((var47 & '쀀') >> 14 | var47 << 2) & 65528) >> 3 | ((var47 & '쀀') >> 14 | var47 << 2) << 13) & 63488) >> 11
                                                   | ((((var47 & '쀀') >> 14 | var47 << 2) & 65528) >> 3 | ((var47 & '쀀') >> 14 | var47 << 2) << 13) << 5
                                             )
                                             << 7
                                    )
                                    << 3
                           )
                        );
                        var10000 += -1944016975 << -1944016975 ^ 1331822593;
                        var10 = -499979581 ^ -28275695 ^ 937817753;
                        break;
                     case 2059667596:
                     default:
                        var14 = var18;
                        if (var10000 >= ((-2007906963 >> -2007906963 + 421310334 | 5) & 193925)) {
                           var10 = -697869009;
                           break label230;
                        }

                        int var40 = 0<"JNT",353852153,"洵眵椵謵⤵輵","⮁\udb83\udb81箃","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987327416>(var18, var10000);
                        int var109 = (var40 & 65534) >> 1;
                        int var41 = (var40 & 65534) >> 1 | var40 << 15;
                        int var110 = (((var40 & 65534) >> 1 | var40 << 15) & 65024) >> 9;
                        var40 = ((var109 | var40 << 15) & 65024) >> 9 | ((var40 & 65534) >> 1 | var40 << 15) << 7;
                        var109 = ((var110 | var41 << 7) & 65532) >> 2;
                        int var43 = (((var110 | var41 << 7) & 65532) >> 2 | var40 << 14) ^ 250;
                        int var112 = (((((var110 | var41 << 7) & 65532) >> 2 | var40 << 14) ^ 250) & 63488) >> 11;
                        char var44 = (char)((((var109 | var40 << 14) ^ 250) & 63488) >> 11 | ((((var110 | var41 << 7) & 65532) >> 2 | var40 << 14) ^ 250) << 5);
                        0<"JNT",353852153,"贵焵輵ⴵ眵椵謵⤵輵","⮁\udb83箃\udb81\u0b84","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987327417>(
                           var18, var10000, (char)(var112 | var43 << 5)
                        );
                        var10000 += (929155248 ^ 1145420413 | 0) & -1932394189;
                        var10 = (1675826697 - 1675826697 | 663532277) & 1741665271;
                  }
               }
            }

            while (true) {
               switch ((var10 - 894078572 + 888133999 + 1175855216 ^ 1283729606) - 1552570255 ^ 728350803) {
                  case -1014392486:
                  default:
                     var14 = var18;
                     if (var13 >= (217983519 * (1386094413 & 1991965031) ^ -1757126311)) {
                        var10 = (1168350094 >> -2060887808 | 251731161) & 265551097;
                        break label214;
                     }

                     int var34 = 0<"JNT",353852153,"洵眵椵謵⤵輵","⮁\udb83\udb81箃","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987327274>(var18, var13) ^ 185;
                     char var37 = (char)(
                        (((((var34 & 65504) >> 5 | var34 << 11) + 177 & 0) >> 16 | ((var34 & 65504) >> 5 | var34 << 11) + 177 << 0) & 32768) >> 15
                           | ((((var34 & 65504) >> 5 | var34 << 11) + 177 & 0) >> 16 | ((var34 & 65504) >> 5 | var34 << 11) + 177 << 0) << 1
                     );
                     0<"JNT",353852153,"贵焵輵ⴵ眵椵謵⤵輵","⮁\udb83箃\udb81\u0b84","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987327347>(
                        var18,
                        var13,
                        (char)(
                           (((((var34 & 65504) >> 5 | var34 << 11) + 177 & 0) >> 16 | ((var34 & 65504) >> 5 | var34 << 11) + 177 << 0) & 32768) >> 15
                              | ((((var34 & 65504) >> 5 | var34 << 11) + 177 & 0) >> 16 | ((var34 & 65504) >> 5 | var34 << 11) + 177 << 0) << 1
                        )
                     );
                     var13 += (-293475858 * (-293475858 >>> -293475858) | 1) & 1352695829;
                     var10 = 323469180 & 353113117 - 353113117 ^ -1003279125;
                     continue;
                  case -603647552:
               }

               var14 = var18;
               if (var13 >= (-1770819373 << -27696730 ^ -1663290172)) {
                  var10 = (71800677 + 71800677 | -1918849020) & -1347289578;
                  break label214;
               }

               int var29 = 0<"JNT",353852153,"洵眵椵謵⤵輵","⮁\udb83\udb81箃","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987327355>(var18, var13) + 2 - 86;
               int var10004 = (var29 & 65535) >> 0;
               int var30 = ((var29 & 65535) >> 0 | var29 << 16) - 212;
               int var105 = (((var29 & 65535) >> 0 | var29 << 16) - 212 & 65520) >> 4;
               char var31 = (char)(((var10004 | var29 << 16) - 212 & 65520) >> 4 | ((var29 & 65535) >> 0 | var29 << 16) - 212 << 12);
               0<"JNT",353852153,"贵焵輵ⴵ眵椵謵⤵輵","⮁\udb83箃\udb81\u0b84","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987325604>(var18, var13, (char)(var105 | var30 << 12));
               var13 += (-1873029419 - (-2131943754 | -1873029419 << -2131943754) | 0) & 1049697;
               var10 = (1179382834 >>> (1179382834 & 1179382834) | -642283935) & -2435;
            }
         }

         label111: {
            label110: {
               label109: {
                  label108: {
                     switch (var10 + 502501348 + 1668203705 + 490112873 - 513665451 + 1942500585 - 1955288987) {
                        case -728350104:
                           var17 = 0<"JNT",-1848112657,"猵蔵謵脵椵輵","⮁\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂﮄ\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁뮃䮅쮅ᮅ箅殆ﮂ\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ",987327264>(
                              0<"JNT",353852153,"輵蔵䴵輵謵礵茵电","⮁\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987327278>(var14),
                              new Object[]{
                                 0<"JNT",-1848112657,"錵椵缵鄵焵䔵猵","⮁殃\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁殃뮅ᮆ䮅\ueb85ᮅﮂ","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0e00Ⴐᄐ\u0fe0ႀတ",987327255>(var3)
                              }
                           );
                           break label108;
                        case -499181306:
                           var17 = 0<"JNT",-1848112657,"猵蔵謵脵椵輵","⮁\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂﮄ\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁뮃䮅쮅ᮅ箅殆ﮂ\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ",987327358>(
                              0<"JNT",353852153,"輵蔵䴵輵謵礵茵电","⮁\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987327356>(var14),
                              new Object[]{
                                 0<"JNT",-1848112657,"錵椵缵鄵焵䔵猵","⮁쮃\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁\ueb83뮅讅㮅ﮂ","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0e80ႰႠူ",987327357>((long)var3)
                              }
                           );
                           break label110;
                        case -361289763:
                           var17 = 0<"JNT",-1848112657,"猵蔵謵脵椵輵","⮁\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂﮄ\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁뮃䮅쮅ᮅ箅殆ﮂ\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ",987327052>(
                              0<"JNT",353852153,"輵蔵䴵輵謵礵茵电","⮁\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987327418>(var14),
                              new Object[]{
                                 0<"JNT",-1848112657,"錵椵缵鄵焵䔵猵","⮁쮃\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁\ueb83뮅讅㮅ﮂ","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0e80ႰႠူ",987327427>((long)var3)
                              }
                           );
                           break label109;
                        case -212325591:
                        default:
                           var17 = 0<"JNT",-1848112657,"猵蔵謵脵椵輵","⮁\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂﮄ\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁뮃䮅쮅ᮅ箅殆ﮂ\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ",987327415>(
                              0<"JNT",353852153,"輵蔵䴵輵謵礵茵电","⮁\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987327053>(var14),
                              new Object[]{
                                 0<"JNT",-1848112657,"錵椵缵鄵焵䔵猵","⮁쮃\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁\ueb83뮅讅㮅ﮂ","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0e80ႰႠူ",987327054>((long)var3)
                              }
                           );
                           break label108;
                        case 532279073:
                           var17 = 0<"JNT",-1848112657,"猵蔵謵脵椵輵","⮁\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂﮄ\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁뮃䮅쮅ᮅ箅殆ﮂ\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ",987327252>(
                              0<"JNT",353852153,"輵蔵䴵輵謵礵茵电","⮁\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987327266>(var14),
                              new Object[]{
                                 0<"JNT",-1848112657,"錵椵缵鄵焵䔵猵","⮁殃\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁殃뮅ᮆ䮅\ueb85ᮅﮂ","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0e00Ⴐᄐ\u0fe0ႀတ",987327275>(var3)
                              }
                           );
                           break;
                        case 871553209:
                           var17 = 0<"JNT",-1848112657,"猵蔵謵脵椵輵","⮁\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂﮄ\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁뮃䮅쮅ᮅ箅殆ﮂ\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ",987327277>(
                              0<"JNT",353852153,"輵蔵䴵輵謵礵茵电","⮁\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987327267>(var14),
                              new Object[]{
                                 0<"JNT",-1848112657,"錵椵缵鄵焵䔵猵","⮁殃\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁殃뮅ᮆ䮅\ueb85ᮅﮂ","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0e00Ⴐᄐ\u0fe0ႀတ",987327276>(var3)
                              }
                           );
                           break label109;
                        case 1005962258:
                           var17 = 0<"JNT",-1848112657,"猵蔵謵脵椵輵","⮁\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂﮄ\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁뮃䮅쮅ᮅ箅殆ﮂ\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ",987325574>(
                              0<"JNT",353852153,"輵蔵䴵輵謵礵茵电","⮁\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987325572>(var14),
                              new Object[]{
                                 0<"JNT",-1848112657,"錵椵缵鄵焵䔵猵","⮁쮃\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁\ueb83뮅讅㮅ﮂ","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0e80ႰႠူ",987325573>((long)var3)
                              }
                           );
                           break;
                        case 1436495064:
                           var17 = 0<"JNT",-1848112657,"猵蔵謵脵椵輵","⮁\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂﮄ\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁뮃䮅쮅ᮅ箅殆ﮂ\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ",987327272>(
                              0<"JNT",353852153,"輵蔵䴵輵謵礵茵电","⮁\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987327254>(var14),
                              new Object[]{
                                 0<"JNT",-1848112657,"錵椵缵鄵焵䔵猵","⮁殃\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁殃뮅ᮆ䮅\ueb85ᮅﮂ","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0e00Ⴐᄐ\u0fe0ႀတ",987327359>(var3)
                              }
                           );
                           break label110;
                     }

                     var10 = 1288961 & 1395125680 ^ -1643249666;
                     break label111;
                  }

                  var10 = 1699716240 >> -768300749 ^ 1386932489;
                  break label111;
               }

               var10 = -1795726712 ^ -1795726712 ^ -569684941;
               break label111;
            }

            var10 = 2131427924 - (1178060528 - 1178060528) ^ 1785917974;
         }

         switch (var10 + 698916993 + 1340471005 + 1731984592 - 352301521 - 923738439 + 1437428188) {
            case -2005433872:
               return var17;
            case -931891419:
            default:
               return var17;
            case -1893580:
               return var17;
            case 1024725138:
               return var17;
         }
      }
      return switch ((var10 + 258267279 + 779341023 ^ 221380881 ^ 287890409) + 48877856 + 604359770) {
         case -28289274 -> 0<"JNT",-1848112657,"猵蔵謵脵椵輵","⮁\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂﮄ\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁뮃䮅쮅ᮅ箅殆ﮂ\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ",987327414>(
         0<"JNT",353852153,"輵蔵䴵輵謵礵茵电","⮁\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987327412>(var14),
         new Object[]{0<"JNT",-1848112657,"錵椵缵鄵焵䔵猵","⮁殃\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁殃뮅ᮆ䮅\ueb85ᮅﮂ","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0e00Ⴐᄐ\u0fe0ႀတ",987327413>(var1)}
      );
         default -> 0<"JNT",-1848112657,"猵蔵謵脵椵輵","⮁\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂﮄ\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁뮃䮅쮅ᮅ箅殆ﮂ\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ",987325659>(
         0<"JNT",353852153,"輵蔵䴵輵謵礵茵电","⮁\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁箄殆䮆\udb85讅㮅ﮂ","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0ef0ᄀრၐႠူ\u0de0ᄐၐႀကတრ",987325649>(var14),
         new Object[]{0<"JNT",-1848112657,"錵椵缵鄵焵䔵猵","⮁쮃\udb81\ueb83쮅宅ஆ宅뮁\ueb85宅讅㮅뮁\ueb83뮅讅㮅ﮂ","ၠ࿐ᄠ࿐ಠႀ࿐Ⴀူಠ\u0e80ႰႠူ",987325650>((long)var1)}
      );
      };
   }

   static {
      Loader.init(Class_30.class);
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1413(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = ((((var10 ^ 2117979316) + 786282183 - 1305706615 ^ 871316901) - 1146706472 ^ 1009983928) + 487123612 ^ 731816266) + 775844723;
      MethodHandle var10000 = field_2275[((((var10 ^ 2117979316) + 786282183 - 1305706615 ^ 871316901) - 1146706472 ^ 1009983928) + 487123612 ^ 731816266)
            + 775844723
         ^ 1333306979];
      if (field_2275[var10001 ^ 1333306979] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = (506586518 | -1033923908 | -944155004) ^ -536873026; var23 < var13.length(); var23 += (-1069392633 >>> 1265215213 | 1) & -17233755) {
            char var42 = var13.charAt(var23);
            char var47 = (char)(
               (
                     (
                              (
                                       (
                                                (
                                                         (
                                                                  ((((var42 & '︀') >> 9 | var42 << 7) & 65024) >> 9 | ((var42 & '︀') >> 9 | var42 << 7) << 7)
                                                                        - 22
                                                                     & 65528
                                                               )
                                                               >> 3
                                                            | ((((var42 & '︀') >> 9 | var42 << 7) & 65024) >> 9 | ((var42 & '︀') >> 9 | var42 << 7) << 7) - 22
                                                               << 13
                                                      )
                                                      - 19
                                                   & 32768
                                             )
                                             >> 15
                                          | (
                                                   (((((var42 & '︀') >> 9 | var42 << 7) & 65024) >> 9 | ((var42 & '︀') >> 9 | var42 << 7) << 7) - 22 & 65528)
                                                         >> 3
                                                      | ((((var42 & '︀') >> 9 | var42 << 7) & 65024) >> 9 | ((var42 & '︀') >> 9 | var42 << 7) << 7) - 22 << 13
                                                )
                                                - 19
                                             << 1
                                    )
                                    + 120
                                 & 65504
                           )
                           >> 5
                        | (
                                 (
                                          (
                                                   (((((var42 & '︀') >> 9 | var42 << 7) & 65024) >> 9 | ((var42 & '︀') >> 9 | var42 << 7) << 7) - 22 & 65528)
                                                         >> 3
                                                      | ((((var42 & '︀') >> 9 | var42 << 7) & 65024) >> 9 | ((var42 & '︀') >> 9 | var42 << 7) << 7) - 22 << 13
                                                )
                                                - 19
                                             & 32768
                                       )
                                       >> 15
                                    | (
                                             (((((var42 & '︀') >> 9 | var42 << 7) & 65024) >> 9 | ((var42 & '︀') >> 9 | var42 << 7) << 7) - 22 & 65528) >> 3
                                                | ((((var42 & '︀') >> 9 | var42 << 7) & 65024) >> 9 | ((var42 & '︀') >> 9 | var42 << 7) << 7) - 22 << 13
                                          )
                                          - 19
                                       << 1
                              )
                              + 120
                           << 11
                  )
                  + 213
                  + 214
            );
            var13.setCharAt(
               var23,
               (char)(
                  (
                        (
                                 (
                                          (
                                                   (
                                                            (
                                                                     ((((var42 & '︀') >> 9 | var42 << 7) & 65024) >> 9 | ((var42 & '︀') >> 9 | var42 << 7) << 7)
                                                                           - 22
                                                                        & 65528
                                                                  )
                                                                  >> 3
                                                               | ((((var42 & '︀') >> 9 | var42 << 7) & 65024) >> 9 | ((var42 & '︀') >> 9 | var42 << 7) << 7)
                                                                     - 22
                                                                  << 13
                                                         )
                                                         - 19
                                                      & 32768
                                                )
                                                >> 15
                                             | (
                                                      (((((var42 & '︀') >> 9 | var42 << 7) & 65024) >> 9 | ((var42 & '︀') >> 9 | var42 << 7) << 7) - 22 & 65528)
                                                            >> 3
                                                         | ((((var42 & '︀') >> 9 | var42 << 7) & 65024) >> 9 | ((var42 & '︀') >> 9 | var42 << 7) << 7) - 22
                                                            << 13
                                                   )
                                                   - 19
                                                << 1
                                       )
                                       + 120
                                    & 65504
                              )
                              >> 5
                           | (
                                    (
                                             (
                                                      (((((var42 & '︀') >> 9 | var42 << 7) & 65024) >> 9 | ((var42 & '︀') >> 9 | var42 << 7) << 7) - 22 & 65528)
                                                            >> 3
                                                         | ((((var42 & '︀') >> 9 | var42 << 7) & 65024) >> 9 | ((var42 & '︀') >> 9 | var42 << 7) << 7) - 22
                                                            << 13
                                                   )
                                                   - 19
                                                & 32768
                                          )
                                          >> 15
                                       | (
                                                (((((var42 & '︀') >> 9 | var42 << 7) & 65024) >> 9 | ((var42 & '︀') >> 9 | var42 << 7) << 7) - 22 & 65528) >> 3
                                                   | ((((var42 & '︀') >> 9 | var42 << 7) & 65024) >> 9 | ((var42 & '︀') >> 9 | var42 << 7) << 7) - 22 << 13
                                             )
                                             - 19
                                          << 1
                                 )
                                 + 120
                              << 11
                     )
                     + 213
                     + 214
               )
            );
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = (-147639403 + -667095365 | 0) & 277777543;
            var29 < var16.length();
            var29 += (-61624257 >>> (978774066 ^ -61624257 >> 978774066) | 1) & -2012597969
         ) {
            int var52 = var16.charAt(var29) + 180;
            char var57 = (char)(
               (
                        (
                              (
                                       (
                                             (
                                                   (
                                                            (
                                                                  ((((var52 & 64512) >> 10 | var52 << 6) ^ 22) - 188 & 57344) >> 13
                                                                     | (((var52 & 64512) >> 10 | var52 << 6) ^ 22) - 188 << 3
                                                               )
                                                               & 61440
                                                         )
                                                         >> 12
                                                      | (
                                                            ((((var52 & 64512) >> 10 | var52 << 6) ^ 22) - 188 & 57344) >> 13
                                                               | (((var52 & 64512) >> 10 | var52 << 6) ^ 22) - 188 << 3
                                                         )
                                                         << 4
                                                )
                                                ^ 253
                                                ^ 123
                                          )
                                          & 65528
                                    )
                                    >> 3
                                 | (
                                       (
                                             (
                                                      (
                                                            ((((var52 & 64512) >> 10 | var52 << 6) ^ 22) - 188 & 57344) >> 13
                                                               | (((var52 & 64512) >> 10 | var52 << 6) ^ 22) - 188 << 3
                                                         )
                                                         & 61440
                                                   )
                                                   >> 12
                                                | (
                                                      ((((var52 & 64512) >> 10 | var52 << 6) ^ 22) - 188 & 57344) >> 13
                                                         | (((var52 & 64512) >> 10 | var52 << 6) ^ 22) - 188 << 3
                                                   )
                                                   << 4
                                          )
                                          ^ 253
                                          ^ 123
                                    )
                                    << 13
                           )
                           & 65472
                     )
                     >> 6
                  | (
                        (
                                 (
                                       (
                                             (
                                                      (
                                                            ((((var52 & 64512) >> 10 | var52 << 6) ^ 22) - 188 & 57344) >> 13
                                                               | (((var52 & 64512) >> 10 | var52 << 6) ^ 22) - 188 << 3
                                                         )
                                                         & 61440
                                                   )
                                                   >> 12
                                                | (
                                                      ((((var52 & 64512) >> 10 | var52 << 6) ^ 22) - 188 & 57344) >> 13
                                                         | (((var52 & 64512) >> 10 | var52 << 6) ^ 22) - 188 << 3
                                                   )
                                                   << 4
                                          )
                                          ^ 253
                                          ^ 123
                                    )
                                    & 65528
                              )
                              >> 3
                           | (
                                 (
                                       (
                                                (
                                                      ((((var52 & 64512) >> 10 | var52 << 6) ^ 22) - 188 & 57344) >> 13
                                                         | (((var52 & 64512) >> 10 | var52 << 6) ^ 22) - 188 << 3
                                                   )
                                                   & 61440
                                             )
                                             >> 12
                                          | (
                                                ((((var52 & 64512) >> 10 | var52 << 6) ^ 22) - 188 & 57344) >> 13
                                                   | (((var52 & 64512) >> 10 | var52 << 6) ^ 22) - 188 << 3
                                             )
                                             << 4
                                    )
                                    ^ 253
                                    ^ 123
                              )
                              << 13
                     )
                     << 10
            );
            var16.setCharAt(
               var29,
               (char)(
                  (
                           (
                                 (
                                          (
                                                (
                                                      (
                                                               (
                                                                     ((((var52 & 64512) >> 10 | var52 << 6) ^ 22) - 188 & 57344) >> 13
                                                                        | (((var52 & 64512) >> 10 | var52 << 6) ^ 22) - 188 << 3
                                                                  )
                                                                  & 61440
                                                            )
                                                            >> 12
                                                         | (
                                                               ((((var52 & 64512) >> 10 | var52 << 6) ^ 22) - 188 & 57344) >> 13
                                                                  | (((var52 & 64512) >> 10 | var52 << 6) ^ 22) - 188 << 3
                                                            )
                                                            << 4
                                                   )
                                                   ^ 253
                                                   ^ 123
                                             )
                                             & 65528
                                       )
                                       >> 3
                                    | (
                                          (
                                                (
                                                         (
                                                               ((((var52 & 64512) >> 10 | var52 << 6) ^ 22) - 188 & 57344) >> 13
                                                                  | (((var52 & 64512) >> 10 | var52 << 6) ^ 22) - 188 << 3
                                                            )
                                                            & 61440
                                                      )
                                                      >> 12
                                                   | (
                                                         ((((var52 & 64512) >> 10 | var52 << 6) ^ 22) - 188 & 57344) >> 13
                                                            | (((var52 & 64512) >> 10 | var52 << 6) ^ 22) - 188 << 3
                                                      )
                                                      << 4
                                             )
                                             ^ 253
                                             ^ 123
                                       )
                                       << 13
                              )
                              & 65472
                        )
                        >> 6
                     | (
                           (
                                    (
                                          (
                                                (
                                                         (
                                                               ((((var52 & 64512) >> 10 | var52 << 6) ^ 22) - 188 & 57344) >> 13
                                                                  | (((var52 & 64512) >> 10 | var52 << 6) ^ 22) - 188 << 3
                                                            )
                                                            & 61440
                                                      )
                                                      >> 12
                                                   | (
                                                         ((((var52 & 64512) >> 10 | var52 << 6) ^ 22) - 188 & 57344) >> 13
                                                            | (((var52 & 64512) >> 10 | var52 << 6) ^ 22) - 188 << 3
                                                      )
                                                      << 4
                                             )
                                             ^ 253
                                             ^ 123
                                       )
                                       & 65528
                                 )
                                 >> 3
                              | (
                                    (
                                          (
                                                   (
                                                         ((((var52 & 64512) >> 10 | var52 << 6) ^ 22) - 188 & 57344) >> 13
                                                            | (((var52 & 64512) >> 10 | var52 << 6) ^ 22) - 188 << 3
                                                      )
                                                      & 61440
                                                )
                                                >> 12
                                             | (
                                                   ((((var52 & 64512) >> 10 | var52 << 6) ^ 22) - 188 & 57344) >> 13
                                                      | (((var52 & 64512) >> 10 | var52 << 6) ^ 22) - 188 << 3
                                                )
                                                << 4
                                       )
                                       ^ 253
                                       ^ 123
                                 )
                                 << 13
                        )
                        << 10
               )
            );
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_30.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = (-1948151694 << (-1881419701 | -1309146065) | 0) & 885431272;
            var35 < var19.length();
            var35 += (-1991315773 - (-1173927544 << -1991315773 * -1173927544) | 0) & -32436195
         ) {
            int var62 = (var19.charAt(var35) ^ 211 ^ 126 ^ 136 ^ 177 ^ 154) - 40 + 138;
            char var63 = (char)(((var62 & 65520) >> 4 | var62 << 12) - 192 + 29);
            var19.setCharAt(var35, (char)(((var62 & 65520) >> 4 | var62 << 12) - 192 + 29));
         }

         Class var7 = Class.forName(var19.toString(), false, Class_30.class.getClassLoader());
         switch ((var4 - 2026717923 - 935343776 + 1751233628 - 1459045609 + 520113876 - 1260176736 ^ 455749836) + 718253263 ^ 1357342310 ^ 1148808248) {
            case 62034238:
               var10000 = var0.findSpecial(var7, var5, var6, Class_30.class);
               break;
            case 471624752:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            case 1314039692:
            case 1767087422:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 1857483110:
               var10000 = var0.findConstructor(var7, var6);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_2275[((((var10 ^ 2117979316) + 786282183 - 1305706615 ^ 871316901) - 1146706472 ^ 1009983928) + 487123612 ^ 731816266) + 775844723 ^ 1333306979] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1414(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = (((var10 ^ 1104893514 ^ 1466007566) - 1320129862 ^ 1344821642) - 1757672508 ^ 548181428) + 500041845 + 1186659435 ^ 1176187901;
      MethodHandle var10000 = field_2275[(
            (((var10 ^ 1104893514 ^ 1466007566) - 1320129862 ^ 1344821642) - 1757672508 ^ 548181428) + 500041845 + 1186659435 ^ 1176187901
         )
         - 1412919968];
      if (field_2275[var10001 - 1412919968] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = (-744221830 + 918071095 + -300310197 | 0) & 34185218;
            var24 < var14.length();
            var24 += (-292302006 & -1228468113 << 427312033 | 1) & 55441301
         ) {
            int var43 = var14.charAt(var24) + 27;
            char var48 = (char)(
               (
                     (
                              (
                                    (
                                             (
                                                      (((((var43 & 65408) >> 7 | var43 << 9) & 63488) >> 11 | ((var43 & 65408) >> 7 | var43 << 9) << 5) & 0)
                                                            >> 16
                                                         | ((((var43 & 65408) >> 7 | var43 << 9) & 63488) >> 11 | ((var43 & 65408) >> 7 | var43 << 9) << 5)
                                                            << 0
                                                   )
                                                   - 252
                                                   - 17
                                                   + 56
                                                & 65532
                                          )
                                          >> 2
                                       | (
                                                (((((var43 & 65408) >> 7 | var43 << 9) & 63488) >> 11 | ((var43 & 65408) >> 7 | var43 << 9) << 5) & 0) >> 16
                                                   | ((((var43 & 65408) >> 7 | var43 << 9) & 63488) >> 11 | ((var43 & 65408) >> 7 | var43 << 9) << 5) << 0
                                             )
                                             - 252
                                             - 17
                                             + 56
                                          << 14
                                 )
                                 & 65520
                           )
                           >> 4
                        | (
                              (
                                       (
                                                (((((var43 & 65408) >> 7 | var43 << 9) & 63488) >> 11 | ((var43 & 65408) >> 7 | var43 << 9) << 5) & 0) >> 16
                                                   | ((((var43 & 65408) >> 7 | var43 << 9) & 63488) >> 11 | ((var43 & 65408) >> 7 | var43 << 9) << 5) << 0
                                             )
                                             - 252
                                             - 17
                                             + 56
                                          & 65532
                                    )
                                    >> 2
                                 | (
                                          (((((var43 & 65408) >> 7 | var43 << 9) & 63488) >> 11 | ((var43 & 65408) >> 7 | var43 << 9) << 5) & 0) >> 16
                                             | ((((var43 & 65408) >> 7 | var43 << 9) & 63488) >> 11 | ((var43 & 65408) >> 7 | var43 << 9) << 5) << 0
                                       )
                                       - 252
                                       - 17
                                       + 56
                                    << 14
                           )
                           << 12
                  )
                  - 225
            );
            var14.setCharAt(
               var24,
               (char)(
                  (
                        (
                                 (
                                       (
                                                (
                                                         (((((var43 & 65408) >> 7 | var43 << 9) & 63488) >> 11 | ((var43 & 65408) >> 7 | var43 << 9) << 5) & 0)
                                                               >> 16
                                                            | ((((var43 & 65408) >> 7 | var43 << 9) & 63488) >> 11 | ((var43 & 65408) >> 7 | var43 << 9) << 5)
                                                               << 0
                                                      )
                                                      - 252
                                                      - 17
                                                      + 56
                                                   & 65532
                                             )
                                             >> 2
                                          | (
                                                   (((((var43 & 65408) >> 7 | var43 << 9) & 63488) >> 11 | ((var43 & 65408) >> 7 | var43 << 9) << 5) & 0) >> 16
                                                      | ((((var43 & 65408) >> 7 | var43 << 9) & 63488) >> 11 | ((var43 & 65408) >> 7 | var43 << 9) << 5) << 0
                                                )
                                                - 252
                                                - 17
                                                + 56
                                             << 14
                                    )
                                    & 65520
                              )
                              >> 4
                           | (
                                 (
                                          (
                                                   (((((var43 & 65408) >> 7 | var43 << 9) & 63488) >> 11 | ((var43 & 65408) >> 7 | var43 << 9) << 5) & 0) >> 16
                                                      | ((((var43 & 65408) >> 7 | var43 << 9) & 63488) >> 11 | ((var43 & 65408) >> 7 | var43 << 9) << 5) << 0
                                                )
                                                - 252
                                                - 17
                                                + 56
                                             & 65532
                                       )
                                       >> 2
                                    | (
                                             (((((var43 & 65408) >> 7 | var43 << 9) & 63488) >> 11 | ((var43 & 65408) >> 7 | var43 << 9) << 5) & 0) >> 16
                                                | ((((var43 & 65408) >> 7 | var43 << 9) & 63488) >> 11 | ((var43 & 65408) >> 7 | var43 << 9) << 5) << 0
                                          )
                                          - 252
                                          - 17
                                          + 56
                                       << 14
                              )
                              << 12
                     )
                     - 225
               )
            );
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = (-475339339 & -475339339 | 0) & 139528768; var30 < var17.length(); var30 += (-944761842 ^ -2064726980 | 1) & 681650885) {
            int var53 = var17.charAt(var30) - 136;
            int var86 = (var53 & 65532) >> 2;
            int var54 = ((var53 & 65532) >> 2 | var53 << 14) + 223 ^ 25;
            int var87 = ((((var53 & 65532) >> 2 | var53 << 14) + 223 ^ 25) & 65535) >> 0;
            char var55 = (char)(
               (((((var86 | var53 << 14) + 223 ^ 25) & 65535) >> 0 | (((var53 & 65532) >> 2 | var53 << 14) + 223 ^ 25) << 16) - 26 ^ 94) + 156 ^ 44 ^ 236
            );
            var17.setCharAt(var30, (char)(((var87 | var54 << 16) - 26 ^ 94) + 156 ^ 44 ^ 236));
         }

         Class var6 = Class.forName(var17.toString(), false, Class_30.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = ~(-728392095 >> 777122814); var36 < var20.length(); var36 += -1768074862 * 1310007735 ^ 519250271) {
            int var60 = var20.charAt(var36) - 7 - 31 + 35;
            char var63 = (char)(
               (
                     (
                              (
                                    (((((var60 & 65520) >> 4 | var60 << 12) & 64512) >> 10 | ((var60 & 65520) >> 4 | var60 << 12) << 6) & 65535) >> 0
                                       | ((((var60 & 65520) >> 4 | var60 << 12) & 64512) >> 10 | ((var60 & 65520) >> 4 | var60 << 12) << 6) << 16
                                 )
                                 ^ 55
                           )
                           + 203
                        ^ 132
                  )
                  - 80
            );
            var20.setCharAt(
               var36,
               (char)(
                  (
                        (
                                 (
                                       (((((var60 & 65520) >> 4 | var60 << 12) & 64512) >> 10 | ((var60 & 65520) >> 4 | var60 << 12) << 6) & 65535) >> 0
                                          | ((((var60 & 65520) >> 4 | var60 << 12) & 64512) >> 10 | ((var60 & 65520) >> 4 | var60 << 12) << 6) << 16
                                    )
                                    ^ 55
                              )
                              + 203
                           ^ 132
                     )
                     - 80
               )
            );
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_30.class.getClassLoader()).returnType();
         switch ((var4 - 562936258 + 1059584305 - 794104463 + 744928639 + 895019600 - 895992217 + 347389788 ^ 1441957119) - 1335955143 - 2087196654) {
            case 917115386:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            case 979144945:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            case 1274430768:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            case 1800534122:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_2275[((((var10 ^ 1104893514 ^ 1466007566) - 1320129862 ^ 1344821642) - 1757672508 ^ 548181428) + 500041845 + 1186659435 ^ 1176187901)
            - 1412919968] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }

   public static native void guard();
}
