import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;
import java.util.HashSet;
import net.minecraft.class_2248;
import net.minecraft.class_3965;

public class Class_335 extends Class_342 {
   // $VF: renamed from: me Class_105
   public Class_105 field_1752;
   // $VF: renamed from: hi Class_210
   public Class_210 field_1753;
   // $VF: renamed from: wpl Class_105
   public Class_105 field_1754;
   // $VF: renamed from: avo Class_105
   public Class_105 field_1755;
   // $VF: renamed from: hrc Class_185
   public Class_185 field_1756;
   // $VF: renamed from: wia java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_1757 = new MethodHandle[108];

   public Class_335() {
      int var1 = 1421100648;
      int var10001 = -87329128 ^ -87329128 ^ 0;

      StringBuilder var10002;
      for (var10002 = (StringBuilder)0<"JNT",1157255505,"Ḫ蘫긫蘫\ude2b⸪","剞癞ၞݞᱞݞ啞ᙞݞᑞ൞啞神Ṟᡞཞᑞ൞慞佞籞","❊ᕊ㽊ᕊ꽉⭊ᕊ⽊⅊꽉雷㭊㝊╊⽊⅊흉㵊╊⭊ᭊᵊ㝊",-1651088486>(
            "耞쀦\u0013\u001d䀥(\u0013\u001c䀤&䀣䀩"
         );
         var10001 < (1757587929 ^ 1401720068 ^ 1757587929 ^ 1401720072);
         var10001 += (1386983830 >> 584039990 | 1) & -406873547
      ) {
         int var32 = 0<"JNT",-617462193,"嘫縫䘫츫䘪\ude2b","剞潞佞楞","❊ᕊ㽊ᕊ꽉⭊ᕊ⽊⅊꽉雷㭊㝊╊⽊⅊흉㵊╊⭊ᭊᵊ㝊",-1651088502>(var10002, var10001) + 'F';
         int var10005 = (var32 & 65504) >> 5;
         int var33 = (var32 & 65504) >> 5 | var32 << 11;
         int var92 = (((var32 & 65504) >> 5 | var32 << 11) & 65024) >> 9;
         char var34 = (char)((((var10005 | var32 << 11) & 65024) >> 9 | ((var32 & 65504) >> 5 | var32 << 11) << 7) - 204 - 120);
         0<"JNT",-617462193,"혫昫\ude2b嘪縫䘫츫䘪\ude2b","剞潞楞佞籞","❊ᕊ㽊ᕊ꽉⭊ᕊ⽊⅊꽉雷㭊㝊╊⽊⅊흉㵊╊⭊ᭊᵊ㝊",-1651088501>(var10002, var10001, (char)((var92 | var33 << 7) - 204 - 120));
      }

      String var5 = 0<"JNT",-617462193,"\ude2b똫혪\ude2b츫蘫긫瘫","剞佞癞ၞݞᱞݞ啞ᙞݞᑞ൞啞神Ṟᡞཞᑞ൞慞","❊ᕊ㽊ᕊ꽉⭊ᕊ⽊⅊꽉雷㭊㝊╊⽊⅊흉㵊╊⭊ᭊᵊ㝊",-1651088417>(var10002);
      int var18 = (1430819686 << 1430819686 | 0) & -1592262567;

      StringBuilder var36;
      for (var36 = (StringBuilder)0<"JNT",1157255505,"Ḫ蘫긫蘫\ude2b⸪","剞癞ၞݞᱞݞ啞ᙞݞᑞ൞啞神Ṟᡞཞᑞ൞慞佞籞","❊ᕊ㽊ᕊ꽉⭊ᕊ⽊⅊꽉雷㭊㝊╊⽊⅊흉㵊╊⭊ᭊᵊ㝊",-1651088428>(
            "\uf757\uf823\uf8db\uf813\uf8ff\uf803\uf817\uf7e7\uf8f7\uf8db\uf817\uf7e7\uf84b\uf823\uf81b\uf7e7\uf8fb喇\uf813\uf813\uf7e7\uf84b\uf823\uf81b\uf82f\uf7e7\uf813\uf843\uf823\uf82f\uf8d7\uf723\uf8eb\uf847\uf8db\uf7e7龜喇\uf817\uf813"
         );
         var18 < ((946232666 & 1862940994 | 40) & 1143825965);
         var18 += (-1768052859 & 1319369557 | 0) & 1349517339
      ) {
         char var67 = 0<"JNT",-617462193,"嘫縫䘫츫䘪\ude2b","剞潞佞楞","❊ᕊ㽊ᕊ꽉⭊ᕊ⽊⅊꽉雷㭊㝊╊⽊⅊흉㵊╊⭊ᭊᵊ㝊",-1651088393>(var36, var18);
         int var10006 = (var67 & '\ufff0') >> 4;
         int var68 = ((var67 & '\ufff0') >> 4 | var67 << '\f') - 49 ^ 169;
         int var110 = ((((var67 & '\ufff0') >> 4 | var67 << '\f') - 49 ^ 169) & 49152) >> 14;
         var67 = (char)(((((var10006 | var67 << '\f') - 49 ^ 169) & 49152) >> 14 | (((var67 & '\ufff0') >> 4 | var67 << '\f') - 49 ^ 169) << 2) + 143);
         0<"JNT",-617462193,"혫昫\ude2b嘪縫䘫츫䘪\ude2b","剞潞楞佞籞","❊ᕊ㽊ᕊ꽉⭊ᕊ⽊⅊꽉雷㭊㝊╊⽊⅊흉㵊╊⭊ᭊᵊ㝊",-1651088500>(var36, var18, (char)((var110 | var68 << 2) + 143));
      }

      super(
         var5,
         0<"JNT",-617462193,"\ude2b똫혪\ude2b츫蘫긫瘫","剞佞癞ၞݞᱞݞ啞ᙞݞᑞ൞啞神Ṟᡞཞᑞ൞慞","❊ᕊ㽊ᕊ꽉⭊ᕊ⽊⅊꽉雷㭊㝊╊⽊⅊흉㵊╊⭊ᭊᵊ㝊",-1651088442>(var36),
         -1,
         1<"JNT",489131168,"磿磓","o\u0098","ƺǁĆőĀƷ",-509921081>()
      );
      var10001 = (2011908166 + (-944137935 << -1700445662) | 0) & 1091060421;

      for (var10002 = (StringBuilder)0<"JNT",1157255505,"Ḫ蘫긫蘫\ude2b⸪","剞癞ၞݞᱞݞ啞ᙞݞᑞ൞啞神Ṟᡞཞᑞ൞慞佞籞","❊ᕊ㽊ᕊ꽉⭊ᕊ⽊⅊꽉雷㭊㝊╊⽊⅊흉㵊╊⭊ᭊᵊ㝊",-1651088420>(
            "\uf43f\uf85f\uf89f刺\uef1f\uf3ff烈\uf77f\uf87f"
         );
         var10001 < ((-2037699533 >>> 599567027 | 9) & -608834291);
         var10001 += -177097214 & -177097214 ^ -177097213
      ) {
         int var39 = 0<"JNT",-617462193,"嘫縫䘫츫䘪\ude2b","剞潞佞楞","❊ᕊ㽊ᕊ꽉⭊ᕊ⽊⅊꽉雷㭊㝊╊⽊⅊흉㵊╊⭊ᭊᵊ㝊",-1651088496>(var10002, var10001) - 141 + 207 ^ 126;
         char var40 = (char)(((var39 & 65504) >> 5 | var39 << 11) + 168);
         0<"JNT",-617462193,"혫昫\ude2b嘪縫䘫츫䘪\ude2b","剞潞楞佞籞","❊ᕊ㽊ᕊ꽉⭊ᕊ⽊⅊꽉雷㭊㝊╊⽊⅊흉㵊╊⭊ᭊᵊ㝊",-1651088495>(
            var10002, var10001, (char)(((var39 & 65504) >> 5 | var39 << 11) + 168)
         );
      }

      this.field_1752 = (Class_105)0<"JNT",1157255505,"Ḫ蘫긫蘫\ude2b⸪","剞癞ၞݞᱞݞ啞ᙞݞᑞ൞啞神Ṟᡞཞᑞ൞慞^佞籞","⅊㝊",-1651088503>(
         0<"JNT",-617462193,"\ude2b똫혪\ude2b츫蘫긫瘫","剞佞癞ၞݞᱞݞ啞ᙞݞᑞ൞啞神Ṟᡞཞᑞ൞慞","❊ᕊ㽊ᕊ꽉⭊ᕊ⽊⅊꽉雷㭊㝊╊⽊⅊흉㵊╊⭊ᭊᵊ㝊",-1651088504>(var10002), true
      );
      var10001 = (759998413 * 1272992995 | 0) & -1979297744;

      for (var10002 = (StringBuilder)0<"JNT",1157255505,"Ḫ蘫긫蘫\ude2b⸪","剞癞ၞݞᱞݞ啞ᙞݞᑞ൞啞神Ṟᡞཞᑞ൞慞佞籞","❊ᕊ㽊ᕊ꽉⭊ᕊ⽊⅊꽉雷㭊㝊╊⽊⅊흉㵊╊⭊ᭊᵊ㝊",-1651088498>("῎翓鿑鿒");
         var10001 < ((1613255435 >>> 1338504878 | 4) & -50983332);
         var10001 += (-1599578473 + -1599578473 | 1) & -1138032639
      ) {
         int var43 = 0<"JNT",-617462193,"嘫縫䘫츫䘪\ude2b","剞潞佞楞","❊ᕊ㽊ᕊ꽉⭊ᕊ⽊⅊꽉雷㭊㝊╊⽊⅊흉㵊╊⭊ᭊᵊ㝊",-1651088598>(var10002, var10001) + 205;
         char var46 = (char)(
            (((((var43 & 65534) >> 1 | var43 << 15) - 73 & 65532) >> 2 | ((var43 & 65534) >> 1 | var43 << 15) - 73 << 14) & 64512) >> 10
               | ((((var43 & 65534) >> 1 | var43 << 15) - 73 & 65532) >> 2 | ((var43 & 65534) >> 1 | var43 << 15) - 73 << 14) << 6
         );
         0<"JNT",-617462193,"혫昫\ude2b嘪縫䘫츫䘪\ude2b","剞潞楞佞籞","❊ᕊ㽊ᕊ꽉⭊ᕊ⽊⅊꽉雷㭊㝊╊⽊⅊흉㵊╊⭊ᭊᵊ㝊",-1651088597>(
            var10002,
            var10001,
            (char)(
               (((((var43 & 65534) >> 1 | var43 << 15) - 73 & 65532) >> 2 | ((var43 & 65534) >> 1 | var43 << 15) - 73 << 14) & 64512) >> 10
                  | ((((var43 & 65534) >> 1 | var43 << 15) - 73 & 65532) >> 2 | ((var43 & 65534) >> 1 | var43 << 15) - 73 << 14) << 6
            )
         );
      }

      this.field_1753 = (Class_210)0<"JNT",1157255505,"Ḫ蘫긫蘫\ude2b⸪","剞癞ၞݞᱞݞ啞ᙞݞᑞ൞啞神Ṟᡞཞᑞ൞慞癞ᑞ\u0b5eṞ啞፞ཞᑞ\u0b5eफ़ᡞݞ\u0c5eṞ啞फ़ᙞݞᥞᥞ՞坞嵞彞塞慞佞籞","ⵊㅊ",-1651088423>(
         0<"JNT",-617462193,"\ude2b똫혪\ude2b츫蘫긫瘫","剞佞癞ၞݞᱞݞ啞ᙞݞᑞ൞啞神Ṟᡞཞᑞ൞慞","❊ᕊ㽊ᕊ꽉⭊ᕊ⽊⅊꽉雷㭊㝊╊⽊⅊흉㵊╊⭊ᭊᵊ㝊",-1651088445>(var10002),
         1<"JNT",489131168,"碳碿碯磋碫碗矻矟石矣","d\u009bj¤c_d\u009b\u0099h\u0097\u009cj¤\u0099b\u0097ii\u0095§®¦¨","ƺǁĆäõŎƣýāäõÿŐęüŎƣÿæęŏŏēƩȋȑȐƷ",-509921030>()
      );
      Class_335 var10000 = this;
      var10001 = -497435683 & -497435683 ^ -497435683;

      for (var10002 = (StringBuilder)0<"JNT",1157255505,"Ḫ蘫긫蘫\ude2b⸪","剞癞ၞݞᱞݞ啞ᙞݞᑞ൞啞神Ṟᡞཞᑞ൞慞佞籞","❊ᕊ㽊ᕊ꽉⭊ᕊ⽊⅊꽉雷㭊㝊╊⽊⅊흉㵊╊⭊ᭊᵊ㝊",-1651088418>("ÉÝ胑");
         var10001 < (1019079451 - -799100191 ^ 1818179641);
         var10001 += -118661464 ^ 1205522547 - -118661464 ^ -1241501854
      ) {
         char var49 = 0<"JNT",-617462193,"嘫縫䘫츫䘪\ude2b","剞潞佞楞","❊ᕊ㽊ᕊ꽉⭊ᕊ⽊⅊꽉雷㭊㝊╊⽊⅊흉㵊╊⭊ᭊᵊ㝊",-1651088485>(var10002, var10001);
         char var50 = (char)((((var49 & '耀') >> 15 | var49 << 1) ^ 20) - 178 - 143 ^ 4);
         0<"JNT",-617462193,"혫昫\ude2b嘪縫䘫츫䘪\ude2b","剞潞楞佞籞","❊ᕊ㽊ᕊ꽉⭊ᕊ⽊⅊꽉雷㭊㝊╊⽊⅊흉㵊╊⭊ᭊᵊ㝊",-1651088400>(
            var10002, var10001, (char)((((var49 & '耀') >> 15 | var49 << 1) ^ 20) - 178 - 143 ^ 4)
         );
      }

      Class_105 var12 = (Class_105)0<"JNT",1157255505,"Ḫ蘫긫蘫\ude2b⸪","剞癞ၞݞᱞݞ啞ᙞݞᑞ൞啞神Ṟᡞཞᑞ൞慞^佞籞","⅊㝊",-1651088588>(
         0<"JNT",-617462193,"\ude2b똫혪\ude2b츫蘫긫瘫","剞佞癞ၞݞᱞݞ啞ᙞݞᑞ൞啞神Ṟᡞཞᑞ൞慞","❊ᕊ㽊ᕊ꽉⭊ᕊ⽊⅊꽉雷㭊㝊╊⽊⅊흉㵊╊⭊ᭊᵊ㝊",-1651088577>(var10002), true
      );
      int var26 = (-963083515 | 0) & 21384378;
      var36 = (StringBuilder)0<"JNT",1157255505,"Ḫ蘫긫蘫\ude2b⸪","剞癞ၞݞᱞݞ啞ᙞݞᑞ൞啞神Ṟᡞཞᑞ൞慞佞籞","❊ᕊ㽊ᕊ꽉⭊ᕊ⽊⅊꽉雷㭊㝊╊⽊⅊흉㵊╊⭊ᭊᵊ㝊",-1651088587>(
         "韹\u0ff9⟹꿸\u0ff9⟹뿸俿꿸ퟸ俿럸꿸ퟸ쿸俿\u0ff9߹꿸럸俿⿹߹뿸⟹㟹꿸⟹⿹俿꿸ퟸ俿꿸\u0ff9⟹俿䟹߹뿸"
      );

      label65:
      while (true) {
         var1 = -1221732516 - 335145713 ^ -141811817;

         while (true) {
            label99: {
               switch ((var1 - 870193665 + 1673518215 - 1724477317 - 699725908 ^ 509424968) + 1783743547) {
                  case -504185193:
                  default:
                     var10002 = var36;
                     if (var26 < ((1189120293 - 925903767 | 33) & 1078755943)) {
                        char var87 = 0<"JNT",-617462193,"嘫縫䘫츫䘪\ude2b","剞潞佞楞","❊ᕊ㽊ᕊ꽉⭊ᕊ⽊⅊꽉雷㭊㝊╊⽊⅊흉㵊╊⭊ᭊᵊ㝊",-1651088399>(var36, var26);
                        char var90 = (char)(
                           ((((((var87 & '\uf000') >> 12 | var87 << 4) + 61 & 65528) >> 3 | ((var87 & '\uf000') >> 12 | var87 << 4) + 61 << 13) ^ 242) & 65504)
                                 >> 5
                              | (((((var87 & '\uf000') >> 12 | var87 << 4) + 61 & 65528) >> 3 | ((var87 & '\uf000') >> 12 | var87 << 4) + 61 << 13) ^ 242)
                                 << 11
                        );
                        0<"JNT",-617462193,"혫昫\ude2b嘪縫䘫츫䘪\ude2b","剞潞楞佞籞","❊ᕊ㽊ᕊ꽉⭊ᕊ⽊⅊꽉雷㭊㝊╊⽊⅊흉㵊╊⭊ᭊᵊ㝊",-1651088394>(
                           var36,
                           var26,
                           (char)(
                              (
                                       (
                                             ((((var87 & '\uf000') >> 12 | var87 << 4) + 61 & 65528) >> 3 | ((var87 & '\uf000') >> 12 | var87 << 4) + 61 << 13)
                                                ^ 242
                                          )
                                          & 65504
                                    )
                                    >> 5
                                 | (((((var87 & '\uf000') >> 12 | var87 << 4) + 61 & 65528) >> 3 | ((var87 & '\uf000') >> 12 | var87 << 4) + 61 << 13) ^ 242)
                                    << 11
                           )
                        );
                        var26 += (-116547742 + 2098281959 | 0) & -2143281147;
                        break label99;
                     }

                     var1 = (-928387441 >> -1001683622 | -2103438077) & -1498130617;
                     break;
                  case 1422934044:
                     var10002 = var36;
                     if (var26 < (2118156080 + (2118156080 - -1242984236) ^ 1184329124)) {
                        char var77 = 0<"JNT",-617462193,"嘫縫䘫츫䘪\ude2b","剞潞佞楞","❊ᕊ㽊ᕊ꽉⭊ᕊ⽊⅊꽉雷㭊㝊╊⽊⅊흉㵊╊⭊ᭊᵊ㝊",-1651088448>(var36, var26);
                        char var80 = (char)(
                           (
                                 (
                                       (((((var77 & '￠') >> 5 | var77 << 11) & 65024) >> 9 | ((var77 & '￠') >> 5 | var77 << 11) << 7) & 57344) >> 13
                                          | ((((var77 & '￠') >> 5 | var77 << 11) & 65024) >> 9 | ((var77 & '￠') >> 5 | var77 << 11) << 7) << 3
                                    )
                                    ^ 191
                              )
                              + 202
                        );
                        0<"JNT",-617462193,"혫昫\ude2b嘪縫䘫츫䘪\ude2b","剞潞楞佞籞","❊ᕊ㽊ᕊ꽉⭊ᕊ⽊⅊꽉雷㭊㝊╊⽊⅊흉㵊╊⭊ᭊᵊ㝊",-1651088447>(
                           var36,
                           var26,
                           (char)(
                              (
                                    (
                                          (((((var77 & '￠') >> 5 | var77 << 11) & 65024) >> 9 | ((var77 & '￠') >> 5 | var77 << 11) << 7) & 57344) >> 13
                                             | ((((var77 & '￠') >> 5 | var77 << 11) & 65024) >> 9 | ((var77 & '￠') >> 5 | var77 << 11) << 7) << 3
                                       )
                                       ^ 191
                                 )
                                 + 202
                           )
                        );
                        var26 += (-477700081 << 186311897 | 1) & -2114273951;
                        continue label65;
                     }

                     var1 = 1465607200 * 1463526270 ^ -643738871;
               }

               switch ((var1 ^ 451163473) - 729918346 + 783067502 ^ 2011088292 ^ 365516612 ^ 669986563) {
                  case -1502543201:
                     var10000.field_1754 = 0<"JNT",-617462193,"䘫\ue62b師","剞癞ၞݞᱞݞ啞ᙞݞᑞ൞啞神Ṟᡞཞᑞ൞慞佞癞൞ᡞ慞","⅊㝊",-1651088582>(
                        var12, 0<"JNT",-617462193,"\ude2b똫혪\ude2b츫蘫긫瘫","剞佞癞ၞݞᱞݞ啞ᙞݞᑞ൞啞神Ṟᡞཞᑞ൞慞","❊ᕊ㽊ᕊ꽉⭊ᕊ⽊⅊꽉雷㭊㝊╊⽊⅊흉㵊╊⭊ᭊᵊ㝊",-1651088427>(var10002)
                     );
                     var10000 = this;
                     var10001 = (1380524877 >>> (384720069 << -498949901) | 0) & 11829250;

                     for (var10002 = (StringBuilder)0<"JNT",1157255505,"Ḫ蘫긫蘫\ude2b⸪","剞癞ၞݞᱞݞ啞ᙞݞᑞ൞啞神Ṟᡞཞᑞ൞慞佞籞","❊ᕊ㽊ᕊ꽉⭊ᕊ⽊⅊꽉雷㭊㝊╊⽊⅊흉㵊╊⭊ᭊᵊ㝊",-1651088581>("篚⏛㟛ߛ⟛䟛");
                        var10001 < (-425473657 << (1113469416 & 1113469416) ^ -1547073786);
                        var10001 += (1164497313 >> -769152037 | 1) & -1389550351
                     ) {
                        int var61 = 0<"JNT",-617462193,"嘫縫䘫츫䘪\ude2b","剞潞佞楞","❊ᕊ㽊ᕊ꽉⭊ᕊ⽊⅊꽉雷㭊㝊╊⽊⅊흉㵊╊⭊ᭊᵊ㝊",-1651088419>(var10002, var10001) ^ '%';
                        int var105 = (var61 & 65534) >> 1;
                        int var62 = (var61 & 65534) >> 1 | var61 << 15;
                        int var106 = (((var61 & 65534) >> 1 | var61 << 15) & 65024) >> 9;
                        char var63 = (char)(((((var105 | var61 << 15) & 65024) >> 9 | ((var61 & 65534) >> 1 | var61 << 15) << 7) ^ 65) + 163);
                        0<"JNT",-617462193,"혫昫\ude2b嘪縫䘫츫䘪\ude2b","剞潞楞佞籞","❊ᕊ㽊ᕊ꽉⭊ᕊ⽊⅊꽉雷㭊㝊╊⽊⅊흉㵊╊⭊ᭊᵊ㝊",-1651088446>(
                           var10002, var10001, (char)(((var106 | var62 << 7) ^ 65) + 163)
                        );
                     }

                     var12 = (Class_105)0<"JNT",1157255505,"Ḫ蘫긫蘫\ude2b⸪","剞癞ၞݞᱞݞ啞ᙞݞᑞ൞啞神Ṟᡞཞᑞ൞慞^佞籞","⅊㝊",-1651088508>(
                        0<"JNT",-617462193,"\ude2b똫혪\ude2b츫蘫긫瘫","剞佞癞ၞݞᱞݞ啞ᙞݞᑞ൞啞神Ṟᡞཞᑞ൞慞","❊ᕊ㽊ᕊ꽉⭊ᕊ⽊⅊꽉雷㭊㝊╊⽊⅊흉㵊╊⭊ᭊᵊ㝊",-1651088497>(var10002), false
                     );
                     var26 = (-1239387969 << (577614882 ^ -1239387969) | 0) & 522461101;
                     var36 = (StringBuilder)0<"JNT",1157255505,"Ḫ蘫긫蘫\ude2b⸪","剞癞ၞݞᱞݞ啞ᙞݞᑞ൞啞神Ṟᡞཞᑞ൞慞佞籞","❊ᕊ㽊ᕊ꽉⭊ᕊ⽊⅊꽉雷㭊㝊╊⽊⅊흉㵊╊⭊ᭊᵊ㝊",-1651088507>(
                        "㔅㛵㘥㜵㛵㘥㝕㉵㜵㚅㉵㝅㜵㚅㝵㉵㛵㛥㜵㝅㉵㘵㛥㝕㘥㙅㜵㘥㘵㉵㜵㚅㉵㙕㚵㚅㙅㛅㝅"
                     );
                     break;
                  case -92020203:
                  default:
                     var10000.field_1755 = 0<"JNT",-617462193,"䘫\ue62b師","剞癞ၞݞᱞݞ啞ᙞݞᑞ൞啞神Ṟᡞཞᑞ൞慞佞癞൞ᡞ慞","⅊㝊",-1651088462>(
                        var12, 0<"JNT",-617462193,"\ude2b똫혪\ude2b츫蘫긫瘫","剞佞癞ၞݞᱞݞ啞ᙞݞᑞ൞啞神Ṟᡞཞᑞ൞慞","❊ᕊ㽊ᕊ꽉⭊ᕊ⽊⅊꽉雷㭊㝊╊⽊⅊흉㵊╊⭊ᭊᵊ㝊",-1651088499>(var10002)
                     );
                     var10001 = -885889762 + 1705866085 ^ 819976323;

                     for (var10002 = (StringBuilder)0<"JNT",1157255505,"Ḫ蘫긫蘫\ude2b⸪","剞癞ၞݞᱞݞ啞ᙞݞᑞ൞啞神Ṟᡞཞᑞ൞慞佞籞","❊ᕊ㽊ᕊ꽉⭊ᕊ⽊⅊꽉雷㭊㝊╊⽊⅊흉㵊╊⭊ᭊᵊ㝊",-1651088461>(
                           "ᛕᨕᩕᴕᥕᬕᩕᷕᴕࠕᆕᬕ᳕᧕ᯕᷕ"
                        );
                        var10001 < 16;
                        var10001 += 1
                     ) {
                        int var56 = (0<"JNT",-617462193,"嘫縫䘫츫䘪\ude2b","剞潞佞楞","❊ᕊ㽊ᕊ꽉⭊ᕊ⽊⅊꽉雷㭊㝊╊⽊⅊흉㵊╊⭊ᭊᵊ㝊",-1651088583>(var10002, var10001) ^ 153) - 174 + 34;
                        int var103 = (var56 & 65528) >> 3;
                        int var57 = (var56 & 65528) >> 3 | var56 << 13;
                        int var104 = (((var56 & 65528) >> 3 | var56 << 13) & 65528) >> 3;
                        char var58 = (char)(((var103 | var56 << 13) & 65528) >> 3 | ((var56 & 65528) >> 3 | var56 << 13) << 13);
                        0<"JNT",-617462193,"혫昫\ude2b嘪縫䘫츫䘪\ude2b","剞潞楞佞籞","❊ᕊ㽊ᕊ꽉⭊ᕊ⽊⅊꽉雷㭊㝊╊⽊⅊흉㵊╊⭊ᭊᵊ㝊",-1651088578>(
                           var10002, var10001, (char)(var104 | var57 << 13)
                        );
                     }

                     this.field_1756 = (Class_185)0<"JNT",1157255505,"Ḫ蘫긫蘫\ude2b⸪","剞癞ၞݞᱞݞ啞ᙞݞᑞ൞啞神Ṟᡞཞᑞ൞慞癞ၞݞᱞݞ啞᭞Ṟཞᙞ啞神\u0b5eṞ慞佞籞","⭊ㅊ",-1651088602>(
                        0<"JNT",-617462193,"\ude2b똫혪\ude2b츫蘫긫瘫","剞佞癞ၞݞᱞݞ啞ᙞݞᑞ൞啞神Ṟᡞཞᑞ൞慞","❊ᕊ㽊ᕊ꽉⭊ᕊ⽊⅊꽉雷㭊㝊╊⽊⅊흉㵊╊⭊ᭊᵊ㝊",-1651088608>(var10002),
                        (HashSet)0<"JNT",1157255505,"Ḫ蘫긫蘫\ude2b⸪","剞佞籞","❊ᕊ㽊ᕊ꽉㵊㭊╊⭊꽉\ue349ᕊ㥊⍊雷ᵊ㭊",-1651088607>()
                     );
                     0<"JNT",-617462193,"옫\ue62b","剞Ş癞\u175e\u0b5e\u0b5e慞佞籞","㵊╊",-1651088584>(
                        this,
                        new Class_271[]{
                           1<"JNT",-799664754,"磏碯","k_","ƺǁĆûŐƷ",-509921241>(this),
                           1<"JNT",-799664754,"碻碿","k_","ƺǁĆýãƷ",-509921242>(this),
                           1<"JNT",-799664754,"磷磛磋","k_","ƺǁĆûŐƷ",-509921063>(this),
                           1<"JNT",-799664754,"碟磳磗","k_","ƺǁĆûŐƷ",-509921064>(this),
                           1<"JNT",-799664754,"碻磣碧","k_","ƺǁĆæãƷ",-509921061>(this)
                        }
                     );
                     return;
               }
            }

            var1 = (-696782481 * 1639178678 | -896900089) & -876970889;
         }
      }
   }

   // $VF: renamed from: mg () void
   @Override
   public void method_1407() {
      0<"JNT",852876653,"ꘫ瘫","剞佞籞","㵊㥊Ὂ",-1651088490>(this);
   }

   // $VF: renamed from: q () void
   @Override
   public void method_1408() {
      0<"JNT",852876653,"옫","剞佞籞","㵊㥊Ὂ",-1651088489>(this);
   }

   // $VF: renamed from: bq () boolean
   public boolean method_1545() {
      int var1 = 552619404;
      if (0<"JNT",-617462193,"䘫︫","剞佞^","⅊㝊",-1651088595>(1<"JNT",-799664754,"磏碯","k_","ƺǁĆûŐƷ",-509921034>(this))) {
         if (0<"JNT",-617462193,"ꘫ昫\ude2b縫똫師㘫\uf629ت븩ت","剞佞癞ᑞ\u0b5eṞ啞፞ཞᑞ\u0b5eफ़ᡞݞ\u0c5eṞ啞फ़ᙞݞᥞᥞ՞坞嵞彞塞慞","⽊ᵊ㭊꽉ⵊ╊⽊ᵊ᥊㝊ᕊὊ㭊꽉᥊⭊ᕊ㥊㥊ᅊ땉셉앉앉",-1651088599>(
               0<"JNT",-617462193,"ꘫ昫\ude2b縫똫師㘫\uee29븩\ude29\uf629","剞佞癞ᑞ\u0b5eṞ啞፞ཞᑞ\u0b5eफ़ᡞݞ\u0c5eṞ啞फ़ᙞݞᥞᥞ՞坞嵞彞彞慞","⽊ᵊ㭊꽉ⵊ╊⽊ᵊ᥊㝊ᕊὊ㭊꽉᥊⭊ᕊ㥊㥊ᅊ셉뭉뽉",-1651088600>(
                  1<"JNT",-799664754,"碳碿碯磋碫碗矟矷矣矫","d\u009bj¤c_d\u009b\u0099h\u0097\u009cj¤\u0099b\u0097ii\u0095©§¦","ƺǁĆäõŎƣýāäõÿŐęüŎƣÿæęŏŏēȋȎȌƷ",-509921045>(
                     1<"JNT",-799664754,"磋磣","k_","ƺǁĆäõŎƣýāäõÿŐęüŎƣÿæęŏŏēȏƩƢƷ",-509921048>(this)
                  )
               )
            )
            == 0<"JNT",-617462193,"鸫븫\uf62b","剞佞癞ᑞ\u0b5eṞ啞፞ཞᑞ\u0b5eफ़ᡞݞ\u0c5eṞ啞फ़ᙞݞᥞᥞ՞坞嵞彞塞慞","ⵊㅊ",-1651088593>(
               1<"JNT",-799664754,"碻碿","k_","ƺǁĆýãƷ",-509921044>(this)
            )) {
            return true;
         }

         var1 = (844523902 >> (844523902 >> 844523902) | -2022926657) & -278079809;
      } else {
         var1 = 1585541923;
      }

      switch ((var1 ^ 1741662878 ^ 237180769) - 1254588616 - 848065112 - 1142706791 ^ 1769534049) {
         case 478509876:
         default:
            return true;
         case 1684592600:
            return false;
      }
   }

   // $VF: renamed from: dws (Class_198) void
   @Class_21
   public void method_1546(Class_198 var1) {
      int var4 = -414145131;
      if (0<"JNT",-617462193,"丫옫","剞佞^","㵊╊",-1651088604>(this)) {
         var4 = (-687785142 | -687785142) ^ 1597914819;

         while (true) {
            label35:
            switch ((var4 ^ 1813172784 ^ 393378960) - 659056696 - 980165781 ^ 706354346 ^ 203656235) {
               case -2024311100:
                  0<"JNT",-617462193,"鸫蘫","剞佞籞","ⵊᕊ䕊",-1651088421>(var1);
                  break;
               case -1674171323:
                  if (0<"JNT",-617462193,"䘫︫","剞佞^","⅊㝊",-1651088543>(1<"JNT",-799664754,"碟磳磗","k_","ƺǁĆûŐƷ",-509921054>(this))) {
                     if (!0<"JNT",794528056,"蘫혫昪ꘫ븫\ude2bج","剞佞^","❊ᕊ㽊ᕊ꽉㵊㭊╊⭊꽉雷ᵊ㭊",-1651088516>(
                           0<"JNT",-617462193,"縫昫","剞佞癞ၞݞᱞݞ啞᭞Ṟཞᙞ啞神\u0b5eṞ慞","⭊ㅊ",-1651088537>(1<"JNT",-799664754,"碻磣碧","k_","ƺǁĆæãƷ",-509921052>(this))
                        )
                        && 1<"JNT",-799664754,"碳碿碯磋碫碗矟矷石矯","d\u009bj¤c_d\u009b\u0099h\u0097\u009cj¤\u0099b\u0097ii\u0095©§¦","ƺǁĆäõŎƣýāäõÿŐęüŎƣÿæęŏŏēȐȏȑƷ",-509921128>(
                           1<"JNT",-799664754,"磋磣","k_","ƺǁĆäõŎƣýāäõÿŐęüŎƣÿæęŏŏēȏƩƢƷ",-509921127>(this)
                        ) instanceof class_3965 var2) {
                        class_2248 var5 = 0<"JNT",-617462193,"ꘫ昫\ude2b縫똫師㘫츩\uee29츩븩\ude29","剞佞癞ᑞ\u0b5eṞ啞፞ཞᑞ\u0b5eफ़ᡞݞ\u0c5eṞ啞फ़ᙞݞᥞᥞ՞塞塞幞扞慞","⽊ᵊ㭊꽉ⵊ╊⽊ᵊ᥊㝊ᕊὊ㭊꽉᥊⭊ᕊ㥊㥊ᅊ띉뽉썉덉",-1651088513>(
                           0<"JNT",-617462193,"ꘫ昫\ude2b縫똫師㘫︩혩츩븩","剞癞ᑞ\u0b5eṞ啞፞ཞᑞ\u0b5eफ़ᡞݞ\u0c5eṞ啞फ़ᙞݞᥞᥞ՞塞奞奞扞慞佞癞ᑞ\u0b5eṞ啞፞ཞᑞ\u0b5eफ़ᡞݞ\u0c5eṞ啞फ़ᙞݞᥞᥞ՞塞属扞婞慞","⽊ᵊ㭊꽉ⵊ╊⽊ᵊ᥊㝊ᕊὊ㭊꽉᥊⭊ᕊ㥊㥊ᅊ뽉륉썉",-1651088514>(
                              1<"JNT",-799664754,"碳碿碯磋碫碗矟石矻矷","d\u009bj¤c_d\u009b\u0099h\u0097\u009cj¤\u0099b\u0097ii\u0095©§¦","ƺǁĆäõŎƣýāäõÿŐęüŎƣÿæęŏŏēȌȏȊƷ",-509921126>(
                                 1<"JNT",-799664754,"磋磣","k_","ƺǁĆäõŎƣýāäõÿŐęüŎƣÿæęŏŏēȏƩƢƷ",-509921125>(this)
                              ),
                              0<"JNT",-617462193,"ꘫ昫\ude2b縫똫師㘫옩\uf629\uf629\uf629\uf629","剞佞癞ᑞ\u0b5eṞ啞፞ཞᑞ\u0b5eफ़ᡞݞ\u0c5eṞ啞फ़ᙞݞᥞᥞ՞塞奞奞扞慞","⽊ᵊ㭊꽉ⵊ╊⽊ᵊ᥊㝊ᕊὊ㭊꽉᥊⭊ᕊ㥊㥊ᅊ륉앉뽉뵉",-1651088519>(
                                 var2
                              )
                           )
                        );
                        if (0<"JNT",794528056,"嘫똫긫\ude2b䘫蘫긫혫","剞癞ၞݞᱞݞ啞ᙞݞᑞ൞啞畞࡞ၞ\u0b5eफ़Ṟ慞佞^","❊ᕊ㽊ᕊ꽉㵊㭊╊⭊꽉雷ᵊ㭊",-1651088422>(
                           0<"JNT",-617462193,"縫昫","剞佞癞ၞݞᱞݞ啞᭞Ṟཞᙞ啞神\u0b5eṞ慞","⭊ㅊ",-1651088523>(1<"JNT",-799664754,"碻磣碧","k_","ƺǁĆæãƷ",-509921122>(this)), var5
                        )) {
                           return;
                        }
                     }

                     var4 = 2045239226 & -62661193;
                     continue;
                  }
                  break;
               case -1215131939:
                  switch (1<"JNT",489131168,"碷碻碷","j","ƺǁėġ",-509921134>()[0<"JNT",-617462193,"똫츫師蘫긫䘫鸫","剞佞潞","⽊ᵊ㭊꽉ⵊ╊⽊ᵊ᥊㝊ᕊὊ㭊꽉᥊⭊ᕊ㥊㥊ᅊ띉륉앉魉᥊⭊ᕊ㥊㥊ᅊ띉뭉덉",-1651088436>(
                        0<"JNT",-617462193,"ꘫ昫\ude2b縫똫師㘫옩\uf629\uf629︩혩","剞佞癞ᑞ\u0b5eṞ啞፞ཞᑞ\u0b5eफ़ᡞݞ\u0c5eṞ啞फ़ᙞݞᥞᥞ՞塞奞彞乞फ़ᙞݞᥞᥞ՞塞幞婞慞","⽊ᵊ㭊꽉ⵊ╊⽊ᵊ᥊㝊ᕊὊ㭊꽉᥊⭊ᕊ㥊㥊ᅊ띉륉앉",-1651088585>(
                           1<"JNT",-799664754,"碳碿碯磋碫碗矟矷石矯","d\u009bj¤c_d\u009b\u0099h\u0097\u009cj¤\u0099b\u0097ii\u0095©§¦","ƺǁĆäõŎƣýāäõÿŐęüŎƣÿæęŏŏēȐȏȑƷ",-509921132>(
                              1<"JNT",-799664754,"磋磣","k_","ƺǁĆäõŎƣýāäõÿŐęüŎƣÿæęŏŏēȏƩƢƷ",-509921131>(this)
                           )
                        )
                     )]
                     + 1066591849
                     + 1884124144
                     - 1462968070
                     + 1433937930
                     + 599734654
                     - 1466329066) {
                     case 2055091442:
                        var4 = 756391353 * 1318659910 ^ -964852891;
                        continue;
                     case 2055091443:
                        var4 = -2064316481 >> -2064316481 ^ -1621419826;
                        continue;
                     default:
                        break label35;
                  }
               case -1109506809:
               default:
                  if (0<"JNT",-617462193,"䘫︫","剞佞^","⅊㝊",-1651088438>(1<"JNT",-799664754,"磷磛磋","k_","ƺǁĆûŐƷ",-509921055>(this))) {
                     0<"JNT",-617462193,"鸫蘫","剞佞籞","ⵊᕊ䕊",-1651088437>(var1);
                  }
                  break;
               case 1308173289:
                  return;
            }

            var4 = -1240076651;
         }
      }
   }

   // $VF: renamed from: dno (Class_307) void
   @Class_21
   public void method_1547(Class_307 var1) {
      int var4 = -1867511149;
      if (0<"JNT",-617462193,"丫옫","剞佞^","㵊╊",-1651088615>(this)) {
         var4 = 1004163927;

         while (true) {
            switch ((var4 ^ 1839537222) + 1964554832 - 1351605632 - 1291038406 - 915131696 ^ 536617655) {
               case -2013610660:
               default:
                  0<"JNT",-617462193,"鸫蘫","剞佞籞","㥊㵊",-1651088435>(var1);
                  break;
               case -395014820:
                  if (0<"JNT",-617462193,"ꘫ昫\ude2b縫똫師㘫옩\uf629\uf629︩혩","剞佞癞ᑞ\u0b5eṞ啞፞ཞᑞ\u0b5eफ़ᡞݞ\u0c5eṞ啞फ़ᙞݞᥞᥞ՞塞奞彞乞फ़ᙞݞᥞᥞ՞塞幞婞慞","⽊ᵊ㭊꽉ⵊ╊⽊ᵊ᥊㝊ᕊὊ㭊꽉᥊⭊ᕊ㥊㥊ᅊ띉륉앉",-1651088440>(
                           1<"JNT",-799664754,"碳碿碯磋碫碗矟矷石矯","d\u009bj¤c_d\u009b\u0099h\u0097\u009cj¤\u0099b\u0097ii\u0095©§¦","ƺǁĆäõŎƣýāäõÿŐęüŎƣÿæęŏŏēȐȏȑƷ",-509921141>(
                              1<"JNT",-799664754,"磋磣","k_","ƺǁĆäõŎƣýāäõÿŐęüŎƣÿæęŏŏēȏƩƢƷ",-509921144>(this)
                           )
                        )
                        == 1<"JNT",489131168,"碳碿碯磋碫碗矟矧矧矣","d\u009bj¤c_d\u009b\u0099h\u0097\u009cj¤\u0099b\u0097ii\u0095¨©¯Ú\u0099b\u0097ii\u0095¨ª¦","ƺǁĆäõŎƣýāäõÿŐęüŎƣÿæęŏŏēȐȏȑƾÿæęŏŏēȐȎƢƷ",-509921139>()
                     && 0<"JNT",-617462193,"䘫︫","剞佞^","⅊㝊",-1651088433>(1<"JNT",-799664754,"碟磳磗","k_","ƺǁĆûŐƷ",-509921140>(this))) {
                     if (!0<"JNT",794528056,"蘫혫昪ꘫ븫\ude2bج","剞佞^","❊ᕊ㽊ᕊ꽉㵊㭊╊⭊꽉雷ᵊ㭊",-1651088534>(
                           0<"JNT",-617462193,"縫昫","剞佞癞ၞݞᱞݞ啞᭞Ṟཞᙞ啞神\u0b5eṞ慞","⭊ㅊ",-1651088443>(1<"JNT",-799664754,"碻磣碧","k_","ƺǁĆæãƷ",-509921138>(this))
                        )
                        && 1<"JNT",-799664754,"碳碿碯磋碫碗矟矷石矯","d\u009bj¤c_d\u009b\u0099h\u0097\u009cj¤\u0099b\u0097ii\u0095©§¦","ƺǁĆäõŎƣýāäõÿŐęüŎƣÿæęŏŏēȐȏȑƷ",-509921150>(
                           1<"JNT",-799664754,"磋磣","k_","ƺǁĆäõŎƣýāäõÿŐęüŎƣÿæęŏŏēȏƩƢƷ",-509921149>(this)
                        ) instanceof class_3965 var2) {
                        class_2248 var5 = 0<"JNT",-617462193,"ꘫ昫\ude2b縫똫師㘫츩\uee29츩븩\ude29","剞佞癞ᑞ\u0b5eṞ啞፞ཞᑞ\u0b5eफ़ᡞݞ\u0c5eṞ啞फ़ᙞݞᥞᥞ՞塞塞幞扞慞","⽊ᵊ㭊꽉ⵊ╊⽊ᵊ᥊㝊ᕊὊ㭊꽉᥊⭊ᕊ㥊㥊ᅊ띉뽉썉덉",-1651088611>(
                           0<"JNT",-617462193,"ꘫ昫\ude2b縫똫師㘫︩혩츩븩","剞癞ᑞ\u0b5eṞ啞፞ཞᑞ\u0b5eफ़ᡞݞ\u0c5eṞ啞फ़ᙞݞᥞᥞ՞塞奞奞扞慞佞癞ᑞ\u0b5eṞ啞፞ཞᑞ\u0b5eफ़ᡞݞ\u0c5eṞ啞फ़ᙞݞᥞᥞ՞塞属扞婞慞","⽊ᵊ㭊꽉ⵊ╊⽊ᵊ᥊㝊ᕊὊ㭊꽉᥊⭊ᕊ㥊㥊ᅊ뽉륉썉",-1651088612>(
                              1<"JNT",-799664754,"碳碿碯磋碫碗矟石矻矷","d\u009bj¤c_d\u009b\u0099h\u0097\u009cj¤\u0099b\u0097ii\u0095©§¦","ƺǁĆäõŎƣýāäõÿŐęüŎƣÿæęŏŏēȌȏȊƷ",-509921148>(
                                 1<"JNT",-799664754,"磋磣","k_","ƺǁĆäõŎƣýāäõÿŐęüŎƣÿæęŏŏēȏƩƢƷ",-509921147>(this)
                              ),
                              0<"JNT",-617462193,"ꘫ昫\ude2b縫똫師㘫옩\uf629\uf629\uf629\uf629","剞佞癞ᑞ\u0b5eṞ啞፞ཞᑞ\u0b5eफ़ᡞݞ\u0c5eṞ啞फ़ᙞݞᥞᥞ՞塞奞奞扞慞","⽊ᵊ㭊꽉ⵊ╊⽊ᵊ᥊㝊ᕊὊ㭊꽉᥊⭊ᕊ㥊㥊ᅊ륉앉뽉뵉",-1651088633>(
                                 var2
                              )
                           )
                        );
                        if (0<"JNT",794528056,"嘫똫긫\ude2b䘫蘫긫혫","剞癞ၞݞᱞݞ啞ᙞݞᑞ൞啞畞࡞ၞ\u0b5eफ़Ṟ慞佞^","❊ᕊ㽊ᕊ꽉㵊㭊╊⭊꽉雷ᵊ㭊",-1651088616>(
                           0<"JNT",-617462193,"縫昫","剞佞癞ၞݞᱞݞ啞᭞Ṟཞᙞ啞神\u0b5eṞ慞","⭊ㅊ",-1651088637>(1<"JNT",-799664754,"碻磣碧","k_","ƺǁĆæãƷ",-509921096>(this)), var5
                        )) {
                           return;
                        }
                     }

                     var4 = -1688722601;
                     continue;
                  }
                  break;
               case 1484318176:
                  return;
            }

            var4 = 163577785 ^ -1033796222;
         }
      }
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1413(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = (((var10 ^ 2036010157) - 868818142 ^ 265964576) - 1109820252 + 730697664 ^ 44503560 ^ 303630308) - 2118042240 + 1149846094;
      MethodHandle var10000 = field_1757[(((var10 ^ 2036010157) - 868818142 ^ 265964576) - 1109820252 + 730697664 ^ 44503560 ^ 303630308)
            - 2118042240
            + 1149846094
         ^ 2135277295];
      if (field_1757[var10001 ^ 2135277295] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = (-1234506740 | -914053237 | 0) & 65584; var23 < var13.length(); var23 += -987576199 ^ -987576199 ^ 1) {
            char var42 = var13.charAt(var23);
            char var49 = (char)(
               (
                        (
                              (
                                       (
                                                (
                                                      (
                                                               (
                                                                        (
                                                                                 (
                                                                                       (
                                                                                                (
                                                                                                      (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                                         | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                                                   )
                                                                                                   & 65534
                                                                                             )
                                                                                             >> 1
                                                                                          | (
                                                                                                (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                                   | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                                             )
                                                                                             << 15
                                                                                    )
                                                                                    & 65528
                                                                              )
                                                                              >> 3
                                                                           | (
                                                                                 (
                                                                                          (
                                                                                                (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                                   | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                                             )
                                                                                             & 65534
                                                                                       )
                                                                                       >> 1
                                                                                    | (
                                                                                          (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                             | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                                       )
                                                                                       << 15
                                                                              )
                                                                              << 13
                                                                     )
                                                                     + 48
                                                                  & 61440
                                                            )
                                                            >> 12
                                                         | (
                                                                  (
                                                                           (
                                                                                 (
                                                                                          (
                                                                                                (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                                   | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                                             )
                                                                                             & 65534
                                                                                       )
                                                                                       >> 1
                                                                                    | (
                                                                                          (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                             | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                                       )
                                                                                       << 15
                                                                              )
                                                                              & 65528
                                                                        )
                                                                        >> 3
                                                                     | (
                                                                           (
                                                                                    (
                                                                                          (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                             | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                                       )
                                                                                       & 65534
                                                                                 )
                                                                                 >> 1
                                                                              | (
                                                                                    (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                       | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                                 )
                                                                                 << 15
                                                                        )
                                                                        << 13
                                                               )
                                                               + 48
                                                            << 4
                                                   )
                                                   & 63488
                                             )
                                             >> 11
                                          | (
                                                (
                                                         (
                                                                  (
                                                                           (
                                                                                 (
                                                                                          (
                                                                                                (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                                   | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                                             )
                                                                                             & 65534
                                                                                       )
                                                                                       >> 1
                                                                                    | (
                                                                                          (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                             | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                                       )
                                                                                       << 15
                                                                              )
                                                                              & 65528
                                                                        )
                                                                        >> 3
                                                                     | (
                                                                           (
                                                                                    (
                                                                                          (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                             | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                                       )
                                                                                       & 65534
                                                                                 )
                                                                                 >> 1
                                                                              | (
                                                                                    (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                       | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                                 )
                                                                                 << 15
                                                                        )
                                                                        << 13
                                                               )
                                                               + 48
                                                            & 61440
                                                      )
                                                      >> 12
                                                   | (
                                                            (
                                                                     (
                                                                           (
                                                                                    (
                                                                                          (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                             | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                                       )
                                                                                       & 65534
                                                                                 )
                                                                                 >> 1
                                                                              | (
                                                                                    (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                       | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                                 )
                                                                                 << 15
                                                                        )
                                                                        & 65528
                                                                  )
                                                                  >> 3
                                                               | (
                                                                     (
                                                                              (
                                                                                    (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                       | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                                 )
                                                                                 & 65534
                                                                           )
                                                                           >> 1
                                                                        | (
                                                                              (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                 | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                           )
                                                                           << 15
                                                                  )
                                                                  << 13
                                                         )
                                                         + 48
                                                      << 4
                                             )
                                             << 5
                                    )
                                    - 241
                                 ^ 8
                           )
                           & 65504
                     )
                     >> 5
                  | (
                        (
                                 (
                                          (
                                                (
                                                         (
                                                                  (
                                                                           (
                                                                                 (
                                                                                          (
                                                                                                (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                                   | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                                             )
                                                                                             & 65534
                                                                                       )
                                                                                       >> 1
                                                                                    | (
                                                                                          (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                             | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                                       )
                                                                                       << 15
                                                                              )
                                                                              & 65528
                                                                        )
                                                                        >> 3
                                                                     | (
                                                                           (
                                                                                    (
                                                                                          (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                             | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                                       )
                                                                                       & 65534
                                                                                 )
                                                                                 >> 1
                                                                              | (
                                                                                    (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                       | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                                 )
                                                                                 << 15
                                                                        )
                                                                        << 13
                                                               )
                                                               + 48
                                                            & 61440
                                                      )
                                                      >> 12
                                                   | (
                                                            (
                                                                     (
                                                                           (
                                                                                    (
                                                                                          (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                             | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                                       )
                                                                                       & 65534
                                                                                 )
                                                                                 >> 1
                                                                              | (
                                                                                    (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                       | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                                 )
                                                                                 << 15
                                                                        )
                                                                        & 65528
                                                                  )
                                                                  >> 3
                                                               | (
                                                                     (
                                                                              (
                                                                                    (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                       | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                                 )
                                                                                 & 65534
                                                                           )
                                                                           >> 1
                                                                        | (
                                                                              (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                 | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                           )
                                                                           << 15
                                                                  )
                                                                  << 13
                                                         )
                                                         + 48
                                                      << 4
                                             )
                                             & 63488
                                       )
                                       >> 11
                                    | (
                                          (
                                                   (
                                                            (
                                                                     (
                                                                           (
                                                                                    (
                                                                                          (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                             | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                                       )
                                                                                       & 65534
                                                                                 )
                                                                                 >> 1
                                                                              | (
                                                                                    (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                       | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                                 )
                                                                                 << 15
                                                                        )
                                                                        & 65528
                                                                  )
                                                                  >> 3
                                                               | (
                                                                     (
                                                                              (
                                                                                    (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                       | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                                 )
                                                                                 & 65534
                                                                           )
                                                                           >> 1
                                                                        | (
                                                                              (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                 | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                           )
                                                                           << 15
                                                                  )
                                                                  << 13
                                                         )
                                                         + 48
                                                      & 61440
                                                )
                                                >> 12
                                             | (
                                                      (
                                                               (
                                                                     (
                                                                              (
                                                                                    (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                       | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                                 )
                                                                                 & 65534
                                                                           )
                                                                           >> 1
                                                                        | (
                                                                              (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                 | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                           )
                                                                           << 15
                                                                  )
                                                                  & 65528
                                                            )
                                                            >> 3
                                                         | (
                                                               (
                                                                        (
                                                                              (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                 | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                           )
                                                                           & 65534
                                                                     )
                                                                     >> 1
                                                                  | (
                                                                        (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                           | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                     )
                                                                     << 15
                                                            )
                                                            << 13
                                                   )
                                                   + 48
                                                << 4
                                       )
                                       << 5
                              )
                              - 241
                           ^ 8
                     )
                     << 11
            );
            var13.setCharAt(
               var23,
               (char)(
                  (
                           (
                                 (
                                          (
                                                   (
                                                         (
                                                                  (
                                                                           (
                                                                                    (
                                                                                          (
                                                                                                   (
                                                                                                         (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                                            | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                                                      )
                                                                                                      & 65534
                                                                                                )
                                                                                                >> 1
                                                                                             | (
                                                                                                   (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                                      | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                                                )
                                                                                                << 15
                                                                                       )
                                                                                       & 65528
                                                                                 )
                                                                                 >> 3
                                                                              | (
                                                                                    (
                                                                                             (
                                                                                                   (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                                      | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                                                )
                                                                                                & 65534
                                                                                          )
                                                                                          >> 1
                                                                                       | (
                                                                                             (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                                | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                                          )
                                                                                          << 15
                                                                                 )
                                                                                 << 13
                                                                        )
                                                                        + 48
                                                                     & 61440
                                                               )
                                                               >> 12
                                                            | (
                                                                     (
                                                                              (
                                                                                    (
                                                                                             (
                                                                                                   (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                                      | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                                                )
                                                                                                & 65534
                                                                                          )
                                                                                          >> 1
                                                                                       | (
                                                                                             (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                                | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                                          )
                                                                                          << 15
                                                                                 )
                                                                                 & 65528
                                                                           )
                                                                           >> 3
                                                                        | (
                                                                              (
                                                                                       (
                                                                                             (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                                | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                                          )
                                                                                          & 65534
                                                                                    )
                                                                                    >> 1
                                                                                 | (
                                                                                       (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                          | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                                    )
                                                                                    << 15
                                                                           )
                                                                           << 13
                                                                  )
                                                                  + 48
                                                               << 4
                                                      )
                                                      & 63488
                                                )
                                                >> 11
                                             | (
                                                   (
                                                            (
                                                                     (
                                                                              (
                                                                                    (
                                                                                             (
                                                                                                   (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                                      | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                                                )
                                                                                                & 65534
                                                                                          )
                                                                                          >> 1
                                                                                       | (
                                                                                             (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                                | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                                          )
                                                                                          << 15
                                                                                 )
                                                                                 & 65528
                                                                           )
                                                                           >> 3
                                                                        | (
                                                                              (
                                                                                       (
                                                                                             (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                                | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                                          )
                                                                                          & 65534
                                                                                    )
                                                                                    >> 1
                                                                                 | (
                                                                                       (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                          | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                                    )
                                                                                    << 15
                                                                           )
                                                                           << 13
                                                                  )
                                                                  + 48
                                                               & 61440
                                                         )
                                                         >> 12
                                                      | (
                                                               (
                                                                        (
                                                                              (
                                                                                       (
                                                                                             (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                                | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                                          )
                                                                                          & 65534
                                                                                    )
                                                                                    >> 1
                                                                                 | (
                                                                                       (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                          | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                                    )
                                                                                    << 15
                                                                           )
                                                                           & 65528
                                                                     )
                                                                     >> 3
                                                                  | (
                                                                        (
                                                                                 (
                                                                                       (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                          | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                                    )
                                                                                    & 65534
                                                                              )
                                                                              >> 1
                                                                           | (
                                                                                 (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                    | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                              )
                                                                              << 15
                                                                     )
                                                                     << 13
                                                            )
                                                            + 48
                                                         << 4
                                                )
                                                << 5
                                       )
                                       - 241
                                    ^ 8
                              )
                              & 65504
                        )
                        >> 5
                     | (
                           (
                                    (
                                             (
                                                   (
                                                            (
                                                                     (
                                                                              (
                                                                                    (
                                                                                             (
                                                                                                   (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                                      | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                                                )
                                                                                                & 65534
                                                                                          )
                                                                                          >> 1
                                                                                       | (
                                                                                             (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                                | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                                          )
                                                                                          << 15
                                                                                 )
                                                                                 & 65528
                                                                           )
                                                                           >> 3
                                                                        | (
                                                                              (
                                                                                       (
                                                                                             (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                                | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                                          )
                                                                                          & 65534
                                                                                    )
                                                                                    >> 1
                                                                                 | (
                                                                                       (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                          | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                                    )
                                                                                    << 15
                                                                           )
                                                                           << 13
                                                                  )
                                                                  + 48
                                                               & 61440
                                                         )
                                                         >> 12
                                                      | (
                                                               (
                                                                        (
                                                                              (
                                                                                       (
                                                                                             (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                                | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                                          )
                                                                                          & 65534
                                                                                    )
                                                                                    >> 1
                                                                                 | (
                                                                                       (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                          | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                                    )
                                                                                    << 15
                                                                           )
                                                                           & 65528
                                                                     )
                                                                     >> 3
                                                                  | (
                                                                        (
                                                                                 (
                                                                                       (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                          | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                                    )
                                                                                    & 65534
                                                                              )
                                                                              >> 1
                                                                           | (
                                                                                 (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                    | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                              )
                                                                              << 15
                                                                     )
                                                                     << 13
                                                            )
                                                            + 48
                                                         << 4
                                                )
                                                & 63488
                                          )
                                          >> 11
                                       | (
                                             (
                                                      (
                                                               (
                                                                        (
                                                                              (
                                                                                       (
                                                                                             (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                                | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                                          )
                                                                                          & 65534
                                                                                    )
                                                                                    >> 1
                                                                                 | (
                                                                                       (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                          | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                                    )
                                                                                    << 15
                                                                           )
                                                                           & 65528
                                                                     )
                                                                     >> 3
                                                                  | (
                                                                        (
                                                                                 (
                                                                                       (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                          | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                                    )
                                                                                    & 65534
                                                                              )
                                                                              >> 1
                                                                           | (
                                                                                 (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                    | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                              )
                                                                              << 15
                                                                     )
                                                                     << 13
                                                            )
                                                            + 48
                                                         & 61440
                                                   )
                                                   >> 12
                                                | (
                                                         (
                                                                  (
                                                                        (
                                                                                 (
                                                                                       (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                          | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                                    )
                                                                                    & 65534
                                                                              )
                                                                              >> 1
                                                                           | (
                                                                                 (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                    | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                              )
                                                                              << 15
                                                                     )
                                                                     & 65528
                                                               )
                                                               >> 3
                                                            | (
                                                                  (
                                                                           (
                                                                                 (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                                    | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                              )
                                                                              & 65534
                                                                        )
                                                                        >> 1
                                                                     | (
                                                                           (((var42 & '￠') >> 5 | var42 << 11) & 65472) >> 6
                                                                              | ((var42 & '￠') >> 5 | var42 << 11) << 10
                                                                        )
                                                                        << 15
                                                               )
                                                               << 13
                                                      )
                                                      + 48
                                                   << 4
                                          )
                                          << 5
                                 )
                                 - 241
                              ^ 8
                        )
                        << 11
               )
            );
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = (-1765539317 >>> -132305585 + 538597426 | 0) & 881965240; var29 < var16.length(); var29 += -1094283490 + -262990299 ^ -1357273790) {
            int var54 = (var16.charAt(var29) + 243 ^ 240) + 38;
            int var93 = (var54 & 49152) >> 14;
            int var55 = ((var54 & 49152) >> 14 | var54 << 2) ^ 227;
            int var94 = ((((var54 & 49152) >> 14 | var54 << 2) ^ 227) & 65534) >> 1;
            var54 = (((var93 | var54 << 2) ^ 227) & 65534) >> 1 | (((var54 & 49152) >> 14 | var54 << 2) ^ 227) << 15;
            var93 = ((var94 | var55 << 15) & 63488) >> 11;
            int var57 = (((var94 | var55 << 15) & 63488) >> 11 | var54 << 5) + 73;
            int var96 = ((((var94 | var55 << 15) & 63488) >> 11 | var54 << 5) + 73 & 49152) >> 14;
            char var58 = (char)((((var93 | var54 << 5) + 73 & 49152) >> 14 | (((var94 | var55 << 15) & 63488) >> 11 | var54 << 5) + 73 << 2) - 140);
            var16.setCharAt(var29, (char)((var96 | var57 << 2) - 140));
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_335.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = (1225162807 ^ 1125224372 | 0) & 1889554536;
            var35 < var19.length();
            var35 += 315822509 ^ -1656553283 * (315822509 | -1656553283) ^ -1634203355
         ) {
            int var63 = ((var19.charAt(var35) + 145 - 233 - 41 ^ 109) - 122 ^ 199) - 235;
            int var97 = (var63 & 65472) >> 6;
            int var64 = (var63 & 65472) >> 6 | var63 << 10;
            int var98 = (((var63 & 65472) >> 6 | var63 << 10) & 65528) >> 3;
            char var65 = (char)((((var97 | var63 << 10) & 65528) >> 3 | ((var63 & 65472) >> 6 | var63 << 10) << 13) - 169);
            var19.setCharAt(var35, (char)((var98 | var64 << 13) - 169));
         }

         Class var7 = Class.forName(var19.toString(), false, Class_335.class.getClassLoader());
         switch (((var4 - 1306007233 + 1468848334 ^ 858918343) + 1741857908 - 1407784157 + 1691457113 ^ 572155014 ^ 581831760 ^ 1507286997) + 1747666118) {
            case 392607824:
               var10000 = var0.findConstructor(var7, var6);
               break;
            case 960222324:
               var10000 = var0.findSpecial(var7, var5, var6, Class_335.class);
               break;
            case 1139384375:
            case 1914593614:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 1461110260:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_1757[(((var10 ^ 2036010157) - 868818142 ^ 265964576) - 1109820252 + 730697664 ^ 44503560 ^ 303630308) - 2118042240 + 1149846094 ^ 2135277295] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1414(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = (var10 ^ 1263840559 ^ 661477494) - 1174190306 - 560594924 - 798519688 - 2086770116 - 3592313 + 55739035 - 667076357;
      MethodHandle var10000 = field_1757[(var10 ^ 1263840559 ^ 661477494)
         - 1174190306
         - 560594924
         - 798519688
         - 2086770116
         - 3592313
         + 55739035
         - 667076357
         - 1436219516];
      if (field_1757[var10001 - 1436219516] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = (-1966669563 * -1966669563 | 0) & 53412; var24 < var14.length(); var24 += 298157289 & 803882974 ^ 29361353) {
            int var43 = var14.charAt(var24);
            int var10004 = (var43 & 32768) >> 15;
            int var44 = ((var43 & 32768) >> 15 | var43 << 1) - 37;
            int var86 = (((var43 & 32768) >> 15 | var43 << 1) - 37 & 65535) >> 0;
            var43 = ((var10004 | var43 << 1) - 37 & 65535) >> 0 | ((var43 & 32768) >> 15 | var43 << 1) - 37 << 16;
            var10004 = ((var86 | var44 << 16) & 0) >> 16;
            int var46 = ((var86 | var44 << 16) & 0) >> 16 | var43 << 0;
            int var88 = ((((var86 | var44 << 16) & 0) >> 16 | var43 << 0) & 65024) >> 9;
            var43 = (((var10004 | var43 << 0) & 65024) >> 9 | (((var86 | var44 << 16) & 0) >> 16 | var43 << 0) << 7) - 188 - 58;
            var10004 = ((var88 | var46 << 7) - 188 - 58 & 64512) >> 10;
            int var48 = ((var88 | var46 << 7) - 188 - 58 & 64512) >> 10 | var43 << 6;
            int var90 = ((((var88 | var46 << 7) - 188 - 58 & 64512) >> 10 | var43 << 6) & 0) >> 16;
            char var49 = (char)((((var10004 | var43 << 6) & 0) >> 16 | (((var88 | var46 << 7) - 188 - 58 & 64512) >> 10 | var43 << 6) << 0) - 66);
            var14.setCharAt(var24, (char)((var90 | var48 << 0) - 66));
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = 903215895 ^ 903215895 ^ 0; var30 < var17.length(); var30 += 313214710 ^ 291488631 ^ 66356608) {
            int var54 = (var17.charAt(var30) + 3 ^ 224) - 21 + 122 - 126;
            char var59 = (char)(
               (
                        (
                              (
                                       (
                                             (((((var54 & 61440) >> 12 | var54 << 4) & 65472) >> 6 | ((var54 & 61440) >> 12 | var54 << 4) << 10) & 61440) >> 12
                                                | ((((var54 & 61440) >> 12 | var54 << 4) & 65472) >> 6 | ((var54 & 61440) >> 12 | var54 << 4) << 10) << 4
                                          )
                                          & 0
                                    )
                                    >> 16
                                 | (
                                       (((((var54 & 61440) >> 12 | var54 << 4) & 65472) >> 6 | ((var54 & 61440) >> 12 | var54 << 4) << 10) & 61440) >> 12
                                          | ((((var54 & 61440) >> 12 | var54 << 4) & 65472) >> 6 | ((var54 & 61440) >> 12 | var54 << 4) << 10) << 4
                                    )
                                    << 0
                           )
                           & 65532
                     )
                     >> 2
                  | (
                        (
                                 (
                                       (((((var54 & 61440) >> 12 | var54 << 4) & 65472) >> 6 | ((var54 & 61440) >> 12 | var54 << 4) << 10) & 61440) >> 12
                                          | ((((var54 & 61440) >> 12 | var54 << 4) & 65472) >> 6 | ((var54 & 61440) >> 12 | var54 << 4) << 10) << 4
                                    )
                                    & 0
                              )
                              >> 16
                           | (
                                 (((((var54 & 61440) >> 12 | var54 << 4) & 65472) >> 6 | ((var54 & 61440) >> 12 | var54 << 4) << 10) & 61440) >> 12
                                    | ((((var54 & 61440) >> 12 | var54 << 4) & 65472) >> 6 | ((var54 & 61440) >> 12 | var54 << 4) << 10) << 4
                              )
                              << 0
                     )
                     << 14
            );
            var17.setCharAt(
               var30,
               (char)(
                  (
                           (
                                 (
                                          (
                                                (((((var54 & 61440) >> 12 | var54 << 4) & 65472) >> 6 | ((var54 & 61440) >> 12 | var54 << 4) << 10) & 61440)
                                                      >> 12
                                                   | ((((var54 & 61440) >> 12 | var54 << 4) & 65472) >> 6 | ((var54 & 61440) >> 12 | var54 << 4) << 10) << 4
                                             )
                                             & 0
                                       )
                                       >> 16
                                    | (
                                          (((((var54 & 61440) >> 12 | var54 << 4) & 65472) >> 6 | ((var54 & 61440) >> 12 | var54 << 4) << 10) & 61440) >> 12
                                             | ((((var54 & 61440) >> 12 | var54 << 4) & 65472) >> 6 | ((var54 & 61440) >> 12 | var54 << 4) << 10) << 4
                                       )
                                       << 0
                              )
                              & 65532
                        )
                        >> 2
                     | (
                           (
                                    (
                                          (((((var54 & 61440) >> 12 | var54 << 4) & 65472) >> 6 | ((var54 & 61440) >> 12 | var54 << 4) << 10) & 61440) >> 12
                                             | ((((var54 & 61440) >> 12 | var54 << 4) & 65472) >> 6 | ((var54 & 61440) >> 12 | var54 << 4) << 10) << 4
                                       )
                                       & 0
                                 )
                                 >> 16
                              | (
                                    (((((var54 & 61440) >> 12 | var54 << 4) & 65472) >> 6 | ((var54 & 61440) >> 12 | var54 << 4) << 10) & 61440) >> 12
                                       | ((((var54 & 61440) >> 12 | var54 << 4) & 65472) >> 6 | ((var54 & 61440) >> 12 | var54 << 4) << 10) << 4
                                 )
                                 << 0
                        )
                        << 14
               )
            );
         }

         Class var6 = Class.forName(var17.toString(), false, Class_335.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = -1324354755 + 587358310 * 587358310 ^ 989109217; var36 < var20.length(); var36 += (-20169415 - 344346793 | 1) & 295833645) {
            int var64 = var20.charAt(var36) - 184 - 170;
            char var65 = (char)(((((var64 & 65535) >> 0 | var64 << 16) ^ 59 ^ 16) + 119 ^ 140) + 17 - 203 + 124);
            var20.setCharAt(var36, (char)(((((var64 & 65535) >> 0 | var64 << 16) ^ 59 ^ 16) + 119 ^ 140) + 17 - 203 + 124));
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_335.class.getClassLoader()).returnType();
         switch ((var4 - 69922945 - 1578003524 + 58226475 + 1013852964 + 596466822 ^ 1328886909 ^ 1384326495) - 372741568 - 1066992067 - 1029903077) {
            case 955448404:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            case 1230407311:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            case 1889572138:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            case 2113738183:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_1757[(var10 ^ 1263840559 ^ 661477494) - 1174190306 - 560594924 - 798519688 - 2086770116 - 3592313 + 55739035 - 667076357 - 1436219516] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
