import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;
import java.util.Iterator;
import java.util.Random;
import net.minecraft.class_1297;
import net.minecraft.class_1299;

public class Class_13 extends Class_342 {
   // $VF: renamed from: jv Class_49
   public Class_49 field_2295;
   // $VF: renamed from: zv Class_105
   public Class_105 field_2296;
   // $VF: renamed from: eoc Class_423
   public Class_423 field_2297;
   // $VF: renamed from: eyr java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_2298 = new MethodHandle[(-2013323161 ^ -2013323161 << 1320061745 | 32) & 407669241];

   public Class_13() {
      int var10001 = (-916158512 << -1425667376 | 0) & 134916296;

      StringBuilder var10002;
      for (var10002 = (StringBuilder)0<"JNT",-2132746845,"ൗ\u0e83ฯ\u0e83ื෯","뼦罨뼯ｺ뽅ｺ㽚罸ｺ罹ｭ㽚｛뽄뼫㼯罹ｭ㼨㾏罵","\u2fe2翢\uefe1翢濦俢翢濢\udfe2濦鿣쿡꿡￢濢\udfe2꿼뿡￢俢쿢뿢꿡",392985630>(
            "偸恹\uf878\ue87eၸ聸桸"
         );
         var10001 < (1498700585 + 1498700585 ^ -1297566123);
         var10001 += (505181057 >> -1583237384 | 1) & 900945249
      ) {
         int var21 = 0<"JNT",-857635535,"\u0e7bງ\u0e63฿\u0de3ื","뼦ｶ㾏｣","\u2fe2翢\uefe1翢濦俢翢濢\udfe2濦鿣쿡꿡￢濢\udfe2꿼뿡￢俢쿢뿢꿡",392985617>(var10002, var10001) ^ '|';
         int var10005 = (var21 & 63488) >> 11;
         int var22 = ((var21 & 63488) >> 11 | var21 << 5) + 45;
         int var69 = (((var21 & 63488) >> 11 | var21 << 5) + 45 & 65535) >> 0;
         char var23 = (char)((((var10005 | var21 << 5) + 45 & 65535) >> 0 | ((var21 & 63488) >> 11 | var21 << 5) + 45 << 16) - 106);
         0<"JNT",-857635535,"\u0e3b\u0e73ื\u0dfbງ\u0e63฿\u0de3ื","뼦ｶ｣㾏罵","\u2fe2翢\uefe1翢濦俢翢濢\udfe2濦鿣쿡꿡￢濢\udfe2꿼뿡￢俢쿢뿢꿡",392985616>(
            var10002, var10001, (char)((var69 | var22 << 16) - 106)
         );
      }

      String var2 = 0<"JNT",-857635535,"ืหරื฿\u0e83ฯ\u0e8b","뼦㾏罨뼯ｺ뽅ｺ㽚罸ｺ罹ｭ㽚｛뽄뼫㼯罹ｭ㼨","\u2fe2翢\uefe1翢濦俢翢濢\udfe2濦鿣쿡꿡￢濢\udfe2꿼뿡￢俢쿢뿢꿡",392985639>(var10002);
      int var11 = (210373913 >> -280252521 | 0) & 645196034;

      StringBuilder var25;
      for (var25 = (StringBuilder)0<"JNT",-2132746845,"ൗ\u0e83ฯ\u0e83ื෯","뼦罨뼯ｺ뽅ｺ㽚罸ｺ罹ｭ㽚｛뽄뼫㼯罹ｭ㼨㾏罵","\u2fe2翢\uefe1翢濦俢翢濢\udfe2濦鿣쿡꿡￢濢\udfe2꿼뿡￢俢쿢뿢꿡",392985622>(
            "㿠翨\uffe7㿨㿩翨\uffe7㿨㿫￪㿖翩￩뿦￪㿖㿫㿨뿪￩翫\uffe7㿨㿖￫翦㿩㿩￪"
         );
         var11 < (-1381479539 << -1732648468 ^ -2068262883);
         var11 += (1401223950 ^ 1401223950 | 1) & -719596975
      ) {
         int var49 = 0<"JNT",-857635535,"\u0e7bງ\u0e63฿\u0de3ื","뼦ｶ㾏｣","\u2fe2翢\uefe1翢濦俢翢濢\udfe2濦鿣쿡꿡￢濢\udfe2꿼뿡￢俢쿢뿢꿡",392985610>(var25, var11);
         int var10006 = (var49 & 63488) >> 11;
         int var50 = (var49 & 63488) >> 11 | var49 << 5;
         int var85 = (((var49 & 63488) >> 11 | var49 << 5) & 65535) >> 0;
         var49 = ((var10006 | var49 << 5) & 65535) >> 0 | ((var49 & 63488) >> 11 | var49 << 5) << 16;
         var10006 = ((var85 | var50 << 16) & 65532) >> 2;
         int var52 = ((var85 | var50 << 16) & 65532) >> 2 | var49 << 14;
         int var87 = ((((var85 | var50 << 16) & 65532) >> 2 | var49 << 14) & 65534) >> 1;
         char var53 = (char)((((var10006 | var49 << 14) & 65534) >> 1 | (((var85 | var50 << 16) & 65532) >> 2 | var49 << 14) << 15) + 200);
         0<"JNT",-857635535,"\u0e3b\u0e73ื\u0dfbງ\u0e63฿\u0de3ื","뼦ｶ｣㾏罵","\u2fe2翢\uefe1翢濦俢翢濢\udfe2濦鿣쿡꿡￢濢\udfe2꿼뿡￢俢쿢뿢꿡",392985605>(
            var25, var11, (char)((var87 | var52 << 15) + 200)
         );
      }

      super(
         var2,
         0<"JNT",-857635535,"ืหරื฿\u0e83ฯ\u0e8b","뼦㾏罨뼯ｺ뽅ｺ㽚罸ｺ罹ｭ㽚｛뽄뼫㼯罹ｭ㼨","\u2fe2翢\uefe1翢濦俢翢濢\udfe2濦鿣쿡꿡￢濢\udfe2꿼뿡￢俢쿢뿢꿡",392985604>(var25),
         -1,
         1<"JNT",-1417423009,"시틜","⥶᷶","忂濂ῄ庇\ueec4࿃",-547088527>()
      );
      var10001 = 584421994 & 1574662788 ^ 13701632;

      for (var10002 = (StringBuilder)0<"JNT",-2132746845,"ൗ\u0e83ฯ\u0e83ื෯","뼦罨뼯ｺ뽅ｺ㽚罸ｺ罹ｭ㽚｛뽄뼫㼯罹ｭ㼨㾏罵","\u2fe2翢\uefe1翢濦俢翢濢\udfe2濦鿣쿡꿡￢濢\udfe2꿼뿡￢俢쿢뿢꿡",392985606>(
            "ȼ͔δʹ̼"
         );
         var10001 < (-509654542 + -321274027 ^ -830928574);
         var10001 += -1848480495 + -547278995 ^ 1899207807
      ) {
         int var28 = 0<"JNT",-857635535,"\u0e7bງ\u0e63฿\u0de3ื","뼦ｶ㾏｣","\u2fe2翢\uefe1翢濦俢翢濢\udfe2濦鿣쿡꿡￢濢\udfe2꿼뿡￢俢쿢뿢꿡",392985628>(var10002, var10001) ^ '4';
         int var74 = (var28 & 64512) >> 10;
         int var29 = (var28 & 64512) >> 10 | var28 << 6;
         int var75 = (((var28 & 64512) >> 10 | var28 << 6) & 0) >> 16;
         int var30 = ((var74 | var28 << 6) & 0) >> 16 | ((var28 & 64512) >> 10 | var28 << 6) << 0;
         var74 = ((var75 | var29 << 0) & 63488) >> 11;
         int var31 = ((var75 | var29 << 0) & 63488) >> 11 | var30 << 5;
         int var77 = ((((var75 | var29 << 0) & 63488) >> 11 | var30 << 5) & 49152) >> 14;
         char var32 = (char)(((var74 | var30 << 5) & 49152) >> 14 | (((var75 | var29 << 0) & 63488) >> 11 | var30 << 5) << 2);
         0<"JNT",-857635535,"\u0e3b\u0e73ื\u0dfbງ\u0e63฿\u0de3ื","뼦ｶ｣㾏罵","\u2fe2翢\uefe1翢濦俢翢濢\udfe2濦鿣쿡꿡￢濢\udfe2꿼뿡￢俢쿢뿢꿡",392985615>(
            var10002, var10001, (char)(var77 | var31 << 2)
         );
      }

      this.field_2295 = (Class_49)0<"JNT",-2132746845,"ൗ\u0e83ฯ\u0e83ื෯","뼦罨뼯ｺ뽅ｺ㽚罸ｺ罹ｭ㽚｛뽄뼫㼯罹ｭ㼨罜罜罜罜㾏罵","쿢鿢",392985666>(
         0<"JNT",-857635535,"ืหරื฿\u0e83ฯ\u0e8b","뼦㾏罨뼯ｺ뽅ｺ㽚罸ｺ罹ｭ㽚｛뽄뼫㼯罹ｭ㼨","\u2fe2翢\uefe1翢濦俢翢濢\udfe2濦鿣쿡꿡￢濢\udfe2꿼뿡￢俢쿢뿢꿡",392985619>(var10002),
         1.0,
         255.0,
         100.0,
         1.0
      );
      var10001 = 2035559479 + 1948311420 ^ -311096397;

      for (var10002 = (StringBuilder)0<"JNT",-2132746845,"ൗ\u0e83ฯ\u0e83ื෯","뼦罨뼯ｺ뽅ｺ㽚罸ｺ罹ｭ㽚｛뽄뼫㼯罹ｭ㼨㾏罵","\u2fe2翢\uefe1翢濦俢翢濢\udfe2濦鿣쿡꿡￢濢\udfe2꿼뿡￢俢쿢뿢꿡",392985629>(
            "\ud8ef僬೬ᓬᳬ僬哬"
         );
         var10001 < ((-242782398 | -242782398 | 5) & 140546103);
         var10001 += 1
      ) {
         int var35 = (0<"JNT",-857635535,"\u0e7bງ\u0e63฿\u0de3ื","뼦ｶ㾏｣","\u2fe2翢\uefe1翢濦俢翢濢\udfe2濦鿣쿡꿡￢濢\udfe2꿼뿡￢俢쿢뿢꿡",392985646>(var10002, var10001) ^ 134)
            - 108;
         int var78 = (var35 & 65024) >> 9;
         int var36 = (var35 & 65024) >> 9 | var35 << 7;
         int var79 = (((var35 & 65024) >> 9 | var35 << 7) & 65534) >> 1;
         char var37 = (char)((((var78 | var35 << 7) & 65534) >> 1 | ((var35 & 65024) >> 9 | var35 << 7) << 15) + 223);
         0<"JNT",-857635535,"\u0e3b\u0e73ื\u0dfbງ\u0e63฿\u0de3ื","뼦ｶ｣㾏罵","\u2fe2翢\uefe1翢濦俢翢濢\udfe2濦鿣쿡꿡￢濢\udfe2꿼뿡￢俢쿢뿢꿡",392985641>(
            var10002, var10001, (char)((var79 | var36 << 15) + 223)
         );
      }

      Class_105 var7 = (Class_105)0<"JNT",-2132746845,"ൗ\u0e83ฯ\u0e83ื෯","뼦罨뼯ｺ뽅ｺ㽚罸ｺ罹ｭ㽚｛뽄뼫㼯罹ｭ㼨罷㾏罵","\udfe2꿡",392985643>(
         0<"JNT",-857635535,"ืหරื฿\u0e83ฯ\u0e8b","뼦㾏罨뼯ｺ뽅ｺ㽚罸ｺ罹ｭ㽚｛뽄뼫㼯罹ｭ㼨","\u2fe2翢\uefe1翢濦俢翢濢\udfe2濦鿣쿡꿡￢濢\udfe2꿼뿡￢俢쿢뿢꿡",392985640>(var10002), false
      );
      int var17 = Integer.MIN_VALUE ^ Integer.MIN_VALUE;

      for (var25 = (StringBuilder)0<"JNT",-2132746845,"ൗ\u0e83ฯ\u0e83ื෯","뼦罨뼯ｺ뽅ｺ㽚罸ｺ罹ｭ㽚｛뽄뼫㼯罹ｭ㼨㾏罵","\u2fe2翢\uefe1翢濦俢翢濢\udfe2濦鿣쿡꿡￢濢\udfe2꿼뿡￢俢쿢뿢꿡",392985626>(
            "ţćĥĉāƻĥƻēĕğĭƻįćęĝƻõęčćƻġćęāāīĥĕćƻăęƻăīĭƻĝęħ"
         );
         var17 < (759097879 - 1753292355 ^ -994194433);
         var17 += 1337980878 & 1337980878 ^ 1337980879
      ) {
         int var62 = 0<"JNT",-857635535,"\u0e7bງ\u0e63฿\u0de3ื","뼦ｶ㾏｣","\u2fe2翢\uefe1翢濦俢翢濢\udfe2濦鿣쿡꿡￢濢\udfe2꿼뿡￢俢쿢뿢꿡",392985599>(var25, var17) - 209;
         int var88 = (var62 & 65534) >> 1;
         int var63 = (((var62 & 65534) >> 1 | var62 << 15) ^ 122) + 17;
         int var89 = ((((var62 & 65534) >> 1 | var62 << 15) ^ 122) + 17 & 0) >> 16;
         char var64 = (char)((((var88 | var62 << 15) ^ 122) + 17 & 0) >> 16 | (((var62 & 65534) >> 1 | var62 << 15) ^ 122) + 17 << 0);
         0<"JNT",-857635535,"\u0e3b\u0e73ื\u0dfbງ\u0e63฿\u0de3ื","뼦ｶ｣㾏罵","\u2fe2翢\uefe1翢濦俢翢濢\udfe2濦鿣쿡꿡￢濢\udfe2꿼뿡￢俢쿢뿢꿡",392985614>(
            var25, var17, (char)(var89 | var63 << 0)
         );
      }

      this.field_2296 = 0<"JNT",-857635535,"\u0e63ำ\u0e77","뼦罨뼯ｺ뽅ｺ㽚罸ｺ罹ｭ㽚｛뽄뼫㼯罹ｭ㼨㾏罨ｭ뼫㼨","\udfe2꿡",392985624>(
         var7, 0<"JNT",-857635535,"ืหරื฿\u0e83ฯ\u0e8b","뼦㾏罨뼯ｺ뽅ｺ㽚罸ｺ罹ｭ㽚｛뽄뼫㼯罹ｭ㼨","\u2fe2翢\uefe1翢濦俢翢濢\udfe2濦鿣쿡꿡￢濢\udfe2꿼뿡￢俢쿢뿢꿡",392985625>(var25)
      );
      var10001 = 1692509834 * -1824723702 ^ 508969828;

      for (var10002 = (StringBuilder)0<"JNT",-2132746845,"ൗ\u0e83ฯ\u0e83ื෯","뼦罨뼯ｺ뽅ｺ㽚罸ｺ罹ｭ㽚｛뽄뼫㼯罹ｭ㼨㾏罵","\u2fe2翢\uefe1翢濦俢翢濢\udfe2濦鿣쿡꿡￢濢\udfe2꿼뿡￢俢쿢뿢꿡",392985627>(
            "ｔＶＹＪ"
         );
         var10001 < (1358106755 >>> -1643408206 ^ 5176);
         var10001 += (-533199402 >> (-380665216 ^ -533199402 >>> -380665216) | 1) & 15
      ) {
         char var42 = 0<"JNT",-857635535,"\u0e7bງ\u0e63฿\u0de3ื","뼦ｶ㾏｣","\u2fe2翢\uefe1翢濦俢翢濢\udfe2濦鿣쿡꿡￢濢\udfe2꿼뿡￢俢쿢뿢꿡",392985621>(var10002, var10001);
         char var45 = (char)(
            ((((((var42 & '￼') >> 2 | var42 << 14) + 216 & 65534) >> 1 | ((var42 & '￼') >> 2 | var42 << 14) + 216 << 15) ^ 95) & 57344) >> 13
               | (((((var42 & '￼') >> 2 | var42 << 14) + 216 & 65534) >> 1 | ((var42 & '￼') >> 2 | var42 << 14) + 216 << 15) ^ 95) << 3
         );
         0<"JNT",-857635535,"\u0e3b\u0e73ื\u0dfbງ\u0e63฿\u0de3ื","뼦ｶ｣㾏罵","\u2fe2翢\uefe1翢濦俢翢濢\udfe2濦鿣쿡꿡￢濢\udfe2꿼뿡￢俢쿢뿢꿡",392985620>(
            var10002,
            var10001,
            (char)(
               ((((((var42 & '￼') >> 2 | var42 << 14) + 216 & 65534) >> 1 | ((var42 & '￼') >> 2 | var42 << 14) + 216 << 15) ^ 95) & 57344) >> 13
                  | (((((var42 & '￼') >> 2 | var42 << 14) + 216 & 65534) >> 1 | ((var42 & '￼') >> 2 | var42 << 14) + 216 << 15) ^ 95) << 3
            )
         );
      }

      this.field_2297 = (Class_423)0<"JNT",-2132746845,"ൗ\u0e83ฯ\u0e83ื෯","뼦罨뼯ｺ뽅ｺ㽚罸ｺ罹ｭ㽚｛뽄뼫㼯罹ｭ㼨㾏罵","\u2fe1\uefe1",392985600>(
         0<"JNT",-857635535,"ืหරื฿\u0e83ฯ\u0e8b","뼦㾏罨뼯ｺ뽅ｺ㽚罸ｺ罹ｭ㽚｛뽄뼫㼯罹ｭ㼨","\u2fe2翢\uefe1翢濦俢翢濢\udfe2濦鿣쿡꿡￢濢\udfe2꿼뿡￢俢쿢뿢꿡",392985601>(var10002)
      );
      0<"JNT",-857635535,"รำ","뼦ｷ罨㼫ｬｬ㼨㾏罵","翢\uefe1",392985612>(
         this,
         new Class_271[]{
            1<"JNT",-1917529018,"웜\uf6dc","ᵶ⟶","忂濂ῄ軄ﻄ࿃",-547088515>(this),
            1<"JNT",-1917529018,"\u06dd\uf6dc","ᵶ⟶","忂濂ῄ뻄\ueec5࿃",-547088516>(this),
            1<"JNT",-1917529018,"닜\udadcꫜ","ᵶ⟶","忂濂ῄ溇껅࿃",-547088521>(this)
         }
      );
   }

   // $VF: renamed from: mg () void
   @Override
   public void method_1407() {
      0<"JNT",1849516319,"ຓ\u0e8b","뼦㾏罵","뿡鿡\uefe2",392985609>(this);
   }

   // $VF: renamed from: q () void
   @Override
   public void method_1408() {
      0<"JNT",1849516319,"ร","뼦㾏罵","뿡鿡\uefe2",392985608>(this);
   }

   // $VF: renamed from: jw (Class_381) void
   @Class_21
   public void method_1926(Class_381 var1) {
      int var14 = 1930838081;
      if (1<"JNT",-1917529018,"뛜시닜컜껜髜\ue2db\uf6dbﻛ\ufadb","⏶ὶ⛶϶⍶ⅶ⏶ὶṶ◶ᵶῶ⛶϶Ṷ⋶ᵶ♶♶ᱶٶնӶ","忂濂ῄ⺆黄軅쿁Ẇ庆⺆黄ﻄ\ueec5\udec4껄軅쿁ﻄຆ\udec4ﻅﻅ쿄뿁迁心࿃",-547092342>(
               1<"JNT",-1917529018,"컜\ue6dc","ᵶ⟶","忂濂ῄ⺆黄軅쿁Ẇ庆⺆黄ﻄ\ueec5\udec4껄軅쿁ﻄຆ\udec4ﻅﻅ쿄迁\uefc1\udfc1࿃",-547092341>(this)
            )
            != null
         && 1<"JNT",-1917529018,"뛜시닜컜껜髜\ue2db\ufadb\ue6db\ueedb","⏶ὶ⛶϶⍶ⅶ⏶ὶṶ◶ᵶῶ⛶϶Ṷ⋶ᵶ♶♶ᱶٶնӶ","忂濂ῄ⺆黄軅쿁Ẇ庆⺆黄ﻄ\ueec5\udec4껄軅쿁ﻄຆ\udec4ﻅﻅ쿄促鿁뿁࿃",-547092340>(
               1<"JNT",-1917529018,"컜\ue6dc","ᵶ⟶","忂濂ῄ⺆黄軅쿁Ẇ庆⺆黄ﻄ\ueec5\udec4껄軅쿁ﻄຆ\udec4ﻅﻅ쿄迁\uefc1\udfc1࿃",-547092339>(this)
            )
            != null) {
         var14 = (-275117862 << -2065650004 + -990211839 | 1827117128) & 1844960223;
      } else {
         var14 = 82320641;
      }

      while (true) {
         switch ((var14 + 1085886623 - 2107290929 ^ 2112968021) + 1098672605 - 340418759 + 1668388663) {
            case -578107600:
               if (0<"JNT",-806796069,"\u0e83\u0e3bෳຓวืใ","뼦㾏罷","\u2fe2翢\uefe1翢濦뿡쿡￢俢濦鿣뿢쿡",392985551>(
                  0<"JNT",-857635535,"็ร\u0e73","뼦㾏罨뼯ｺ뽅ｺ㽚㽅뽄㼯罸㽚｛ｬ뽄㼨","\u2fe1\uefe1",392985564>(1<"JNT",-1917529018,"닜\udadcꫜ","ᵶ⟶","忂濂ῄ溇껅࿃",-547092345>(this))
               )) {
                  return;
               }

               var14 = (323685133 ^ 323685133 | 422254679) & 1039908831;
               break;
            case 844924637:
               float var2 = 1<"JNT",-1917529018,"\uf6dc컜","⡶⥶","忂濂뿂",-547092332>(var1);
               Iterator var3 = 0<"JNT",-806796069,"\u0e83ื\u0e73฿\u0e63ืห฿","뼦㾏罨뼯ｺ뽅ｺ㽚㽅뽄㼯罸㽚ｶ뽄ｬ뼫ｺ뽄ｹ뼫㼨","\u2fe2翢\uefe1翢濦俢翢濢\udfe2濦￼쿡뿢꿡翢꿢俢뿢",392985558>(
                  0<"JNT",-857635535,"ຓ\u0e73ืງห\u0e77\u0e6bണേണണി","뼦㾏罨뼯ｺ뽅ｺ㽚罸ｺ罹ｭ㽚ｶ뽄ｬ뼫ｺ罳罸ｬ㼨","濢뿢쿡濦㿢￢濢뿢鿢꿡翢\uefe2쿡濦鿢俢翢鿡鿡忣\uefe5鿥\u0fe5",392985575>(
                     1<"JNT",-1917529018,"뛜시닜컜껜髜\ue2db\uf6dbﻛ\ufadb","⏶ὶ⛶϶⍶ⅶ⏶ὶṶ◶ᵶῶ⛶϶Ṷ⋶ᵶ♶♶ᱶٶնӶ","忂濂ῄ⺆黄軅쿁Ẇ庆⺆黄ﻄ\ueec5\udec4껄軅쿁ﻄຆ\udec4ﻅﻅ쿄뿁迁心࿃",-547092338>(
                        1<"JNT",-1917529018,"컜\ue6dc","ᵶ⟶","忂濂ῄ⺆黄軅쿁Ẇ庆⺆黄ﻄ\ueec5\udec4껄軅쿁ﻄຆ\udec4ﻅﻅ쿄迁\uefc1\udfc1࿃",-547092337>(this)
                     )
                  )
               );

               label43:
               while (true) {
                  var14 = (331747211 | 1457428619 | -1457381344) & -1423231873;

                  while (true) {
                     switch (((var14 + 1169951092 ^ 388863473) - 334454593 ^ 1749235919) + 1039798141 - 1831663441) {
                        case -1939043826:
                           if (0<"JNT",-806796069,"ງ\u0e63\u0e3bද\u0e73็ื","뼦㾏罷","\u2fe2翢\uefe1翢濦뿡쿡￢俢濦￼쿡뿢꿡翢쿡忢꿡",392985582>(var3)) {
                              class_1297 var4 = (class_1297)0<"JNT",-806796069,"ฯ\u0e73็ื","뼦㾏罨뼯ｺ뽅ｺ㽚罸ｺ罹ｭ㽚ｩ罳뼯ｬｳ뽄㼨","\u2fe2翢\uefe1翢濦뿡쿡￢俢濦￼쿡뿢꿡翢쿡忢꿡",392985577>(
                                 var3
                              );
                              if (var4
                                 != 1<"JNT",-1917529018,"뛜시닜컜껜髜\ue2db\ufadb\ue6db\ueedb","⏶ὶ⛶϶⍶ⅶ⏶ὶṶ◶ᵶῶ⛶϶Ṷ⋶ᵶ♶♶ᱶٶնӶ","忂濂ῄ⺆黄軅쿁Ẇ庆⺆黄ﻄ\ueec5\udec4껄軅쿁ﻄຆ\udec4ﻅﻅ쿄促鿁뿁࿃",-547092331>(
                                    1<"JNT",-1917529018,"컜\ue6dc","ᵶ⟶","忂濂ῄ⺆黄軅쿁Ẇ庆⺆黄ﻄ\ueec5\udec4껄軅쿁ﻄຆ\udec4ﻅﻅ쿄迁\uefc1\udfc1࿃",-547092334>(this)
                                 )) {
                                 class_1299 var5 = 0<"JNT",-857635535,"ຓ\u0e73ืງห\u0e77\u0e6bളേ൏ഷ","뼦㾏罨罹ｬ뽄㽚ｸ㼯罹ｬｳ뼫ｺ罭뽄㽚ｳ罸ｺ㼬㼬｡㾋뾋㼧㼧㼨","濢뿢쿡濦㿢￢濢뿢鿢꿡翢\uefe2쿡濦鿢俢翢鿡鿡忣翥꿥￥\udfe5",392985566>(
                                    var4
                                 );
                                 if (0<"JNT",-857635535,"วปใ","뼦罨罹ｬ뽄㽚ｸ㼯罹ｬｳ뼫ｺ罭뽄㽚ｳ罸ｺ㼬㼬｡㾋뾋㼧㼧㼨㾏罷","\u2fe1\uefe1",392985560>(
                                    1<"JNT",-1917529018,"닜\udadcꫜ","ᵶ⟶","忂濂ῄ溇껅࿃",-547092349>(this), var5
                                 )) {
                                    Class_262 var6 = 0<"JNT",-857635535,"\u0e7fป","뼦罨罹ｬ뽄㽚ｸ㼯罹ｬｳ뼫ｺ罭뽄㽚ｳ罸ｺ㼬㼬｡㾋뾋㼧㼧㼨ｶ㾏罨뼲㽆㼨","翢\uefe1",392985589>(
                                       this,
                                       var5,
                                       0<"JNT",-857635535,"ຏໟ\u0e8b","뼦㾏ｶ","쿢鿢",392985594>(1<"JNT",-1917529018,"웜\uf6dc","ᵶ⟶","忂濂ῄ軄ﻄ࿃",-547088523>(this))
                                    );
                                    double var7 = 0<"JNT",1365671222,"ຓ\u0e73ืງห\u0e77\u0e6bണ൏ഷ഻൏","뼦罜罜罜㾏罜","濢뿢쿡濦㿢￢濢뿢鿢꿡翢\uefe2쿡濦鿢俢翢鿡鿡忣鿥뿥鿥꿥",392985590>(
                                       (double)var2,
                                       1<"JNT",-1917529018,"뛜시닜컜껜髜\uf6db\udedb\ueadbﻛ","⏶ὶ⛶϶⍶ⅶ⏶ὶṶ◶ᵶῶ⛶϶Ṷ⋶ᵶ♶♶ᱶն\u05f6ॶࡶ","忂濂鿂",-547088530>(var4),
                                       0<"JNT",-857635535,"ຓ\u0e73ืງห\u0e77\u0e6bി഻഻ണോ","뼦㾏罜","濢뿢쿡濦㿢￢濢뿢鿢꿡翢\uefe2쿡濦鿢俢翢鿡鿡忣翥꿥￥\udfe5",392985607>(var4)
                                    );
                                    double var9 = 0<"JNT",1365671222,"ຓ\u0e73ืງห\u0e77\u0e6bണ൏ഷ഻൏","뼦罜罜罜㾏罜","濢뿢쿡濦㿢￢濢뿢鿢꿡翢\uefe2쿡濦鿢俢翢鿡鿡忣鿥뿥鿥꿥",392985587>(
                                       (double)var2,
                                       1<"JNT",-1917529018,"뛜시닜컜껜髜\uf2db˜\ufadb\ue2db","⏶ὶ⛶϶⍶ⅶ⏶ὶṶ◶ᵶῶ⛶϶Ṷ⋶ᵶ♶♶ᱶն\u05f6ॶࡶ","忂濂鿂",-547088533>(var4),
                                       0<"JNT",-857635535,"ຓ\u0e73ืງห\u0e77\u0e6bി഻഻ണേ","뼦㾏罜","濢뿢쿡濦㿢￢濢뿢鿢꿡翢\uefe2쿡濦鿢俢翢鿡鿡忣翥꿥￥\udfe5",392985584>(var4)
                                    );
                                    double var11 = 0<"JNT",1365671222,"ຓ\u0e73ืງห\u0e77\u0e6bണ൏ഷ഻൏","뼦罜罜罜㾏罜","濢뿢쿡濦㿢￢濢뿢鿢꿡翢\uefe2쿡濦鿢俢翢鿡鿡忣鿥뿥鿥꿥",392985596>(
                                       (double)var2,
                                       1<"JNT",-1917529018,"뛜시닜컜껜髜\uf2db˜ﻛ˜","⏶ὶ⛶϶⍶ⅶ⏶ὶṶ◶ᵶῶ⛶϶Ṷ⋶ᵶ♶♶ᱶն\u05f6ॶࡶ","忂濂鿂",-547088532>(var4),
                                       0<"JNT",-857635535,"ຓ\u0e73ืງห\u0e77\u0e6bി഻഻ിണ","뼦㾏罜","濢뿢쿡濦㿢￢濢뿢鿢꿡翢\uefe2쿡濦鿢俢翢鿡鿡忣翥꿥￥\udfe5",392985597>(var4)
                                    );
                                    float var13 = 0<"JNT",-857635535,"ຓ\u0e73ืງห\u0e77\u0e6bണോ൏േണ","뼦㾏罝","濢뿢쿡濦㿢￢濢뿢鿢꿡翢\uefe2쿡濦鿢俢翢鿡鿡忣翥꿥￥\udfe5",392985583>(var4)
                                       / 2.0F;
                                    0<"JNT",-857635535,"๏รห","뼦罜罜罜罜罜罜罨뼲㽆㼨罨뼲㽆㼨罨뽄뽄㼨ｶ㾏罵","\udfe2迡\u2fe1",392985595>(
                                       1<"JNT",-1917529018,"ﻜ뻜시","⡶⥶","忂濂ῄ뻄컅溇࿃",-547088552>(var1),
                                       (double)((float)var7 - var13),
                                       (double)((float)var9),
                                       (double)((float)var11 - var13),
                                       (double)((float)var7 + var13),
                                       (double)(
                                          (float)var9
                                             + 0<"JNT",-857635535,"ຓ\u0e73ืງห\u0e77\u0e6bണോ൏േി","뼦㾏罝","濢뿢쿡濦㿢￢濢뿢鿢꿡翢\uefe2쿡濦鿢俢翢鿡鿡忣翥꿥￥\udfe5",392985593>(var4)
                                       ),
                                       (double)((float)var11 + var13),
                                       var6,
                                       var6,
                                       1<"JNT",-1417423009,"쫜뫜","⛶⛶","忂濂ῄ軅軅࿃",-547088542>(),
                                       0
                                    );
                                    if (0<"JNT",-857635535,"\u0e63็","뼦㾏罷","\udfe2꿡",392985573>(
                                       1<"JNT",-1917529018,"\u06dd\uf6dc","ᵶ⟶","忂濂ῄ뻄\ueec5࿃",-547088540>(this)
                                    )) {
                                       0<"JNT",-857635535,"\u0e63\u0e73ฯ","뼦罜罜罜罜罜罜罨뼲㽆㼨㾏罵","\udfe2迡\u2fe1",392985567>(
                                          1<"JNT",-1917529018,"ﻜ뻜시","⡶⥶","忂濂ῄ뻄컅溇࿃",-547092322>(var1),
                                          1<"JNT",-1917529018,"뛜시닜컜껜髜\ue2db\ueadb\uf2db\ue6db","⏶ὶ⛶϶⍶ⅶ⏶ὶṶ◶ᵶῶ⛶϶Ṷ⋶ᵶ♶♶ᱶ\u05f6۶ٶ","忂濂鿂",-547092336>(
                                             1<"JNT",-1417423009,"\udadc닜뫜","⁶⓶⧶","忂濂ῄ⺆黄軅쿁Ẇ庆⺆黄ﻄ\ueec5\udec4껄軅쿁ﻄຆ\udec4ﻅﻅ쿄\uffc1鿁迁࿃",-547092335>()
                                          ),
                                          1<"JNT",-1917529018,"뛜시닜컜껜髜\ue2db\ueadb\uf2db\ue2db","⏶ὶ⛶϶⍶ⅶ⏶ὶṶ◶ᵶῶ⛶϶Ṷ⋶ᵶ♶♶ᱶ\u05f6۶ٶ","忂濂鿂",-547092326>(
                                             1<"JNT",-1417423009,"\udadc닜뫜","⁶⓶⧶","忂濂ῄ⺆黄軅쿁Ẇ庆⺆黄ﻄ\ueec5\udec4껄軅쿁ﻄຆ\udec4ﻅﻅ쿄\uffc1鿁迁࿃",-547092325>()
                                          ),
                                          1<"JNT",-1917529018,"뛜시닜컜껜髜\ue2db\ueadb\uf2db\udedb","⏶ὶ⛶϶⍶ⅶ⏶ὶṶ◶ᵶῶ⛶϶Ṷ⋶ᵶ♶♶ᱶ\u05f6۶ٶ","忂濂鿂",-547092324>(
                                             1<"JNT",-1417423009,"\udadc닜뫜","⁶⓶⧶","忂濂ῄ⺆黄軅쿁Ẇ庆⺆黄ﻄ\ueec5\udec4껄軅쿁ﻄຆ\udec4ﻅﻅ쿄\uffc1鿁迁࿃",-547092323>()
                                          ),
                                          var7,
                                          var9
                                             + (double)(
                                                0<"JNT",-857635535,"ຓ\u0e73ืງห\u0e77\u0e6bണോ൏േി","뼦㾏罝","濢뿢쿡濦㿢￢濢뿢鿢꿡翢\uefe2쿡濦鿢俢翢鿡鿡忣翥꿥￥\udfe5",392985581>(var4)
                                                   / 2.0F
                                             ),
                                          var11,
                                          0<"JNT",-857635535,"\u0e7fป","뼦罨罹ｬ뽄㽚ｸ㼯罹ｬｳ뼫ｺ罭뽄㽚ｳ罸ｺ㼬㼬｡㾋뾋㼧㼧㼨ｶ㾏罨뼲㽆㼨","翢\uefe1",392985580>(this, var5, 255)
                                       );
                                    }
                                 }
                              }
                              continue label43;
                           }

                           var14 = (1009255482 | 49481552) & 117176185;
                           break;
                        case 11875647:
                        default:
                           return;
                     }
                  }
               }
            case 1184599431:
            default:
               return;
         }
      }
   }

   // $VF: renamed from: bk (net.minecraft.class_1299, int) Class_262
   public Class_262 method_1927(class_1299 var1, int var2) {
      Class_262 var3 = 0<"JNT",-857635535,"ທืว","뼦罨罹ｬ뽄㽚ｸ㼯罹ｬｳ뼫ｺ罭뽄㽚ｳ罸ｺ㼬㼬｡㾋뾋㼧㼧㼨㾏罨뼲㽆㼨","\u2fe1\uefe1",392994762>(
         1<"JNT",-1917529018,"닜\udadcꫜ","ᵶ⟶","忂濂ῄ溇껅࿃",-547092347>(this), var1
      );
      if (var3 != null) {
         return (Class_262)0<"JNT",-2132746845,"ൗ\u0e83ฯ\u0e83ื෯","뼦ｶｶｶｶ㾏罵","迡\udfe1",392994758>(
            1<"JNT",-1917529018,"쫜뛜컜","⓶⡶","忂濂濄",-547088577>(var3),
            1<"JNT",-1917529018,"\ueadc틜\ue2dc","⓶⡶","忂濂濄",-547088578>(var3),
            1<"JNT",-1917529018,"뫜ﻜ","⓶⡶","忂濂濄",-547088591>(var3),
            var2
         );
      } else {
         int var4 = 0<"JNT",-857635535,"ງ\u0e63\u0e3bງ\u0dfbห\u0e77\u0e73","뼦㾏ｶ","濢뿢쿡濦㿢￢濢뿢鿢꿡翢\uefe2쿡濦鿢俢翢鿡鿡忣꿥￥\uefe5迥",392994755>(
            0<"JNT",-806796069,"ຓ\u0e73ืງห\u0e77\u0e6bണധിിണ","뼦罨뼯ｺ뽅ｺ㽚罸ｺ罹ｭ㽚ｩ罳뼯ｬｳ뽄㼨㾏罨罹ｬ뽄㽚ｸ㼯罹ｬｳ뼫ｺ罭뽄㽚ｳ罸ｺ㼬㼬｡뾋㼧뼥뾒㼨","濢뿢쿡濦㿢￢濢뿢鿢꿡翢\uefe2쿡濦鿢俢翢鿡鿡忣\udfe5￥꿥꿥",392994752>(
               1<"JNT",-1417423009,"뛜시닜컜껜髜\ueedb\ue2db\ue2db\ufadb\ufadb","⏶ὶ⛶϶⍶ⅶ⏶ὶṶ◶ᵶῶ⛶϶Ṷ⋶ᵶ♶♶ᱶࡶॶ\u05f6ٶ","忂濂ῄ⺆黄軅쿁Ẇ庆⺆黄ﻄ\ueec5\udec4껄軅쿁ﻄຆ\udec4ﻅﻅ쿄促濃\uffc1\uffc1࿃",-547088581>(),
               var1
            )
         );
         Random var5 = (Random)0<"JNT",-2132746845,"ൗ\u0e83ฯ\u0e83ื෯","뼦罟㾏罵","\u2fe2翢\uefe1翢濦뿡쿡￢俢濦꿣翢濢쿢忢㿢",392991154>((long)var4);
         int var6 = 100 + 0<"JNT",-857635535,"ฯ\u0e73็ืฃฯื","뼦ｶ㾏ｶ","\u2fe2翢\uefe1翢濦뿡쿡￢俢濦꿣翢濢쿢忢㿢",392994765>(var5, 156);
         int var7 = 100 + 0<"JNT",-857635535,"ฯ\u0e73็ืฃฯื","뼦ｶ㾏ｶ","\u2fe2翢\uefe1翢濦뿡쿡￢俢濦꿣翢濢쿢忢㿢",392994764>(var5, 156);
         int var8 = 100 + 0<"JNT",-857635535,"ฯ\u0e73็ืฃฯื","뼦ｶ㾏ｶ","\u2fe2翢\uefe1翢濦뿡쿡￢俢濦꿣翢濢쿢忢㿢",392994751>(var5, 156);
         return (Class_262)0<"JNT",-2132746845,"ൗ\u0e83ฯ\u0e83ื෯","뼦ｶｶｶｶ㾏罵","迡\udfe1",392994766>(var6, var7, var8, var2);
      }
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1413(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = (((var10 - 785985715 ^ 417761026) - 161393180 ^ 2087572014) - 1190712777 - 534311926 ^ 1999591130) - 194481036 + 239908641;
      MethodHandle var10000 = field_2298[(((var10 - 785985715 ^ 417761026) - 161393180 ^ 2087572014) - 1190712777 - 534311926 ^ 1999591130)
            - 194481036
            + 239908641
         ^ 1199283203];
      if (field_2298[var10001 ^ 1199283203] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = (-617299687 ^ 1147620926 | 0) & 1621913664; var23 < var13.length(); var23 += 535425435 * 535425435 ^ 975909848) {
            int var42 = var13.charAt(var23) - 27 ^ 75;
            int var10004 = (var42 & 61440) >> 12;
            int var43 = (((var42 & 61440) >> 12 | var42 << 4) ^ 186 ^ 88 ^ 20) - 128 ^ 185;
            int var71 = (((((var42 & 61440) >> 12 | var42 << 4) ^ 186 ^ 88 ^ 20) - 128 ^ 185) & 65472) >> 6;
            char var44 = (char)(
               (
                     ((((var10004 | var42 << 4) ^ 186 ^ 88 ^ 20) - 128 ^ 185) & 65472) >> 6
                        | ((((var42 & 61440) >> 12 | var42 << 4) ^ 186 ^ 88 ^ 20) - 128 ^ 185) << 10
                  )
                  + 222
            );
            var13.setCharAt(var23, (char)((var71 | var43 << 10) + 222));
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = -1984189790 >>> 1842957838 ^ 141038; var29 < var16.length(); var29 += -1548818554 - 125887053 ^ -1674705608) {
            int var49 = var16.charAt(var29) + 'e';
            int var72 = (var49 & 49152) >> 14;
            int var50 = (((var49 & 49152) >> 14 | var49 << 2) ^ 208) + 28 + 35 + 172 ^ 146;
            int var73 = (((((var49 & 49152) >> 14 | var49 << 2) ^ 208) + 28 + 35 + 172 ^ 146) & 65534) >> 1;
            char var51 = (char)(
               (
                        ((((var72 | var49 << 2) ^ 208) + 28 + 35 + 172 ^ 146) & 65534) >> 1
                           | ((((var49 & 49152) >> 14 | var49 << 2) ^ 208) + 28 + 35 + 172 ^ 146) << 15
                     )
                     + 212
                  ^ 185
            );
            var16.setCharAt(var29, (char)((var73 | var50 << 15) + 212 ^ 185));
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_13.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = -1613053623 >> 1245706429 * 1245706429 ^ -3150496; var35 < var19.length(); var35 += 812887401 ^ 812887401 ^ 1) {
            int var56 = (var19.charAt(var35) ^ 'S') - 106 + 226 - 33 - 62 + 30 - 93 + 119;
            char var57 = (char)(((var56 & 61440) >> 12 | var56 << 4) ^ 73);
            var19.setCharAt(var35, (char)(((var56 & 61440) >> 12 | var56 << 4) ^ 73));
         }

         Class var7 = Class.forName(var19.toString(), false, Class_13.class.getClassLoader());
         switch (((var4 ^ 1703821285 ^ 1746297151 ^ 637717244 ^ 2087659700 ^ 1083032575 ^ 552929002) - 317118932 ^ 812332778) + 918501370 + 1745864839) {
            case 54402232:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            case 359729327:
               var10000 = var0.findSpecial(var7, var5, var6, Class_13.class);
               break;
            case 868023611:
               var10000 = var0.findConstructor(var7, var6);
               break;
            case 1944409571:
            case 2008814729:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_2298[(((var10 - 785985715 ^ 417761026) - 161393180 ^ 2087572014) - 1190712777 - 534311926 ^ 1999591130) - 194481036 + 239908641 ^ 1199283203] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1414(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 ^ 1590314873) + 714927262 ^ 1179404836) + 293007511 + 1800862601 - 281878730 - 1387930589 - 450826447 + 223365751;
      MethodHandle var10000 = field_2298[((var10 ^ 1590314873) + 714927262 ^ 1179404836)
         + 293007511
         + 1800862601
         - 281878730
         - 1387930589
         - 450826447
         + 223365751
         + 172009588];
      if (field_2298[var10001 + 172009588] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = 1301946794 & 1301946794 ^ 1301946794; var24 < var14.length(); var24 += 476301718 * 476301718 ^ 1489036261) {
            int var43 = var14.charAt(var24) + '%';
            int var10004 = (var43 & 65528) >> 3;
            int var44 = (var43 & 65528) >> 3 | var43 << 13;
            int var88 = (((var43 & 65528) >> 3 | var43 << 13) & 65528) >> 3;
            var43 = ((var10004 | var43 << 13) & 65528) >> 3 | ((var43 & 65528) >> 3 | var43 << 13) << 13;
            var10004 = ((var88 | var44 << 13) & 65472) >> 6;
            int var46 = ((var88 | var44 << 13) & 65472) >> 6 | var43 << 10;
            int var90 = ((((var88 | var44 << 13) & 65472) >> 6 | var43 << 10) & 61440) >> 12;
            var43 = (((var10004 | var43 << 10) & 61440) >> 12 | (((var88 | var44 << 13) & 65472) >> 6 | var43 << 10) << 4) + 126;
            var10004 = ((var90 | var46 << 4) + 126 & 0) >> 16;
            int var48 = (((var90 | var46 << 4) + 126 & 0) >> 16 | var43 << 0) - 113;
            int var92 = ((((var90 | var46 << 4) + 126 & 0) >> 16 | var43 << 0) - 113 & 65532) >> 2;
            char var49 = (char)((((var10004 | var43 << 0) - 113 & 65532) >> 2 | (((var90 | var46 << 4) + 126 & 0) >> 16 | var43 << 0) - 113 << 14) - 11);
            var14.setCharAt(var24, (char)((var92 | var48 << 14) - 11));
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = 485201426 + -1631384501 ^ -1146183075; var30 < var17.length(); var30 += (-1676440936 >> -718665512 | 1) & 67) {
            int var54 = var17.charAt(var30);
            int var93 = (var54 & 32768) >> 15;
            int var55 = ((var54 & 32768) >> 15 | var54 << 1) - 76 - 156 - 237 ^ 21;
            int var94 = ((((var54 & 32768) >> 15 | var54 << 1) - 76 - 156 - 237 ^ 21) & 0) >> 16;
            var54 = (((var93 | var54 << 1) - 76 - 156 - 237 ^ 21) & 0) >> 16 | (((var54 & 32768) >> 15 | var54 << 1) - 76 - 156 - 237 ^ 21) << 0;
            var93 = ((var94 | var55 << 0) & 64512) >> 10;
            int var57 = (((var94 | var55 << 0) & 64512) >> 10 | var54 << 6) - 19 - 99;
            int var96 = ((((var94 | var55 << 0) & 64512) >> 10 | var54 << 6) - 19 - 99 & 49152) >> 14;
            char var58 = (char)(((var93 | var54 << 6) - 19 - 99 & 49152) >> 14 | (((var94 | var55 << 0) & 64512) >> 10 | var54 << 6) - 19 - 99 << 2);
            var17.setCharAt(var30, (char)(var96 | var57 << 2));
         }

         Class var6 = Class.forName(var17.toString(), false, Class_13.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = (-1198022633 >>> 551460889 | 0) & -498309502; var36 < var20.length(); var36 += -11849555 & 1361911447 ^ 1359548548) {
            int var63 = var20.charAt(var36) - '?' - 231;
            char var66 = (char)(
               (
                     (
                              ((((((var63 & 65520) >> 4 | var63 << 12) ^ 246) & 65520) >> 4 | (((var63 & 65520) >> 4 | var63 << 12) ^ 246) << 12) + 139 ^ 202)
                                    + 105
                                 & 65520
                           )
                           >> 4
                        | ((((((var63 & 65520) >> 4 | var63 << 12) ^ 246) & 65520) >> 4 | (((var63 & 65520) >> 4 | var63 << 12) ^ 246) << 12) + 139 ^ 202)
                              + 105
                           << 12
                  )
                  + 97
            );
            var20.setCharAt(
               var36,
               (char)(
                  (
                        (
                                 (
                                          (((((var63 & 65520) >> 4 | var63 << 12) ^ 246) & 65520) >> 4 | (((var63 & 65520) >> 4 | var63 << 12) ^ 246) << 12)
                                                + 139
                                             ^ 202
                                       )
                                       + 105
                                    & 65520
                              )
                              >> 4
                           | ((((((var63 & 65520) >> 4 | var63 << 12) ^ 246) & 65520) >> 4 | (((var63 & 65520) >> 4 | var63 << 12) ^ 246) << 12) + 139 ^ 202)
                                 + 105
                              << 12
                     )
                     + 97
               )
            );
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_13.class.getClassLoader()).returnType();
         switch ((((var4 ^ 1093657270 ^ 659634678 ^ 1108215200) + 1808161985 ^ 660878331 ^ 419513489 ^ 884715850) - 543585693 ^ 559830111) + 937324849) {
            case 395243814:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            case 675147917:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            case 1597180468:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            case 1935571641:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_2298[((var10 ^ 1590314873) + 714927262 ^ 1179404836) + 293007511 + 1800862601 - 281878730 - 1387930589 - 450826447 + 223365751 + 172009588] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
