import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;
import net.minecraft.class_11909;

public class Class_415 extends Class_375 {
   // $VF: renamed from: lm Class_423
   public Class_423 field_1259;
   // $VF: renamed from: upe java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_1260 = new MethodHandle[35];

   public Class_415(Class_199 var1, Class_271 var2, int var3) {
      super(var1, var2, var3);
      this.field_1259 = (Class_423)var2;
   }

   // $VF: renamed from: vk (RenderEngine_216, int, int, float) void
   @Override
   public void method_1268(RenderEngine_216 var1, int var2, int var3, float var4) {
      int var12 = 312335112;
      int var5 = 0<"JNT",-108154942,"胣胓胣","翄ￄￔ","䷈僈䪈",1422934190>(this) + 5;
      int var6 = 0<"JNT",-108154942,"胕胗脏","翄ￄￔ","䷈僈䪈",1422934089>(this)
         + 0<"JNT",-108154942,"脍脍胿","翄ￄￔ","䷈僈䪈",1422934108>(this)
         + 1<"JNT",864273004,"⸓\ue613\uee13","簵퐵蘵","帪帬幬",-1712115598>(this)
         + 0<"JNT",-108154942,"脑胕","翄ￄￔ","䷈僈䪈",1422934106>(this) / 2;
      int var7 = var6 - 4;
      int var8 = 0<"JNT",-91211888,"胙脅胧能","翄ￄￔ","凈侈䳈侈㫈䲈䱈冈䩈㫈䊈侈䭈",1422934107>(
         0<"JNT",-108154942,"脁胡脑","翄ￄ翖䀥쀠翛쀠ￇￚ翚쀤䀦ￇￖ쀠翘�","䷈䳈",1422934088>(1<"JNT",864273004,"\uf612︒","簵퐵蘵","帪帬干廎廦幐",-1712115596>(this))
      );
      String var10000 = 0<"JNT",-108154942,"胿胻胥","翄ￄ翖䀥쀠翛쀠ￇ䀦쀠䀧쀣ￇ\uffc9翚翙쀤䀧쀣�","䷈䳈",1422934113>(1<"JNT",864273004,"\uf612︒","簵퐵蘵","帪帬干廎廦幐",-1712115599>(this));
      int var11 = var8;
      String var10 = var10000;
      StringBuilder var15 = 0<"JNT",-108154942,"胵胓胓能脏胻","翄翖䀥쀠翛쀠ￇ䀦쀠䀧쀣ￇￗ䀡䀥쀢쀡翚�ￄ翖䀥쀠翛쀠ￇ䀦쀠䀧쀣ￇ\uffc9翚翙쀤䀧쀣翑ￚ쀤䀦䀢쀢翙�","凈侈䳈侈㫈䩈侈䫈儈㫈䐈䱈䯈冈䫈儈䟈䲈冈䩈偈傈䯈",1422934103>(
         (StringBuilder)0<"JNT",1502342611,"腫脅脏脅胛腯","翄ￄ翋","凈侈䳈侈㫈䩈侈䫈儈㫈䐈䱈䯈冈䫈儈䟈䲈冈䩈偈傈䯈",1422934100>(), var10
      );
      int var10001 = (-1260596718 << -1260596718 | 0) & -2043216188;
      StringBuilder var10002 = (StringBuilder)0<"JNT",1502342611,"腫脅脏脅胛腯","翄翖䀥쀠翛쀠ￇ䀦쀠䀧쀣ￇ\uffc9翚翙쀤䀧쀣�ￄ翋","凈侈䳈侈㫈䩈侈䫈儈㫈䐈䱈䯈冈䫈儈䟈䲈冈䩈偈傈䯈",1422934098>("\uf779\uf5b9");

      label32:
      while (true) {
         var12 = 1410841298;

         while (true) {
            label27: {
               StringBuilder var16;
               switch ((var12 + 1335167220 + 140967796 ^ 438008377) - 568786887 + 1072889255 - 1122687462) {
                  case -1859527427:
                     var16 = var10002;
                     if (var10001 < ((-1749376989 >>> -127968478 | 2) & 135284690)) {
                        int var24 = 0<"JNT",-108154942,"胹脃胵胗肵胛","翄ￔￄ\uffd1","凈侈䳈侈㫈䩈侈䫈儈㫈䐈䱈䯈冈䫈儈䟈䲈冈䩈偈傈䯈",1422934109>(var10002, var10001) ^ 134;
                        char var25 = (char)((((var24 & 65504) >> 5 | var24 << 11) + 26 ^ 130) + 223);
                        0<"JNT",-108154942,"胙能胛肹脃胵胗肵胛","翄ￔ\uffd1ￄ翋","凈侈䳈侈㫈䩈侈䫈儈㫈䐈䱈䯈冈䫈儈䟈䲈冈䩈偈傈䯈",1422934112>(
                           var10002, var10001, (char)((((var24 & 65504) >> 5 | var24 << 11) + 26 ^ 130) + 223)
                        );
                        var10001 += -1884670812 ^ 1457677746 ^ -649572073;
                        continue label32;
                     }

                     var12 = 396103141 * 1666563227 ^ -127815419;
                     break;
                  case -1122730103:
                  default:
                     var16 = var10002;
                     if (var10001 < ((-2049606057 & -1419656157 | 4) & 1690082245)) {
                        int var19 = 0<"JNT",-108154942,"胹脃胵胗肵胛","翄ￔￄ\uffd1","凈侈䳈侈㫈䩈侈䫈儈㫈䐈䱈䯈冈䫈儈䟈䲈冈䩈偈傈䯈",1422934031>(var10002, var10001) ^ 137 ^ 122;
                        int var10005 = (var19 & 65520) >> 4;
                        int var20 = ((var19 & 65520) >> 4 | var19 << 12) ^ 190;
                        int var29 = ((((var19 & 65520) >> 4 | var19 << 12) ^ 190) & 65408) >> 7;
                        char var21 = (char)((((var10005 | var19 << 12) ^ 190) & 65408) >> 7 | (((var19 & 65520) >> 4 | var19 << 12) ^ 190) << 9);
                        0<"JNT",-108154942,"胙能胛肹脃胵胗肵胛","翄ￔ\uffd1ￄ翋","凈侈䳈侈㫈䩈侈䫈儈㫈䐈䱈䯈冈䫈儈䟈䲈冈䩈偈傈䯈",1422934090>(var10002, var10001, (char)(var29 | var20 << 9));
                        var10001 += 1624249985 & 269718736 & 1624249985 ^ 1053825;
                        break label27;
                     }

                     var12 = -75499595 & 410872236;
               }

               switch (((var12 ^ 599714697) - 2026326756 ^ 1087831590 ^ 360782579 ^ 1800019897) - 867982657) {
                  case -920295708:
                     String var9 = 0<"JNT",-108154942,"胛脑肙胛胗脅脏脁","翄ￄ翖䀥쀠翛쀠ￇ䀦쀠䀧쀣ￇ\uffc9翚翙쀤䀧쀣�","凈侈䳈侈㫈䩈侈䫈儈㫈䐈䱈䯈冈䫈儈䟈䲈冈䩈偈傈䯈",1422934091>(
                        0<"JNT",-108154942,"胵胓胓能脏胻","翄翖䀥쀠翛쀠ￇ䀦쀠䀧쀣ￇ\uffc9翚翙쀤䀧쀣�ￄ翖䀥쀠翛쀠ￇ䀦쀠䀧쀣ￇ\uffc9翚翙쀤䀧쀣翑ￚ쀤䀦䀢쀢翙�","凈侈䳈侈㫈䩈侈䫈儈㫈䐈䱈䯈冈䫈儈䟈䲈冈䩈偈傈䯈",1422934200>(
                           var15, 0<"JNT",-108154942,"胛脑肙胛胗脅脏脁","翄ￄ翖䀥쀠翛쀠ￇ䀦쀠䀧쀣ￇ\uffc9翚翙쀤䀧쀣�","凈侈䳈侈㫈䩈侈䫈儈㫈䐈䱈䯈冈䫈儈䟈䲈冈䩈偈傈䯈",1422934197>(var16)
                        )
                     );
                     0<"JNT",-108154942,"脁脃","翄翖䀥쀠翛쀠ￇ䀦쀠䀧쀣ￇ\uffc9翚翙쀤䀧쀣�習習翖翘ￛ�ￄ習","䪈䳈",1422934033>(
                        var1, var9, (double)var5, (double)var7, 1<"JNT",785115288,"⸓帓","簵퐵蘵","帪帬干廚廈幐",-1712115583>()
                     );
                     return;
                  case 1002840554:
                  default:
                     var15 = 0<"JNT",-108154942,"胵胓胓能脏胻","翄ￔￄ翖䀥쀠翛쀠ￇ䀦쀠䀧쀣ￇ\uffc9翚翙쀤䀧쀣翑ￚ쀤䀦䀢쀢翙�","凈侈䳈侈㫈䩈侈䫈儈㫈䐈䱈䯈冈䫈儈䟈䲈冈䩈偈傈䯈",1422934201>(
                        0<"JNT",-108154942,"胵胓胓能脏胻","翄翖䀥쀠翛쀠ￇ䀦쀠䀧쀣ￇ\uffc9翚翙쀤䀧쀣�ￄ翖䀥쀠翛쀠ￇ䀦쀠䀧쀣ￇ\uffc9翚翙쀤䀧쀣翑ￚ쀤䀦䀢쀢翙�","凈侈䳈侈㫈䩈侈䫈儈㫈䐈䱈䯈冈䫈儈䟈䲈冈䩈偈傈䯈",1422934110>(
                           var15, 0<"JNT",-108154942,"胛脑肙胛胗脅脏脁","翄ￄ翖䀥쀠翛쀠ￇ䀦쀠䀧쀣ￇ\uffc9翚翙쀤䀧쀣�","凈侈䳈侈㫈䩈侈䫈儈㫈䐈䱈䯈冈䫈儈䟈䲈冈䩈偈傈䯈",1422934099>(var16)
                        ),
                        var11
                     );
                     var10001 = (-923456697 | 1817550795 | 0) & 540704;
                     var10002 = (StringBuilder)0<"JNT",1502342611,"腫脅脏脅胛腯","翄翖䀥쀠翛쀠ￇ䀦쀠䀧쀣ￇ\uffc9翚翙쀤䀧쀣�ￄ翋","凈侈䳈侈㫈䩈侈䫈儈㫈䐈䱈䯈冈䫈儈䟈䲈冈䩈偈傈䯈",1422934092>("\u0b12挐猐ᬐ錐");
               }
            }

            var12 = -610128067 ^ -484318055 ^ -1687170326;
         }
      }
   }

   // $VF: renamed from: yr (net.minecraft.class_11909, boolean) void
   @Override
   public void method_1272(class_11909 var1, boolean var2) {
      if (0<"JNT",-108154942,"脁胣胝","翄習習ￄ翍","䷈僈䪈",1422934029>(
            this,
            0<"JNT",-108154942,"胹脑脍胓肱腛腡腥腣","翄ￄ習","䫈傈䱈㫈䪈冈䫈傈倈䯈侈僈䱈㫈倈䩈侈䰈䰈伈㮈㮈㶈㭈㶈",1422934023>(var1),
            0<"JNT",-108154942,"胹脑脍胓肱腛腡腥腥","翄ￄ習","䫈傈䱈㫈䪈冈䫈傈倈䯈侈僈䱈㫈倈䩈侈䰈䰈伈㮈㮈㶈㭈㶈",1422934018>(var1)
         )
         && 0<"JNT",-108154942,"脍能胛脃脑胻肱腡腛腗腛腝","翄ￄￔ","䫈傈䱈㫈䪈冈䫈傈倈䯈侈僈䱈㫈倈䩈侈䰈䰈伈㮈㮈㶈㭈㶈",1422934032>(var1) == 0) {
         0<"JNT",-108154942,"脍能胛脃脑胻肱腕腝腓腡","翄翖䀧쀢翚ￇ쀦쀤䀧쀢쀡翙쀠䀣翚ￇ쀡䀦쀠\uffd9\uffd9ￏ翺\ufff9\ufffb�ￄ翋","䫈傈䱈㫈䪈冈䫈傈倈䯈侈僈䱈㫈倈䩈侈䰈䰈伈㰈㮈㭈",1422934204>(
            1<"JNT",864273004,"\uf612\ue613","簵퐵蘵","帪帬干庶廄廢幘庴庬庶廄廀廞庼廆廢幘廀庲庼廠廠庸幠幜幚幐",-1712115562>(this),
            (Class_58)0<"JNT",1502342611,"腫脅脏脅胛腯","翄翖翝翛�ￄ翋","偈䯈",1422934185>(1<"JNT",864273004,"\uf612︒","簵퐵蘵","帪帬干廎廦幐",-1712115559>(this))
         );
      }

      0<"JNT",2028061274,"胥胗","翄翖䀧쀢翚ￇ쀦쀤䀧쀢쀡翙쀠䀣翚ￇ쀡䀦쀠\uffd9\uffd9ￏ\ufff8\ufff8￼翸￼�翍ￄ翋","䴈凈",1422934020>(this, var1, var2);
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1293(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 - 1591904973 + 377384305 - 567922662 ^ 446423095) + 530882723 ^ 1273239330) - 1296918292 + 16019165 ^ 1921818282;
      MethodHandle var10000 = field_1260[(
            ((var10 - 1591904973 + 377384305 - 567922662 ^ 446423095) + 530882723 ^ 1273239330) - 1296918292 + 16019165 ^ 1921818282
         )
         + 2055351793];
      if (field_1260[var10001 + 2055351793] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = (110644660 + -1514765862 | 0) & 1098981473;
            var23 < var13.length();
            var23 += (-2053285764 ^ (-1073858038 | -1073858038) | 1) & -2070147071
         ) {
            char var42 = var13.charAt(var23);
            char var47 = (char)(
               (
                        (
                                 (
                                          (
                                                   (
                                                         (
                                                                  (
                                                                        (((var42 & '\ufff8') >> 3 | var42 << '\r') & 32768) >> 15
                                                                           | ((var42 & '\ufff8') >> 3 | var42 << '\r') << 1
                                                                     )
                                                                     & 49152
                                                               )
                                                               >> 14
                                                            | (
                                                                  (((var42 & '\ufff8') >> 3 | var42 << '\r') & 32768) >> 15
                                                                     | ((var42 & '\ufff8') >> 3 | var42 << '\r') << 1
                                                               )
                                                               << 2
                                                      )
                                                      & 32768
                                                )
                                                >> 15
                                             | (
                                                   (
                                                            (
                                                                  (((var42 & '\ufff8') >> 3 | var42 << '\r') & 32768) >> 15
                                                                     | ((var42 & '\ufff8') >> 3 | var42 << '\r') << 1
                                                               )
                                                               & 49152
                                                         )
                                                         >> 14
                                                      | (
                                                            (((var42 & '\ufff8') >> 3 | var42 << '\r') & 32768) >> 15
                                                               | ((var42 & '\ufff8') >> 3 | var42 << '\r') << 1
                                                         )
                                                         << 2
                                                )
                                                << 1
                                       )
                                       + 85
                                    & 65532
                              )
                              >> 2
                           | (
                                    (
                                             (
                                                   (
                                                            (
                                                                  (((var42 & '\ufff8') >> 3 | var42 << '\r') & 32768) >> 15
                                                                     | ((var42 & '\ufff8') >> 3 | var42 << '\r') << 1
                                                               )
                                                               & 49152
                                                         )
                                                         >> 14
                                                      | (
                                                            (((var42 & '\ufff8') >> 3 | var42 << '\r') & 32768) >> 15
                                                               | ((var42 & '\ufff8') >> 3 | var42 << '\r') << 1
                                                         )
                                                         << 2
                                                )
                                                & 32768
                                          )
                                          >> 15
                                       | (
                                             (
                                                      (
                                                            (((var42 & '\ufff8') >> 3 | var42 << '\r') & 32768) >> 15
                                                               | ((var42 & '\ufff8') >> 3 | var42 << '\r') << 1
                                                         )
                                                         & 49152
                                                   )
                                                   >> 14
                                                | ((((var42 & '\ufff8') >> 3 | var42 << '\r') & 32768) >> 15 | ((var42 & '\ufff8') >> 3 | var42 << '\r') << 1)
                                                   << 2
                                          )
                                          << 1
                                 )
                                 + 85
                              << 14
                     )
                     - 95
                  ^ 44
                  ^ 201
                  ^ 181
            );
            var13.setCharAt(
               var23,
               (char)(
                  (
                           (
                                    (
                                             (
                                                      (
                                                            (
                                                                     (
                                                                           (((var42 & '\ufff8') >> 3 | var42 << '\r') & 32768) >> 15
                                                                              | ((var42 & '\ufff8') >> 3 | var42 << '\r') << 1
                                                                        )
                                                                        & 49152
                                                                  )
                                                                  >> 14
                                                               | (
                                                                     (((var42 & '\ufff8') >> 3 | var42 << '\r') & 32768) >> 15
                                                                        | ((var42 & '\ufff8') >> 3 | var42 << '\r') << 1
                                                                  )
                                                                  << 2
                                                         )
                                                         & 32768
                                                   )
                                                   >> 15
                                                | (
                                                      (
                                                               (
                                                                     (((var42 & '\ufff8') >> 3 | var42 << '\r') & 32768) >> 15
                                                                        | ((var42 & '\ufff8') >> 3 | var42 << '\r') << 1
                                                                  )
                                                                  & 49152
                                                            )
                                                            >> 14
                                                         | (
                                                               (((var42 & '\ufff8') >> 3 | var42 << '\r') & 32768) >> 15
                                                                  | ((var42 & '\ufff8') >> 3 | var42 << '\r') << 1
                                                            )
                                                            << 2
                                                   )
                                                   << 1
                                          )
                                          + 85
                                       & 65532
                                 )
                                 >> 2
                              | (
                                       (
                                                (
                                                      (
                                                               (
                                                                     (((var42 & '\ufff8') >> 3 | var42 << '\r') & 32768) >> 15
                                                                        | ((var42 & '\ufff8') >> 3 | var42 << '\r') << 1
                                                                  )
                                                                  & 49152
                                                            )
                                                            >> 14
                                                         | (
                                                               (((var42 & '\ufff8') >> 3 | var42 << '\r') & 32768) >> 15
                                                                  | ((var42 & '\ufff8') >> 3 | var42 << '\r') << 1
                                                            )
                                                            << 2
                                                   )
                                                   & 32768
                                             )
                                             >> 15
                                          | (
                                                (
                                                         (
                                                               (((var42 & '\ufff8') >> 3 | var42 << '\r') & 32768) >> 15
                                                                  | ((var42 & '\ufff8') >> 3 | var42 << '\r') << 1
                                                            )
                                                            & 49152
                                                      )
                                                      >> 14
                                                   | (
                                                         (((var42 & '\ufff8') >> 3 | var42 << '\r') & 32768) >> 15
                                                            | ((var42 & '\ufff8') >> 3 | var42 << '\r') << 1
                                                      )
                                                      << 2
                                             )
                                             << 1
                                    )
                                    + 85
                                 << 14
                        )
                        - 95
                     ^ 44
                     ^ 201
                     ^ 181
               )
            );
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = -1199689354 >> -1199689354 ^ -287; var29 < var16.length(); var29 += (563976146 | -138664722 | 1) & 138545153) {
            int var52 = var16.charAt(var29) ^ '!';
            char var57 = (char)(
               (
                     (
                              (
                                       (
                                                (
                                                      (((((var52 & 0) >> 16 | var52 << 0) & 61440) >> 12 | ((var52 & 0) >> 16 | var52 << 0) << 4) & 65520) >> 4
                                                         | ((((var52 & 0) >> 16 | var52 << 0) & 61440) >> 12 | ((var52 & 0) >> 16 | var52 << 0) << 4) << 12
                                                   )
                                                   & 49152
                                             )
                                             >> 14
                                          | (
                                                (((((var52 & 0) >> 16 | var52 << 0) & 61440) >> 12 | ((var52 & 0) >> 16 | var52 << 0) << 4) & 65520) >> 4
                                                   | ((((var52 & 0) >> 16 | var52 << 0) & 61440) >> 12 | ((var52 & 0) >> 16 | var52 << 0) << 4) << 12
                                             )
                                             << 2
                                    )
                                    + 223
                                 & 65534
                           )
                           >> 1
                        | (
                                 (
                                          (
                                                (((((var52 & 0) >> 16 | var52 << 0) & 61440) >> 12 | ((var52 & 0) >> 16 | var52 << 0) << 4) & 65520) >> 4
                                                   | ((((var52 & 0) >> 16 | var52 << 0) & 61440) >> 12 | ((var52 & 0) >> 16 | var52 << 0) << 4) << 12
                                             )
                                             & 49152
                                       )
                                       >> 14
                                    | (
                                          (((((var52 & 0) >> 16 | var52 << 0) & 61440) >> 12 | ((var52 & 0) >> 16 | var52 << 0) << 4) & 65520) >> 4
                                             | ((((var52 & 0) >> 16 | var52 << 0) & 61440) >> 12 | ((var52 & 0) >> 16 | var52 << 0) << 4) << 12
                                       )
                                       << 2
                              )
                              + 223
                           << 15
                  )
                  ^ 222
                  ^ 49
                  ^ 253
            );
            var16.setCharAt(
               var29,
               (char)(
                  (
                        (
                                 (
                                          (
                                                   (
                                                         (((((var52 & 0) >> 16 | var52 << 0) & 61440) >> 12 | ((var52 & 0) >> 16 | var52 << 0) << 4) & 65520)
                                                               >> 4
                                                            | ((((var52 & 0) >> 16 | var52 << 0) & 61440) >> 12 | ((var52 & 0) >> 16 | var52 << 0) << 4) << 12
                                                      )
                                                      & 49152
                                                )
                                                >> 14
                                             | (
                                                   (((((var52 & 0) >> 16 | var52 << 0) & 61440) >> 12 | ((var52 & 0) >> 16 | var52 << 0) << 4) & 65520) >> 4
                                                      | ((((var52 & 0) >> 16 | var52 << 0) & 61440) >> 12 | ((var52 & 0) >> 16 | var52 << 0) << 4) << 12
                                                )
                                                << 2
                                       )
                                       + 223
                                    & 65534
                              )
                              >> 1
                           | (
                                    (
                                             (
                                                   (((((var52 & 0) >> 16 | var52 << 0) & 61440) >> 12 | ((var52 & 0) >> 16 | var52 << 0) << 4) & 65520) >> 4
                                                      | ((((var52 & 0) >> 16 | var52 << 0) & 61440) >> 12 | ((var52 & 0) >> 16 | var52 << 0) << 4) << 12
                                                )
                                                & 49152
                                          )
                                          >> 14
                                       | (
                                             (((((var52 & 0) >> 16 | var52 << 0) & 61440) >> 12 | ((var52 & 0) >> 16 | var52 << 0) << 4) & 65520) >> 4
                                                | ((((var52 & 0) >> 16 | var52 << 0) & 61440) >> 12 | ((var52 & 0) >> 16 | var52 << 0) << 4) << 12
                                          )
                                          << 2
                                 )
                                 + 223
                              << 15
                     )
                     ^ 222
                     ^ 49
                     ^ 253
               )
            );
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_415.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = (90486751 - 752883498 | 0) & 638730504; var35 < var19.length(); var35 += (-762988918 & 1984012264 | 1) & 738207783) {
            int var62 = var19.charAt(var35);
            int var98 = (var62 & 65535) >> 0;
            int var63 = ((var62 & 65535) >> 0 | var62 << 16) ^ 38;
            int var99 = ((((var62 & 65535) >> 0 | var62 << 16) ^ 38) & 65024) >> 9;
            var62 = ((((var98 | var62 << 16) ^ 38) & 65024) >> 9 | (((var62 & 65535) >> 0 | var62 << 16) ^ 38) << 7) + 235 + 156 ^ 162;
            var98 = (((var99 | var63 << 7) + 235 + 156 ^ 162) & 64512) >> 10;
            int var65 = ((((var99 | var63 << 7) + 235 + 156 ^ 162) & 64512) >> 10 | var62 << 6) - 171 + 125;
            int var101 = (((((var99 | var63 << 7) + 235 + 156 ^ 162) & 64512) >> 10 | var62 << 6) - 171 + 125 & 65528) >> 3;
            char var66 = (char)(
               ((var98 | var62 << 6) - 171 + 125 & 65528) >> 3 | ((((var99 | var63 << 7) + 235 + 156 ^ 162) & 64512) >> 10 | var62 << 6) - 171 + 125 << 13
            );
            var19.setCharAt(var35, (char)(var101 | var65 << 13));
         }

         Class var7 = Class.forName(var19.toString(), false, Class_415.class.getClassLoader());
         switch (((var4 + 1408586337 - 631149992 - 2142906703 ^ 1288642740 ^ 1676481756 ^ 2043033402) - 1395290417 ^ 402333237) - 842964894 + 2061513507) {
            case 67557831:
            case 83518717:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 1077382033:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            case 1379307221:
               var10000 = var0.findSpecial(var7, var5, var6, Class_415.class);
               break;
            case 1694147216:
               var10000 = var0.findConstructor(var7, var6);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_1260[(((var10 - 1591904973 + 377384305 - 567922662 ^ 446423095) + 530882723 ^ 1273239330) - 1296918292 + 16019165 ^ 1921818282) + 2055351793] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1294(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = (var10 - 1463177514 ^ 975131458 ^ 1522165420 ^ 852448369 ^ 1194720914) + 283523579 - 1084225763 + 1874992762 - 1834779231;
      MethodHandle var10000 = field_1260[(var10 - 1463177514 ^ 975131458 ^ 1522165420 ^ 852448369 ^ 1194720914)
         + 283523579
         - 1084225763
         + 1874992762
         - 1834779231
         - 714022261];
      if (field_1260[var10001 - 714022261] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = 777294417 ^ 777294417 ^ 323914293 ^ 323914293; var24 < var14.length(); var24 += (-1604915198 - -801720983 | 1) & 631129095) {
            int var43 = var14.charAt(var24);
            int var10004 = (var43 & 65528) >> 3;
            int var44 = (var43 & 65528) >> 3 | var43 << 13;
            int var88 = (((var43 & 65528) >> 3 | var43 << 13) & 65504) >> 5;
            var43 = ((var10004 | var43 << 13) & 65504) >> 5 | ((var43 & 65528) >> 3 | var43 << 13) << 11;
            var10004 = ((var88 | var44 << 11) & 65024) >> 9;
            int var46 = (((var88 | var44 << 11) & 65024) >> 9 | var43 << 7) + 30 + 217;
            int var90 = ((((var88 | var44 << 11) & 65024) >> 9 | var43 << 7) + 30 + 217 & 64512) >> 10;
            char var47 = (char)(
               (((var10004 | var43 << 7) + 30 + 217 & 64512) >> 10 | (((var88 | var44 << 11) & 65024) >> 9 | var43 << 7) + 30 + 217 << 6) + 183 - 118 ^ 71 ^ 75
            );
            var14.setCharAt(var24, (char)((var90 | var46 << 6) + 183 - 118 ^ 71 ^ 75));
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = -1784282551 - (-1784282551 & -215174226) ^ 75628609; var30 < var17.length(); var30 += (2004746994 | 1060269286) ^ 2138992375) {
            int var52 = var17.charAt(var30) + 250;
            int var91 = (var52 & 0) >> 16;
            int var53 = (var52 & 0) >> 16 | var52 << 0;
            int var92 = (((var52 & 0) >> 16 | var52 << 0) & 65520) >> 4;
            var52 = (((var91 | var52 << 0) & 65520) >> 4 | ((var52 & 0) >> 16 | var52 << 0) << 12) + 190 ^ 51;
            var91 = (((var92 | var53 << 12) + 190 ^ 51) & 49152) >> 14;
            int var55 = ((((var92 | var53 << 12) + 190 ^ 51) & 49152) >> 14 | var52 << 2) + 113;
            int var94 = (((((var92 | var53 << 12) + 190 ^ 51) & 49152) >> 14 | var52 << 2) + 113 & 65408) >> 7;
            char var56 = (char)(
               ((((var91 | var52 << 2) + 113 & 65408) >> 7 | ((((var92 | var53 << 12) + 190 ^ 51) & 49152) >> 14 | var52 << 2) + 113 << 9) ^ 232) - 180
            );
            var17.setCharAt(var30, (char)(((var94 | var55 << 9) ^ 232) - 180));
         }

         Class var6 = Class.forName(var17.toString(), false, Class_415.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = 1242424891 * 1242424891 ^ 1292636569; var36 < var20.length(); var36 += 1745876394 >>> -525939812 - 226956991 ^ 2) {
            char var61 = var20.charAt(var36);
            char var66 = (char)(
               (
                     (
                              (
                                       (
                                             (
                                                      (
                                                            (
                                                                     (
                                                                           (((var61 & '\ue000') >> 13 | var61 << 3) - 57 & 57344) >> 13
                                                                              | ((var61 & '\ue000') >> 13 | var61 << 3) - 57 << 3
                                                                        )
                                                                        & 65408
                                                                  )
                                                                  >> 7
                                                               | (
                                                                     (((var61 & '\ue000') >> 13 | var61 << 3) - 57 & 57344) >> 13
                                                                        | ((var61 & '\ue000') >> 13 | var61 << 3) - 57 << 3
                                                                  )
                                                                  << 9
                                                         )
                                                         & 57344
                                                   )
                                                   >> 13
                                                | (
                                                      (
                                                               (
                                                                     (((var61 & '\ue000') >> 13 | var61 << 3) - 57 & 57344) >> 13
                                                                        | ((var61 & '\ue000') >> 13 | var61 << 3) - 57 << 3
                                                                  )
                                                                  & 65408
                                                            )
                                                            >> 7
                                                         | (
                                                               (((var61 & '\ue000') >> 13 | var61 << 3) - 57 & 57344) >> 13
                                                                  | ((var61 & '\ue000') >> 13 | var61 << 3) - 57 << 3
                                                            )
                                                            << 9
                                                   )
                                                   << 3
                                          )
                                          ^ 66
                                    )
                                    + 88
                                    + 249
                                 & 65528
                           )
                           >> 3
                        | (
                                 (
                                       (
                                                (
                                                      (
                                                               (
                                                                     (((var61 & '\ue000') >> 13 | var61 << 3) - 57 & 57344) >> 13
                                                                        | ((var61 & '\ue000') >> 13 | var61 << 3) - 57 << 3
                                                                  )
                                                                  & 65408
                                                            )
                                                            >> 7
                                                         | (
                                                               (((var61 & '\ue000') >> 13 | var61 << 3) - 57 & 57344) >> 13
                                                                  | ((var61 & '\ue000') >> 13 | var61 << 3) - 57 << 3
                                                            )
                                                            << 9
                                                   )
                                                   & 57344
                                             )
                                             >> 13
                                          | (
                                                (
                                                         (
                                                               (((var61 & '\ue000') >> 13 | var61 << 3) - 57 & 57344) >> 13
                                                                  | ((var61 & '\ue000') >> 13 | var61 << 3) - 57 << 3
                                                            )
                                                            & 65408
                                                      )
                                                      >> 7
                                                   | (
                                                         (((var61 & '\ue000') >> 13 | var61 << 3) - 57 & 57344) >> 13
                                                            | ((var61 & '\ue000') >> 13 | var61 << 3) - 57 << 3
                                                      )
                                                      << 9
                                             )
                                             << 3
                                    )
                                    ^ 66
                              )
                              + 88
                              + 249
                           << 13
                  )
                  + 229
            );
            var20.setCharAt(
               var36,
               (char)(
                  (
                        (
                                 (
                                          (
                                                (
                                                         (
                                                               (
                                                                        (
                                                                              (((var61 & '\ue000') >> 13 | var61 << 3) - 57 & 57344) >> 13
                                                                                 | ((var61 & '\ue000') >> 13 | var61 << 3) - 57 << 3
                                                                           )
                                                                           & 65408
                                                                     )
                                                                     >> 7
                                                                  | (
                                                                        (((var61 & '\ue000') >> 13 | var61 << 3) - 57 & 57344) >> 13
                                                                           | ((var61 & '\ue000') >> 13 | var61 << 3) - 57 << 3
                                                                     )
                                                                     << 9
                                                            )
                                                            & 57344
                                                      )
                                                      >> 13
                                                   | (
                                                         (
                                                                  (
                                                                        (((var61 & '\ue000') >> 13 | var61 << 3) - 57 & 57344) >> 13
                                                                           | ((var61 & '\ue000') >> 13 | var61 << 3) - 57 << 3
                                                                     )
                                                                     & 65408
                                                               )
                                                               >> 7
                                                            | (
                                                                  (((var61 & '\ue000') >> 13 | var61 << 3) - 57 & 57344) >> 13
                                                                     | ((var61 & '\ue000') >> 13 | var61 << 3) - 57 << 3
                                                               )
                                                               << 9
                                                      )
                                                      << 3
                                             )
                                             ^ 66
                                       )
                                       + 88
                                       + 249
                                    & 65528
                              )
                              >> 3
                           | (
                                    (
                                          (
                                                   (
                                                         (
                                                                  (
                                                                        (((var61 & '\ue000') >> 13 | var61 << 3) - 57 & 57344) >> 13
                                                                           | ((var61 & '\ue000') >> 13 | var61 << 3) - 57 << 3
                                                                     )
                                                                     & 65408
                                                               )
                                                               >> 7
                                                            | (
                                                                  (((var61 & '\ue000') >> 13 | var61 << 3) - 57 & 57344) >> 13
                                                                     | ((var61 & '\ue000') >> 13 | var61 << 3) - 57 << 3
                                                               )
                                                               << 9
                                                      )
                                                      & 57344
                                                )
                                                >> 13
                                             | (
                                                   (
                                                            (
                                                                  (((var61 & '\ue000') >> 13 | var61 << 3) - 57 & 57344) >> 13
                                                                     | ((var61 & '\ue000') >> 13 | var61 << 3) - 57 << 3
                                                               )
                                                               & 65408
                                                         )
                                                         >> 7
                                                      | (
                                                            (((var61 & '\ue000') >> 13 | var61 << 3) - 57 & 57344) >> 13
                                                               | ((var61 & '\ue000') >> 13 | var61 << 3) - 57 << 3
                                                         )
                                                         << 9
                                                )
                                                << 3
                                       )
                                       ^ 66
                                 )
                                 + 88
                                 + 249
                              << 13
                     )
                     + 229
               )
            );
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_415.class.getClassLoader()).returnType();
         switch ((var4 + 327552135 + 171360876 ^ 614367638) + 1775484434 + 1224665513 - 836969576 - 1719952268 + 1906490188 + 1719604991 - 731060223) {
            case 789581872:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            case 1020783324:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            case 1224083855:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            case 1320796893:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_1260[(var10 - 1463177514 ^ 975131458 ^ 1522165420 ^ 852448369 ^ 1194720914) + 283523579 - 1084225763 + 1874992762 - 1834779231 - 714022261] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
