import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;
import java.util.Iterator;
import java.util.Map;
import net.minecraft.class_310;
import net.minecraft.class_332;
import net.minecraft.class_408;

public class Class_314 {
   // $VF: renamed from: dg java.lang.String
   public static String field_256 = null;
   // $VF: renamed from: ps int
   public static int field_257 = 0;
   // $VF: renamed from: kyr int
   public static int field_258 = 0;
   // $VF: renamed from: ay boolean
   public static boolean field_259 = false;
   // $VF: renamed from: bpg java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_260 = new MethodHandle[1743445652 ^ -1174633633 << 1743445652 * -1174633633 ^ -1344328029];

   // $VF: renamed from: ti () boolean
   public static boolean method_300() {
      class_310 var0 = 0<"JNT",1414028032,"䒙䐹䑽䐭䒑䐽䑑䎉䍹䍹䎉","କଅᇕྵཅၕ\u0ba5࿅༅ྵཅ\u0e65ཱུ\u0e85༵ၕ\u0ba5\u0e65࿕\u0e85ཥཥລ\u0b65அக\u0be5","뼹뽀뽳뻺뼸뼼뼹뽀뽂뽵뽄뽁뽳뻺뽂뼻뽄뽲뽲뽆뼲뼴뻸",-581870507>();
      return 1<"JNT",-1396791617,"\uf6b2ᚳ隲뚳뚲횽ᚸ횸隸隸","\uec1b鰚谛\uec17ᰚ\udc1b\uec1b鰚㰚Ⱋ尚氚谛\uec17㰚చ尚㰛㰛ﰞ㰗尗䰗","\uf044E끂遀䁁あꁄ쁀A遀䁁恁偂聁၁あꁄ恁끀聁恂恂ꁃう恆⁆\ue045",1507016067>(var0) instanceof class_408;
   }

   // $VF: renamed from: ao (net.minecraft.class_332) void
   public static void method_301(class_332 var0) {
      int var17 = 725995276;
      class_310 var1 = 0<"JNT",1414028032,"䒙䐹䑽䐭䒑䐽䑑䎉䍹䍹䎉","କଅᇕྵཅၕ\u0ba5࿅༅ྵཅ\u0e65ཱུ\u0e85༵ၕ\u0ba5\u0e65࿕\u0e85ཥཥລ\u0b65அக\u0be5","뼹뽀뽳뻺뼸뼼뼹뽀뽂뽵뽄뽁뽳뻺뽂뼻뽄뽲뽲뽆뼲뼴뻸",-581870477>();
      if (!0<"JNT",1414028032,"䑽䐩","କଅᇵ","뽳뽁",-581870476>()) {
         1<"JNT",-945011130,"뚲횲","谛氚","\uf044E끂큀聁၂聁ꁄ끀聁遀⁁ꁄ恄あ偂A遀⁁\ue045",1507016030>(null);
      } else {
         int var2 = 0<"JNT",1706072755,"䒙䐹䑽䐭䒑䐽䑑䍽䍽䍭䍵","କଅᄅ","뼹뽀뽳뻺뼸뼼뼹뽀뽂뽵뽄뽁뽳뻺뽂뼻뽄뽲뽲뽆뼴뻸뼳뼴",-581870494>(
            0<"JNT",1706072755,"䒙䐹䑽䐭䒑䐽䑑䎅䎅䍵䍭䎁","କଅᇕྵཅၕ\u0ba5࿅༅ྵཅ\u0e65ཱུ\u0e85༵ၕ\u0ba5\u0e65࿕\u0e85ཥཥລஅகౕஅ\u0be5","뼹뽀뽳뻺뼸뼼뼹뽀뽂뽵뽄뽁뽳뻺뽂뼻뽄뽲뽲뽆뼲뼴뻸",-581870495>(var1)
         );
         int var3 = 0<"JNT",1706072755,"䒙䐹䑽䐭䒑䐽䑑䍽䍹䎍䎅","କଅᄅ","뼹뽀뽳뻺뼸뼼뼹뽀뽂뽵뽄뽁뽳뻺뽂뼻뽄뽲뽲뽆뼴뻸뼳뼴",-581870492>(
            0<"JNT",1706072755,"䒙䐹䑽䐭䒑䐽䑑䎅䎅䍵䍭䎁","କଅᇕྵཅၕ\u0ba5࿅༅ྵཅ\u0e65ཱུ\u0e85༵ၕ\u0ba5\u0e65࿕\u0e85ཥཥລஅகౕஅ\u0be5","뼹뽀뽳뻺뼸뼼뼹뽀뽂뽵뽄뽁뽳뻺뽂뼻뽄뽲뽲뽆뼲뼴뻸",-581870493>(var1)
         );
         double var4 = 0<"JNT",1706072755,"䒙䐹䑽䐭䒑䐽䑑䎉䍵䎍䎁","କଅᅕ","뼹뽀뽳뻺뼸뼼뼹뽀뽂뽵뽄뽁뽳뻺뽂뼻뽄뽲뽲뽆뼲뼴뼵",-581870490>(
               1<"JNT",-1396791617,"\uf6b2ᚳ隲뚳뚲횽ᚸ횸皸ᚹ","\uec1b鰚谛\uec17ᰚ\udc1b\uec1b鰚㰚Ⱋ尚氚谛\uec17㰚చ尚㰛㰛ﰞ㰗尗䰗","\uf044E끂遀䁁あꁄ쁀A遀䁁恁偂聁၁あꁄ恁끀聁恂恂ꁃ恆聆偆\ue045",1507015918>(
                  var1
               )
            )
            / (double)0<"JNT",1706072755,"䒙䐹䑽䐭䒑䐽䑑䍽䍽䍩䍹","କଅᄅ","뼹뽀뽳뻺뼸뼼뼹뽀뽂뽵뽄뽁뽳뻺뽂뼻뽄뽲뽲뽆뼴뻸뼳뼴",-581870488>(
               0<"JNT",1706072755,"䒙䐹䑽䐭䒑䐽䑑䎅䎅䍵䍭䎁","କଅᇕྵཅၕ\u0ba5࿅༅ྵཅ\u0e65ཱུ\u0e85༵ၕ\u0ba5\u0e65࿕\u0e85ཥཥລஅகౕஅ\u0be5","뼹뽀뽳뻺뼸뼼뼹뽀뽂뽵뽄뽁뽳뻺뽂뼻뽄뽲뽲뽆뼲뼴뻸",-581870489>(var1)
            );
         double var6 = 0<"JNT",1706072755,"䒙䐹䑽䐭䒑䐽䑑䎉䍵䎍䍽","କଅᅕ","뼹뽀뽳뻺뼸뼼뼹뽀뽂뽵뽄뽁뽳뻺뽂뼻뽄뽲뽲뽆뼲뼴뼵",-581870486>(
               1<"JNT",-1396791617,"\uf6b2ᚳ隲뚳뚲횽ᚸ횸皸ᚹ","\uec1b鰚谛\uec17ᰚ\udc1b\uec1b鰚㰚Ⱋ尚氚谛\uec17㰚చ尚㰛㰛ﰞ㰗尗䰗","\uf044E끂遀䁁あꁄ쁀A遀䁁恁偂聁၁あꁄ恁끀聁恂恂ꁃ恆聆偆\ue045",1507016074>(
                  var1
               )
            )
            / (double)0<"JNT",1706072755,"䒙䐹䑽䐭䒑䐽䑑䍽䍽䍩䍹","କଅᄅ","뼹뽀뽳뻺뼸뼼뼹뽀뽂뽵뽄뽁뽳뻺뽂뼻뽄뽲뽲뽆뼴뻸뼳뼴",-581870484>(
               0<"JNT",1706072755,"䒙䐹䑽䐭䒑䐽䑑䎅䎅䍵䍭䎁","କଅᇕྵཅၕ\u0ba5࿅༅ྵཅ\u0e65ཱུ\u0e85༵ၕ\u0ba5\u0e65࿕\u0e85ཥཥລஅகౕஅ\u0be5","뼹뽀뽳뻺뼸뼼뼹뽀뽂뽵뽄뽁뽳뻺뽂뼻뽄뽲뽲뽆뼲뼴뻸",-581870485>(var1)
            );
         boolean var8 = 0<"JNT",1414028032,"䐱䒝䐵䑱䎱䐹䑽䐙䒑䑹䒁䐹䏅䑹䑽䑽䒑䒕","କჵᄅଅᄅ","뼶뽵뼾뻺뼻뽮뼽뼾뼻뻺뼾뼻뽁뽮뻺뼞뼛뼡뽎",-581870481>(
               0<"JNT",1706072755,"䒙䐹䑽䐭䒑䐽䑑䍽䍽䍩䎍","କଅჵ","뼹뽀뽳뻺뼸뼼뼹뽀뽂뽵뽄뽁뽳뻺뽂뼻뽄뽲뽲뽆뼴뻸뼳뼴",-581870482>(
                  0<"JNT",1706072755,"䒙䐹䑽䐭䒑䐽䑑䎅䎅䍵䍭䎁","କଅᇕྵཅၕ\u0ba5࿅༅ྵཅ\u0e65ཱུ\u0e85༵ၕ\u0ba5\u0e65࿕\u0e85ཥཥລஅகౕஅ\u0be5","뼹뽀뽳뻺뼸뼼뼹뽀뽂뽵뽄뽁뽳뻺뽂뼻뽄뽲뽲뽆뼲뼴뻸",-581870483>(
                     var1
                  )
               ),
               0
            )
            == 1;
         Map var9 = 0<"JNT",1414028032,"䒕䐵","କଅᇕ\u0ef5\u0e85ဵ\u0e85\u0ba5၅ၕ༅࿕\u0ba5ᇅ\u0e85ྕ\u0be5","뼼뽱",-581870501>();
         Map var10 = 0<"JNT",1414028032,"䐡䐡䑽","କଅᇕ\u0ef5\u0e85ဵ\u0e85\u0ba5၅ၕ༅࿕\u0ba5ᇅ\u0e85ྕ\u0be5","뼼뽱",-581870500>();
         if (var8
            && !1<"JNT",-982027317,"ᚲᚱ","谛氚","\uf044E큃",1507015910>()
            && 1<"JNT",-982027317,"뚲횲","谛氚","\uf044E끂큀聁၂聁ꁄ끀聁遀⁁ꁄ恄あ偂A遀⁁\ue045",1507015915>() == null) {
            Iterator var11 = 0<"JNT",1447181466,"䐩䑽䐹䒅䑉䑽䒑䒅","କଅᇕ\u0ef5\u0e85ဵ\u0e85\u0ba5၅ၕ༅࿕\u0ba5ᄅၕཅཱུ\u0e85ၕྥཱུ\u0be5","뼽뽄뽱뽄뻺뽰뽳뼼뼻뻺뽒뽀뽳",-581870496>(
               0<"JNT",1447181466,"䐡䐹䑩䐁䐹䑽","କଅᇕ\u0ef5\u0e85ဵ\u0e85\u0ba5၅ၕ༅࿕\u0ba5ᅥཅၕ\u0be5","뼽뽄뽱뽄뻺뽰뽳뼼뼻뻺뼘뽄뼷",-581870497>(var9)
            );

            label91:
            while (0<"JNT",1447181466,"䐭䑉䒁䐕䐹䑭䑽","କଅᇵ","뼽뽄뽱뽄뻺뽰뽳뼼뼻뻺뼜뽳뽀뽵뽄뽳뼶뽵",-581870505>(var11)) {
               String var12 = (String)0<"JNT",1447181466,"䒕䐹䑭䑽","କଅᇕ\u0ef5\u0e85ဵ\u0e85\u0ba5࿕\u0e85ྵ༥\u0ba5ᆥ\u0e75\u0ef5ཅ\u0e65ၕ\u0be5","뼽뽄뽱뽄뻺뽰뽳뼼뼻뻺뼜뽳뽀뽵뽄뽳뼶뽵",-581870504>(
                  var11
               );
               int[] var13 = (int[])0<"JNT",1447181466,"䐱䐹䑽","କᇕ\u0ef5\u0e85ဵ\u0e85\u0ba5࿕\u0e85ྵ༥\u0ba5ᆥ\u0e75\u0ef5ཅ\u0e65ၕ\u0be5ଅᇕ\u0ef5\u0e85ဵ\u0e85\u0ba5࿕\u0e85ྵ༥\u0ba5ᆥ\u0e75\u0ef5ཅ\u0e65ၕ\u0be5","뼽뽄뽱뽄뻺뽰뽳뼼뼻뻺뼘뽄뼷",-581870503>(
                  var9, var12
               );
               int[] var14 = (int[])0<"JNT",1447181466,"䐱䐹䑽","କᇕ\u0ef5\u0e85ဵ\u0e85\u0ba5࿕\u0e85ྵ༥\u0ba5ᆥ\u0e75\u0ef5ཅ\u0e65ၕ\u0be5ଅᇕ\u0ef5\u0e85ဵ\u0e85\u0ba5࿕\u0e85ྵ༥\u0ba5ᆥ\u0e75\u0ef5ཅ\u0e65ၕ\u0be5","뼽뽄뽱뽄뻺뽰뽳뼼뼻뻺뼘뽄뼷",-581870502>(
                  var10, var12
               );
               if (var13 != null && var14 != null) {
                  var17 = -340790018 & -1415059781;

                  while (true) {
                     switch ((var17 ^ 596356709) + 358970826 + 1132748360 - 677655528 + 996339428 - 2123636397) {
                        case 1971370816:
                        default:
                           if (var4 >= (double)var13[0]
                              && var4 < (double)(var13[0] + var14[0])
                              && var6 >= (double)var13[1]
                              && var6 < (double)(var13[1] + var14[1])) {
                              1<"JNT",-945011130,"뚲횲","谛氚","\uf044E끂큀聁၂聁ꁄ끀聁遀⁁ꁄ恄あ偂A遀⁁\ue045",1507016061>(var12);
                              1<"JNT",-945011130,"㚰嚰","谛氚","\uf044EC",1507015922>((int)var4 - var13[0]);
                              1<"JNT",-945011130,"嚳ᚱ皰","谛氚","\uf044EC",1507016023>((int)var6 - var13[1]);
                              break label91;
                           }

                           var17 = (1500819249 << 1500819249 | -1555473008) & -1417839214;
                           break;
                        case 1983341654:
                           continue label91;
                     }
                  }
               }
            }
         }

         var17 = -200450524;

         while (true) {
            switch (var17 - 872993886 + 365316428 + 1649192014 + 1808356901 + 729507598 - 914459852) {
               case -1895294761:
                  if (1<"JNT",-982027317,"뚲횲","谛氚","\uf044E끂큀聁၂聁ꁄ끀聁遀⁁ꁄ恄あ偂A遀⁁\ue045",1507016021>() != null && var8) {
                     int[] var19 = (int[])0<"JNT",1447181466,"䐱䐹䑽","କᇕ\u0ef5\u0e85ဵ\u0e85\u0ba5࿕\u0e85ྵ༥\u0ba5ᆥ\u0e75\u0ef5ཅ\u0e65ၕ\u0be5ଅᇕ\u0ef5\u0e85ဵ\u0e85\u0ba5࿕\u0e85ྵ༥\u0ba5ᆥ\u0e75\u0ef5ཅ\u0e65ၕ\u0be5","뼽뽄뽱뽄뻺뽰뽳뼼뼻뻺뼘뽄뼷",-581870454>(
                        var10, 1<"JNT",-982027317,"뚲횲","谛氚","\uf044E끂큀聁၂聁ꁄ끀聁遀⁁ꁄ恄あ偂A遀⁁\ue045",1507015914>()
                     );
                     int var21 = var19 != null ? var19[0] : 50;
                     int var23 = var19 != null ? var19[1] : 30;
                     int var25 = 0<"JNT",1414028032,"䒙䑉䑭","କᄅᄅଅᄅ","뼽뽄뽱뽄뻺뼻뽄뼹뼾뻺뼘뽄뽳뼿",-581870472>(
                        0,
                        0<"JNT",1414028032,"䒙䐩䒕","କᄅᄅଅᄅ","뼽뽄뽱뽄뻺뼻뽄뼹뼾뻺뼘뽄뽳뼿",-581870473>(
                           var2 - var21, (int)var4 - 1<"JNT",-982027317,"㚰嚰","谛氚","\uf044EC",1507016035>()
                        )
                     );
                     int var26 = 0<"JNT",1414028032,"䒙䑉䑭","କᄅᄅଅᄅ","뼽뽄뽱뽄뻺뼻뽄뼹뼾뻺뼘뽄뽳뼿",-581870469>(
                        0,
                        0<"JNT",1414028032,"䒙䐩䒕","କᄅᄅଅᄅ","뼽뽄뽱뽄뻺뼻뽄뼹뼾뻺뼘뽄뽳뼿",-581870470>(
                           var3 - var23, (int)var6 - 1<"JNT",-982027317,"嚳ᚱ皰","谛氚","\uf044EC",1507016122>()
                        )
                     );
                     0<"JNT",1414028032,"䒙䐩","କᇕ\u0ef5\u0e85ဵ\u0e85\u0ba5࿕\u0e85ྵ༥\u0ba5ᅥၕཱུ༅ྵ༥\u0be5ᄅᄅଅስ","뼼뽱",-581870467>(
                        1<"JNT",-982027317,"뚲횲","谛氚","\uf044E끂큀聁၂聁ꁄ끀聁遀⁁ꁄ恄あ偂A遀⁁\ue045",1507016033>(), var25, var26
                     );
                  }

                  var17 = -2039963774 & -981654222 << (-2039963774 << -981654222) ^ -1870422433;
                  break;
               case -1730498617:
               default:
                  if (!var8) {
                     1<"JNT",-945011130,"뚲횲","谛氚","\uf044E끂큀聁၂聁ꁄ끀聁遀⁁ꁄ恄あ偂A遀⁁\ue045",1507016012>(null);
                  }

                  var17 = 1259569973 >>> -2146477707 ^ -365247124;
                  break;
               case -1413133490:
                  return;
               case -1179063040:
                  1<"JNT",-945011130,"ᚲᚱ","谛氚","\uf044E큃",1507016011>(var8);
                  if (1<"JNT",-982027317,"뚲횲","谛氚","\uf044E끂큀聁၂聁ꁄ끀聁遀⁁ꁄ恄あ偂A遀⁁\ue045",1507016008>() != null) {
                     int[] var18 = (int[])0<"JNT",1447181466,"䐱䐹䑽","କᇕ\u0ef5\u0e85ဵ\u0e85\u0ba5࿕\u0e85ྵ༥\u0ba5ᆥ\u0e75\u0ef5ཅ\u0e65ၕ\u0be5ଅᇕ\u0ef5\u0e85ဵ\u0e85\u0ba5࿕\u0e85ྵ༥\u0ba5ᆥ\u0e75\u0ef5ཅ\u0e65ၕ\u0be5","뼽뽄뽱뽄뻺뽰뽳뼼뼻뻺뼘뽄뼷",-581870463>(
                        var9, 1<"JNT",-982027317,"뚲횲","谛氚","\uf044E끂큀聁၂聁ꁄ끀聁遀⁁ꁄ恄あ偂A遀⁁\ue045",1507016109>()
                     );
                     int[] var20 = (int[])0<"JNT",1447181466,"䐱䐹䑽","କᇕ\u0ef5\u0e85ဵ\u0e85\u0ba5࿕\u0e85ྵ༥\u0ba5ᆥ\u0e75\u0ef5ཅ\u0e65ၕ\u0be5ଅᇕ\u0ef5\u0e85ဵ\u0e85\u0ba5࿕\u0e85ྵ༥\u0ba5ᆥ\u0e75\u0ef5ཅ\u0e65ၕ\u0be5","뼽뽄뽱뽄뻺뽰뽳뼼뼻뻺뼘뽄뼷",-581870461>(
                        var10, 1<"JNT",-982027317,"뚲횲","谛氚","\uf044E끂큀聁၂聁ꁄ끀聁遀⁁ꁄ恄あ偂A遀⁁\ue045",1507016007>()
                     );
                     if (var18 != null && var20 != null) {
                        int var22 = var18[0];
                        int var24 = var18[1];
                        int var15 = var20[0];
                        int var16 = var20[1];
                        0<"JNT",1706072755,"䒙䐹䑽䐭䒑䐽䑑䎅䍹䎅䍩䍽","କᄅᄅᄅᄅᄅଅስ","뼹뽀뽳뻺뼸뼼뼹뽀뽂뽵뽄뽁뽳뻺뽂뼻뽄뽲뽲뽆뼲뼲뼵",-581870460>(
                           var0, var22, var24, var22 + var15, var24 + 1, -2130706433
                        );
                        0<"JNT",1706072755,"䒙䐹䑽䐭䒑䐽䑑䎅䍹䎅䍩䍽","କᄅᄅᄅᄅᄅଅስ","뼹뽀뽳뻺뼸뼼뼹뽀뽂뽵뽄뽁뽳뻺뽂뼻뽄뽲뽲뽆뼲뼲뼵",-581870459>(
                           var0, var22, var24 + var16 - 1, var22 + var15, var24 + var16, -2130706433
                        );
                        0<"JNT",1706072755,"䒙䐹䑽䐭䒑䐽䑑䎅䍹䎅䍩䍽","କᄅᄅᄅᄅᄅଅስ","뼹뽀뽳뻺뼸뼼뼹뽀뽂뽵뽄뽁뽳뻺뽂뼻뽄뽲뽲뽆뼲뼲뼵",-581870458>(
                           var0, var22, var24, var22 + 1, var24 + var16, -2130706433
                        );
                        0<"JNT",1706072755,"䒙䐹䑽䐭䒑䐽䑑䎅䍹䎅䍩䍽","କᄅᄅᄅᄅᄅଅስ","뼹뽀뽳뻺뼸뼼뼹뽀뽂뽵뽄뽁뽳뻺뽂뼻뽄뽲뽲뽆뼲뼲뼵",-581870457>(
                           var0, var22 + var15 - 1, var24, var22 + var15, var24 + var16, -2130706433
                        );
                     }
                  }

                  var17 = (92977662 ^ 92977662 | 116914603) & 922746367;
            }
         }
      }
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_302(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = var10 + 151066776 - 1756695523 + 710302595 - 361507576 + 2090404834 - 1688446928 - 1181378235 + 552569192 + 1397220762;
      MethodHandle var10000 = field_260[var10
         + 151066776
         - 1756695523
         + 710302595
         - 361507576
         + 2090404834
         - 1688446928
         - 1181378235
         + 552569192
         + 1397220762
         + 668334610];
      if (field_260[var10001 + 668334610] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = 158988210 + -586841733 ^ -427853523; var23 < var13.length(); var23 += (473239262 ^ 473239262 | 1) & 890683105) {
            int var42 = var13.charAt(var23) - 'X' + 162;
            int var10004 = (var42 & 49152) >> 14;
            int var43 = ((var42 & 49152) >> 14 | var42 << 2) + 92 ^ 16 ^ 233;
            int var83 = ((((var42 & 49152) >> 14 | var42 << 2) + 92 ^ 16 ^ 233) & 65535) >> 0;
            var42 = (((var10004 | var42 << 2) + 92 ^ 16 ^ 233) & 65535) >> 0 | (((var42 & 49152) >> 14 | var42 << 2) + 92 ^ 16 ^ 233) << 16;
            var10004 = ((var83 | var43 << 16) & 65472) >> 6;
            int var45 = ((var83 | var43 << 16) & 65472) >> 6 | var42 << 10;
            int var85 = ((((var83 | var43 << 16) & 65472) >> 6 | var42 << 10) & 49152) >> 14;
            char var46 = (char)((((var10004 | var42 << 10) & 49152) >> 14 | (((var83 | var43 << 16) & 65472) >> 6 | var42 << 10) << 2) - 196);
            var13.setCharAt(var23, (char)((var85 | var45 << 2) - 196));
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = (366446718 >>> -615755743 | 0) & 1090530240; var29 < var16.length(); var29 += (-1221885354 << -467207796 | 1) & 17340677) {
            int var51 = var16.charAt(var29) - 'u' + 12 - 254 - 192 - 62;
            char var54 = (char)(
               (
                     (
                           (((((var51 & 65528) >> 3 | var51 << 13) & 57344) >> 13 | ((var51 & 65528) >> 3 | var51 << 13) << 3) & 65520) >> 4
                              | ((((var51 & 65528) >> 3 | var51 << 13) & 57344) >> 13 | ((var51 & 65528) >> 3 | var51 << 13) << 3) << 12
                        )
                        ^ 167
                  )
                  - 4
            );
            var16.setCharAt(
               var29,
               (char)(
                  (
                        (
                              (((((var51 & 65528) >> 3 | var51 << 13) & 57344) >> 13 | ((var51 & 65528) >> 3 | var51 << 13) << 3) & 65520) >> 4
                                 | ((((var51 & 65528) >> 3 | var51 << 13) & 57344) >> 13 | ((var51 & 65528) >> 3 | var51 << 13) << 3) << 12
                           )
                           ^ 167
                     )
                     - 4
               )
            );
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_314.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = 445785358 >>> -405388940 ^ 425; var35 < var19.length(); var35 += -262584555 ^ -589807140 ^ 746653384) {
            int var59 = var19.charAt(var35) + 199 + 45;
            int var89 = (var59 & 65534) >> 1;
            int var60 = (var59 & 65534) >> 1 | var59 << 15;
            int var90 = (((var59 & 65534) >> 1 | var59 << 15) & 57344) >> 13;
            var59 = (((var89 | var59 << 15) & 57344) >> 13 | ((var59 & 65534) >> 1 | var59 << 15) << 3) - 43;
            var89 = ((var90 | var60 << 3) - 43 & 65024) >> 9;
            int var62 = ((var90 | var60 << 3) - 43 & 65024) >> 9 | var59 << 7;
            int var92 = ((((var90 | var60 << 3) - 43 & 65024) >> 9 | var59 << 7) & 65024) >> 9;
            char var63 = (char)(((((var89 | var59 << 7) & 65024) >> 9 | (((var90 | var60 << 3) - 43 & 65024) >> 9 | var59 << 7) << 7) ^ 23 ^ 9) + 49);
            var19.setCharAt(var35, (char)(((var92 | var62 << 7) ^ 23 ^ 9) + 49));
         }

         Class var7 = Class.forName(var19.toString(), false, Class_314.class.getClassLoader());
         switch ((var4 + 2052577766 + 157745601 ^ 1917167055 ^ 303579154) - 1555901279 - 1625359743 + 761512655 + 178004386 ^ 1142839933 ^ 1440828975) {
            case 309023560:
            case 625059197:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 591631199:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            case 1302097398:
               var10000 = var0.findConstructor(var7, var6);
               break;
            case 1807866357:
               var10000 = var0.findSpecial(var7, var5, var6, Class_314.class);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_260[var10 + 151066776 - 1756695523 + 710302595 - 361507576 + 2090404834 - 1688446928 - 1181378235 + 552569192 + 1397220762 + 668334610] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_303(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = (((var10 - 1142377540 ^ 1829892004) + 1453455381 + 874502085 + 520435790 ^ 1509919274) - 31881607 ^ 1433334254) + 527430665;
      MethodHandle var10000 = field_260[(((var10 - 1142377540 ^ 1829892004) + 1453455381 + 874502085 + 520435790 ^ 1509919274) - 31881607 ^ 1433334254)
            + 527430665
         ^ 1278654100];
      if (field_260[var10001 ^ 1278654100] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = -1576675054 >>> -1576675054 ^ 10369; var24 < var14.length(); var24 += (-2095494920 - -1531327005 | 1) & 545293449) {
            char var43 = var14.charAt(var24);
            char var50 = (char)(
               (
                        (
                              (
                                       (
                                             (
                                                      (
                                                            (
                                                                  (
                                                                           (
                                                                                 (
                                                                                          (
                                                                                                ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                                                   | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                                             )
                                                                                             & 65024
                                                                                       )
                                                                                       >> 9
                                                                                    | (
                                                                                          ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                                             | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                                       )
                                                                                       << 7
                                                                              )
                                                                              & 63488
                                                                        )
                                                                        >> 11
                                                                     | (
                                                                           (
                                                                                    (
                                                                                          ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                                             | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                                       )
                                                                                       & 65024
                                                                                 )
                                                                                 >> 9
                                                                              | (
                                                                                    ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                                       | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                                 )
                                                                                 << 7
                                                                        )
                                                                        << 5
                                                               )
                                                               ^ 141
                                                         )
                                                         & 65504
                                                   )
                                                   >> 5
                                                | (
                                                      (
                                                            (
                                                                     (
                                                                           (
                                                                                    (
                                                                                          ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                                             | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                                       )
                                                                                       & 65024
                                                                                 )
                                                                                 >> 9
                                                                              | (
                                                                                    ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                                       | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                                 )
                                                                                 << 7
                                                                        )
                                                                        & 63488
                                                                  )
                                                                  >> 11
                                                               | (
                                                                     (
                                                                              (
                                                                                    ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                                       | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                                 )
                                                                                 & 65024
                                                                           )
                                                                           >> 9
                                                                        | (
                                                                              ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                                 | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                           )
                                                                           << 7
                                                                  )
                                                                  << 5
                                                         )
                                                         ^ 141
                                                   )
                                                   << 11
                                          )
                                          & 49152
                                    )
                                    >> 14
                                 | (
                                       (
                                                (
                                                      (
                                                            (
                                                                     (
                                                                           (
                                                                                    (
                                                                                          ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                                             | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                                       )
                                                                                       & 65024
                                                                                 )
                                                                                 >> 9
                                                                              | (
                                                                                    ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                                       | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                                 )
                                                                                 << 7
                                                                        )
                                                                        & 63488
                                                                  )
                                                                  >> 11
                                                               | (
                                                                     (
                                                                              (
                                                                                    ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                                       | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                                 )
                                                                                 & 65024
                                                                           )
                                                                           >> 9
                                                                        | (
                                                                              ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                                 | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                           )
                                                                           << 7
                                                                  )
                                                                  << 5
                                                         )
                                                         ^ 141
                                                   )
                                                   & 65504
                                             )
                                             >> 5
                                          | (
                                                (
                                                      (
                                                               (
                                                                     (
                                                                              (
                                                                                    ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                                       | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                                 )
                                                                                 & 65024
                                                                           )
                                                                           >> 9
                                                                        | (
                                                                              ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                                 | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                           )
                                                                           << 7
                                                                  )
                                                                  & 63488
                                                            )
                                                            >> 11
                                                         | (
                                                               (
                                                                        (
                                                                              ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                                 | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                           )
                                                                           & 65024
                                                                     )
                                                                     >> 9
                                                                  | (
                                                                        ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                           | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                     )
                                                                     << 7
                                                            )
                                                            << 5
                                                   )
                                                   ^ 141
                                             )
                                             << 11
                                    )
                                    << 2
                           )
                           & 0
                     )
                     >> 16
                  | (
                        (
                                 (
                                       (
                                                (
                                                      (
                                                            (
                                                                     (
                                                                           (
                                                                                    (
                                                                                          ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                                             | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                                       )
                                                                                       & 65024
                                                                                 )
                                                                                 >> 9
                                                                              | (
                                                                                    ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                                       | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                                 )
                                                                                 << 7
                                                                        )
                                                                        & 63488
                                                                  )
                                                                  >> 11
                                                               | (
                                                                     (
                                                                              (
                                                                                    ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                                       | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                                 )
                                                                                 & 65024
                                                                           )
                                                                           >> 9
                                                                        | (
                                                                              ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                                 | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                           )
                                                                           << 7
                                                                  )
                                                                  << 5
                                                         )
                                                         ^ 141
                                                   )
                                                   & 65504
                                             )
                                             >> 5
                                          | (
                                                (
                                                      (
                                                               (
                                                                     (
                                                                              (
                                                                                    ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                                       | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                                 )
                                                                                 & 65024
                                                                           )
                                                                           >> 9
                                                                        | (
                                                                              ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                                 | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                           )
                                                                           << 7
                                                                  )
                                                                  & 63488
                                                            )
                                                            >> 11
                                                         | (
                                                               (
                                                                        (
                                                                              ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                                 | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                           )
                                                                           & 65024
                                                                     )
                                                                     >> 9
                                                                  | (
                                                                        ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                           | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                     )
                                                                     << 7
                                                            )
                                                            << 5
                                                   )
                                                   ^ 141
                                             )
                                             << 11
                                    )
                                    & 49152
                              )
                              >> 14
                           | (
                                 (
                                          (
                                                (
                                                      (
                                                               (
                                                                     (
                                                                              (
                                                                                    ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                                       | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                                 )
                                                                                 & 65024
                                                                           )
                                                                           >> 9
                                                                        | (
                                                                              ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                                 | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                           )
                                                                           << 7
                                                                  )
                                                                  & 63488
                                                            )
                                                            >> 11
                                                         | (
                                                               (
                                                                        (
                                                                              ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                                 | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                           )
                                                                           & 65024
                                                                     )
                                                                     >> 9
                                                                  | (
                                                                        ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                           | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                     )
                                                                     << 7
                                                            )
                                                            << 5
                                                   )
                                                   ^ 141
                                             )
                                             & 65504
                                       )
                                       >> 5
                                    | (
                                          (
                                                (
                                                         (
                                                               (
                                                                        (
                                                                              ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                                 | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                           )
                                                                           & 65024
                                                                     )
                                                                     >> 9
                                                                  | (
                                                                        ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                           | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                     )
                                                                     << 7
                                                            )
                                                            & 63488
                                                      )
                                                      >> 11
                                                   | (
                                                         (
                                                                  (
                                                                        ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                           | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                     )
                                                                     & 65024
                                                               )
                                                               >> 9
                                                            | (
                                                                  ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                     | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                               )
                                                               << 7
                                                      )
                                                      << 5
                                             )
                                             ^ 141
                                       )
                                       << 11
                              )
                              << 2
                     )
                     << 0
            );
            var14.setCharAt(
               var24,
               (char)(
                  (
                           (
                                 (
                                          (
                                                (
                                                         (
                                                               (
                                                                     (
                                                                              (
                                                                                    (
                                                                                             (
                                                                                                   ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520)
                                                                                                         >> 4
                                                                                                      | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                                                )
                                                                                                & 65024
                                                                                          )
                                                                                          >> 9
                                                                                       | (
                                                                                             ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                                                | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                                          )
                                                                                          << 7
                                                                                 )
                                                                                 & 63488
                                                                           )
                                                                           >> 11
                                                                        | (
                                                                              (
                                                                                       (
                                                                                             ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                                                | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                                          )
                                                                                          & 65024
                                                                                    )
                                                                                    >> 9
                                                                                 | (
                                                                                       ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                                          | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                                    )
                                                                                    << 7
                                                                           )
                                                                           << 5
                                                                  )
                                                                  ^ 141
                                                            )
                                                            & 65504
                                                      )
                                                      >> 5
                                                   | (
                                                         (
                                                               (
                                                                        (
                                                                              (
                                                                                       (
                                                                                             ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                                                | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                                          )
                                                                                          & 65024
                                                                                    )
                                                                                    >> 9
                                                                                 | (
                                                                                       ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                                          | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                                    )
                                                                                    << 7
                                                                           )
                                                                           & 63488
                                                                     )
                                                                     >> 11
                                                                  | (
                                                                        (
                                                                                 (
                                                                                       ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                                          | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                                    )
                                                                                    & 65024
                                                                              )
                                                                              >> 9
                                                                           | (
                                                                                 ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                                    | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                              )
                                                                              << 7
                                                                     )
                                                                     << 5
                                                            )
                                                            ^ 141
                                                      )
                                                      << 11
                                             )
                                             & 49152
                                       )
                                       >> 14
                                    | (
                                          (
                                                   (
                                                         (
                                                               (
                                                                        (
                                                                              (
                                                                                       (
                                                                                             ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                                                | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                                          )
                                                                                          & 65024
                                                                                    )
                                                                                    >> 9
                                                                                 | (
                                                                                       ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                                          | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                                    )
                                                                                    << 7
                                                                           )
                                                                           & 63488
                                                                     )
                                                                     >> 11
                                                                  | (
                                                                        (
                                                                                 (
                                                                                       ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                                          | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                                    )
                                                                                    & 65024
                                                                              )
                                                                              >> 9
                                                                           | (
                                                                                 ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                                    | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                              )
                                                                              << 7
                                                                     )
                                                                     << 5
                                                            )
                                                            ^ 141
                                                      )
                                                      & 65504
                                                )
                                                >> 5
                                             | (
                                                   (
                                                         (
                                                                  (
                                                                        (
                                                                                 (
                                                                                       ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                                          | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                                    )
                                                                                    & 65024
                                                                              )
                                                                              >> 9
                                                                           | (
                                                                                 ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                                    | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                              )
                                                                              << 7
                                                                     )
                                                                     & 63488
                                                               )
                                                               >> 11
                                                            | (
                                                                  (
                                                                           (
                                                                                 ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                                    | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                              )
                                                                              & 65024
                                                                        )
                                                                        >> 9
                                                                     | (
                                                                           ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                              | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                        )
                                                                        << 7
                                                               )
                                                               << 5
                                                      )
                                                      ^ 141
                                                )
                                                << 11
                                       )
                                       << 2
                              )
                              & 0
                        )
                        >> 16
                     | (
                           (
                                    (
                                          (
                                                   (
                                                         (
                                                               (
                                                                        (
                                                                              (
                                                                                       (
                                                                                             ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                                                | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                                          )
                                                                                          & 65024
                                                                                    )
                                                                                    >> 9
                                                                                 | (
                                                                                       ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                                          | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                                    )
                                                                                    << 7
                                                                           )
                                                                           & 63488
                                                                     )
                                                                     >> 11
                                                                  | (
                                                                        (
                                                                                 (
                                                                                       ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                                          | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                                    )
                                                                                    & 65024
                                                                              )
                                                                              >> 9
                                                                           | (
                                                                                 ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                                    | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                              )
                                                                              << 7
                                                                     )
                                                                     << 5
                                                            )
                                                            ^ 141
                                                      )
                                                      & 65504
                                                )
                                                >> 5
                                             | (
                                                   (
                                                         (
                                                                  (
                                                                        (
                                                                                 (
                                                                                       ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                                          | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                                    )
                                                                                    & 65024
                                                                              )
                                                                              >> 9
                                                                           | (
                                                                                 ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                                    | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                              )
                                                                              << 7
                                                                     )
                                                                     & 63488
                                                               )
                                                               >> 11
                                                            | (
                                                                  (
                                                                           (
                                                                                 ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                                    | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                              )
                                                                              & 65024
                                                                        )
                                                                        >> 9
                                                                     | (
                                                                           ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                              | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                        )
                                                                        << 7
                                                               )
                                                               << 5
                                                      )
                                                      ^ 141
                                                )
                                                << 11
                                       )
                                       & 49152
                                 )
                                 >> 14
                              | (
                                    (
                                             (
                                                   (
                                                         (
                                                                  (
                                                                        (
                                                                                 (
                                                                                       ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                                          | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                                    )
                                                                                    & 65024
                                                                              )
                                                                              >> 9
                                                                           | (
                                                                                 ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                                    | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                              )
                                                                              << 7
                                                                     )
                                                                     & 63488
                                                               )
                                                               >> 11
                                                            | (
                                                                  (
                                                                           (
                                                                                 ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                                    | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                              )
                                                                              & 65024
                                                                        )
                                                                        >> 9
                                                                     | (
                                                                           ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                              | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                        )
                                                                        << 7
                                                               )
                                                               << 5
                                                      )
                                                      ^ 141
                                                )
                                                & 65504
                                          )
                                          >> 5
                                       | (
                                             (
                                                   (
                                                            (
                                                                  (
                                                                           (
                                                                                 ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                                    | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                              )
                                                                              & 65024
                                                                        )
                                                                        >> 9
                                                                     | (
                                                                           ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                              | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                        )
                                                                        << 7
                                                               )
                                                               & 63488
                                                         )
                                                         >> 11
                                                      | (
                                                            (
                                                                     (
                                                                           ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                              | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                        )
                                                                        & 65024
                                                                  )
                                                                  >> 9
                                                               | (
                                                                     ((((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 & 65520) >> 4
                                                                        | (((var43 & '￼') >> 2 | var43 << 14) ^ 226) - 75 << 12
                                                                  )
                                                                  << 7
                                                         )
                                                         << 5
                                                )
                                                ^ 141
                                          )
                                          << 11
                                 )
                                 << 2
                        )
                        << 0
               )
            );
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = (2102381535 * (2102381535 >> 2102381535 - 2102381535) | 0) & -1006628198;
            var30 < var17.length();
            var30 += 1439389955 >>> 1439389955 ^ 179923745
         ) {
            char var55 = var17.charAt(var30);
            char var58 = (char)(
               (
                        (
                                 (
                                          ((((var55 & '\uf000') >> 12 | var55 << 4) ^ 14) + 76 & 49152) >> 14
                                             | (((var55 & '\uf000') >> 12 | var55 << 4) ^ 14) + 76 << 2
                                       )
                                       - 145
                                       - 154
                                    & 65532
                              )
                              >> 2
                           | (((((var55 & '\uf000') >> 12 | var55 << 4) ^ 14) + 76 & 49152) >> 14 | (((var55 & '\uf000') >> 12 | var55 << 4) ^ 14) + 76 << 2)
                                 - 145
                                 - 154
                              << 14
                     )
                     - 189
                     - 43
                  ^ 164
            );
            var17.setCharAt(
               var30,
               (char)(
                  (
                           (
                                    (
                                             ((((var55 & '\uf000') >> 12 | var55 << 4) ^ 14) + 76 & 49152) >> 14
                                                | (((var55 & '\uf000') >> 12 | var55 << 4) ^ 14) + 76 << 2
                                          )
                                          - 145
                                          - 154
                                       & 65532
                                 )
                                 >> 2
                              | (((((var55 & '\uf000') >> 12 | var55 << 4) ^ 14) + 76 & 49152) >> 14 | (((var55 & '\uf000') >> 12 | var55 << 4) ^ 14) + 76 << 2)
                                    - 145
                                    - 154
                                 << 14
                        )
                        - 189
                        - 43
                     ^ 164
               )
            );
         }

         Class var6 = Class.forName(var17.toString(), false, Class_314.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = (-558103731 & -1346223994 | 0) & 555232608; var36 < var20.length(); var36 += (260325414 + 436013028 | 1) & 1448485685) {
            int var63 = var20.charAt(var36) - '2';
            int var103 = (var63 & 63488) >> 11;
            int var64 = ((var63 & 63488) >> 11 | var63 << 5) - 210;
            int var104 = (((var63 & 63488) >> 11 | var63 << 5) - 210 & 32768) >> 15;
            var63 = ((var103 | var63 << 5) - 210 & 32768) >> 15 | ((var63 & 63488) >> 11 | var63 << 5) - 210 << 1;
            var103 = ((var104 | var64 << 1) & 65532) >> 2;
            int var66 = ((var104 | var64 << 1) & 65532) >> 2 | var63 << 14;
            int var106 = ((((var104 | var64 << 1) & 65532) >> 2 | var63 << 14) & 57344) >> 13;
            var63 = ((var103 | var63 << 14) & 57344) >> 13 | (((var104 | var64 << 1) & 65532) >> 2 | var63 << 14) << 3;
            var103 = ((var106 | var66 << 3) & 65528) >> 3;
            int var68 = (((var106 | var66 << 3) & 65528) >> 3 | var63 << 13) ^ 94;
            int var108 = (((((var106 | var66 << 3) & 65528) >> 3 | var63 << 13) ^ 94) & 0) >> 16;
            char var69 = (char)(((((var103 | var63 << 13) ^ 94) & 0) >> 16 | ((((var106 | var66 << 3) & 65528) >> 3 | var63 << 13) ^ 94) << 0) ^ 176);
            var20.setCharAt(var36, (char)((var108 | var68 << 0) ^ 176));
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_314.class.getClassLoader()).returnType();
         switch ((((var4 + 1459174093 ^ 1139429387) - 577899475 + 121399206 - 404051048 - 944302682 ^ 1790281648) + 921307917 ^ 949895941) + 1200072787) {
            case 74542938:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            case 360693635:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            case 820895734:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            case 881495159:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_260[(((var10 - 1142377540 ^ 1829892004) + 1453455381 + 874502085 + 520435790 ^ 1509919274) - 31881607 ^ 1433334254) + 527430665 ^ 1278654100] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
