import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;
import net.minecraft.class_11908;
import net.minecraft.class_11909;

public class Class_343 extends Class_375 {
   // $VF: renamed from: yc Class_262
   public static Class_262 field_1272 = (Class_262)0<"JNT",-952031873,"䀙쁰䁲쁰䁽䀚","Ⱥ¯¯¯ɏǼ","愄曄",903135639>(60, 60, 65);
   // $VF: renamed from: zrv Class_262
   public static Class_262 field_1273 = (Class_262)0<"JNT",-952031873,"䀙쁰䁲쁰䁽䀚","Ⱥ¯¯¯ɏǼ","愄曄",903135710>(240, 240, 240);
   // $VF: renamed from: um float
   public static float field_1274 = 4.0F;
   // $VF: renamed from: lt float
   public static float field_1275 = 2.0F;
   // $VF: renamed from: vwu float
   public static float field_1276 = 8.0F;
   // $VF: renamed from: shs Class_419
   public Class_419 field_1277;
   // $VF: renamed from: itq double
   public double field_1278;
   // $VF: renamed from: qdx double
   public double field_1279;
   // $VF: renamed from: ask Class_262
   public Class_262 field_1280;
   // $VF: renamed from: cyt boolean
   public boolean field_1281;
   // $VF: renamed from: kpg boolean
   public boolean field_1282;
   // $VF: renamed from: vgb double
   public double field_1283;
   // $VF: renamed from: hmy double
   public double field_1284;
   // $VF: renamed from: cme java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_1285 = new MethodHandle[249];

   public Class_343(Class_199 var1, Class_271 var2, int var3) {
      super(var1, var2, var3);
      this.field_1277 = (Class_419)var2;
      this.field_1278 = (double)0<"JNT",-733314636,"䁿䁳䁿","Ⱥɏ¯","晄昄捄",903135462>(this);
      this.field_1279 = (double)(0<"JNT",-733314636,"䁿䁳䁿","Ⱥɏ¯","晄昄捄",903135461>(this) + 0<"JNT",-733314636,"䁰䁷","Ⱥɏ¯","晄昄捄",903135452>(this));
   }

   // $VF: renamed from: vk (RenderEngine_216, int, int, float) void
   @Override
   public void method_1268(RenderEngine_216 var1, int var2, int var3, float var4) {
      1<"JNT",1993169548,"३హ\u0c29","ᣒ᠒ῒ","⸥㸥\uee24",-985749666>(
         this,
         (
                  0<"JNT",-733314636,"쁳쁿","Ⱥɏ®","构恄",903135412>(1<"JNT",-968032826,"৹உ৹","ᣒ᠒ῒ","⸥㸥渫丨縩帤",-985749689>(this))
                     - 0<"JNT",-733314636,"䁿쁱","Ⱥɏ®","构恄",903135354>(1<"JNT",-968032826,"৹உ৹","ᣒ᠒ῒ","⸥㸥渫丨縩帤",-985749691>(this))
               )
               / (
                  0<"JNT",-733314636,"䁱쀔","Ⱥɏ®","构恄",903135360>(1<"JNT",-968032826,"৹உ৹","ᣒ᠒ῒ","⸥㸥渫丨縩帤",-985749669>(this))
                     - 0<"JNT",-733314636,"䁿쁱","Ⱥɏ®","构恄",903135366>(1<"JNT",-968032826,"৹உ৹","ᣒ᠒ῒ","⸥㸥渫丨縩帤",-985749671>(this))
               )
               * (double)(0<"JNT",-733314636,"䁰䁷","Ⱥɏ¯","晄昄捄",903135365>(this) - 10)
            + 5.0
      );
      1<"JNT",1993169548,"உಙ࡙","ᣒ᠒ῒ","⸥㸥\uee24",-985749876>(
         this,
         (
                  0<"JNT",-733314636,"쁷쁼","Ⱥɏ®","构恄",903135362>(1<"JNT",-968032826,"৹உ৹","ᣒ᠒ῒ","⸥㸥渫丨縩帤",-985749667>(this))
                     - 0<"JNT",-733314636,"䁿쁱","Ⱥɏ®","构恄",903135368>(1<"JNT",-968032826,"৹உ৹","ᣒ᠒ῒ","⸥㸥渫丨縩帤",-985749645>(this))
               )
               / (
                  0<"JNT",-733314636,"䁱쀔","Ⱥɏ®","构恄",903135438>(1<"JNT",-968032826,"৹உ৹","ᣒ᠒ῒ","⸥㸥渫丨縩帤",-985749647>(this))
                     - 0<"JNT",-733314636,"䁿쁱","Ⱥɏ®","构恄",903135428>(1<"JNT",-968032826,"৹உ৹","ᣒ᠒ῒ","⸥㸥渫丨縩帤",-985749833>(this))
               )
               * (double)(0<"JNT",-733314636,"䁰䁷","Ⱥɏ¯","晄昄捄",903135427>(this) - 10)
            + 5.0
      );
      1<"JNT",1993169548,"\u0b59ॉ\u09d9","ᣒ᠒ῒ","⸥㸥\uee24",-985749840>(
         this,
         0<"JNT",-1179173477,"䁾쁶䁳","Ⱥɬ®®ɏ®","慄惄揄",903135439>(
            (float)(0.5 * (double)var4),
            1<"JNT",-968032826,"\u0b59ॉ\u09d9","ᣒ᠒ῒ","⸥㸥\uee24",-985749877>(this),
            1<"JNT",-968032826,"३హ\u0c29","ᣒ᠒ῒ","⸥㸥\uee24",-985749878>(this)
         )
      );
      1<"JNT",1993169548,"\u09d9\u0c49ࢉ","ᣒ᠒ῒ","⸥㸥\uee24",-985749852>(
         this,
         0<"JNT",-1179173477,"䁾쁶䁳","Ⱥɬ®®ɏ®","慄惄揄",903135435>(
            (float)(0.5 * (double)var4),
            1<"JNT",-968032826,"\u09d9\u0c49ࢉ","ᣒ᠒ῒ","⸥㸥\uee24",-985749873>(this),
            1<"JNT",-968032826,"உಙ࡙","ᣒ᠒ῒ","⸥㸥\uee24",-985749874>(this)
         )
      );
      int var5 = 0<"JNT",-733314636,"쁼䁼䁲","Ⱥɏ¯","晄昄捄",903135441>(this)
         + 1<"JNT",-968032826,"\u0b79ऩ৹","ᣒ᠒ῒ","⸥㸥㸫",-985749854>(this)
         + 0<"JNT",-733314636,"쁲쁲䁶","Ⱥɏ¯","晄昄捄",903135447>(this)
         + 25;
      int var6 = 0<"JNT",-733314636,"䁿䁳䁿","Ⱥɏ¯","晄昄捄",903135262>(this) + 5;
      int var7 = 0<"JNT",-733314636,"䁰䁷","Ⱥɏ¯","晄昄捄",903135261>(this) - 10;
      0<"JNT",-733314636,"䁲쀕䀕","ȺɦǒǑȝ®®®®®®®®ɏǼ","恄暄",903135443>(
         var1,
         1<"JNT",910514161,"࡙\u0cf9","ᣒ᠒ῒ","⸥㸥渫긩Ḩ帤",-985749850>(),
         (double)var6,
         (double)var5,
         (double)(var6 + var7),
         (double)((float)var5 + 4.0F),
         2.0,
         2.0,
         2.0,
         2.0
      );
      if (1<"JNT",-968032826,"\u09d9\u0c49ࢉ","ᣒ᠒ῒ","⸥㸥\uee24",-985749828>(this) > 1<"JNT",-968032826,"\u0b59ॉ\u09d9","ᣒ᠒ῒ","⸥㸥\uee24",-985749829>(this)) {
         0<"JNT",-733314636,"䁲쀕䀕","ȺɦǒǑȝ®®®®®®®®ɏǼ","恄暄",903135269>(
            var1,
            1<"JNT",-968032826,"\u0b79३\u0b79","ᣒ᠒ῒ","⸥㸥渫긩Ḩ帤",-985749830>(this),
            (double)var6 + 1<"JNT",-968032826,"\u0b59ॉ\u09d9","ᣒ᠒ῒ","⸥㸥\uee24",-985749831>(this) - 5.0,
            (double)var5,
            (double)var6 + 1<"JNT",-968032826,"\u09d9\u0c49ࢉ","ᣒ᠒ῒ","⸥㸥\uee24",-985748960>(this) - 5.0,
            (double)((float)var5 + 4.0F),
            2.0,
            2.0,
            2.0,
            2.0
         );
      }

      String var8 = 0<"JNT",-733314636,"쁾쁷쁱","ȺɏɦȈǷǜǷȹǆǷǄǁȹɥǞǀȏǄǁȝ","晄昄捄",903135451>(this);
      int var9 = 0<"JNT",-733314636,"쁼䁼䁲","Ⱥɏ¯","晄昄捄",903135458>(this)
         + 0<"JNT",-733314636,"쁲쁲䁶","Ⱥɏ¯","晄昄捄",903135457>(this)
         + 1<"JNT",-968032826,"\u0b79ऩ৹","ᣒ᠒ῒ","⸥㸥㸫",-985748974>(this)
         + 9;
      0<"JNT",-733314636,"쁷䁷","ȺɦȈǷǜǷȹǆǷǄǁȹɥǞǀȏǄǁȝ®®ɦǒǑȝɏ®","恄暄",903135395>(
         var1,
         0<"JNT",-733314636,"䁶䀕쁸","ȺɏɦȈǷǜǷȹǆǷǄǁȹɥǞǀȏǄǁȝ","构恄",903135406>(1<"JNT",-968032826,"৹உ৹","ᣒ᠒ῒ","⸥㸥渫丨縩帤",-985748975>(this)),
         (double)(0<"JNT",-733314636,"䁿䁳䁿","Ⱥɏ¯","晄昄捄",903135405>(this) + 5),
         (double)var9,
         1<"JNT",910514161,"\u0b79\u0cd9","ᣒ᠒ῒ","⸥㸥渫긩Ḩ帤",-985749674>()
      );
      double var10 = 0<"JNT",-733314636,"쁸쁾䁰","ȺɦȈǷǜǷȹǆǷǄǁȹɥǞǀȏǄǁȝɏ®","恄暄",903135402>(var1, var8);
      int var12 = (int)((double)(0<"JNT",-733314636,"䁿䁳䁿","Ⱥɏ¯","晄昄捄",903135401>(this) + 0<"JNT",-733314636,"䁰䁷","Ⱥɏ¯","晄昄捄",903135408>(this)) - var10 - 5.0);
      0<"JNT",-733314636,"쁷䁷","ȺɦȈǷǜǷȹǆǷǄǁȹɥǞǀȏǄǁȝ®®ɦǒǑȝɏ®","恄暄",903135414>(
         var1, var8, (double)var12, (double)var9, 1<"JNT",-968032826,"\u0b79३\u0b79","ᣒ᠒ῒ","⸥㸥渫긩Ḩ帤",-985749847>(this)
      );
      float var13 = (float)var5 + 2.0F - 4.0F;
      0<"JNT",-733314636,"䁲쀕䀕","ȺɦǒǑȝ®®®®®®®®ɏǼ","恄暄",903135410>(
         var1,
         1<"JNT",910514161,"\u09a9ऩ३","ᣒ᠒ῒ","⸥㸥渫긩Ḩ帤",-985749841>(),
         (double)((float)((double)var6 + 1<"JNT",-968032826,"\u0b59ॉ\u09d9","ᣒ᠒ῒ","⸥㸥\uee24",-985749842>(this) - 5.0 - 4.0)),
         (double)var13,
         (double)((float)((double)var6 + 1<"JNT",-968032826,"\u0b59ॉ\u09d9","ᣒ᠒ῒ","⸥㸥\uee24",-985749843>(this) - 5.0 + 4.0)),
         (double)(var13 + 8.0F),
         4.0,
         4.0,
         4.0,
         4.0
      );
      0<"JNT",-733314636,"䁲쀕䀕","ȺɦǒǑȝ®®®®®®®®ɏǼ","恄暄",903135358>(
         var1,
         1<"JNT",910514161,"\u09a9ऩ३","ᣒ᠒ῒ","⸥㸥渫긩Ḩ帤",-985749693>(),
         (double)((float)((double)var6 + 1<"JNT",-968032826,"\u09d9\u0c49ࢉ","ᣒ᠒ῒ","⸥㸥\uee24",-985749694>(this) - 5.0 - 4.0)),
         (double)var13,
         (double)((float)((double)var6 + 1<"JNT",-968032826,"\u09d9\u0c49ࢉ","ᣒ᠒ῒ","⸥㸥\uee24",-985749695>(this) - 5.0 + 4.0)),
         (double)(var13 + 8.0F),
         4.0,
         4.0,
         4.0,
         4.0
      );
   }

   // $VF: renamed from: ugk () java.lang.String
   public String method_1297() {
      if (0<"JNT",-733314636,"쁳쁿","Ⱥɏ®","构恄",903135265>(1<"JNT",-968032826,"৹உ৹","ᣒ᠒ῒ","⸥㸥渫丨縩帤",-985748780>(this))
         == 0<"JNT",-733314636,"쁷쁼","Ⱥɏ®","构恄",903135271>(1<"JNT",-968032826,"৹உ৹","ᣒ᠒ῒ","⸥㸥渫丨縩帤",-985748782>(this))) {
         return 0<"JNT",-733314636,"쁸䀕䁼","Ⱥ®ɏɦȈǷǜǷȹǆǷǄǁȹɥǞǀȏǄǁȝ","晄昄捄",903135460>(
            this, 0<"JNT",-733314636,"쁳쁿","Ⱥɏ®","构恄",903135469>(1<"JNT",-968032826,"৹உ৹","ᣒ᠒ῒ","⸥㸥渫丨縩帤",-985748968>(this))
         );
      } else {
         String var2;
         String var1 = var2 = 0<"JNT",-733314636,"쁸䀕䁼","Ⱥ®ɏɦȈǷǜǷȹǆǷǄǁȹɥǞǀȏǄǁȝ","晄昄捄",903135474>(
            this, 0<"JNT",-733314636,"쁷쁼","Ⱥɏ®","构恄",903135467>(1<"JNT",-968032826,"৹உ৹","ᣒ᠒ῒ","⸥㸥渫丨縩帤",-985748882>(this))
         );
         StringBuilder var10000 = 0<"JNT",-733314636,"쀔䁳䁳쁶䁲䀕","ȺɦȈǷǜǷȹǆǷǄǁȹʙǰȈǃǵǞȝɏɦȈǷǜǷȹǆǷǄǁȹɥǞǀȏǄǁʐǓȏǆȎǃǀȝ","掄浄暄浄炄怄浄悄拄炄槄昄憄捄悄拄疄晄捄怄戄扄憄",903135480>(
            (StringBuilder)0<"JNT",-952031873,"䀙쁰䁲쁰䁽䀚","ȺɏǼ","掄浄暄浄炄怄浄悄拄炄槄昄憄捄悄拄疄晄捄怄戄扄憄",903135473>(), var1
         );
         int var10001 = (1294508260 ^ 1294508260 >>> 1829678402 | 0) & 857344;

         StringBuilder var10002;
         for (var10002 = (StringBuilder)0<"JNT",-952031873,"䀙쁰䁲쁰䁽䀚","ȺɦȈǷǜǷȹǆǷǄǁȹɥǞǀȏǄǁȝɏǼ","掄浄暄浄炄怄浄悄拄炄槄昄憄捄悄拄疄晄捄怄戄扄憄",903135479>("ª§ª");
            var10001 < 3;
            var10001 += -604330129 & 67440769
         ) {
            int var5 = (0<"JNT",-733314636,"쀕䁷쀔䁼쀤䁽","Ⱥ¯ɏʕ","掄浄暄浄炄怄浄悄拄炄槄昄憄捄悄拄疄晄捄怄戄扄憄",903135260>(var10002, var10001) ^ 200) - 66;
            char var8 = (char)(
               (((((var5 & 0) >> 16 | var5 << 0) & 65520) >> 4 | ((var5 & 0) >> 16 | var5 << 0) << 12) & 61440) >> 12
                  | ((((var5 & 0) >> 16 | var5 << 0) & 65520) >> 4 | ((var5 & 0) >> 16 | var5 << 0) << 12) << 4
            );
            0<"JNT",-733314636,"쁽쁶䁽쀥䁷쀔䁼쀤䁽","Ⱥ¯ʕɏǼ","掄浄暄浄炄怄浄悄拄炄槄昄憄捄悄拄疄晄捄怄戄扄憄",903135259>(
               var10002,
               var10001,
               (char)(
                  (((((var5 & 0) >> 16 | var5 << 0) & 65520) >> 4 | ((var5 & 0) >> 16 | var5 << 0) << 12) & 61440) >> 12
                     | ((((var5 & 0) >> 16 | var5 << 0) & 65520) >> 4 | ((var5 & 0) >> 16 | var5 << 0) << 12) << 4
               )
            );
         }

         return 0<"JNT",-733314636,"䁽쁳쀍䁽䁼쁰䁲쁷","ȺɏɦȈǷǜǷȹǆǷǄǁȹɥǞǀȏǄǁȝ","掄浄暄浄炄怄浄悄拄炄槄昄憄捄悄拄疄晄捄怄戄扄憄",903135472>(
            0<"JNT",-733314636,"쀔䁳䁳쁶䁲䀕","ȺɦȈǷǜǷȹǆǷǄǁȹʙǰȈǃǵǞȝɏɦȈǷǜǷȹǆǷǄǁȹɥǞǀȏǄǁʐǓȏǆȎǃǀȝ","掄浄暄浄炄怄浄悄拄炄槄昄憄捄悄拄疄晄捄怄戄扄憄",903135465>(
               0<"JNT",-733314636,"쀔䁳䁳쁶䁲䀕","ȺɦȈǷǜǷȹǆǷǄǁȹɥǞǀȏǄǁȝɏɦȈǷǜǷȹǆǷǄǁȹɥǞǀȏǄǁʐǓȏǆȎǃǀȝ","掄浄暄浄炄怄浄悄拄炄槄昄憄捄悄拄疄晄捄怄戄扄憄",903135466>(
                  var10000, 0<"JNT",-733314636,"䁽쁳쀍䁽䁼쁰䁲쁷","ȺɏɦȈǷǜǷȹǆǷǄǁȹɥǞǀȏǄǁȝ","掄浄暄浄炄怄浄悄拄炄槄昄憄捄悄拄疄晄捄怄戄扄憄",903135459>(var10002)
               ),
               var2
            )
         );
      }
   }

   // $VF: renamed from: ydr (double) java.lang.String
   // $VF: Irreducible bytecode was duplicated to produce valid code
   public String method_1298(double var1) {
      int var5 = -481181491;
      double var3 = 0<"JNT",-733314636,"䁽䁷","Ⱥɏ®","构恄",903135417>(1<"JNT",-968032826,"৹உ৹","ᣒ᠒ῒ","⸥㸥渫丨縩帤",-985748964>(this));
      int var10000;
      StringBuilder var10001;
      if (var3 == 0.1) {
         var10000 = (-2026329358 | -2026329358) ^ -2026329358;
         var10001 = (StringBuilder)0<"JNT",-952031873,"䀙쁰䁲쁰䁽䀚","ȺɦȈǷǜǷȹǆǷǄǁȹɥǞǀȏǄǁȝɏǼ","掄浄暄浄炄怄浄悄拄炄槄昄憄捄悄拄疄晄捄怄戄扄憄",903135424>("偱\ue071ၲ恵");
         var5 = (89138348 - 89138348 | 456172516) & -1678442515;
      } else {
         var5 = -1012764485 - 2118283156 ^ -1360041640;

         label84:
         while (true) {
            switch ((var5 ^ 1213406124) + 564801204 + 2173733 + 262411500 + 2133504612 + 1386878897) {
               case -1811360575:
                  return 0<"JNT",-1179173477,"䁾쀔䁱쁾쁶쀃䁶","Ⱥ®ɏɦȈǷǜǷȹǆǷǄǁȹɥǞǀȏǄǁȝ","掄浄暄浄炄怄浄悄拄炄槄昄憄捄悄拄",903135498>(var1);
               case -1491030867:
               default:
                  if (var3 == 0.01) {
                     var10000 = -1125771956 >>> 1296156130 ^ 792298835;
                     var10001 = (StringBuilder)0<"JNT",-952031873,"䀙쁰䁲쁰䁽䀚","ȺɦȈǷǜǷȹǆǷǄǁȹɥǞǀȏǄǁȝɏǼ","掄浄暄浄炄怄浄悄拄炄槄昄憄捄悄拄疄晄捄怄戄扄憄",903135429>("ɲ̂͂ڂ");
                     var5 = (-1440343654 & -1440343654 | -1722433502) & -581581514;
                     break label84;
                  }

                  var5 = (585587090 ^ 1075945260 | 403457553) & 472673905;
                  continue;
               case 1403229815:
                  if (var3 == 0.001) {
                     var10000 = (97092430 * -505827433 | 0) & -935251916;
                     var10001 = (StringBuilder)0<"JNT",-952031873,"䀙쁰䁲쁰䁽䀚","ȺɦȈǷǜǷȹǆǷǄǁȹɥǞǀȏǄǁȝɏǼ","掄浄暄浄炄怄浄悄拄炄槄昄憄捄悄拄疄晄捄怄戄扄憄",903135497>("ናᜓᦓ㌓");
                     var5 = (-695505909 & -59352245 | 33005962) & 1778360746;
                     break label84;
                  }

                  var5 = (-1965525062 | -1341758487 | 4262607) & 1767971567;
                  continue;
               case 1666595357:
            }

            if (var3 >= 1.0) {
               var10000 = 99306855 & 99306855 ^ 99306855;
               var10001 = (StringBuilder)0<"JNT",-952031873,"䀙쁰䁲쁰䁽䀚","ȺɦȈǷǜǷȹǆǷǄǁȹɥǞǀȏǄǁȝɏǼ","掄浄暄浄炄怄浄悄拄炄槄昄憄捄悄拄疄晄捄怄戄扄憄",903135420>("ꃒ샓Ô샚");
               var5 = (-2071928989 - 1473614027 | 1181726018) & -940591769;
               break;
            }

            var5 = (1330127410 - 490845297 | -929857526) & -589332353;
         }
      }

      label70:
      while (true) {
         switch ((var5 ^ 647408611) + 21829596 + 723743665 + 659351772 + 1488555883 ^ 277444466) {
            case -90932055:
               var9 = var10001;
               if (var10000 >= ((-71718293 >>> -1181360284 | 0) & 805323781)) {
                  var5 = (-165397960 + -165397960 | 1446183060) & -540161;
                  break label70;
               }

               int var30 = 0<"JNT",-733314636,"쀕䁷쀔䁼쀤䁽","Ⱥ¯ɏʕ","掄浄暄浄炄怄浄悄拄炄槄昄憄捄悄拄疄晄捄怄戄扄憄",903135476>(var10001, var10000) - 145;
               char var33 = (char)(
                  (((((var30 & 65535) >> 0 | var30 << 16) + 34 & 65532) >> 2 | ((var30 & 65535) >> 0 | var30 << 16) + 34 << 14) & 64512) >> 10
                     | ((((var30 & 65535) >> 0 | var30 << 16) + 34 & 65532) >> 2 | ((var30 & 65535) >> 0 | var30 << 16) + 34 << 14) << 6
               );
               0<"JNT",-733314636,"쁽쁶䁽쀥䁷쀔䁼쀤䁽","Ⱥ¯ʕɏǼ","掄浄暄浄炄怄浄悄拄炄槄昄憄捄悄拄疄晄捄怄戄扄憄",903135475>(
                  var10001,
                  var10000,
                  (char)(
                     (((((var30 & 65535) >> 0 | var30 << 16) + 34 & 65532) >> 2 | ((var30 & 65535) >> 0 | var30 << 16) + 34 << 14) & 64512) >> 10
                        | ((((var30 & 65535) >> 0 | var30 << 16) + 34 & 65532) >> 2 | ((var30 & 65535) >> 0 | var30 << 16) + 34 << 14) << 6
                  )
               );
               var10000 += (-764200225 >> 1159157251 | 1) & 83890337;
               var5 = (89138348 - 89138348 | 456172516) & -1678442515;
               break;
            case 55671119:
               var9 = var10001;
               if (var10000 >= ((-900636349 | -900636349) ^ -900636345)) {
                  var5 = (-66907454 >> -1702906807 | -2062241455) & -2026571945;
                  break label70;
               }

               int var25 = (0<"JNT",-733314636,"쀕䁷쀔䁼쀤䁽","Ⱥ¯ɏʕ","掄浄暄浄炄怄浄悄拄炄槄昄憄捄悄拄疄晄捄怄戄扄憄",903135504>(var10001, var10000) ^ 26) + 74 ^ 83;
               int var48 = (var25 & 65532) >> 2;
               int var26 = (var25 & 65532) >> 2 | var25 << 14;
               int var49 = (((var25 & 65532) >> 2 | var25 << 14) & 65504) >> 5;
               char var27 = (char)(((var48 | var25 << 14) & 65504) >> 5 | ((var25 & 65532) >> 2 | var25 << 14) << 11);
               0<"JNT",-733314636,"쁽쁶䁽쀥䁷쀔䁼쀤䁽","Ⱥ¯ʕɏǼ","掄浄暄浄炄怄浄悄拄炄槄昄憄捄悄拄疄晄捄怄戄扄憄",903135503>(var10001, var10000, (char)(var49 | var26 << 11));
               var10000 += (-445947018 >> -1185821358 | 1) & 1669;
               var5 = (-695505909 & -59352245 | 33005962) & 1778360746;
               break;
            case 477713671:
               var9 = var10001;
               if (var10000 >= 4) {
                  var5 = -1358789104 << -1313050964 ^ 1778337768;
                  break label70;
               }

               int var20 = 0<"JNT",-733314636,"쀕䁷쀔䁼쀤䁽","Ⱥ¯ɏʕ","掄浄暄浄炄怄浄悄拄炄槄昄憄捄悄拄疄晄捄怄戄扄憄",903135422>(var10001, var10000) - 'g';
               int var46 = (var20 & 0) >> 16;
               int var21 = ((var20 & 0) >> 16 | var20 << 0) - 112 + 9;
               int var47 = (((var20 & 0) >> 16 | var20 << 0) - 112 + 9 & 57344) >> 13;
               char var22 = (char)(((var46 | var20 << 0) - 112 + 9 & 57344) >> 13 | ((var20 & 0) >> 16 | var20 << 0) - 112 + 9 << 3);
               0<"JNT",-733314636,"쁽쁶䁽쀥䁷쀔䁼쀤䁽","Ⱥ¯ʕɏǼ","掄浄暄浄炄怄浄悄拄炄槄昄憄捄悄拄疄晄捄怄戄扄憄",903135421>(var10001, var10000, (char)(var47 | var21 << 3));
               var10000 += 200651207 & 1946815025;
               var5 = (-2071928989 - 1473614027 | 1181726018) & -940591769;
               break;
            case 2092112343:
            default:
               var9 = var10001;
               if (var10000 >= ((-383915326 >> -2022178172 | 0) & 19791895)) {
                  var5 = -1758666652 << (-585639194 >> -1866048663) ^ 1715769255;
                  break label70;
               }

               char var14 = 0<"JNT",-733314636,"쀕䁷쀔䁼쀤䁽","Ⱥ¯ɏʕ","掄浄暄浄炄怄浄悄拄炄槄昄憄捄悄拄疄晄捄怄戄扄憄",903135423>(var10001, var10000);
               char var17 = (char)(
                  (((((var14 & '쀀') >> 14 | var14 << 2) - 166 + 30 & 65472) >> 6 | ((var14 & '쀀') >> 14 | var14 << 2) - 166 + 30 << 10) & 0) >> 16
                     | ((((var14 & '쀀') >> 14 | var14 << 2) - 166 + 30 & 65472) >> 6 | ((var14 & '쀀') >> 14 | var14 << 2) - 166 + 30 << 10) << 0
               );
               0<"JNT",-733314636,"쁽쁶䁽쀥䁷쀔䁼쀤䁽","Ⱥ¯ʕɏǼ","掄浄暄浄炄怄浄悄拄炄槄昄憄捄悄拄疄晄捄怄戄扄憄",903135430>(
                  var10001,
                  var10000,
                  (char)(
                     (((((var14 & '쀀') >> 14 | var14 << 2) - 166 + 30 & 65472) >> 6 | ((var14 & '쀀') >> 14 | var14 << 2) - 166 + 30 << 10) & 0) >> 16
                        | ((((var14 & '쀀') >> 14 | var14 << 2) - 166 + 30 & 65472) >> 6 | ((var14 & '쀀') >> 14 | var14 << 2) - 166 + 30 << 10) << 0
                  )
               );
               var10000 += (2081545616 - (2081545616 | -730599462) | 1) & 6292033;
               var5 = (-1440343654 & -1440343654 | -1722433502) & -581581514;
         }
      }

      switch (var5 - 394756981 - 1134597283 + 685809650 - 1044805029 - 730314151 - 961752781) {
         case -1312039150:
            return 0<"JNT",-1179173477,"䁶쁳䁼쁲쀔䁽","ȺɦȈǷǜǷȹǆǷǄǁȹɥǞǀȏǄǁȝǽɦȈǷǜǷȹǆǷǄǁȹʙǰȈǃǵǞȝɏɦȈǷǜǷȹǆǷǄǁȹɥǞǀȏǄǁȝ","掄浄暄浄炄怄浄悄拄炄槄昄憄捄悄拄",903135491>(
               0<"JNT",-733314636,"䁽쁳쀍䁽䁼쁰䁲쁷","ȺɏɦȈǷǜǷȹǆǷǄǁȹɥǞǀȏǄǁȝ","掄浄暄浄炄怄浄悄拄炄槄昄憄捄悄拄疄晄捄怄戄扄憄",903135501>(var9),
               new Object[]{0<"JNT",-1179173477,"䁾쀔䁱쁾쁶쀃䁶","Ⱥ®ɏɦȈǷǜǷȹǆǷǄǁȹ®ǹǓǰǆǃȝ","掄浄暄浄炄怄浄悄拄炄樄惄晄涄怄扄",903135492>(var1)}
            );
         case 618610024:
            return 0<"JNT",-1179173477,"䁶쁳䁼쁲쀔䁽","ȺɦȈǷǜǷȹǆǷǄǁȹɥǞǀȏǄǁȝǽɦȈǷǜǷȹǆǷǄǁȹʙǰȈǃǵǞȝɏɦȈǷǜǷȹǆǷǄǁȹɥǞǀȏǄǁȝ","掄浄暄浄炄怄浄悄拄炄槄昄憄捄悄拄",903135500>(
               0<"JNT",-733314636,"䁽쁳쀍䁽䁼쁰䁲쁷","ȺɏɦȈǷǜǷȹǆǷǄǁȹɥǞǀȏǄǁȝ","掄浄暄浄炄怄浄悄拄炄槄昄憄捄悄拄疄晄捄怄戄扄憄",903135510>(var9),
               new Object[]{0<"JNT",-1179173477,"䁾쀔䁱쁾쁶쀃䁶","Ⱥ®ɏɦȈǷǜǷȹǆǷǄǁȹ®ǹǓǰǆǃȝ","掄浄暄浄炄怄浄悄拄炄樄惄晄涄怄扄",903135509>(var1)}
            );
         case 688549557:
         default:
            return 0<"JNT",-1179173477,"䁶쁳䁼쁲쀔䁽","ȺɦȈǷǜǷȹǆǷǄǁȹɥǞǀȏǄǁȝǽɦȈǷǜǷȹǆǷǄǁȹʙǰȈǃǵǞȝɏɦȈǷǜǷȹǆǷǄǁȹɥǞǀȏǄǁȝ","掄浄暄浄炄怄浄悄拄炄槄昄憄捄悄拄",903135502>(
               0<"JNT",-733314636,"䁽쁳쀍䁽䁼쁰䁲쁷","ȺɏɦȈǷǜǷȹǆǷǄǁȹɥǞǀȏǄǁȝ","掄浄暄浄炄怄浄悄拄炄槄昄憄捄悄拄疄晄捄怄戄扄憄",903135432>(var9),
               new Object[]{0<"JNT",-1179173477,"䁾쀔䁱쁾쁶쀃䁶","Ⱥ®ɏɦȈǷǜǷȹǆǷǄǁȹ®ǹǓǰǆǃȝ","掄浄暄浄炄怄浄悄拄炄樄惄晄涄怄扄",903135431>(var1)}
            );
         case 1815442857:
            return 0<"JNT",-1179173477,"䁶쁳䁼쁲쀔䁽","ȺɦȈǷǜǷȹǆǷǄǁȹɥǞǀȏǄǁȝǽɦȈǷǜǷȹǆǷǄǁȹʙǰȈǃǵǞȝɏɦȈǷǜǷȹǆǷǄǁȹɥǞǀȏǄǁȝ","掄浄暄浄炄怄浄悄拄炄槄昄憄捄悄拄",903135425>(
               0<"JNT",-733314636,"䁽쁳쀍䁽䁼쁰䁲쁷","ȺɏɦȈǷǜǷȹǆǷǄǁȹɥǞǀȏǄǁȝ","掄浄暄浄炄怄浄悄拄炄槄昄憄捄悄拄疄晄捄怄戄扄憄",903135419>(var9),
               new Object[]{0<"JNT",-1179173477,"䁾쀔䁱쁾쁶쀃䁶","Ⱥ®ɏɦȈǷǜǷȹǆǷǄǁȹ®ǹǓǰǆǃȝ","掄浄暄浄炄怄浄悄拄炄樄惄晄涄怄扄",903135426>(var1)}
            );
      }
   }

   // $VF: renamed from: yr (net.minecraft.class_11909, boolean) void
   // $VF: Irreducible bytecode was duplicated to produce valid code
   @Override
   public void method_1272(class_11909 var1, boolean var2) {
      int var3 = 426993231;
      if (0<"JNT",-733314636,"쁲쁶䁽䁷쁳䀕쀋쀟䀝䀜䀝쀞","Ⱥɏ¯","悄扄昄炄恄捄悄扄淄憄浄抄昄炄淄怄浄懄懄泄煄煄睄焄睄",903135535>(var1) == 0) {
         if (0<"JNT",-733314636,"쁷䁿쁾","Ⱥ®®ɏǸ","晄昄捄",903135532>(
            this,
            0<"JNT",-733314636,"쀕쁳쁲䁳쀋䀝쀟쀘䀟","Ⱥɏ®","悄扄昄炄恄捄悄扄淄憄浄抄昄炄淄怄浄懄懄泄煄煄睄焄睄",903135542>(var1),
            0<"JNT",-733314636,"쀕쁳쁲䁳쀋䀝쀟쀘쀘","Ⱥɏ®","悄扄昄炄恄捄悄扄淄憄浄抄昄炄淄怄浄懄懄泄煄煄睄焄睄",903135541>(var1)
         )) {
            if (0<"JNT",-733314636,"쁸쁱䁸","Ⱥ®®ɏǸ","晄昄捄",903135537>(
               this,
               0<"JNT",-733314636,"쀕쁳쁲䁳쀋䀝쀟쀘䀟","Ⱥɏ®","悄扄昄炄恄捄悄扄淄憄浄抄昄炄淄怄浄懄懄泄煄煄睄焄睄",903135531>(var1),
               0<"JNT",-733314636,"쀕쁳쁲䁳쀋䀝쀟쀘쀘","Ⱥɏ®","悄扄昄炄恄捄悄扄淄憄浄抄昄炄淄怄浄懄懄泄煄煄睄焄睄",903135538>(var1)
            )) {
               1<"JNT",1993169548,"\u0cf9࡙ॉ","ᣒ᠒ῒ","⸥㸥个",-985751102>(this, true);
               0<"JNT",-733314636,"쁳쀔䁼","Ⱥ®ɏǼ","晄昄捄",903135486>(this, 0<"JNT",-733314636,"쀕쁳쁲䁳쀋䀝쀟쀘䀟","Ⱥɏ®","悄扄昄炄恄捄悄扄淄憄浄抄昄炄淄怄浄懄懄泄煄煄睄焄睄",903135543>(var1));
               var3 = 1130180240 ^ 1105635796;
            } else {
               var3 = (-398027374 >> -398027374 | 673293161) & -362679425;
            }
         } else {
            var3 = 1130180240 ^ 1105635796;
         }
      } else {
         var3 = 1130180240 ^ 1105635796;
      }

      while (true) {
         switch (((var3 + 469119968 ^ 927943286) + 1227915384 - 1768728694 ^ 1323300677) + 1368824174) {
            case -1733044353:
               0<"JNT",-1181589331,"쁸䁼","ȺɦǄǃǞȹǻȏǄǃǵǀǷǌǞȹǵǆǷǅǅǩȇȇȟȒȟȝǸɏǼ","曄掄",903135580>(this, var1, var2);
               return;
            case -1348776990:
            default:
               if (0<"JNT",-733314636,"䁲쁳쁼","Ⱥ®®ɏǸ","晄昄捄",903135584>(
                  this,
                  0<"JNT",-733314636,"쀕쁳쁲䁳쀋䀝쀟쀘䀟","Ⱥɏ®","悄扄昄炄恄捄悄扄淄憄浄抄昄炄淄怄浄懄懄泄煄煄睄焄睄",903135578>(var1),
                  0<"JNT",-733314636,"쀕쁳쁲䁳쀋䀝쀟쀘쀘","Ⱥɏ®","悄扄昄炄恄捄悄扄淄憄浄抄昄炄淄怄浄懄懄泄煄煄睄焄睄",903135577>(var1)
               )) {
                  1<"JNT",1993169548,"\u0b79ਉహ","ᣒ᠒ῒ","⸥㸥个",-985748871>(this, true);
                  0<"JNT",-733314636,"쁷쁳","Ⱥ®ɏǼ","晄昄捄",903135589>(this, 0<"JNT",-733314636,"쀕쁳쁲䁳쀋䀝쀟쀘䀟","Ⱥɏ®","悄扄昄炄恄捄悄扄淄憄浄抄昄炄淄怄浄懄懄泄煄煄睄焄睄",903135590>(var1));
                  var3 = 1130180240 ^ 1105635796;
               } else {
                  var3 = -1008601722;
               }
               continue;
            case -669293115:
               if (0<"JNT",-733314636,"쀕쁳쁲䁳쀋䀝쀟쀘䀟","Ⱥɏ®","悄扄昄炄恄捄悄扄淄憄浄抄昄炄淄怄浄懄懄泄煄煄睄焄睄",903135579>(var1)
                  < (double)0<"JNT",-733314636,"䁿䁳䁿","Ⱥɏ¯","晄昄捄",903135586>(this) + 1<"JNT",-968032826,"३హ\u0c29","ᣒ᠒ῒ","⸥㸥\uee24",-985749869>(this)) {
                  1<"JNT",1993169548,"\u0cf9࡙ॉ","ᣒ᠒ῒ","⸥㸥个",-985749870>(this, true);
                  0<"JNT",-733314636,"쁳쀔䁼","Ⱥ®ɏǼ","晄昄捄",903135534>(this, 0<"JNT",-733314636,"쀕쁳쁲䁳쀋䀝쀟쀘䀟","Ⱥɏ®","悄扄昄炄恄捄悄扄淄憄浄抄昄炄淄怄浄懄懄泄煄煄睄焄睄",903135591>(var1));
                  var3 = 1130180240 ^ 1105635796;
               } else {
                  var3 = -2100954072;
               }
               continue;
            case -358839547:
               if (0<"JNT",-733314636,"쀕쁳쁲䁳쀋䀝쀟쀘䀟","Ⱥɏ®","悄扄昄炄恄捄悄扄淄憄浄抄昄炄淄怄浄懄懄泄煄煄睄焄睄",903135499>(var1)
                     - ((double)0<"JNT",-733314636,"䁿䁳䁿","Ⱥɏ¯","晄昄捄",903135506>(this) + 1<"JNT",-968032826,"३హ\u0c29","ᣒ᠒ῒ","⸥㸥\uee24",-985748893>(this))
                  < (double)0<"JNT",-733314636,"䁿䁳䁿","Ⱥɏ¯","晄昄捄",903135512>(this)
                     + 1<"JNT",-968032826,"உಙ࡙","ᣒ᠒ῒ","⸥㸥\uee24",-985748895>(this)
                     - 0<"JNT",-733314636,"쀕쁳쁲䁳쀋䀝쀟쀘䀟","Ⱥɏ®","悄扄昄炄恄捄悄扄淄憄浄抄昄炄淄怄浄懄懄泄煄煄睄焄睄",903135582>(var1)) {
                  1<"JNT",1993169548,"\u0cf9࡙ॉ","ᣒ᠒ῒ","⸥㸥个",-985748889>(this, true);
                  0<"JNT",-733314636,"쁳쀔䁼","Ⱥ®ɏǼ","晄昄捄",903135507>(this, 0<"JNT",-733314636,"쀕쁳쁲䁳쀋䀝쀟쀘䀟","Ⱥɏ®","悄扄昄炄恄捄悄扄淄憄浄抄昄炄淄怄浄懄懄泄煄煄睄焄睄",903135508>(var1));
                  var3 = 1130180240 ^ 1105635796;
               } else {
                  var3 = 721521564 - -109969297 ^ 1557379980;
               }
               continue;
            case 419381043:
               if (0<"JNT",-733314636,"쀕쁳쁲䁳쀋䀝쀟쀘䀟","Ⱥɏ®","悄扄昄炄恄捄悄扄淄憄浄抄昄炄淄怄浄懄懄泄煄煄睄焄睄",903135533>(var1)
                  > (double)0<"JNT",-733314636,"䁿䁳䁿","Ⱥɏ¯","晄昄捄",903135524>(this) + 1<"JNT",-968032826,"உಙ࡙","ᣒ᠒ῒ","⸥㸥\uee24",-985751083>(this)) {
                  1<"JNT",1993169548,"\u0b79ਉహ","ᣒ᠒ῒ","⸥㸥个",-985751252>(this, true);
                  0<"JNT",-733314636,"쁷쁳","Ⱥ®ɏǼ","晄昄捄",903135536>(this, 0<"JNT",-733314636,"쀕쁳쁲䁳쀋䀝쀟쀘䀟","Ⱥɏ®","悄扄昄炄恄捄悄扄淄憄浄抄昄炄淄怄浄懄懄泄煄煄睄焄睄",903135529>(var1));
                  var3 = 1130180240 ^ 1105635796;
               } else {
                  var3 = (-1339275263 >> -1339275263 | 593694918) & -1209271578;
               }
               continue;
            case 617974570:
         }

         1<"JNT",1993169548,"\u0b79ਉహ","ᣒ᠒ῒ","⸥㸥个",-985751097>(this, true);
         0<"JNT",-733314636,"쁷쁳","Ⱥ®ɏǼ","晄昄捄",903135539>(this, 0<"JNT",-733314636,"쀕쁳쁲䁳쀋䀝쀟쀘䀟","Ⱥɏ®","悄扄昄炄恄捄悄扄淄憄浄抄昄炄淄怄浄懄懄泄煄煄睄焄睄",903135540>(var1));
         var3 = 1130180240 ^ 1105635796;
      }
   }

   // $VF: renamed from: yz (net.minecraft.class_11908) void
   @Override
   public void method_1271(class_11908 var1) {
      if (1<"JNT",-968032826,"\u09a9உ\u0b79","ᣒ᠒ῒ","⸥㸥个",-985751077>(this)
         && 0<"JNT",-733314636,"쁲쁶䁽䁷쁳䀕쀋쀟䀝䀜䀜䀟","Ⱥɏ¯","悄扄昄炄恄捄悄扄淄憄浄抄昄炄淄怄浄懄懄泄煄煄睄焄眄",903135488>(var1) == 259) {
         0<"JNT",-733314636,"䁷䁶","Ⱥ®ɏǼ","构恄",903135484>(
            1<"JNT",-968032826,"৹உ৹","ᣒ᠒ῒ","⸥㸥渫丨縩帤",-985751079>(this),
            0<"JNT",-733314636,"쁸쁸","Ⱥɏ®","构恄",903135493>(1<"JNT",-968032826,"৹உ৹","ᣒ᠒ῒ","⸥㸥渫丨縩帤",-985751104>(this))
         );
         0<"JNT",-733314636,"쁲쁼","Ⱥ®ɏǼ","构恄",903135496>(
            1<"JNT",-968032826,"৹உ৹","ᣒ᠒ῒ","⸥㸥渫丨縩帤",-985751075>(this),
            0<"JNT",-733314636,"䁾쀕","Ⱥɏ®","构恄",903135489>(1<"JNT",-968032826,"৹உ৹","ᣒ᠒ῒ","⸥㸥渫丨縩帤",-985751052>(this))
         );
      }

      0<"JNT",-1181589331,"쁸䁸","ȺɦǄǃǞȹǻȏǄǃǵǀǷǌǞȹǵǆǷǅǅǩȇȇȟȒȊȝɏǼ","曄掄",903135482>(this, var1);
   }

   // $VF: renamed from: ykz (double, double) boolean
   public boolean method_1299(double var1, double var3) {
      return 0<"JNT",-733314636,"쁷䁿쁾","Ⱥ®®ɏǸ","晄昄捄",903135495>(this, var1, var3)
         && var1 > (double)0<"JNT",-733314636,"䁿䁳䁿","Ⱥɏ¯","晄昄捄",903135566>(this) + 1<"JNT",-968032826,"३హ\u0c29","ᣒ᠒ῒ","⸥㸥\uee24",-985751241>(this) - 8.0
         && var1 < (double)0<"JNT",-733314636,"䁿䁳䁿","Ⱥɏ¯","晄昄捄",903135556>(this) + 1<"JNT",-968032826,"३హ\u0c29","ᣒ᠒ῒ","⸥㸥\uee24",-985751243>(this) + 8.0;
   }

   // $VF: renamed from: noq (double, double) boolean
   public boolean method_1300(double var1, double var3) {
      return 0<"JNT",-733314636,"쁷䁿쁾","Ⱥ®®ɏǸ","晄昄捄",903135562>(this, var1, var3)
         && var1 > (double)0<"JNT",-733314636,"䁿䁳䁿","Ⱥɏ¯","晄昄捄",903135561>(this) + 1<"JNT",-968032826,"உಙ࡙","ᣒ᠒ῒ","⸥㸥\uee24",-985751286>(this) - 8.0
         && var1 < (double)0<"JNT",-733314636,"䁿䁳䁿","Ⱥɏ¯","晄昄捄",903135567>(this) + 1<"JNT",-968032826,"உಙ࡙","ᣒ᠒ῒ","⸥㸥\uee24",-985751248>(this) + 8.0;
   }

   // $VF: renamed from: blk (net.minecraft.class_11909) void
   @Override
   public void method_1273(class_11909 var1) {
      if (0<"JNT",-733314636,"쁲쁶䁽䁷쁳䀕쀋쀟䀝䀜䀝쀞","Ⱥɏ¯","悄扄昄炄恄捄悄扄淄憄浄抄昄炄淄怄浄懄懄泄煄煄睄焄睄",903135573>(var1) == 0) {
         1<"JNT",1993169548,"\u0cf9࡙ॉ","ᣒ᠒ῒ","⸥㸥个",-985751282>(this, false);
         1<"JNT",1993169548,"\u0b79ਉహ","ᣒ᠒ῒ","⸥㸥个",-985751283>(this, false);
      }

      0<"JNT",-1181589331,"䀔䁱쁱","ȺɦǄǃǞȹǻȏǄǃǵǀǷǌǞȹǵǆǷǅǅǩȇȇȟȒȟȝɏǼ","曄掄",903135570>(this, var1);
   }

   // $VF: renamed from: oh (net.minecraft.class_11909, double, double) void
   @Override
   public void method_1274(class_11909 var1, double var2, double var4) {
      int var6 = -1519611551;
      if (1<"JNT",-968032826,"\u0cf9࡙ॉ","ᣒ᠒ῒ","⸥㸥个",-985751262>(this)) {
         0<"JNT",-733314636,"쁳쀔䁼","Ⱥ®ɏǼ","晄昄捄",903134878>(this, 0<"JNT",-733314636,"쀕쁳쁲䁳쀋䀝쀟쀘䀟","Ⱥɏ®","悄扄昄炄恄捄悄扄淄憄浄抄昄炄淄怄浄懄懄泄煄煄睄焄睄",903135575>(var1));
      }

      var6 = -1193310222;

      while (true) {
         switch (((var6 + 1119918294 ^ 690431455) - 320464197 - 1168615795 ^ 1028249668) - 1412477256) {
            case -1042980269:
            default:
               0<"JNT",-1181589331,"쁳䁷","ȺɦǄǃǞȹǻȏǄǃǵǀǷǌǞȹǵǆǷǅǅǩȇȇȟȒȟȝ®®ɏǼ","曄掄",903135569>(this, var1, var2, var4);
               return;
            case -262406957:
         }

         if (1<"JNT",-968032826,"\u0b79ਉహ","ᣒ᠒ῒ","⸥㸥个",-985751257>(this)) {
            0<"JNT",-733314636,"쁷쁳","Ⱥ®ɏǼ","晄昄捄",903135571>(this, 0<"JNT",-733314636,"쀕쁳쁲䁳쀋䀝쀟쀘䀟","Ⱥɏ®","悄扄昄炄恄捄悄扄淄憄浄抄昄炄淄怄浄懄懄泄煄煄睄焄睄",903135572>(var1));
         }

         var6 = (864845162 | 864845162 | 1752556144) & 1786242679;
      }
   }

   // $VF: renamed from: zxs () void
   @Override
   public void method_1270() {
      1<"JNT",1993169548,"\u0cd9৹\u0b79","ᣒ᠒ῒ","⸥㸥渫긩Ḩ帤",-985751236>(this, null);
      0<"JNT",-1181589331,"䁸䁿쁽","ȺɏǼ","曄掄",903134873>(this);
   }

   // $VF: renamed from: oar (double) void
   public void method_1301(double var1) {
      double var3 = var1 - (double)(0<"JNT",-733314636,"䁿䁳䁿","Ⱥɏ¯","晄昄捄",903134880>(this) + 5);
      double var5 = 0<"JNT",-1179173477,"쁲쁶䁽䁷쁳䀕쀋쀜쀞쀝쀞䀓","Ⱥ®®®ɏ®","悄扄昄炄恄捄悄扄淄憄浄抄昄炄淄怄浄懄懄泄燄癄燄熄",903134886>(
         var3 / (double)(0<"JNT",-733314636,"䁰䁷","Ⱥɏ¯","晄昄捄",903134879>(this) - 10), 0.0, 1.0
      );
      double var7 = 0<"JNT",-1179173477,"쁲䁽쁶","Ⱥ®®ɏ®","慄惄揄",903135597>(
         var5
               * (
                  0<"JNT",-733314636,"䁱쀔","Ⱥɏ®","构恄",903134876>(1<"JNT",-968032826,"৹உ৹","ᣒ᠒ῒ","⸥㸥渫丨縩帤",-985749825>(this))
                     - 0<"JNT",-733314636,"䁿쁱","Ⱥɏ®","构恄",903134882>(1<"JNT",-968032826,"৹உ৹","ᣒ᠒ῒ","⸥㸥渫丨縩帤",-985749827>(this))
               )
            + 0<"JNT",-733314636,"䁿쁱","Ⱥɏ®","构恄",903134888>(1<"JNT",-968032826,"৹உ৹","ᣒ᠒ῒ","⸥㸥渫丨縩帤",-985749677>(this)),
         0<"JNT",-733314636,"䁽䁷","Ⱥɏ®","构恄",903135598>(1<"JNT",-968032826,"৹உ৹","ᣒ᠒ῒ","⸥㸥渫丨縩帤",-985749679>(this))
      );
      0<"JNT",-733314636,"쁲쁼","Ⱥ®ɏǼ","构恄",903135600>(
         1<"JNT",-968032826,"৹உ৹","ᣒ᠒ῒ","⸥㸥渫丨縩帤",-985749866>(this),
         0<"JNT",-1179173477,"쁲쁰䁲","Ⱥ®®ɏ®","掄浄暄浄炄怄浄悄拄炄桄浄昄挄",903135593>(
            var7, 0<"JNT",-733314636,"쁷쁼","Ⱥɏ®","构恄",903135594>(1<"JNT",-968032826,"৹உ৹","ᣒ᠒ῒ","⸥㸥渫丨縩帤",-985749867>(this))
         )
      );
   }

   // $VF: renamed from: go (double) void
   public void method_1302(double var1) {
      double var3 = var1 - (double)(0<"JNT",-733314636,"䁿䁳䁿","Ⱥɏ¯","晄昄捄",903135599>(this) + 5);
      double var5 = 0<"JNT",-1179173477,"쁲쁶䁽䁷쁳䀕쀋쀜쀞쀝쀞䀓","Ⱥ®®®ɏ®","悄扄昄炄恄捄悄扄淄憄浄抄昄炄淄怄浄懄懄泄燄癄燄熄",903135605>(
         var3 / (double)(0<"JNT",-733314636,"䁰䁷","Ⱥɏ¯","晄昄捄",903135606>(this) - 10), 0.0, 1.0
      );
      double var7 = 0<"JNT",-1179173477,"쁲䁽쁶","Ⱥ®®ɏ®","慄惄揄",903135604>(
         var5
               * (
                  0<"JNT",-733314636,"䁱쀔","Ⱥɏ®","构恄",903135595>(1<"JNT",-968032826,"৹உ৹","ᣒ᠒ῒ","⸥㸥渫丨縩帤",-985749778>(this))
                     - 0<"JNT",-733314636,"䁿쁱","Ⱥɏ®","构恄",903135601>(1<"JNT",-968032826,"৹உ৹","ᣒ᠒ῒ","⸥㸥渫丨縩帤",-985749884>(this))
               )
            + 0<"JNT",-733314636,"䁿쁱","Ⱥɏ®","构恄",903135607>(1<"JNT",-968032826,"৹உ৹","ᣒ᠒ῒ","⸥㸥渫丨縩帤",-985749886>(this)),
         0<"JNT",-733314636,"䁽䁷","Ⱥɏ®","构恄",903135549>(1<"JNT",-968032826,"৹உ৹","ᣒ᠒ῒ","⸥㸥渫丨縩帤",-985749880>(this))
      );
      0<"JNT",-733314636,"䁷䁶","Ⱥ®ɏǼ","构恄",903135551>(
         1<"JNT",-968032826,"৹உ৹","ᣒ᠒ῒ","⸥㸥渫丨縩帤",-985749883>(this),
         0<"JNT",-1179173477,"쁲쀔䁿","Ⱥ®®ɏ®","掄浄暄浄炄怄浄悄拄炄桄浄昄挄",903135552>(
            var7, 0<"JNT",-733314636,"쁳쁿","Ⱥɏ®","构恄",903135545>(1<"JNT",-968032826,"৹உ৹","ᣒ᠒ῒ","⸥㸥渫丨縩帤",-985749860>(this))
         )
      );
   }

   // $VF: renamed from: gau () void
   // $VF: Irreducible bytecode was duplicated to produce valid code
   @Override
   public void method_1269() {
      int var3 = 49580364;
      0<"JNT",-1181589331,"쁷쀔쁾","ȺɏǼ","曄掄",903135558>(this);
      Class_262 var1 = 0<"JNT",-1179173477,"䁼쁾쁳","Ⱥ¯¯ɏɦǒǑȝ","涄淄",903135554>(
         255,
         0<"JNT",430280895,"쁰䁲䀕쁶䁿쀃䁶","ȺɦȈǷǜǷȹǆǷǄǁȹʙǰȈǃǵǞȝɏ¯","掄浄暄浄炄晄昄捄怄炄栄捄懄昄",903135547>(
               1<"JNT",-968032826,"\u0b59\u0b79\u0ca9","Ồᶒ","⸥㸥渫丩븪ศ븪鸥︩\uee29㸩温鸥渫㸩\ude29\uee29帤",-985749858>(
                  1<"JNT",-968032826,"\u0cc9ङङ","ᣒ᠒ῒ","⸥㸥渫縩츪帤",-985749857>(this)
               ),
               this
            )
            + 1
      );
      if (1<"JNT",-968032826,"\u0cd9৹\u0b79","ᣒ᠒ῒ","⸥㸥渫긩Ḩ帤",-985749837>(this) == null) {
         1<"JNT",1993169548,"\u0cd9৹\u0b79","ᣒ᠒ῒ","⸥㸥渫긩Ḩ帤",-985749770>(
            this,
            (Class_262)0<"JNT",-952031873,"䀙쁰䁲쁰䁽䀚","Ⱥ¯¯¯¯ɏǼ","愄曄",903135629>(
               0<"JNT",-733314636,"䁰䁽䁼","Ⱥɏ¯","愄曄",903135560>(var1),
               0<"JNT",-733314636,"쁱䁰","Ⱥɏ¯","愄曄",903135559>(var1),
               0<"JNT",-733314636,"䁱쁷䁾","Ⱥɏ¯","愄曄",903135630>(var1),
               0
            )
         );
         var3 = -125181866;
      } else {
         var3 = 1829258345;
      }

      while (true) {
         switch ((var3 + 247375087 + 2143237611 ^ 92448015 ^ 1104685332) - 292653093 ^ 1657779276) {
            case -861618305:
            default:
               1<"JNT",1993169548,"\u0cd9৹\u0b79","ᣒ᠒ῒ","⸥㸥渫긩Ḩ帤",-985749809>(
                  this,
                  (Class_262)0<"JNT",-952031873,"䀙쁰䁲쁰䁽䀚","Ⱥ¯¯¯¯ɏǼ","愄曄",903135638>(
                     0<"JNT",-733314636,"䁰䁽䁼","Ⱥɏ¯","愄曄",903135619>(var1),
                     0<"JNT",-733314636,"쁱䁰","Ⱥɏ¯","愄曄",903135626>(var1),
                     0<"JNT",-733314636,"䁱쁷䁾","Ⱥɏ¯","愄曄",903135625>(var1),
                     0<"JNT",-733314636,"䁱쁸","Ⱥɏ¯","愄曄",903135631>(1<"JNT",-968032826,"\u0cd9৹\u0b79","ᣒ᠒ῒ","⸥㸥渫긩Ḩ帤",-985749814>(this))
                  )
               );
               var3 = -125181866;
               break;
            case -752608438:
               short var2 = 255;
               if (0<"JNT",-733314636,"䁱쁸","Ⱥɏ¯","愄曄",903135627>(1<"JNT",-968032826,"\u0cd9৹\u0b79","ᣒ᠒ῒ","⸥㸥渫긩Ḩ帤",-985749810>(this)) != var2) {
                  1<"JNT",1993169548,"\u0cd9৹\u0b79","ᣒ᠒ῒ","⸥㸥渫긩Ḩ帤",-985749790>(
                     this,
                     0<"JNT",-1179173477,"쁿䁸䁾","Ⱥɬ¯ɦǒǑȝɏɦǒǑȝ","涄淄",903135633>(0.05F, var2, 1<"JNT",-968032826,"\u0cd9৹\u0b79","ᣒ᠒ῒ","⸥㸥渫긩Ḩ帤",-985749788>(this))
                  );
               }

               return;
         }
      }
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1293(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 + 1338908167 ^ 63262138 ^ 1838078751) + 2037620418 + 1831814962 + 1089289713 + 1453066253 ^ 1460969634) - 1280773622;
      MethodHandle var10000 = field_1285[((var10 + 1338908167 ^ 63262138 ^ 1838078751) + 2037620418 + 1831814962 + 1089289713 + 1453066253 ^ 1460969634)
         - 1280773622
         + 257243486];
      if (field_1285[var10001 + 257243486] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = (274948003 - (-522340192 & 1744189019) | 0) & 272678928; var23 < var13.length(); var23 += (-474681484 - 632764773 | 0) & 33571217) {
            char var42 = var13.charAt(var23);
            char var45 = (char)(
               (
                     (
                              (
                                       (
                                                ((((var42 & '쀀') >> 14 | var42 << 2) ^ 156 ^ 114) & 65535) >> 0
                                                   | (((var42 & '쀀') >> 14 | var42 << 2) ^ 156 ^ 114) << 16
                                             )
                                             - 249
                                          ^ 61
                                    )
                                    + 6
                                    + 103
                                 & 65534
                           )
                           >> 1
                        | (
                                 (((((var42 & '쀀') >> 14 | var42 << 2) ^ 156 ^ 114) & 65535) >> 0 | (((var42 & '쀀') >> 14 | var42 << 2) ^ 156 ^ 114) << 16)
                                       - 249
                                    ^ 61
                              )
                              + 6
                              + 103
                           << 15
                  )
                  + 46
            );
            var13.setCharAt(
               var23,
               (char)(
                  (
                        (
                                 (
                                          (
                                                   ((((var42 & '쀀') >> 14 | var42 << 2) ^ 156 ^ 114) & 65535) >> 0
                                                      | (((var42 & '쀀') >> 14 | var42 << 2) ^ 156 ^ 114) << 16
                                                )
                                                - 249
                                             ^ 61
                                       )
                                       + 6
                                       + 103
                                    & 65534
                              )
                              >> 1
                           | (
                                    (((((var42 & '쀀') >> 14 | var42 << 2) ^ 156 ^ 114) & 65535) >> 0 | (((var42 & '쀀') >> 14 | var42 << 2) ^ 156 ^ 114) << 16)
                                          - 249
                                       ^ 61
                                 )
                                 + 6
                                 + 103
                              << 15
                     )
                     + 46
               )
            );
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = 454330904 + -1236307236 ^ -781976332; var29 < var16.length(); var29 += -633016015 ^ 1311983591 ^ -1804093737) {
            var16.setCharAt(var29, (char)((((var16.charAt(var29) ^ '\r' ^ 22) - 19 + 39 + 85 ^ 226) - 220 ^ 84) - 237 ^ 195));
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_343.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = (646987759 << 1974638226 | 0) & 111064; var35 < var19.length(); var35 += (-1440626525 * 16921410 | 1) & 101465) {
            int var54 = var19.charAt(var35) ^ 196;
            int var72 = (var54 & 65472) >> 6;
            int var55 = (((var54 & 65472) >> 6 | var54 << 10) ^ 189 ^ 214) - 127 + 97 - 117;
            int var73 = ((((var54 & 65472) >> 6 | var54 << 10) ^ 189 ^ 214) - 127 + 97 - 117 & 0) >> 16;
            char var56 = (char)(
               ((((var72 | var54 << 10) ^ 189 ^ 214) - 127 + 97 - 117 & 0) >> 16 | (((var54 & 65472) >> 6 | var54 << 10) ^ 189 ^ 214) - 127 + 97 - 117 << 0)
                  + 11
                  - 244
            );
            var19.setCharAt(var35, (char)((var73 | var55 << 0) + 11 - 244));
         }

         Class var7 = Class.forName(var19.toString(), false, Class_343.class.getClassLoader());
         switch ((var4 - 1666307417 ^ 1559150456) - 874262988 - 1300082224 + 377137250 + 1801819118 - 8832411 + 934299346 ^ 1228475154 ^ 1000685979) {
            case 82675296:
               var10000 = var0.findConstructor(var7, var6);
               break;
            case 286898727:
            case 1353755424:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 813849406:
               var10000 = var0.findSpecial(var7, var5, var6, Class_343.class);
               break;
            case 862453324:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_1285[((var10 + 1338908167 ^ 63262138 ^ 1838078751) + 2037620418 + 1831814962 + 1089289713 + 1453066253 ^ 1460969634) - 1280773622 + 257243486] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1294(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = (((var10 ^ 1497342544) + 873271020 + 464525291 ^ 619955957) + 1287376500 ^ 962432414) - 692689778 + 1017164218 ^ 1140979444;
      MethodHandle var10000 = field_1285[(((var10 ^ 1497342544) + 873271020 + 464525291 ^ 619955957) + 1287376500 ^ 962432414) - 692689778 + 1017164218
         ^ 1140979444
         ^ 2091563700];
      if (field_1285[var10001 ^ 2091563700] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = -2023114462 >> 392671737 ^ -61; var24 < var14.length(); var24 += 1619096488 * 726392738 ^ -270366639) {
            int var43 = (var14.charAt(var24) - 'I' - 206 + 9 ^ 153) - 66;
            char var44 = (char)((((var43 & 65520) >> 4 | var43 << 12) - 140 + 147 ^ 233) + 16);
            var14.setCharAt(var24, (char)((((var43 & 65520) >> 4 | var43 << 12) - 140 + 147 ^ 233) + 16));
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = (1116294123 - -397380605 | 0) & 608249873; var30 < var17.length(); var30 += (-33292391 >>> -1046135586 | 1) & -555528387) {
            int var49 = var17.charAt(var30);
            int var84 = (var49 & 64512) >> 10;
            int var50 = ((var49 & 64512) >> 10 | var49 << 6) - 75;
            int var85 = (((var49 & 64512) >> 10 | var49 << 6) - 75 & 65520) >> 4;
            var49 = ((((var84 | var49 << 6) - 75 & 65520) >> 4 | ((var49 & 64512) >> 10 | var49 << 6) - 75 << 12) - 81 ^ 90) + 88;
            var84 = (((var85 | var50 << 12) - 81 ^ 90) + 88 & 65408) >> 7;
            int var52 = (((((var85 | var50 << 12) - 81 ^ 90) + 88 & 65408) >> 7 | var49 << 9) ^ 234) - 162;
            int var87 = ((((((var85 | var50 << 12) - 81 ^ 90) + 88 & 65408) >> 7 | var49 << 9) ^ 234) - 162 & 65534) >> 1;
            char var53 = (char)(
               (((var84 | var49 << 9) ^ 234) - 162 & 65534) >> 1 | (((((var85 | var50 << 12) - 81 ^ 90) + 88 & 65408) >> 7 | var49 << 9) ^ 234) - 162 << 15
            );
            var17.setCharAt(var30, (char)(var87 | var52 << 15));
         }

         Class var6 = Class.forName(var17.toString(), false, Class_343.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = (1646914619 >> 125140202 | 0) & 1482895620; var36 < var20.length(); var36 += (1200794315 >>> 1200794315 | 0) & 941886723) {
            int var58 = var20.charAt(var36) ^ 131;
            int var88 = (var58 & 65534) >> 1;
            int var59 = ((var58 & 65534) >> 1 | var58 << 15) + 173;
            int var89 = (((var58 & 65534) >> 1 | var58 << 15) + 173 & 63488) >> 11;
            var58 = ((var88 | var58 << 15) + 173 & 63488) >> 11 | ((var58 & 65534) >> 1 | var58 << 15) + 173 << 5;
            var88 = ((var89 | var59 << 5) & 64512) >> 10;
            int var61 = ((var89 | var59 << 5) & 64512) >> 10 | var58 << 6;
            int var91 = ((((var89 | var59 << 5) & 64512) >> 10 | var58 << 6) & 65520) >> 4;
            var58 = ((var88 | var58 << 6) & 65520) >> 4 | (((var89 | var59 << 5) & 64512) >> 10 | var58 << 6) << 12;
            var88 = ((var91 | var61 << 12) & 65534) >> 1;
            int var63 = (((var91 | var61 << 12) & 65534) >> 1 | var58 << 15) + 52;
            int var93 = ((((var91 | var61 << 12) & 65534) >> 1 | var58 << 15) + 52 & 65534) >> 1;
            char var64 = (char)((((var88 | var58 << 15) + 52 & 65534) >> 1 | (((var91 | var61 << 12) & 65534) >> 1 | var58 << 15) + 52 << 15) + 11);
            var20.setCharAt(var36, (char)((var93 | var63 << 15) + 11));
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_343.class.getClassLoader()).returnType();
         switch ((((var4 ^ 1981740619) - 1000480635 ^ 395210689) + 515969289 ^ 784092422) - 172329220 + 1326322470 - 1649725890 - 2100966245 - 328589470) {
            case 16940599:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            case 820011757:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            case 1415343592:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            case 1894274654:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_1285[(((var10 ^ 1497342544) + 873271020 + 464525291 ^ 619955957) + 1287376500 ^ 962432414) - 692689778 + 1017164218 ^ 1140979444 ^ 2091563700] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
