import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;

public enum Class_367 {
   // $VF: renamed from: brw Class_367
   field_1023,
   // $VF: renamed from: mmf Class_367
   field_1024,
   // $VF: renamed from: sb Class_367
   field_1025,
   // $VF: renamed from: xz Class_367
   field_1026,
   // $VF: renamed from: lks Class_367
   field_1027;

   // $VF: renamed from: gqc java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_1028 = new MethodHandle[-62239182 >> -62239182 ^ -205];

   // $VF: Failed to inline enum fields
   // Please report this to the Vineflower issue tracker, at https://github.com/Vineflower/vineflower/issues with a copy of the class file (if you have the rights to distribute it!)
   static {
      int var10000 = (-714755570 + -1845737961 | 0) & -2004613160;

      StringBuilder var10001;
      for (var10001 = (StringBuilder)0<"JNT",848551272,"劂华卺华卢劺","ކࣶࢎࢪ࡞ࢪނࡶࢪࡾࢢނࣲࡖ\u086eࢊࡾࢢݒފࣞ","ຟ红캟红亣⺟红亟\udea2亣麡꺟躟ﺟ亟\udea2躤뺟ﺟ⺟꺢뺢躟",320344902>("ڨݰڄݼݠڴڐڄݨۈڼڴݰݼݠڴ");
         var10000 < ((-219630772 + -219630772 | 16) & 405575730);
         var10000 += (2023344900 >> (1433930661 | 1433930661) | 1) & -802025467
      ) {
         int var18 = 0<"JNT",1765681486,"匦卒匮卪劮卢","ކऊފल","ຟ红캟红亣⺟红亟\udea2亣麡꺟躟ﺟ亟\udea2躤뺟ﺟ⺟꺢뺢躟",320344900>(var10001, var10000) ^ 244;
         int var10004 = (var18 & 65532) >> 2;
         int var19 = ((var18 & 65532) >> 2 | var18 << 14) ^ 217;
         int var50 = ((((var18 & 65532) >> 2 | var18 << 14) ^ 217) & 65535) >> 0;
         char var20 = (char)(((((var10004 | var18 << 14) ^ 217) & 65535) >> 0 | (((var18 & 65532) >> 2 | var18 << 14) ^ 217) << 16) - 247);
         0<"JNT",1765681486,"卦卞卢劦卒匮卪劮卢","ކऊलފࣞ","ຟ红캟红亣⺟红亟\udea2亣麡꺟躟ﺟ亟\udea2躤뺟ﺟ⺟꺢뺢躟",320344899>(var10001, var10000, (char)((var50 | var19 << 16) - 247));
      }

      field_1023 = (Class_367)0<"JNT",848551272,"劂华卺华卢劺","ކࣶࢎࢪ࡞ࢪނࡶࢪࡾࢢނࣲࡖ\u086eࢊࡾࢢݒऊފࣞ","\ude9f",320344781>(
         0<"JNT",1765681486,"卢卶僦卢卪华卺卖","ކފࣶࢎࢪ࡞ࢪނࡶࢪࡾࢢނࣲࡖ\u086eࢊࡾࢢݒ","ຟ红캟红亣⺟红亟\udea2亣麡꺟躟ﺟ亟\udea2躤뺟ﺟ⺟꺢뺢躟",320344670>(var10001), 0
      );
      var10000 = (-1487340445 * 203784971 | 0) & 620830388;

      for (var10001 = (StringBuilder)0<"JNT",848551272,"劂华卺华卢劺","ކࣶࢎࢪ࡞ࢪނࡶࢪࡾࢢނࣲࡖ\u086eࢊࡾࢢݒފࣞ","ຟ红캟红亣⺟红亟\udea2亣麡꺟躟ﺟ亟\udea2躤뺟ﺟ⺟꺢뺢躟",320344784>("ퟙꏙ꿙꿙菙鯙鏙쟙");
         var10000 < (-1990608668 >>> 67456233 ^ 4500692);
         var10000 += (-521579614 | 215882174) ^ -318809153
      ) {
         char var23 = 0<"JNT",1765681486,"匦卒匮卪劮卢","ކऊފल","ຟ红캟红亣⺟红亟\udea2亣麡꺟躟ﺟ亟\udea2躤뺟ﺟ⺟꺢뺢躟",320344677>(var10001, var10000);
         int var51 = (var23 & '쀀') >> 14;
         int var24 = ((var23 & '쀀') >> 14 | var23 << 2) + 40 - 111 + 229;
         int var52 = (((var23 & '쀀') >> 14 | var23 << 2) + 40 - 111 + 229 & 61440) >> 12;
         var23 = (char)(((var51 | var23 << 2) + 40 - 111 + 229 & 61440) >> 12 | ((var23 & '쀀') >> 14 | var23 << 2) + 40 - 111 + 229 << 4);
         0<"JNT",1765681486,"卦卞卢劦卒匮卪劮卢","ކऊलފࣞ","ຟ红캟红亣⺟红亟\udea2亣麡꺟躟ﺟ亟\udea2躤뺟ﺟ⺟꺢뺢躟",320344680>(var10001, var10000, (char)(var52 | var24 << 4));
      }

      field_1024 = (Class_367)0<"JNT",848551272,"劂华卺华卢劺","ކࣶࢎࢪ࡞ࢪނࡶࢪࡾࢢނࣲࡖ\u086eࢊࡾࢢݒऊފࣞ","\ude9f",320344898>(
         0<"JNT",1765681486,"卢卶僦卢卪华卺卖","ކފࣶࢎࢪ࡞ࢪނࡶࢪࡾࢢނࣲࡖ\u086eࢊࡾࢢݒ","ຟ红캟红亣⺟红亟\udea2亣麡꺟躟ﺟ亟\udea2躤뺟ﺟ⺟꺢뺢躟",320344783>(var10001), 1
      );
      var10000 = (-1214098361 * -1214098361 | 0) & -1207614464;

      for (var10001 = (StringBuilder)0<"JNT",848551272,"劂华卺华卢劺","ކࣶࢎࢪ࡞ࢪނࡶࢪࡾࢢނࣲࡖ\u086eࢊࡾࢢݒފࣞ","ຟ红캟红亣⺟红亟\udea2亣麡꺟躟ﺟ亟\udea2躤뺟ﺟ⺟꺢뺢躟",320344897>(
            "\uffd0ￅￃﾸ\uffbfﾻￕￌ\uffbfￂￂﾷﾽﾻ\uffc8"
         );
         var10000 < 15;
         var10000 += (-1847892419 * (-2054287015 + -2054287015) | 1) & 605077765
      ) {
         0<"JNT",1765681486,"卦卞卢劦卒匮卪劮卢","ކऊलފࣞ","ຟ红캟红亣⺟红亟\udea2亣麡꺟躟ﺟ亟\udea2躤뺟ﺟ⺟꺢뺢躟",320344671>(
            var10001,
            var10000,
            (char)((0<"JNT",1765681486,"匦卒匮卪劮卢","ކऊފल","ຟ红캟红亣⺟红亟\udea2亣麡꺟躟ﺟ亟\udea2躤뺟ﺟ⺟꺢뺢躟",320344672>(var10001, var10000) ^ 0) - 142 + 197 + 30 + 53)
         );
      }

      field_1025 = (Class_367)0<"JNT",848551272,"劂华卺华卢劺","ކࣶࢎࢪ࡞ࢪނࡶࢪࡾࢢނࣲࡖ\u086eࢊࡾࢢݒऊފࣞ","\ude9f",320344666>(
         0<"JNT",1765681486,"卢卶僦卢卪华卺卖","ކފࣶࢎࢪ࡞ࢪނࡶࢪࡾࢢނࣲࡖ\u086eࢊࡾࢢݒ","ຟ红캟红亣⺟红亟\udea2亣麡꺟躟ﺟ亟\udea2躤뺟ﺟ⺟꺢뺢躟",320344679>(var10001), 2
      );
      var10000 = (-123651032 >>> -123651032 | 0) & -1291370302;

      for (var10001 = (StringBuilder)0<"JNT",848551272,"劂华卺华卢劺","ކࣶࢎࢪ࡞ࢪނࡶࢪࡾࢢނࣲࡖ\u086eࢊࡾࢢݒފࣞ","ຟ红캟红亣⺟红亟\udea2亣麡꺟躟ﺟ亟\udea2躤뺟ﺟ⺟꺢뺢躟",320344665>("￼￼Ώ鿼Ώ");
         var10000 < (-177760266 & -121133359 ^ -263747883);
         var10000 += (-1940662142 - -1894123386 | 1) & 38019075
      ) {
         int var30 = 0<"JNT",1765681486,"匦卒匮卪劮卢","ކऊފल","ຟ红캟红亣⺟红亟\udea2亣麡꺟躟ﺟ亟\udea2躤뺟ﺟ⺟꺢뺢躟",320344668>(var10001, var10000);
         int var53 = (var30 & 32768) >> 15;
         int var31 = ((var30 & 32768) >> 15 | var30 << 1) + 26;
         int var54 = (((var30 & 32768) >> 15 | var30 << 1) + 26 & 63488) >> 11;
         var30 = ((var53 | var30 << 1) + 26 & 63488) >> 11 | ((var30 & 32768) >> 15 | var30 << 1) + 26 << 5;
         var53 = ((var54 | var31 << 5) & 49152) >> 14;
         int var33 = ((var54 | var31 << 5) & 49152) >> 14 | var30 << 2;
         int var56 = ((((var54 | var31 << 5) & 49152) >> 14 | var30 << 2) & 65504) >> 5;
         char var34 = (char)(((var53 | var30 << 2) & 65504) >> 5 | (((var54 | var31 << 5) & 49152) >> 14 | var30 << 2) << 11);
         0<"JNT",1765681486,"卦卞卢劦卒匮卪劮卢","ކऊलފࣞ","ຟ红캟红亣⺟红亟\udea2亣麡꺟躟ﺟ亟\udea2躤뺟ﺟ⺟꺢뺢躟",320344667>(var10001, var10000, (char)(var56 | var33 << 11));
      }

      field_1026 = (Class_367)0<"JNT",848551272,"劂华卺华卢劺","ކࣶࢎࢪ࡞ࢪނࡶࢪࡾࢢނࣲࡖ\u086eࢊࡾࢢݒऊފࣞ","\ude9f",320344792>(
         0<"JNT",1765681486,"卢卶僦卢卪华卺卖","ކފࣶࢎࢪ࡞ࢪނࡶࢪࡾࢢނࣲࡖ\u086eࢊࡾࢢݒ","ຟ红캟红亣⺟红亟\udea2亣麡꺟躟ﺟ亟\udea2躤뺟ﺟ⺟꺢뺢躟",320344789>(var10001), 3
      );
      var10000 = (-1823343873 + -957809238 | 0) & 75825668;

      for (var10001 = (StringBuilder)0<"JNT",848551272,"劂华卺华卢劺","ކࣶࢎࢪ࡞ࢪނࡶࢪࡾࢢނࣲࡖ\u086eࢊࡾࢢݒފࣞ","ຟ红캟红亣⺟红亟\udea2亣麡꺟躟ﺟ亟\udea2躤뺟ﺟ⺟꺢뺢躟",320344791>("彶癶獶獶湶桶橶嵶");
         var10000 < (-606501989 & 104);
         var10000 += 289563237 << 289563237 ^ 676088993
      ) {
         int var37 = 0<"JNT",1765681486,"匦卒匮卪劮卢","ކऊފल","ຟ红캟红亣⺟红亟\udea2亣麡꺟躟ﺟ亟\udea2躤뺟ﺟ⺟꺢뺢躟",320344658>(var10001, var10000) - 'u';
         int var57 = (var37 & 65532) >> 2;
         int var38 = (var37 & 65532) >> 2 | var37 << 14;
         int var58 = (((var37 & 65532) >> 2 | var37 << 14) & 65472) >> 6;
         char var39 = (char)((((var57 | var37 << 14) & 65472) >> 6 | ((var37 & 65532) >> 2 | var37 << 14) << 10) - 248 ^ 55);
         0<"JNT",1765681486,"卦卞卢劦卒匮卪劮卢","ކऊलފࣞ","ຟ红캟红亣⺟红亟\udea2亣麡꺟躟ﺟ亟\udea2躤뺟ﺟ⺟꺢뺢躟",320344657>(var10001, var10000, (char)((var58 | var38 << 10) - 248 ^ 55));
      }

      field_1027 = (Class_367)0<"JNT",848551272,"劂华卺华卢劺","ކࣶࢎࢪ࡞ࢪނࡶࢪࡾࢢނࣲࡖ\u086eࢊࡾࢢݒऊފࣞ","\ude9f",320344659>(
         0<"JNT",1765681486,"卢卶僦卢卪华卺卖","ކފࣶࢎࢪ࡞ࢪނࡶࢪࡾࢢނࣲࡖ\u086eࢊࡾࢢݒ","ຟ红캟红亣⺟红亟\udea2亣麡꺟躟ﺟ亟\udea2躤뺟ﺟ⺟꺢뺢躟",320344660>(var10001), 4
      );
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1149(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = (var10 + 933971590 - 1666945765 + 1710962875 + 969002674 - 1936289495 ^ 693453382) - 1113553287 + 278784316 ^ 755383095;
      MethodHandle var10000 = field_1028[(
            (var10 + 933971590 - 1666945765 + 1710962875 + 969002674 - 1936289495 ^ 693453382) - 1113553287 + 278784316 ^ 755383095
         )
         - 606779306];
      if (field_1028[var10001 - 606779306] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = (-1815861575 << -45603042 | 0) & -1295773947; var23 < var13.length(); var23 += (449819908 + 901460922 | 1) & 104076865) {
            int var42 = var13.charAt(var23);
            int var10004 = (var42 & 0) >> 16;
            int var43 = (var42 & 0) >> 16 | var42 << 0;
            int var77 = (((var42 & 0) >> 16 | var42 << 0) & 64512) >> 10;
            var42 = (((var10004 | var42 << 0) & 64512) >> 10 | ((var42 & 0) >> 16 | var42 << 0) << 6) ^ 150;
            var10004 = (((var77 | var43 << 6) ^ 150) & 65024) >> 9;
            int var45 = (((((var77 | var43 << 6) ^ 150) & 65024) >> 9 | var42 << 7) - 153 ^ 31) - 53;
            int var79 = ((((((var77 | var43 << 6) ^ 150) & 65024) >> 9 | var42 << 7) - 153 ^ 31) - 53 & 32768) >> 15;
            char var46 = (char)(
               (
                     (
                           (((var10004 | var42 << 7) - 153 ^ 31) - 53 & 32768) >> 15
                              | (((((var77 | var43 << 6) ^ 150) & 65024) >> 9 | var42 << 7) - 153 ^ 31) - 53 << 1
                        )
                        ^ 57
                  )
                  - 163
            );
            var13.setCharAt(var23, (char)(((var79 | var45 << 1) ^ 57) - 163));
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = -150154193 ^ 911047403 ^ -1052660028; var29 < var16.length(); var29 += (38346558 | 38346558 | 1) & -989437759) {
            int var51 = var16.charAt(var29) + '-' + 23 + 210 + 84 - 136;
            int var80 = (var51 & 65528) >> 3;
            int var52 = ((var51 & 65528) >> 3 | var51 << 13) - 195;
            int var81 = (((var51 & 65528) >> 3 | var51 << 13) - 195 & 32768) >> 15;
            char var53 = (char)((((var80 | var51 << 13) - 195 & 32768) >> 15 | ((var51 & 65528) >> 3 | var51 << 13) - 195 << 1) ^ 66 ^ 254);
            var16.setCharAt(var29, (char)((var81 | var52 << 1) ^ 66 ^ 254));
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_367.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = 1449493290 >>> 499414749 ^ 2; var35 < var19.length(); var35 += (451177286 | 451177286 ^ 451177286 | 1) & -1056767999) {
            int var58 = (var19.charAt(var35) + 149 - 191 + 53 + 92 ^ 126) + 159;
            int var82 = (var58 & 65408) >> 7;
            int var59 = (var58 & 65408) >> 7 | var58 << 9;
            int var83 = (((var58 & 65408) >> 7 | var58 << 9) & 65504) >> 5;
            char var60 = (char)((((var82 | var58 << 9) & 65504) >> 5 | ((var58 & 65408) >> 7 | var58 << 9) << 11) - 139 - 124);
            var19.setCharAt(var35, (char)((var83 | var59 << 11) - 139 - 124));
         }

         Class var7 = Class.forName(var19.toString(), false, Class_367.class.getClassLoader());
         switch ((var4 - 2113063014 - 376027262 + 1561444404 + 504249795 ^ 295335303) - 1798560728 + 1882430414 - 951698257 - 1811482150 - 1672424804) {
            case 90896663:
               var10000 = var0.findConstructor(var7, var6);
               break;
            case 1043963137:
            case 1305052132:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 1273108795:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            case 1936269954:
               var10000 = var0.findSpecial(var7, var5, var6, Class_367.class);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_1028[((var10 + 933971590 - 1666945765 + 1710962875 + 969002674 - 1936289495 ^ 693453382) - 1113553287 + 278784316 ^ 755383095) - 606779306] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1150(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = var10 - 1500174967 - 1772175743 + 1190391628 - 853786191 + 3194868 + 590507409 - 1266001570 ^ 1229440982 ^ 799098408;
      MethodHandle var10000 = field_1028[(var10 - 1500174967 - 1772175743 + 1190391628 - 853786191 + 3194868 + 590507409 - 1266001570 ^ 1229440982 ^ 799098408)
         - 1409359542];
      if (field_1028[var10001 - 1409359542] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = -857663185 << -857663185 ^ -1936228352; var24 < var14.length(); var24 += (1344603309 * 1344603309 | 1) & -2130181881) {
            int var43 = var14.charAt(var24) ^ 'N';
            char var48 = (char)(
               (
                     (
                              (
                                    (
                                             (
                                                   (
                                                            (
                                                                  (
                                                                           (
                                                                                 (((var43 & 61440) >> 12 | var43 << 4) & 65472) >> 6
                                                                                    | ((var43 & 61440) >> 12 | var43 << 4) << 10
                                                                              )
                                                                              ^ 221
                                                                        )
                                                                        + 29
                                                                     ^ 196
                                                               )
                                                               & 64512
                                                         )
                                                         >> 10
                                                      | (
                                                            (
                                                                     (
                                                                           (((var43 & 61440) >> 12 | var43 << 4) & 65472) >> 6
                                                                              | ((var43 & 61440) >> 12 | var43 << 4) << 10
                                                                        )
                                                                        ^ 221
                                                                  )
                                                                  + 29
                                                               ^ 196
                                                         )
                                                         << 6
                                                )
                                                & 32768
                                          )
                                          >> 15
                                       | (
                                             (
                                                      (
                                                            (
                                                                     (
                                                                           (((var43 & 61440) >> 12 | var43 << 4) & 65472) >> 6
                                                                              | ((var43 & 61440) >> 12 | var43 << 4) << 10
                                                                        )
                                                                        ^ 221
                                                                  )
                                                                  + 29
                                                               ^ 196
                                                         )
                                                         & 64512
                                                   )
                                                   >> 10
                                                | (
                                                      (((((var43 & 61440) >> 12 | var43 << 4) & 65472) >> 6 | ((var43 & 61440) >> 12 | var43 << 4) << 10) ^ 221)
                                                            + 29
                                                         ^ 196
                                                   )
                                                   << 6
                                          )
                                          << 1
                                 )
                                 & 32768
                           )
                           >> 15
                        | (
                              (
                                       (
                                             (
                                                      (
                                                            (
                                                                     (
                                                                           (((var43 & 61440) >> 12 | var43 << 4) & 65472) >> 6
                                                                              | ((var43 & 61440) >> 12 | var43 << 4) << 10
                                                                        )
                                                                        ^ 221
                                                                  )
                                                                  + 29
                                                               ^ 196
                                                         )
                                                         & 64512
                                                   )
                                                   >> 10
                                                | (
                                                      (((((var43 & 61440) >> 12 | var43 << 4) & 65472) >> 6 | ((var43 & 61440) >> 12 | var43 << 4) << 10) ^ 221)
                                                            + 29
                                                         ^ 196
                                                   )
                                                   << 6
                                          )
                                          & 32768
                                    )
                                    >> 15
                                 | (
                                       (
                                                (
                                                      (((((var43 & 61440) >> 12 | var43 << 4) & 65472) >> 6 | ((var43 & 61440) >> 12 | var43 << 4) << 10) ^ 221)
                                                            + 29
                                                         ^ 196
                                                   )
                                                   & 64512
                                             )
                                             >> 10
                                          | (
                                                (((((var43 & 61440) >> 12 | var43 << 4) & 65472) >> 6 | ((var43 & 61440) >> 12 | var43 << 4) << 10) ^ 221) + 29
                                                   ^ 196
                                             )
                                             << 6
                                    )
                                    << 1
                           )
                           << 1
                  )
                  - 156
            );
            var14.setCharAt(
               var24,
               (char)(
                  (
                        (
                                 (
                                       (
                                                (
                                                      (
                                                               (
                                                                     (
                                                                              (
                                                                                    (((var43 & 61440) >> 12 | var43 << 4) & 65472) >> 6
                                                                                       | ((var43 & 61440) >> 12 | var43 << 4) << 10
                                                                                 )
                                                                                 ^ 221
                                                                           )
                                                                           + 29
                                                                        ^ 196
                                                                  )
                                                                  & 64512
                                                            )
                                                            >> 10
                                                         | (
                                                               (
                                                                        (
                                                                              (((var43 & 61440) >> 12 | var43 << 4) & 65472) >> 6
                                                                                 | ((var43 & 61440) >> 12 | var43 << 4) << 10
                                                                           )
                                                                           ^ 221
                                                                     )
                                                                     + 29
                                                                  ^ 196
                                                            )
                                                            << 6
                                                   )
                                                   & 32768
                                             )
                                             >> 15
                                          | (
                                                (
                                                         (
                                                               (
                                                                        (
                                                                              (((var43 & 61440) >> 12 | var43 << 4) & 65472) >> 6
                                                                                 | ((var43 & 61440) >> 12 | var43 << 4) << 10
                                                                           )
                                                                           ^ 221
                                                                     )
                                                                     + 29
                                                                  ^ 196
                                                            )
                                                            & 64512
                                                      )
                                                      >> 10
                                                   | (
                                                         (
                                                                  (
                                                                        (((var43 & 61440) >> 12 | var43 << 4) & 65472) >> 6
                                                                           | ((var43 & 61440) >> 12 | var43 << 4) << 10
                                                                     )
                                                                     ^ 221
                                                               )
                                                               + 29
                                                            ^ 196
                                                      )
                                                      << 6
                                             )
                                             << 1
                                    )
                                    & 32768
                              )
                              >> 15
                           | (
                                 (
                                          (
                                                (
                                                         (
                                                               (
                                                                        (
                                                                              (((var43 & 61440) >> 12 | var43 << 4) & 65472) >> 6
                                                                                 | ((var43 & 61440) >> 12 | var43 << 4) << 10
                                                                           )
                                                                           ^ 221
                                                                     )
                                                                     + 29
                                                                  ^ 196
                                                            )
                                                            & 64512
                                                      )
                                                      >> 10
                                                   | (
                                                         (
                                                                  (
                                                                        (((var43 & 61440) >> 12 | var43 << 4) & 65472) >> 6
                                                                           | ((var43 & 61440) >> 12 | var43 << 4) << 10
                                                                     )
                                                                     ^ 221
                                                               )
                                                               + 29
                                                            ^ 196
                                                      )
                                                      << 6
                                             )
                                             & 32768
                                       )
                                       >> 15
                                    | (
                                          (
                                                   (
                                                         (
                                                                  (
                                                                        (((var43 & 61440) >> 12 | var43 << 4) & 65472) >> 6
                                                                           | ((var43 & 61440) >> 12 | var43 << 4) << 10
                                                                     )
                                                                     ^ 221
                                                               )
                                                               + 29
                                                            ^ 196
                                                      )
                                                      & 64512
                                                )
                                                >> 10
                                             | (
                                                   (((((var43 & 61440) >> 12 | var43 << 4) & 65472) >> 6 | ((var43 & 61440) >> 12 | var43 << 4) << 10) ^ 221)
                                                         + 29
                                                      ^ 196
                                                )
                                                << 6
                                       )
                                       << 1
                              )
                              << 1
                     )
                     - 156
               )
            );
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = (1602819720 * 1818985745 | 0) & -1610069821; var30 < var17.length(); var30 += (-1141328948 + -1879735464 | 1) & 872466441) {
            int var53 = var17.charAt(var30) + 'M' - 41;
            int var94 = (var53 & 0) >> 16;
            int var54 = (((var53 & 0) >> 16 | var53 << 0) ^ 163) - 178 + 134 - 60 + 184;
            int var95 = ((((var53 & 0) >> 16 | var53 << 0) ^ 163) - 178 + 134 - 60 + 184 & 61440) >> 12;
            char var55 = (char)(
               ((((var94 | var53 << 0) ^ 163) - 178 + 134 - 60 + 184 & 61440) >> 12 | (((var53 & 0) >> 16 | var53 << 0) ^ 163) - 178 + 134 - 60 + 184 << 4)
                  ^ 220
            );
            var17.setCharAt(var30, (char)((var95 | var54 << 4) ^ 220));
         }

         Class var6 = Class.forName(var17.toString(), false, Class_367.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = (-265443555 - (-783374900 << 1403973829) | 0) & 151326818;
            var36 < var20.length();
            var36 += (-594841395 >>> 1401337769 | 1) & -1156546043
         ) {
            int var60 = var20.charAt(var36) - 160;
            char var67 = (char)(
               (
                        (
                              (
                                       (
                                             (
                                                      (
                                                            (
                                                                     (
                                                                              (
                                                                                    (
                                                                                             (
                                                                                                   (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                                      | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                                                )
                                                                                                & 65520
                                                                                          )
                                                                                          >> 4
                                                                                       | (
                                                                                             (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                                | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                                          )
                                                                                          << 12
                                                                                 )
                                                                                 ^ 115
                                                                           )
                                                                           - 189
                                                                        & 64512
                                                                  )
                                                                  >> 10
                                                               | (
                                                                        (
                                                                              (
                                                                                       (
                                                                                             (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                                | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                                          )
                                                                                          & 65520
                                                                                    )
                                                                                    >> 4
                                                                                 | (
                                                                                       (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                          | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                                    )
                                                                                    << 12
                                                                           )
                                                                           ^ 115
                                                                     )
                                                                     - 189
                                                                  << 6
                                                         )
                                                         & 65520
                                                   )
                                                   >> 4
                                                | (
                                                      (
                                                               (
                                                                        (
                                                                              (
                                                                                       (
                                                                                             (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                                | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                                          )
                                                                                          & 65520
                                                                                    )
                                                                                    >> 4
                                                                                 | (
                                                                                       (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                          | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                                    )
                                                                                    << 12
                                                                           )
                                                                           ^ 115
                                                                     )
                                                                     - 189
                                                                  & 64512
                                                            )
                                                            >> 10
                                                         | (
                                                                  (
                                                                        (
                                                                                 (
                                                                                       (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                          | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                                    )
                                                                                    & 65520
                                                                              )
                                                                              >> 4
                                                                           | (
                                                                                 (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                    | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                              )
                                                                              << 12
                                                                     )
                                                                     ^ 115
                                                               )
                                                               - 189
                                                            << 6
                                                   )
                                                   << 12
                                          )
                                          & 64512
                                    )
                                    >> 10
                                 | (
                                       (
                                                (
                                                      (
                                                               (
                                                                        (
                                                                              (
                                                                                       (
                                                                                             (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                                | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                                          )
                                                                                          & 65520
                                                                                    )
                                                                                    >> 4
                                                                                 | (
                                                                                       (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                          | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                                    )
                                                                                    << 12
                                                                           )
                                                                           ^ 115
                                                                     )
                                                                     - 189
                                                                  & 64512
                                                            )
                                                            >> 10
                                                         | (
                                                                  (
                                                                        (
                                                                                 (
                                                                                       (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                          | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                                    )
                                                                                    & 65520
                                                                              )
                                                                              >> 4
                                                                           | (
                                                                                 (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                    | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                              )
                                                                              << 12
                                                                     )
                                                                     ^ 115
                                                               )
                                                               - 189
                                                            << 6
                                                   )
                                                   & 65520
                                             )
                                             >> 4
                                          | (
                                                (
                                                         (
                                                                  (
                                                                        (
                                                                                 (
                                                                                       (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                          | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                                    )
                                                                                    & 65520
                                                                              )
                                                                              >> 4
                                                                           | (
                                                                                 (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                    | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                              )
                                                                              << 12
                                                                     )
                                                                     ^ 115
                                                               )
                                                               - 189
                                                            & 64512
                                                      )
                                                      >> 10
                                                   | (
                                                            (
                                                                  (
                                                                           (
                                                                                 (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                    | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                              )
                                                                              & 65520
                                                                        )
                                                                        >> 4
                                                                     | (
                                                                           (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                              | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                        )
                                                                        << 12
                                                               )
                                                               ^ 115
                                                         )
                                                         - 189
                                                      << 6
                                             )
                                             << 12
                                    )
                                    << 6
                           )
                           & 65024
                     )
                     >> 9
                  | (
                        (
                                 (
                                       (
                                                (
                                                      (
                                                               (
                                                                        (
                                                                              (
                                                                                       (
                                                                                             (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                                | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                                          )
                                                                                          & 65520
                                                                                    )
                                                                                    >> 4
                                                                                 | (
                                                                                       (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                          | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                                    )
                                                                                    << 12
                                                                           )
                                                                           ^ 115
                                                                     )
                                                                     - 189
                                                                  & 64512
                                                            )
                                                            >> 10
                                                         | (
                                                                  (
                                                                        (
                                                                                 (
                                                                                       (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                          | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                                    )
                                                                                    & 65520
                                                                              )
                                                                              >> 4
                                                                           | (
                                                                                 (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                    | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                              )
                                                                              << 12
                                                                     )
                                                                     ^ 115
                                                               )
                                                               - 189
                                                            << 6
                                                   )
                                                   & 65520
                                             )
                                             >> 4
                                          | (
                                                (
                                                         (
                                                                  (
                                                                        (
                                                                                 (
                                                                                       (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                          | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                                    )
                                                                                    & 65520
                                                                              )
                                                                              >> 4
                                                                           | (
                                                                                 (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                    | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                              )
                                                                              << 12
                                                                     )
                                                                     ^ 115
                                                               )
                                                               - 189
                                                            & 64512
                                                      )
                                                      >> 10
                                                   | (
                                                            (
                                                                  (
                                                                           (
                                                                                 (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                    | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                              )
                                                                              & 65520
                                                                        )
                                                                        >> 4
                                                                     | (
                                                                           (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                              | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                        )
                                                                        << 12
                                                               )
                                                               ^ 115
                                                         )
                                                         - 189
                                                      << 6
                                             )
                                             << 12
                                    )
                                    & 64512
                              )
                              >> 10
                           | (
                                 (
                                          (
                                                (
                                                         (
                                                                  (
                                                                        (
                                                                                 (
                                                                                       (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                          | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                                    )
                                                                                    & 65520
                                                                              )
                                                                              >> 4
                                                                           | (
                                                                                 (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                    | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                              )
                                                                              << 12
                                                                     )
                                                                     ^ 115
                                                               )
                                                               - 189
                                                            & 64512
                                                      )
                                                      >> 10
                                                   | (
                                                            (
                                                                  (
                                                                           (
                                                                                 (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                    | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                              )
                                                                              & 65520
                                                                        )
                                                                        >> 4
                                                                     | (
                                                                           (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                              | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                        )
                                                                        << 12
                                                               )
                                                               ^ 115
                                                         )
                                                         - 189
                                                      << 6
                                             )
                                             & 65520
                                       )
                                       >> 4
                                    | (
                                          (
                                                   (
                                                            (
                                                                  (
                                                                           (
                                                                                 (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                    | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                              )
                                                                              & 65520
                                                                        )
                                                                        >> 4
                                                                     | (
                                                                           (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                              | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                        )
                                                                        << 12
                                                               )
                                                               ^ 115
                                                         )
                                                         - 189
                                                      & 64512
                                                )
                                                >> 10
                                             | (
                                                      (
                                                            (
                                                                     (
                                                                           (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                              | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                        )
                                                                        & 65520
                                                                  )
                                                                  >> 4
                                                               | ((((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7 | ((var60 & 65408) >> 7 | var60 << 9) << 9)
                                                                  << 12
                                                         )
                                                         ^ 115
                                                   )
                                                   - 189
                                                << 6
                                       )
                                       << 12
                              )
                              << 6
                     )
                     << 7
            );
            var20.setCharAt(
               var36,
               (char)(
                  (
                           (
                                 (
                                          (
                                                (
                                                         (
                                                               (
                                                                        (
                                                                                 (
                                                                                       (
                                                                                                (
                                                                                                      (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                                         | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                                                   )
                                                                                                   & 65520
                                                                                             )
                                                                                             >> 4
                                                                                          | (
                                                                                                (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                                   | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                                             )
                                                                                             << 12
                                                                                    )
                                                                                    ^ 115
                                                                              )
                                                                              - 189
                                                                           & 64512
                                                                     )
                                                                     >> 10
                                                                  | (
                                                                           (
                                                                                 (
                                                                                          (
                                                                                                (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                                   | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                                             )
                                                                                             & 65520
                                                                                       )
                                                                                       >> 4
                                                                                    | (
                                                                                          (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                             | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                                       )
                                                                                       << 12
                                                                              )
                                                                              ^ 115
                                                                        )
                                                                        - 189
                                                                     << 6
                                                            )
                                                            & 65520
                                                      )
                                                      >> 4
                                                   | (
                                                         (
                                                                  (
                                                                           (
                                                                                 (
                                                                                          (
                                                                                                (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                                   | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                                             )
                                                                                             & 65520
                                                                                       )
                                                                                       >> 4
                                                                                    | (
                                                                                          (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                             | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                                       )
                                                                                       << 12
                                                                              )
                                                                              ^ 115
                                                                        )
                                                                        - 189
                                                                     & 64512
                                                               )
                                                               >> 10
                                                            | (
                                                                     (
                                                                           (
                                                                                    (
                                                                                          (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                             | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                                       )
                                                                                       & 65520
                                                                                 )
                                                                                 >> 4
                                                                              | (
                                                                                    (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                       | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                                 )
                                                                                 << 12
                                                                        )
                                                                        ^ 115
                                                                  )
                                                                  - 189
                                                               << 6
                                                      )
                                                      << 12
                                             )
                                             & 64512
                                       )
                                       >> 10
                                    | (
                                          (
                                                   (
                                                         (
                                                                  (
                                                                           (
                                                                                 (
                                                                                          (
                                                                                                (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                                   | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                                             )
                                                                                             & 65520
                                                                                       )
                                                                                       >> 4
                                                                                    | (
                                                                                          (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                             | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                                       )
                                                                                       << 12
                                                                              )
                                                                              ^ 115
                                                                        )
                                                                        - 189
                                                                     & 64512
                                                               )
                                                               >> 10
                                                            | (
                                                                     (
                                                                           (
                                                                                    (
                                                                                          (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                             | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                                       )
                                                                                       & 65520
                                                                                 )
                                                                                 >> 4
                                                                              | (
                                                                                    (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                       | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                                 )
                                                                                 << 12
                                                                        )
                                                                        ^ 115
                                                                  )
                                                                  - 189
                                                               << 6
                                                      )
                                                      & 65520
                                                )
                                                >> 4
                                             | (
                                                   (
                                                            (
                                                                     (
                                                                           (
                                                                                    (
                                                                                          (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                             | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                                       )
                                                                                       & 65520
                                                                                 )
                                                                                 >> 4
                                                                              | (
                                                                                    (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                       | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                                 )
                                                                                 << 12
                                                                        )
                                                                        ^ 115
                                                                  )
                                                                  - 189
                                                               & 64512
                                                         )
                                                         >> 10
                                                      | (
                                                               (
                                                                     (
                                                                              (
                                                                                    (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                       | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                                 )
                                                                                 & 65520
                                                                           )
                                                                           >> 4
                                                                        | (
                                                                              (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                 | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                           )
                                                                           << 12
                                                                  )
                                                                  ^ 115
                                                            )
                                                            - 189
                                                         << 6
                                                )
                                                << 12
                                       )
                                       << 6
                              )
                              & 65024
                        )
                        >> 9
                     | (
                           (
                                    (
                                          (
                                                   (
                                                         (
                                                                  (
                                                                           (
                                                                                 (
                                                                                          (
                                                                                                (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                                   | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                                             )
                                                                                             & 65520
                                                                                       )
                                                                                       >> 4
                                                                                    | (
                                                                                          (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                             | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                                       )
                                                                                       << 12
                                                                              )
                                                                              ^ 115
                                                                        )
                                                                        - 189
                                                                     & 64512
                                                               )
                                                               >> 10
                                                            | (
                                                                     (
                                                                           (
                                                                                    (
                                                                                          (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                             | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                                       )
                                                                                       & 65520
                                                                                 )
                                                                                 >> 4
                                                                              | (
                                                                                    (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                       | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                                 )
                                                                                 << 12
                                                                        )
                                                                        ^ 115
                                                                  )
                                                                  - 189
                                                               << 6
                                                      )
                                                      & 65520
                                                )
                                                >> 4
                                             | (
                                                   (
                                                            (
                                                                     (
                                                                           (
                                                                                    (
                                                                                          (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                             | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                                       )
                                                                                       & 65520
                                                                                 )
                                                                                 >> 4
                                                                              | (
                                                                                    (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                       | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                                 )
                                                                                 << 12
                                                                        )
                                                                        ^ 115
                                                                  )
                                                                  - 189
                                                               & 64512
                                                         )
                                                         >> 10
                                                      | (
                                                               (
                                                                     (
                                                                              (
                                                                                    (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                       | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                                 )
                                                                                 & 65520
                                                                           )
                                                                           >> 4
                                                                        | (
                                                                              (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                 | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                           )
                                                                           << 12
                                                                  )
                                                                  ^ 115
                                                            )
                                                            - 189
                                                         << 6
                                                )
                                                << 12
                                       )
                                       & 64512
                                 )
                                 >> 10
                              | (
                                    (
                                             (
                                                   (
                                                            (
                                                                     (
                                                                           (
                                                                                    (
                                                                                          (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                             | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                                       )
                                                                                       & 65520
                                                                                 )
                                                                                 >> 4
                                                                              | (
                                                                                    (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                       | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                                 )
                                                                                 << 12
                                                                        )
                                                                        ^ 115
                                                                  )
                                                                  - 189
                                                               & 64512
                                                         )
                                                         >> 10
                                                      | (
                                                               (
                                                                     (
                                                                              (
                                                                                    (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                       | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                                 )
                                                                                 & 65520
                                                                           )
                                                                           >> 4
                                                                        | (
                                                                              (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                 | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                           )
                                                                           << 12
                                                                  )
                                                                  ^ 115
                                                            )
                                                            - 189
                                                         << 6
                                                )
                                                & 65520
                                          )
                                          >> 4
                                       | (
                                             (
                                                      (
                                                               (
                                                                     (
                                                                              (
                                                                                    (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                       | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                                 )
                                                                                 & 65520
                                                                           )
                                                                           >> 4
                                                                        | (
                                                                              (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                 | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                           )
                                                                           << 12
                                                                  )
                                                                  ^ 115
                                                            )
                                                            - 189
                                                         & 64512
                                                   )
                                                   >> 10
                                                | (
                                                         (
                                                               (
                                                                        (
                                                                              (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                                 | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                           )
                                                                           & 65520
                                                                     )
                                                                     >> 4
                                                                  | (
                                                                        (((var60 & 65408) >> 7 | var60 << 9) & 65408) >> 7
                                                                           | ((var60 & 65408) >> 7 | var60 << 9) << 9
                                                                     )
                                                                     << 12
                                                            )
                                                            ^ 115
                                                      )
                                                      - 189
                                                   << 6
                                          )
                                          << 12
                                 )
                                 << 6
                        )
                        << 7
               )
            );
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_367.class.getClassLoader()).returnType();
         switch (((((var4 ^ 584615915) + 176087158 - 526077718 ^ 981580094) + 913131032 ^ 1080038756) + 415175951 + 1514744553 ^ 646823762) - 2051798239) {
            case 419056636:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            case 1023510224:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            case 1127750201:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            case 2122079295:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_1028[(var10 - 1500174967 - 1772175743 + 1190391628 - 853786191 + 3194868 + 590507409 - 1266001570 ^ 1229440982 ^ 799098408) - 1409359542] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
