import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;
import net.minecraft.class_1819;
import net.minecraft.class_3965;

public class Class_176 extends Class_342 {
   // $VF: renamed from: duo Class_49
   public Class_49 field_2041;
   // $VF: renamed from: zj Class_49
   public Class_49 field_2042;
   // $VF: renamed from: kig Class_49
   public Class_49 field_2043;
   // $VF: renamed from: mt Class_49
   public Class_49 field_2044;
   // $VF: renamed from: ut int
   public int field_2045;
   // $VF: renamed from: hju int
   public int field_2046;
   // $VF: renamed from: jid int
   public int field_2047;
   // $VF: renamed from: vql java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_2048 = new MethodHandle[138];

   public Class_176() {
      int var10001 = 1171164078 ^ -219601761 ^ -1222136015;

      StringBuilder var10002;
      for (var10002 = (StringBuilder)0<"JNT",-1960818773,"\u001d\n￫\n\ufff5\u001b","\uf070びၵ聴큵聴恱ふ聴偵\ue074恱ꁳ끵遵u偵\ue074\u2072q큳","ￂￏￎￏ&￤ￏ￦ﾽ&\uffc9ￌ￪ￗ￦ﾽ:ￓￗ￤ﾼￃ￪",-1993744472>(
            "Â\u009c\u0086\u0090\u009e¤\u0000Ú\u0082\u0086¤\u009e"
         );
         var10001 < (-1386463270 + 1348738691 ^ -37724591);
         var10001 += -1535192830 << -1925894550 ^ -79427583
      ) {
         int var22 = 0<"JNT",-1190575820,"\u0000\t\u0002\uffef\"\ufff5","\uf070sqꁲ","ￂￏￎￏ&￤ￏ￦ﾽ&\uffc9ￌ￪ￗ￦ﾽ:ￓￗ￤ﾼￃ￪",-1993745769>(var10002, var10001) ^ 'L';
         int var10005 = (var22 & 65534) >> 1;
         int var23 = ((var22 & 65534) >> 1 | var22 << 15) ^ 2;
         int var58 = ((((var22 & 65534) >> 1 | var22 << 15) ^ 2) & 65535) >> 0;
         char var24 = (char)(((((var10005 | var22 << 15) ^ 2) & 65535) >> 0 | (((var22 & 65534) >> 1 | var22 << 15) ^ 2) << 16) ^ 4);
         0<"JNT",-1190575820,"\ufff0\u0006\ufff5 \t\u0002\uffef\"\ufff5","\uf070sꁲq큳","ￂￏￎￏ&￤ￏ￦ﾽ&\uffc9ￌ￪ￗ￦ﾽ:ￓￗ￤ﾼￃ￪",-1993745768>(
            var10002, var10001, (char)((var58 | var23 << 16) ^ 4)
         );
      }

      String var2 = 0<"JNT",-1190575820,"\ufff5￬\u0010\ufff5\uffef\n￫\u0004","\uf070qびၵ聴큵聴恱ふ聴偵\ue074恱ꁳ끵遵u偵\ue074\u2072","ￂￏￎￏ&￤ￏ￦ﾽ&\uffc9ￌ￪ￗ￦ﾽ:ￓￗ￤ﾼￃ￪",-1993745779>(
         var10002
      );
      int var12 = (200659879 << 336116054 | 0) & 270980607;

      StringBuilder var26;
      for (var26 = (StringBuilder)0<"JNT",-1960818773,"\u001d\n￫\n\ufff5\u001b","\uf070びၵ聴큵聴恱ふ聴偵\ue074恱ꁳ끵遵u偵\ue074\u2072q큳","ￂￏￎￏ&￤ￏ￦ﾽ&\uffc9ￌ￪ￗ￦ﾽ:ￓￗ￤ﾼￃ￪",-1993745778>(
            "Ｖｪｩ､｢ｖｩ～ｘｖ｡｡ｮ５ｗ｡､ｬｨ５ｪ･５ｧｚｨ･ｖｬ｣５ｖ｣ｘ｝､ｧｨ５｛､ｧ５ｮ､ｪ"
         );
         var12 < ((-1069549369 << (-618204925 >>> -618204925) | 40) & 12584510);
         var12 += 1
      ) {
         0<"JNT",-1190575820,"\ufff0\u0006\ufff5 \t\u0002\uffef\"\ufff5","\uf070sꁲq큳","ￂￏￎￏ&￤ￏ￦ﾽ&\uffc9ￌ￪ￗ￦ﾽ:ￓￗ￤ﾼￃ￪",-1993744483>(
            var26,
            var12,
            (char)(
               0<"JNT",-1190575820,"\u0000\t\u0002\uffef\"\ufff5","\uf070sqꁲ","ￂￏￎￏ&￤ￏ￦ﾽ&\uffc9ￌ￪ￗ￦ﾽ:ￓￗ￤ﾼￃ￪",-1993744476>(var26, var12)
                  + 206
                  - 46
                  - 131
                  + 210
                  + 28
            )
         );
      }

      super(
         var2,
         0<"JNT",-1190575820,"\ufff5￬\u0010\ufff5\uffef\n￫\u0004","\uf070qびၵ聴큵聴恱ふ聴偵\ue074恱ꁳ끵遵u偵\ue074\u2072","ￂￏￎￏ&￤ￏ￦ﾽ&\uffc9ￌ￪ￗ￦ﾽ:ￓￗ￤ﾼￃ￪",-1993745780>(var26),
         -1,
         1<"JNT",-1790568060,"뉆賆","ꤌꥣ","蟺鿺怄᠅퀄\ueffb",-1453188478>()
      );
      var10001 = -923826718 + -923826718 ^ -1847653436;

      for (var10002 = (StringBuilder)0<"JNT",-1960818773,"\u001d\n￫\n\ufff5\u001b","\uf070びၵ聴큵聴恱ふ聴偵\ue074恱ꁳ끵遵u偵\ue074\u2072q큳","ￂￏￎￏ&￤ￏ￦ﾽ&\uffc9ￌ￪ￗ￦ﾽ:ￓￗ￤ﾼￃ￪",-1993745786>(
            "쓣윣욃윳엣왳쇳쐳왃욳옃잃"
         );
         var10001 < (180503255 << 19316595 ^ 381157388);
         var10001 += (-836862110 | 1582292661 | 0) & 538968065
      ) {
         int var29 = 0<"JNT",-1190575820,"\u0000\t\u0002\uffef\"\ufff5","\uf070sqꁲ","ￂￏￎￏ&￤ￏ￦ﾽ&\uffc9ￌ￪ￗ￦ﾽ:ￓￗ￤ﾼￃ￪",-1993744479>(var10002, var10001) - '\t';
         int var59 = (var29 & 49152) >> 14;
         int var30 = ((var29 & 49152) >> 14 | var29 << 2) + 218 ^ 133;
         int var60 = ((((var29 & 49152) >> 14 | var29 << 2) + 218 ^ 133) & 65472) >> 6;
         char var31 = (char)((((var59 | var29 << 2) + 218 ^ 133) & 65472) >> 6 | (((var29 & 49152) >> 14 | var29 << 2) + 218 ^ 133) << 10);
         0<"JNT",-1190575820,"\ufff0\u0006\ufff5 \t\u0002\uffef\"\ufff5","\uf070sꁲq큳","ￂￏￎￏ&￤ￏ￦ﾽ&\uffc9ￌ￪ￗ￦ﾽ:ￓￗ￤ﾼￃ￪",-1993744478>(
            var10002, var10001, (char)(var60 | var30 << 10)
         );
      }

      this.field_2041 = (Class_49)0<"JNT",-1960818773,"\u001d\n￫\n\ufff5\u001b","\uf070びၵ聴큵聴恱ふ聴偵\ue074恱ꁳ끵遵u偵\ue074\u2072끲끲끲끲q큳","ﾼ\uffd9",-1993745764>(
         0<"JNT",-1190575820,"\ufff5￬\u0010\ufff5\uffef\n￫\u0004","\uf070qびၵ聴큵聴恱ふ聴偵\ue074恱ꁳ끵遵u偵\ue074\u2072","ￂￏￎￏ&￤ￏ￦ﾽ&\uffc9ￌ￪ￗ￦ﾽ:ￓￗ￤ﾼￃ￪",-1993745765>(
            var10002
         ),
         0.0,
         20.0,
         0.0,
         1.0
      );
      var10001 = (-1040961363 << 1827588868 | 0) & -533678813;

      for (var10002 = (StringBuilder)0<"JNT",-1960818773,"\u001d\n￫\n\ufff5\u001b","\uf070びၵ聴큵聴恱ふ聴偵\ue074恱ꁳ끵遵u偵\ue074\u2072q큳","ￂￏￎￏ&￤ￏ￦ﾽ&\uffc9ￌ￪ￗ￦ﾽ:ￓￗ￤ﾼￃ￪",-1993745771>(
            "텥復ᅧ內ㅧ㥧ᅧ१셦饤륥셦復ꅦ慧"
         );
         var10001 < ((-1822787156 ^ -1536282857 | 13) & -1060929457);
         var10001 += (1066324066 | 1066324066) ^ 1066324067
      ) {
         char var34 = 0<"JNT",-1190575820,"\u0000\t\u0002\uffef\"\ufff5","\uf070sqꁲ","ￂￏￎￏ&￤ￏ￦ﾽ&\uffc9ￌ￪ￗ￦ﾽ:ￓￗ￤ﾼￃ￪",-1993745770>(var10002, var10001);
         char var37 = (char)(
            (
                  (((((var34 & 0) >> 16 | var34 << 0) & 65520) >> 4 | ((var34 & 0) >> 16 | var34 << 0) << 12) - 150 & 65408) >> 7
                     | ((((var34 & 0) >> 16 | var34 << 0) & 65520) >> 4 | ((var34 & 0) >> 16 | var34 << 0) << 12) - 150 << 9
               )
               - 114
         );
         0<"JNT",-1190575820,"\ufff0\u0006\ufff5 \t\u0002\uffef\"\ufff5","\uf070sꁲq큳","ￂￏￎￏ&￤ￏ￦ﾽ&\uffc9ￌ￪ￗ￦ﾽ:ￓￗ￤ﾼￃ￪",-1993745761>(
            var10002,
            var10001,
            (char)(
               (
                     (((((var34 & 0) >> 16 | var34 << 0) & 65520) >> 4 | ((var34 & 0) >> 16 | var34 << 0) << 12) - 150 & 65408) >> 7
                        | ((((var34 & 0) >> 16 | var34 << 0) & 65520) >> 4 | ((var34 & 0) >> 16 | var34 << 0) << 12) - 150 << 9
                  )
                  - 114
            )
         );
      }

      this.field_2042 = (Class_49)0<"JNT",-1960818773,"\u001d\n￫\n\ufff5\u001b","\uf070びၵ聴큵聴恱ふ聴偵\ue074恱ꁳ끵遵u偵\ue074\u2072끲끲끲끲q큳","ﾼ\uffd9",-1993745774>(
         0<"JNT",-1190575820,"\ufff5￬\u0010\ufff5\uffef\n￫\u0004","\uf070qびၵ聴큵聴恱ふ聴偵\ue074恱ꁳ끵遵u偵\ue074\u2072","ￂￏￎￏ&￤ￏ￦ﾽ&\uffc9ￌ￪ￗ￦ﾽ:ￓￗ￤ﾼￃ￪",-1993745775>(
            var10002
         ),
         0.0,
         20.0,
         0.0,
         1.0
      );
      var10001 = -1712694608 ^ 299839656 >> 642506701 ^ -1712663479;

      for (var10002 = (StringBuilder)0<"JNT",-1960818773,"\u001d\n￫\n\ufff5\u001b","\uf070びၵ聴큵聴恱ふ聴偵\ue074恱ꁳ끵遵u偵\ue074\u2072q큳","ￂￏￎￏ&￤ￏ￦ﾽ&\uffc9ￌ￪ￗ￦ﾽ:ￓￗ￤ﾼￃ￪",-1993745781>(
            "ƿƌƔƘƕƠƟŤŀƟƘƣƋ"
         );
         var10001 < (358982759 - 358982759 ^ 13);
         var10001 += 141866514 ^ -532927499 ^ -397894170
      ) {
         0<"JNT",-1190575820,"\ufff0\u0006\ufff5 \t\u0002\uffef\"\ufff5","\uf070sꁲq큳","ￂￏￎￏ&￤ￏ￦ﾽ&\uffc9ￌ￪ￗ￦ﾽ:ￓￗ￤ﾼￃ￪",-1993745767>(
            var10002,
            var10001,
            (char)(
               (0<"JNT",-1190575820,"\u0000\t\u0002\uffef\"\ufff5","\uf070sqꁲ","ￂￏￎￏ&￤ￏ￦ﾽ&\uffc9ￌ￪ￗ￦ﾽ:ￓￗ￤ﾼￃ￪",-1993745760>(var10002, var10001) ^ '?')
                  + 67
                  - 191
                  + 12
                  - 203
            )
         );
      }

      this.field_2043 = (Class_49)0<"JNT",-1960818773,"\u001d\n￫\n\ufff5\u001b","\uf070びၵ聴큵聴恱ふ聴偵\ue074恱ꁳ끵遵u偵\ue074\u2072끲끲끲끲q큳","ﾼ\uffd9",-1993745773>(
         0<"JNT",-1190575820,"\ufff5￬\u0010\ufff5\uffef\n￫\u0004","\uf070qびၵ聴큵聴恱ふ聴偵\ue074恱ꁳ끵遵u偵\ue074\u2072","ￂￏￎￏ&￤ￏ￦ﾽ&\uffc9ￌ￪ￗ￦ﾽ:ￓￗ￤ﾼￃ￪",-1993745766>(
            var10002
         ),
         0.0,
         20.0,
         0.0,
         1.0
      );
      var10001 = ~(-109193089 >> -109193089);

      for (var10002 = (StringBuilder)0<"JNT",-1960818773,"\u001d\n￫\n\ufff5\u001b","\uf070びၵ聴큵聴恱ふ聴偵\ue074恱ꁳ끵遵u偵\ue074\u2072q큳","ￂￏￎￏ&￤ￏ￦ﾽ&\uffc9ￌ￪ￗ￦ﾽ:ￓￗ￤ﾼￃ￪",-1993745772>(
            "麬풬\udeac사킬㚬鲬캬풬\udeac"
         );
         var10001 < (-2146943090 & 611631227);
         var10001 += (-1508300763 + (-185473416 >> -185473416) | 1) & 415405537
      ) {
         char var42 = 0<"JNT",-1190575820,"\u0000\t\u0002\uffef\"\ufff5","\uf070sqꁲ","ￂￏￎￏ&￤ￏ￦ﾽ&\uffc9ￌ￪ￗ￦ﾽ:ￓￗ￤ﾼￃ￪",-1993744482>(var10002, var10001);
         char var45 = (char)(
            (
                  (((((var42 & '\uffff') >> 0 | var42 << 16) - 171 & 65528) >> 3 | ((var42 & '\uffff') >> 0 | var42 << 16) - 171 << 13) & 65472) >> 6
                     | ((((var42 & '\uffff') >> 0 | var42 << 16) - 171 & 65528) >> 3 | ((var42 & '\uffff') >> 0 | var42 << 16) - 171 << 13) << 10
               )
               - 123
         );
         0<"JNT",-1190575820,"\ufff0\u0006\ufff5 \t\u0002\uffef\"\ufff5","\uf070sꁲq큳","ￂￏￎￏ&￤ￏ￦ﾽ&\uffc9ￌ￪ￗ￦ﾽ:ￓￗ￤ﾼￃ￪",-1993744473>(
            var10002,
            var10001,
            (char)(
               (
                     (((((var42 & '\uffff') >> 0 | var42 << 16) - 171 & 65528) >> 3 | ((var42 & '\uffff') >> 0 | var42 << 16) - 171 << 13) & 65472) >> 6
                        | ((((var42 & '\uffff') >> 0 | var42 << 16) - 171 & 65528) >> 3 | ((var42 & '\uffff') >> 0 | var42 << 16) - 171 << 13) << 10
                  )
                  - 123
            )
         );
      }

      this.field_2044 = (Class_49)0<"JNT",-1960818773,"\u001d\n￫\n\ufff5\u001b","\uf070びၵ聴큵聴恱ふ聴偵\ue074恱ꁳ끵遵u偵\ue074\u2072끲끲끲끲q큳","ﾼ\uffd9",-1993745776>(
         0<"JNT",-1190575820,"\ufff5￬\u0010\ufff5\uffef\n￫\u0004","\uf070qびၵ聴큵聴恱ふ聴偵\ue074恱ꁳ끵遵u偵\ue074\u2072","ￂￏￎￏ&￤ￏ￦ﾽ&\uffc9ￌ￪ￗ￦ﾽ:ￓￗ￤ﾼￃ￪",-1993745777>(
            var10002
         ),
         1.0,
         9.0,
         1.0,
         1.0
      );
      this.field_2045 = 0;
      this.field_2046 = 0;
      this.field_2047 = 0;
      0<"JNT",-1190575820,"\ufff2\ufff6","\uf070⁴び聵쁴쁴\u2072q큳","￤ￏ",-1993745795>(
         this,
         new Class_271[]{
            1<"JNT",-1951742075,"识둆赆","\ua95dꥤ","蟺鿺怄ꀄꠄ\ueffb",-1453188482>(this),
            1<"JNT",-1951742075,"뛆軆","\ua95dꥤ","蟺鿺怄ꀄꠄ\ueffb",-1453188481>(this),
            1<"JNT",-1951742075,"轆詆襆","\ua95dꥤ","蟺鿺怄ꀄꠄ\ueffb",-1453188484>(this),
            1<"JNT",-1951742075,"遆돆","\ua95dꥤ","蟺鿺怄ꀄꠄ\ueffb",-1453188483>(this)
         }
      );
   }

   // $VF: renamed from: mg () void
   @Override
   public void method_1407() {
      0<"JNT",-1190575820,"￫\ufff7","\uf070q큳","￤ￏ",-1993745794>(this);
      0<"JNT",1860333513,"￮\u0004","\uf070q큳","ￓ￩ﾾ",-1993745785>(this);
   }

   // $VF: renamed from: q () void
   @Override
   public void method_1408() {
      0<"JNT",1860333513,"\ufff2","\uf070q큳","ￓ￩ﾾ",-1993745784>(this);
   }

   // $VF: renamed from: gd (Class_207) void
   @Class_21
   public void method_1762(Class_207 var1) {
      int var2 = -201374394;
      if (1<"JNT",-1951742075,"裆詆豆迆识蕆滆酆鑆鑆","ꤗꥠꤕ\ua957ꤘ\ua95cꤗꥠꥦꤓꥤ꥟ꤕ\ua957ꥦ\ua95dꥤꤖꤖꥪ\ua956\ua954\ua959","蟺鿺怄瀅렄 俻砅頄瀅렄ꠄ倅\ud804뀄 俻ꠄ怅\ud804⠅⠅전⟻⿻\u0ffb\ueffb",-1453188489>(
            1<"JNT",-1951742075,"迆닆","\ua95dꥤ","蟺鿺怄瀅렄 俻砅頄瀅렄ꠄ倅\ud804뀄 俻ꠄ怅\ud804⠅⠅전⿻忻䟻\ueffb",-1453188490>(this)
         )
         == null) {
         var2 = (17806704 + 17806704 | -1644952565) & -34204101;

         while (true) {
            switch (((var2 ^ 1745563786) - 63675963 + 337847822 - 2059294649 ^ 536340551) - 1781111493) {
               case -1622458570:
               default:
                  return;
               case -94287251:
                  if (0<"JNT",1883514359,"￮\u0000","\uf070sqၴ","￤ￚ",-1993745796>(1)) {
                     0<"JNT",-1190575820,"\ufff2\n\ufff1","\uf070q큳","￤ￏ",-1993744651>(this);
                  }

                  var2 = 301707320 >> 301707320 ^ -387894983;
                  break;
               case 708310071:
                  if (0<"JNT",-1190575820,"\u0005\u0004￫","\uf070qၴ","￤ￏ",-1993745797>(this)) {
                     return;
                  }

                  var2 = -1914114607;
            }
         }
      }
   }

   // $VF: renamed from: dgn () boolean
   // $VF: Irreducible bytecode was duplicated to produce valid code
   public boolean method_1763() {
      int var4 = 1300244510;
      if (!0<"JNT",-1486886529,"￮\u0006\ufff5\t￬\u0005￼ﾶﾴﾹﾰﾯ","\uf070び偵쁴끵恱䁵u偵쁴ꁴ遵聴클끵恱ꁴふ聴ꁵꁵ恴rꁱꁱ聱\u2072qၴ","￦ￃￌ&￫ￗ￦ￃ\uffd9￪ￏﾾￌ&\uffd9￤ￏ￩￩ￕ')*)",-1993744656>(
            0<"JNT",-1190575820,"￮\u0006\ufff5\t￬\u0005￼ﾶﾴﾰﾵﾴ","\uf070qび偵쁴끵恱䁵u偵쁴ꁴ遵聴클끵恱ꁴふ聴ꁵꁵ恴rꁱ遱ꁱ\u2072","￦ￃￌ&￫ￗ￦ￃ\uffd9￪ￏﾾￌ&\uffd9￤ￏ￩￩ￕ\u001f\r'*",-1993744666>(
               0<"JNT",-1190575820,"￮\u0006\ufff5\t￬\u0005￼ﾴﾺﾱﾺ","\uf070qび偵쁴끵恱䁵u偵쁴ꁴ遵聴클끵恱ꁴふ聴ꁵꁵ恴聱\ue071r遱\u2072","￦ￃￌ&￫ￗ￦ￃ\uffd9￪ￏﾾￌ&\uffd9￤ￏ￩￩ￕ\u001f\r''",-1993744667>(
                  0<"JNT",-1190575820,"￮\u0006\ufff5\t￬\u0005￼ﾳﾱﾵﾴ","\uf070qび偵쁴끵恱䁵u偵쁴ꁴ遵聴클끵恱ꁴふ聴ꁵꁵ恴聱\ue071rr\u2072","￦ￃￌ&￫ￗ￦ￃ\uffd9￪ￏﾾￌ&\uffd9￤ￏ￩￩ￕ\r\f\u000e",-1993744660>(
                     1<"JNT",-1951742075,"裆詆豆迆识蕆滆酆鋆鏆","ꤗꥠꤕ\ua957ꤘ\ua95cꤗꥠꥦꤓꥤ꥟ꤕ\ua957ꥦ\ua95dꥤꤖꤖꥪ\ua956\ua954\ua959","蟺鿺怄瀅렄 俻砅頄瀅렄ꠄ倅\ud804뀄 俻ꠄ怅\ud804⠅⠅전\u0ffb⟻㟻\ueffb",-1453188508>(
                        1<"JNT",-1951742075,"迆닆","\ua95dꥤ","蟺鿺怄瀅렄 俻砅頄瀅렄ꠄ倅\ud804뀄 俻ꠄ怅\ud804⠅⠅전⿻忻䟻\ueffb",-1453188505>(this)
                     )
                  )
               )
            ),
            1<"JNT",-1790568060,"裆詆豆迆识蕆鑆湆湆酆鑆","ꤗꥠꤕ\ua957ꤘ\ua95cꤗꥠꥦꤓꥤ꥟ꤕ\ua957ꥦ\ua95dꥤꤖꤖꥪꥌ\ua956\ua956\ua955","蟺鿺怄瀅렄 俻砅頄瀅렄ꠄ倅\ud804뀄 俻ꠄ怅\ud804⠅⠅전Ώ⿻⿻忻\ueffb",-1453188512>()
         )
         && !0<"JNT",-1486886529,"￮\u0006\ufff5\t￬\u0005￼ﾶﾴﾹﾰﾯ","\uf070び偵쁴끵恱䁵u偵쁴ꁴ遵聴클끵恱ꁴふ聴ꁵꁵ恴rꁱꁱ聱\u2072qၴ","￦ￃￌ&￫ￗ￦ￃ\uffd9￪ￏﾾￌ&\uffd9￤ￏ￩￩ￕ')*)",-1993744665>(
            0<"JNT",-1190575820,"￮\u0006\ufff5\t￬\u0005￼ﾶﾴﾰﾵﾴ","\uf070qび偵쁴끵恱䁵u偵쁴ꁴ遵聴클끵恱ꁴふ聴ꁵꁵ恴rꁱ遱ꁱ\u2072","￦ￃￌ&￫ￗ￦ￃ\uffd9￪ￏﾾￌ&\uffd9￤ￏ￩￩ￕ\u001f\r'*",-1993744675>(
               0<"JNT",-1190575820,"￮\u0006\ufff5\t￬\u0005￼ﾴﾺﾱﾺ","\uf070qび偵쁴끵恱䁵u偵쁴ꁴ遵聴클끵恱ꁴふ聴ꁵꁵ恴聱\ue071r遱\u2072","￦ￃￌ&￫ￗ￦ￃ\uffd9￪ￏﾾￌ&\uffd9￤ￏ￩￩ￕ\u001f\r''",-1993744668>(
                  0<"JNT",-1190575820,"￮\u0006\ufff5\t￬\u0005￼ﾳﾱﾴﾺ","\uf070qび偵쁴끵恱䁵u偵쁴ꁴ遵聴클끵恱ꁴふ聴ꁵꁵ恴聱\ue071rr\u2072","￦ￃￌ&￫ￗ￦ￃ\uffd9￪ￏﾾￌ&\uffd9￤ￏ￩￩ￕ\r\f\u000e",-1993744669>(
                     1<"JNT",-1951742075,"裆詆豆迆识蕆滆酆鋆鏆","ꤗꥠꤕ\ua957ꤘ\ua95cꤗꥠꥦꤓꥤ꥟ꤕ\ua957ꥦ\ua95dꥤꤖꤖꥪ\ua956\ua954\ua959","蟺鿺怄瀅렄 俻砅頄瀅렄ꠄ倅\ud804뀄 俻ꠄ怅\ud804⠅⠅전\u0ffb⟻㟻\ueffb",-1453188897>(
                        1<"JNT",-1951742075,"迆닆","\ua95dꥤ","蟺鿺怄瀅렄 俻砅頄瀅렄ꠄ倅\ud804뀄 俻ꠄ怅\ud804⠅⠅전⿻忻䟻\ueffb",-1453188898>(this)
                     )
                  )
               )
            ),
            1<"JNT",-1790568060,"裆詆豆迆识蕆鑆湆湆酆鑆","ꤗꥠꤕ\ua957ꤘ\ua95cꤗꥠꥦꤓꥤ꥟ꤕ\ua957ꥦ\ua95dꥤꤖꤖꥪꥌ\ua956\ua956\ua955","蟺鿺怄瀅렄 俻砅頄瀅렄ꠄ倅\ud804뀄 俻ꠄ怅\ud804⠅⠅전Ώ⿻⿻忻\ueffb",-1453188901>()
         )) {
         var4 = (-4261165 | 551048816) & 786103922;
      } else {
         var4 = -1142720911 << -1142720911 ^ 1299257700;
      }
      boolean var1 = switch (((var4 ^ 1826121680) + 428170686 ^ 579279164 ^ 612558092 ^ 309205133) - 2110319909) {
         case -769448264 -> false;
         default -> true;
      };
      if (!(
            0<"JNT",-1190575820,"￮\u0006\ufff5\t￬\u0005￼ﾴﾺﾱﾺ","\uf070qび偵쁴끵恱䁵u偵쁴ꁴ遵聴클끵恱ꁴふ聴ꁵꁵ恴聱\ue071r遱\u2072","￦ￃￌ&￫ￗ￦ￃ\uffd9￪ￏﾾￌ&\uffd9￤ￏ￩￩ￕ\u001f\r''",-1993745799>(
               0<"JNT",-1190575820,"￮\u0006\ufff5\t￬\u0005￼ﾳﾱﾵﾴ","\uf070qび偵쁴끵恱䁵u偵쁴ꁴ遵聴클끵恱ꁴふ聴ꁵꁵ恴聱\ue071rr\u2072","￦ￃￌ&￫ￗ￦ￃ\uffd9￪ￏﾾￌ&\uffd9￤ￏ￩￩ￕ\r\f\u000e",-1993745792>(
                  1<"JNT",-1951742075,"裆詆豆迆识蕆滆酆鋆鏆","ꤗꥠꤕ\ua957ꤘ\ua95cꤗꥠꥦꤓꥤ꥟ꤕ\ua957ꥦ\ua95dꥤꤖꤖꥪ\ua956\ua954\ua959","蟺鿺怄瀅렄 俻砅頄瀅렄ꠄ倅\ud804뀄 俻ꠄ怅\ud804⠅⠅전\u0ffb⟻㟻\ueffb",-1453188496>(
                     1<"JNT",-1951742075,"迆닆","\ua95dꥤ","蟺鿺怄瀅렄 俻砅頄瀅렄ꠄ倅\ud804뀄 俻ꠄ怅\ud804⠅⠅전⿻忻䟻\ueffb",-1453188493>(this)
                  )
               )
            ) instanceof class_1819
         )
         && !(
            0<"JNT",-1190575820,"￮\u0006\ufff5\t￬\u0005￼ﾴﾺﾱﾺ","\uf070qび偵쁴끵恱䁵u偵쁴ꁴ遵聴클끵恱ꁴふ聴ꁵꁵ恴聱\ue071r遱\u2072","￦ￃￌ&￫ￗ￦ￃ\uffd9￪ￏﾾￌ&\uffd9￤ￏ￩￩ￕ\u001f\r''",-1993744659>(
               0<"JNT",-1190575820,"￮\u0006\ufff5\t￬\u0005￼ﾳﾱﾴﾺ","\uf070qび偵쁴끵恱䁵u偵쁴ꁴ遵聴클끵恱ꁴふ聴ꁵꁵ恴聱\ue071rr\u2072","￦ￃￌ&￫ￗ￦ￃ\uffd9￪ￏﾾￌ&\uffd9￤ￏ￩￩ￕ\r\f\u000e",-1993744652>(
                  1<"JNT",-1951742075,"裆詆豆迆识蕆滆酆鋆鏆","ꤗꥠꤕ\ua957ꤘ\ua95cꤗꥠꥦꤓꥤ꥟ꤕ\ua957ꥦ\ua95dꥤꤖꤖꥪ\ua956\ua954\ua959","蟺鿺怄瀅렄 俻砅頄瀅렄ꠄ倅\ud804뀄 俻ꠄ怅\ud804⠅⠅전\u0ffb⟻㟻\ueffb",-1453188500>(
                     1<"JNT",-1951742075,"迆닆","\ua95dꥤ","蟺鿺怄瀅렄 俻砅頄瀅렄ꠄ倅\ud804뀄 俻ꠄ怅\ud804⠅⠅전⿻忻䟻\ueffb",-1453188497>(this)
                  )
               )
            ) instanceof class_1819
         )) {
         var4 = (-2118177352 >>> (206911961 & -2118177352 & 206911961) | -1889153487) & -1879584837;
      } else {
         var4 = -917674127;
      }
      boolean var2 = switch (((var4 - 825553558 ^ 796394650) - 925738544 ^ 396050427 ^ 1222060315) - 1487936367) {
         case -2033270398 -> true;
         default -> false;
      };
      boolean var3 = 0<"JNT",1883514359,"\u0004￭\u0003\ufff4$\u0006\ufff5\u000e￬\ufff6\ufff0\u0006\u001f\ufff6\ufff5\ufff5￬￫","\uf070ၳsqs","￥￪ﾽ&￤ￍￂﾽ￤&ﾽ￤ﾾￍ&\u001dￄ\u001eﾭ",-1993744655>(
            0<"JNT",-1190575820,"￮\u0006\ufff5\t￬\u0005￼ﾵﾵﾺﾱ","\uf070qၳ","￦ￃￌ&￫ￗ￦ￃ\uffd9￪ￏﾾￌ&\uffd9￤ￏ￩￩ￕ\u001f(\f\u001f",-1993744648>(
               0<"JNT",-1190575820,"￮\u0006\ufff5\t￬\u0005￼ﾯﾯﾳﾹﾰ","\uf070qび偵쁴끵恱䁵u偵쁴ꁴ遵聴클끵恱ꁴふ聴ꁵꁵ恴聱灱끱聱\u2072","￦ￃￌ&￫ￗ￦ￃ\uffd9￪ￏﾾￌ&\uffd9￤ￏ￩￩ￕ)\u001f(",-1993744649>(
                  1<"JNT",-1951742075,"迆닆","\ua95dꥤ","蟺鿺怄瀅렄 俻砅頄瀅렄ꠄ倅\ud804뀄 俻ꠄ怅\ud804⠅⠅전⿻忻䟻\ueffb",-1453188501>(this)
               )
            ),
            1
         )
         == 1;
      if (!var1) {
         if (var2) {
            var4 = 897769554;
         } else {
            var4 = -735880755 - (-1508276624 & -1508276624) ^ 312999648;
         }
      } else {
         var4 = 897769554;
      }

      while (true) {
         switch ((var4 + 698645063 + 1900610420 - 1075337033 - 333605580 ^ 2107930963) - 1495138163) {
            case -1528393539:
            default:
               return false;
            case -1464605896:
         }

         if (var3) {
            return true;
         }

         var4 = -735880755 - (-1508276624 & -1508276624) ^ 312999648;
      }
   }

   // $VF: renamed from: qip () void
   public void method_1764() {
      int var3 = 836685006;
      if (1<"JNT",-1951742075,"裆詆豆迆识蕆滆酆郆鑆","ꤗꥠꤕ\ua957ꤘ\ua95cꤗꥠꥦꤓꥤ꥟ꤕ\ua957ꥦ\ua95dꥤꤖꤖꥪ\ua956\ua954\ua959","蟺鿺怄瀅렄 俻砅頄瀅렄ꠄ倅\ud804뀄 俻ꠄ怅\ud804⠅⠅전埻⿻Ώ\ueffb",-1453188912>(
         1<"JNT",-1951742075,"迆닆","\ua95dꥤ","蟺鿺怄瀅렄 俻砅頄瀅렄ꠄ倅\ud804뀄 俻ꠄ怅\ud804⠅⠅전⿻忻䟻\ueffb",-1453188909>(this)
      ) instanceof class_3965 var1) {
         var3 = 2078295168;

         while (true) {
            switch (var3 + 1428479052 + 1183368326 - 997417110 - 184801356 + 1223841366 ^ 1237760203) {
               case -2075388602:
                  0<"JNT",-1190575820,"￮\u0006\ufff5\t￬\u0005￼ﾯﾰﾵﾹﾲ","\uf070ၴq큳","￦ￃￌ&￫ￗ￦ￃ\uffd9￪ￏﾾￌ&\uffd9￤ￏ￩￩ￕ)(\f",-1993744685>(
                     1<"JNT",-1951742075,"裆詆豆迆识蕆滆鉆湆鏆","ꤗꥠꤕ\ua957ꤘ\ua95cꤗꥠꥦꤓꥤ꥟ꤕ\ua957ꥦ\ua95dꥤꤖꤖꥪ\ua956\ua954ꥐ","蟺鿺怄瀅렄 俻砅頄瀅렄ꠄ倅\ud804뀄 俻ꠄ怅\ud804⠅⠅전⿻䟻⟻\ueffb",-1453188913>(
                        1<"JNT",-1951742075,"裆詆豆迆识蕆滆郆鉆湆","ꤗꥠꤕ\ua957ꤘ\ua95cꤗꥠꥦꤓꥤ꥟ꤕ\ua957ꥦ\ua95dꥤꤖꤖꥪ\ua956\ua954\ua959","蟺鿺怄瀅렄 俻砅頄瀅렄ꠄ倅\ud804뀄 俻ꠄ怅\ud804⠅⠅전⿻忻㿻\ueffb",-1453188914>(
                           1<"JNT",-1951742075,"迆닆","\ua95dꥤ","蟺鿺怄瀅렄 俻砅頄瀅렄ꠄ倅\ud804뀄 俻ꠄ怅\ud804⠅⠅전⿻忻䟻\ueffb",-1453188911>(this)
                        )
                     ),
                     false
                  );
                  if (!0<"JNT",1883514359,"\u0007\ufffa","\uf070び偵쁴끵恱䁵u偵쁴ꁴ遵聴클끵恱ꁴふ聴ꁵꁵ恴遱ꁱꁱ\uf071\u2072qၴ","￪\uffdf",-1993744691>(
                     0<"JNT",-1190575820,"￮\u0006\ufff5\t￬\u0005￼ﾲﾴﾴﾴﾴ","\uf070qび偵쁴끵恱䁵u偵쁴ꁴ遵聴클끵恱ꁴふ聴ꁵꁵ恴遱ꁱꁱ\uf071\u2072","￦ￃￌ&￫ￗ￦ￃ\uffd9￪ￏﾾￌ&\uffd9￤ￏ￩￩ￕ)'\u000e\u0013",-1993744684>(
                        var1
                     )
                  )) {
                     var3 = -1975798661 << (-1975798661 >>> -1975798661) ^ -1052072736;
                     continue;
                  }

                  0<"JNT",-1190575820,"￭\ufffa\u0006","\uf070び偵쁴끵恱䁵u偵쁴ꁴ遵聴클끵恱ꁴふ聴ꁵꁵ恴ꁱr큱쁱\u2072q큳","￤ￏ",-1993744690>(this, var1);
                  break;
               case -1103035839:
                  return;
               case 237231085:
                  if (0<"JNT",1883514359,"\u0004￬\uffef","\uf070び偵쁴끵恱䁵u偵쁴ꁴ遵聴클끵恱ꁴふ聴ꁵꁵ恴遱ꁱꁱ\uf071\u2072qၴ","￪\uffdf",-1993744671>(
                     0<"JNT",-1190575820,"￮\u0006\ufff5\t￬\u0005￼ﾲﾴﾴﾴﾴ","\uf070qび偵쁴끵恱䁵u偵쁴ꁴ遵聴클끵恱ꁴふ聴ꁵꁵ恴遱ꁱꁱ\uf071\u2072","￦ￃￌ&￫ￗ￦ￃ\uffd9￪ￏﾾￌ&\uffd9￤ￏ￩￩ￕ)'\u000e\u0013",-1993744664>(
                        var1
                     )
                  )) {
                     0<"JNT",-1190575820,"\ufff4\t\ufff9","\uf070び偵쁴끵恱䁵u偵쁴ꁴ遵聴클끵恱ꁴふ聴ꁵꁵ恴ꁱr큱쁱\u2072q큳","￤ￏ",-1993744670>(this, var1);
                  }
                  break;
               case 1406122509:
               default:
                  if (!0<"JNT",1883514359,"\ufff7\ufff7","\uf070び偵쁴끵恱䁵u偵쁴ꁴ遵聴클끵恱ꁴふ聴ꁵꁵ恴遱ꁱꁱ\uf071\u2072び偵쁴끵恱䁵u偵쁴ꁴ遵聴클끵恱ꁴふ聴ꁵꁵ恴遱遱끱\uf071\u2072qၴ","￪\uffdf",-1993744683>(
                     0<"JNT",-1190575820,"￮\u0006\ufff5\t￬\u0005￼ﾲﾴﾴﾴﾴ","\uf070qび偵쁴끵恱䁵u偵쁴ꁴ遵聴클끵恱ꁴふ聴ꁵꁵ恴遱ꁱꁱ\uf071\u2072","￦ￃￌ&￫ￗ￦ￃ\uffd9￪ￏﾾￌ&\uffd9￤ￏ￩￩ￕ)'\u000e\u0013",-1993744677>(
                        var1
                     ),
                     1<"JNT",-1790568060,"裆詆豆迆识蕆鋆鍆滆鑆鋆","ꤗꥠꤕ\ua957ꤘ\ua95cꤗꥠꥦꤓꥤ꥟ꤕ\ua957ꥦ\ua95dꥤꤖꤖꥪ꥓꥓\ua955ꥏ","蟺鿺怄瀅렄 俻砅頄瀅렄ꠄ倅\ud804뀄 俻ꠄ怅\ud804⠅⠅전埻埻⟻\u07fb\ueffb",-1453188907>()
                  )) {
                     return;
                  }

                  var3 = -401421457 ^ -401421457 ^ 794947399;
                  continue;
            }

            var3 = (-670577172 - (-670577172 >> -174572168) | 1499082820) & 2147417286;
         }
      }
   }

   // $VF: renamed from: lye (net.minecraft.class_3965) void
   // $VF: Irreducible bytecode was duplicated to produce valid code
   public void method_1765(class_3965 var1) {
      int var2 = -1150785779;
      if (!0<"JNT",-1190575820,"￮\u0006\ufff5\t￬\u0005￼ﾰﾲﾶﾴﾵ","\uf070び偵쁴끵恱䁵u偵쁴ꁴ遵聴클끵恱ꁴふ聴ꁵꁵ恴聱\ue071r遱\u2072qၴ","￦ￃￌ&￫ￗ￦ￃ\uffd9￪ￏﾾￌ&\uffd9￤ￏ￩￩ￕ\u001f\r''",-1993744693>(
         0<"JNT",-1190575820,"￮\u0006\ufff5\t￬\u0005￼ﾳﾱﾵﾴ","\uf070qび偵쁴끵恱䁵u偵쁴ꁴ遵聴클끵恱ꁴふ聴ꁵꁵ恴聱\ue071rr\u2072","￦ￃￌ&￫ￗ￦ￃ\uffd9￪ￏﾾￌ&\uffd9￤ￏ￩￩ￕ\r\f\u000e",-1993744687>(
            1<"JNT",-1951742075,"裆詆豆迆识蕆滆酆鋆鏆","ꤗꥠꤕ\ua957ꤘ\ua95cꤗꥠꥦꤓꥤ꥟ꤕ\ua957ꥦ\ua95dꥤꤖꤖꥪ\ua956\ua954\ua959","蟺鿺怄瀅렄 俻砅頄瀅렄ꠄ倅\ud804뀄 俻ꠄ怅\ud804⠅⠅전\u0ffb⟻㟻\ueffb",-1453188919>(
               1<"JNT",-1951742075,"迆닆","\ua95dꥤ","蟺鿺怄瀅렄 俻砅頄瀅렄ꠄ倅\ud804뀄 俻ꠄ怅\ud804⠅⠅전⿻忻䟻\ueffb",-1453188920>(this)
            )
         ),
         1<"JNT",-1790568060,"裆詆豆迆识蕆釆釆湆滆","ꤗꥠꤕ\ua957ꤘ\ua95cꤗꥠꥦꤓꥤ꥟ꤕ\ua957ꥦ\ua95dꥤꤖꤖꥪ\ua954ꥑ\ua959꥓","蟺鿺怄瀅렄 俻砅頄瀅렄ꠄ倅\ud804뀄 俻ꠄ怅\ud804⠅⠅전忻\u0ffbΏ埻\ueffb",-1453188921>()
      )) {
         if (1<"JNT",-1951742075,"둆돆","\ua95dꥤ","蟺鿺鿻",-1453188923>(this)
            < 0<"JNT",-1190575820,"\u0003\ufff7\u0004","\uf070qs","ﾼ\uffd9",-1993744698>(1<"JNT",-1951742075,"识둆赆","\ua95dꥤ","蟺鿺怄ꀄꠄ\ueffb",-1453188926>(this))) {
            1<"JNT",-1017559362,"둆돆","\ua95dꥤ","蟺鿺鿻",-1453188927>(this, 1<"JNT",-1951742075,"둆돆","\ua95dꥤ","蟺鿺鿻",-1453188928>(this) + 1);
            return;
         }

         var2 = -415915349;
      } else {
         var2 = 2113584575 & 2073991375;
      }

      while (true) {
         switch ((var2 + 1714446757 + 325327999 + 689444208 - 422320588 ^ 914835466) - 376972167) {
            case -9060164:
            default:
               1<"JNT",-1017559362,"视軆둆","\ua95dꥤ","蟺鿺鿻",-1453188930>(this, 0);
               0<"JNT",1883514359,"\u0000\ufffa","\uf070び偵쁴끵恱䁵u偵쁴ꁴ遵聴클끵恱ꁴふ聴ꁵꁵ恴ꁱr큱쁱\u2072ၴq큳","￪\uffdf",-1993744694>(var1, true);
               break;
            case 522467030:
               if (0<"JNT",-1190575820,"￮\u0006\ufff5\t￬\u0005￼ﾰﾲﾶﾴﾵ","\uf070び偵쁴끵恱䁵u偵쁴ꁴ遵聴클끵恱ꁴふ聴ꁵꁵ恴聱\ue071r遱\u2072qၴ","￦ￃￌ&￫ￗ￦ￃ\uffd9￪ￏﾾￌ&\uffd9￤ￏ￩￩ￕ\u001f\r''",-1993744697>(
                  0<"JNT",-1190575820,"￮\u0006\ufff5\t￬\u0005￼ﾳﾱﾵﾴ","\uf070qび偵쁴끵恱䁵u偵쁴ꁴ遵聴클끵恱ꁴふ聴ꁵꁵ恴聱\ue071rr\u2072","￦ￃￌ&￫ￗ￦ￃ\uffd9￪ￏﾾￌ&\uffd9￤ￏ￩￩ￕ\r\f\u000e",-1993744707>(
                     1<"JNT",-1951742075,"裆詆豆迆识蕆滆酆鋆鏆","ꤗꥠꤕ\ua957ꤘ\ua95cꤗꥠꥦꤓꥤ꥟ꤕ\ua957ꥦ\ua95dꥤꤖꤖꥪ\ua956\ua954\ua959","蟺鿺怄瀅렄 俻砅頄瀅렄ꠄ倅\ud804뀄 俻ꠄ怅\ud804⠅⠅전\u0ffb⟻㟻\ueffb",-1453188931>(
                        1<"JNT",-1951742075,"迆닆","\ua95dꥤ","蟺鿺怄瀅렄 俻砅頄瀅렄ꠄ倅\ud804뀄 俻ꠄ怅\ud804⠅⠅전⿻忻䟻\ueffb",-1453188932>(this)
                     )
                  ),
                  1<"JNT",-1790568060,"裆詆豆迆识蕆釆釆湆滆","ꤗꥠꤕ\ua957ꤘ\ua95cꤗꥠꥦꤓꥤ꥟ꤕ\ua957ꥦ\ua95dꥤꤖꤖꥪ\ua954ꥑ\ua959꥓","蟺鿺怄瀅렄 俻砅頄瀅렄ꠄ倅\ud804뀄 俻ꠄ怅\ud804⠅⠅전忻\u0ffbΏ埻\ueffb",-1453188933>()
               )) {
                  if (1<"JNT",-1951742075,"视軆둆","\ua95dꥤ","蟺鿺鿻",-1453188935>(this)
                     < 0<"JNT",-1190575820,"\u0003\ufff7\u0004","\uf070qs","ﾼ\uffd9",-1993744702>(
                        1<"JNT",-1951742075,"뛆軆","\ua95dꥤ","蟺鿺怄ꀄꠄ\ueffb",-1453188938>(this)
                     )) {
                     1<"JNT",-1017559362,"视軆둆","\ua95dꥤ","蟺鿺鿻",-1453188939>(this, 1<"JNT",-1951742075,"视軆둆","\ua95dꥤ","蟺鿺鿻",-1453188940>(this) + 1);
                     return;
                  }

                  var2 = (1100701227 >>> 1100701227 | -1713233791) & -34934139;
                  continue;
               }
               break;
            case 800665842:
               1<"JNT",-1017559362,"둆돆","\ua95dꥤ","蟺鿺鿻",-1453188942>(this, 0);
               0<"JNT",1883514359,"\ufff3\ufff7\uffff","\uf070び偵쁴끵恱䁵u偵쁴ꁴ遵聴클끵恱ꁴふ聴ꁵꁵ恴聱\ue071r遱\u2072qၴ","\uffc0",-1993744705>(
                  1<"JNT",-1790568060,"裆詆豆迆识蕆釆釆湆滆","ꤗꥠꤕ\ua957ꤘ\ua95cꤗꥠꥦꤓꥤ꥟ꤕ\ua957ꥦ\ua95dꥤꤖꤖꥪ\ua954ꥑ\ua959꥓","蟺鿺怄瀅렄 俻砅頄瀅렄ꠄ倅\ud804뀄 俻ꠄ怅\ud804⠅⠅전忻\u0ffbΏ埻\ueffb",-1453188941>()
               );
               var2 = 2113584575 & 2073991375;
               continue;
            case 1842894904:
               return;
         }

         var2 = -1484852551 << 2126797222 ^ -152430675;
      }
   }

   // $VF: renamed from: whx (net.minecraft.class_3965) void
   // $VF: Irreducible bytecode was duplicated to produce valid code
   public void method_1766(class_3965 var1) {
      int var3 = 757276557;
      int var2 = 0<"JNT",-1190575820,"\u0003\ufff7\u0004","\uf070qs","ﾼ\uffd9",-1993744590>(1<"JNT",-1951742075,"遆돆","\ua95dꥤ","蟺鿺怄ꀄꠄ\ueffb",-1453188954>(this))
         - 1;
      if (0<"JNT",-1190575820,"￮\u0006\ufff5\t￬\u0005￼ﾳﾴﾶﾰﾯ","\uf070qs","￦ￃￌ&￫ￗ￦ￃ\uffd9￪ￏﾾￌ&\uffd9￤ￏ￩￩ￕ\u001f\u000e\u000e\u001f",-1993744602>(
            0<"JNT",-1190575820,"￮\u0006\ufff5\t￬\u0005￼ﾰﾲﾶﾵﾹ","\uf070qび偵쁴끵恱䁵u偵쁴ꁴ遵聴클끵恱ꁴふ聴ꁵꁵ恴聱큱큱聱\u2072","￦ￃￌ&￫ￗ￦ￃ\uffd9￪ￏﾾￌ&\uffd9￤ￏ￩￩ￕ\r\f\u000e",-1993744603>(
               1<"JNT",-1951742075,"裆詆豆迆识蕆滆酆鋆鏆","ꤗꥠꤕ\ua957ꤘ\ua95cꤗꥠꥦꤓꥤ꥟ꤕ\ua957ꥦ\ua95dꥤꤖꤖꥪ\ua956\ua954\ua959","蟺鿺怄瀅렄 俻砅頄瀅렄ꠄ倅\ud804뀄 俻ꠄ怅\ud804⠅⠅전\u0ffb⟻㟻\ueffb",-1453188955>(
                  1<"JNT",-1951742075,"迆닆","\ua95dꥤ","蟺鿺怄瀅렄 俻砅頄瀅렄ꠄ倅\ud804뀄 俻ꠄ怅\ud804⠅⠅전⿻忻䟻\ueffb",-1453188956>(this)
               )
            )
         )
         != var2) {
         if (1<"JNT",-1951742075,"둆돆","\ua95dꥤ","蟺鿺鿻",-1453188960>(this)
            < 0<"JNT",-1190575820,"\u0003\ufff7\u0004","\uf070qs","ﾼ\uffd9",-1993744599>(1<"JNT",-1951742075,"识둆赆","\ua95dꥤ","蟺鿺怄ꀄꠄ\ueffb",-1453188959>(this))) {
            1<"JNT",-1017559362,"둆돆","\ua95dꥤ","蟺鿺鿻",-1453188324>(this, 1<"JNT",-1951742075,"둆돆","\ua95dꥤ","蟺鿺鿻",-1453188321>(this) + 1);
            return;
         }

         var3 = (-671949783 & -671949783 | 570960601) & 840494045;
      } else {
         var3 = (-388305335 | -388305335 | -1733850678) & -1632129541;
      }

      while (true) {
         switch (var3 + 421599165 + 457456925 + 1247576131 - 114558156 - 20351697 - 603014795) {
            case -2065765938:
               1<"JNT",-1017559362,"둆돆","\ua95dꥤ","蟺鿺鿻",-1453188325>(this, 0);
               0<"JNT",-1190575820,"￮\u0006\ufff5\t￬\u0005￼ﾳﾲﾵﾺﾳ","\uf070sq큳","￦ￃￌ&￫ￗ￦ￃ\uffd9￪ￏﾾￌ&\uffd9￤ￏ￩￩ￕ\u001f\u000e\u000e\u001f",-1993744606>(
                  0<"JNT",-1190575820,"￮\u0006\ufff5\t￬\u0005￼ﾰﾲﾶﾵﾹ","\uf070qび偵쁴끵恱䁵u偵쁴ꁴ遵聴클끵恱ꁴふ聴ꁵꁵ恴聱큱큱聱\u2072","￦ￃￌ&￫ￗ￦ￃ\uffd9￪ￏﾾￌ&\uffd9￤ￏ￩￩ￕ\r\f\u000e",-1993744607>(
                     1<"JNT",-1951742075,"裆詆豆迆识蕆滆酆鋆鏆","ꤗꥠꤕ\ua957ꤘ\ua95cꤗꥠꥦꤓꥤ꥟ꤕ\ua957ꥦ\ua95dꥤꤖꤖꥪ\ua956\ua954\ua959","蟺鿺怄瀅렄 俻砅頄瀅렄ꠄ倅\ud804뀄 俻ꠄ怅\ud804⠅⠅전\u0ffb⟻㟻\ueffb",-1453188327>(
                        1<"JNT",-1951742075,"迆닆","\ua95dꥤ","蟺鿺怄瀅렄 俻砅頄瀅렄ꠄ倅\ud804뀄 俻ꠄ怅\ud804⠅⠅전⿻忻䟻\ueffb",-1453188328>(this)
                     )
                  ),
                  var2
               );
               var3 = (-388305335 | -388305335 | -1733850678) & -1632129541;
               break;
            case -344085312:
               if (0<"JNT",-1190575820,"￮\u0006\ufff5\t￬\u0005￼ﾳﾴﾶﾰﾯ","\uf070qs","￦ￃￌ&￫ￗ￦ￃ\uffd9￪ￏﾾￌ&\uffd9￤ￏ￩￩ￕ\u001f\u000e\u000e\u001f",-1993744589>(
                     0<"JNT",-1190575820,"￮\u0006\ufff5\t￬\u0005￼ﾰﾲﾶﾵﾹ","\uf070qび偵쁴끵恱䁵u偵쁴ꁴ遵聴클끵恱ꁴふ聴ꁵꁵ恴聱큱큱聱\u2072","￦ￃￌ&￫ￗ￦ￃ\uffd9￪ￏﾾￌ&\uffd9￤ￏ￩￩ￕ\r\f\u000e",-1993744710>(
                        1<"JNT",-1951742075,"裆詆豆迆识蕆滆酆鋆鏆","ꤗꥠꤕ\ua957ꤘ\ua95cꤗꥠꥦꤓꥤ꥟ꤕ\ua957ꥦ\ua95dꥤꤖꤖꥪ\ua956\ua954\ua959","蟺鿺怄瀅렄 俻砅頄瀅렄ꠄ倅\ud804뀄 俻ꠄ怅\ud804⠅⠅전\u0ffb⟻㟻\ueffb",-1453188946>(
                           1<"JNT",-1951742075,"迆닆","\ua95dꥤ","蟺鿺怄瀅렄 俻砅頄瀅렄ꠄ倅\ud804뀄 俻ꠄ怅\ud804⠅⠅전⿻忻䟻\ueffb",-1453188943>(this)
                        )
                     )
                  )
                  == var2) {
                  if (1<"JNT",-1951742075,"軆詆识","\ua95dꥤ","蟺鿺鿻",-1453188947>(this)
                     < 0<"JNT",-1190575820,"\u0003\ufff7\u0004","\uf070qs","ﾼ\uffd9",-1993744594>(
                        1<"JNT",-1951742075,"轆詆襆","\ua95dꥤ","蟺鿺怄ꀄꠄ\ueffb",-1453188950>(this)
                     )) {
                     1<"JNT",-1017559362,"軆詆识","\ua95dꥤ","蟺鿺鿻",-1453188951>(this, 1<"JNT",-1951742075,"軆詆识","\ua95dꥤ","蟺鿺鿻",-1453188952>(this) + 1);
                     return;
                  }

                  var3 = (1585687514 & 1585687514 | -1587784666) & -1317249994;
               } else {
                  var3 = -581334851;
               }
               break;
            case 69360427:
            default:
               1<"JNT",-1017559362,"軆詆识","\ua95dꥤ","蟺鿺鿻",-1453188323>(this, 0);
               0<"JNT",1883514359,"\u0000\ufffa","\uf070び偵쁴끵恱䁵u偵쁴ꁴ遵聴클끵恱ꁴふ聴ꁵꁵ恴ꁱr큱쁱\u2072ၴq큳","￪\uffdf",-1993744611>(var1, true);
               var3 = -581334851;
               break;
            case 807372722:
               return;
         }
      }
   }

   // $VF: renamed from: nz () void
   public void method_1767() {
      1<"JNT",-1017559362,"둆돆","\ua95dꥤ","蟺鿺鿻",-1453188332>(this, 0);
      1<"JNT",-1017559362,"视軆둆","\ua95dꥤ","蟺鿺鿻",-1453188331>(this, 0);
      1<"JNT",-1017559362,"軆詆识","\ua95dꥤ","蟺鿺鿻",-1453188334>(this, 0);
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1413(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 - 325307991 - 47755874 ^ 506536509) - 573420634 ^ 1356100264 ^ 1583983661 ^ 944592821 ^ 922465973) - 1432056989;
      MethodHandle var10000 = field_2048[((var10 - 325307991 - 47755874 ^ 506536509) - 573420634 ^ 1356100264 ^ 1583983661 ^ 944592821 ^ 922465973)
         - 1432056989
         + 179666084];
      if (field_2048[var10001 + 179666084] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = (-1323738923 * (1809386421 + -1359008050) | 0) & 201982208;
            var23 < var13.length();
            var23 += -234135142 - (815750096 | -234135142 >> 815750096) ^ -234134082
         ) {
            int var42 = var13.charAt(var23) + 128 + 66 - 173 ^ 84;
            int var10004 = (var42 & 0) >> 16;
            int var43 = (var42 & 0) >> 16 | var42 << 0;
            int var70 = (((var42 & 0) >> 16 | var42 << 0) & 0) >> 16;
            char var44 = (char)(((((var10004 | var42 << 0) & 0) >> 16 | ((var42 & 0) >> 16 | var42 << 0) << 0) ^ 184 ^ 222) + 148 - 88);
            var13.setCharAt(var23, (char)(((var70 | var43 << 0) ^ 184 ^ 222) + 148 - 88));
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = (-2126443602 + 435732530 | 0) & 604374033; var29 < var16.length(); var29 += 1399048594 & -608054198 ^ 1396817923) {
            int var49 = var16.charAt(var29) - 'u' + 7;
            char var52 = (char)(
               (((((var49 & 61440) >> 12 | var49 << 4) & 64512) >> 10 | ((var49 & 61440) >> 12 | var49 << 4) << 6) - 240 - 162 - 106 + 17 + 43 & 65472) >> 6
                  | ((((var49 & 61440) >> 12 | var49 << 4) & 64512) >> 10 | ((var49 & 61440) >> 12 | var49 << 4) << 6) - 240 - 162 - 106 + 17 + 43 << 10
            );
            var16.setCharAt(
               var29,
               (char)(
                  (((((var49 & 61440) >> 12 | var49 << 4) & 64512) >> 10 | ((var49 & 61440) >> 12 | var49 << 4) << 6) - 240 - 162 - 106 + 17 + 43 & 65472) >> 6
                     | ((((var49 & 61440) >> 12 | var49 << 4) & 64512) >> 10 | ((var49 & 61440) >> 12 | var49 << 4) << 6) - 240 - 162 - 106 + 17 + 43 << 10
               )
            );
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_176.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = -1737297317 << -1737297317 ^ -671088640; var35 < var19.length(); var35 += -178959766 ^ 780164420 ^ -606791889) {
            var19.setCharAt(var35, (char)(((var19.charAt(var35) - 156 ^ 11) - 122 + 225 ^ 200) + 30 + 41 + 73 + 124 ^ 2));
         }

         Class var7 = Class.forName(var19.toString(), false, Class_176.class.getClassLoader());
         switch (((var4 - 578750200 ^ 385298645) + 1283685836 + 880402371 ^ 26512517 ^ 746659503 ^ 597110242) + 935043644 ^ 1858984893 ^ 1686002314) {
            case 14374810:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            case 108866976:
               var10000 = var0.findSpecial(var7, var5, var6, Class_176.class);
               break;
            case 591304014:
               var10000 = var0.findConstructor(var7, var6);
               break;
            case 1292368091:
            case 1608561490:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_2048[((var10 - 325307991 - 47755874 ^ 506536509) - 573420634 ^ 1356100264 ^ 1583983661 ^ 944592821 ^ 922465973) - 1432056989 + 179666084] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1414(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 ^ 56634067 ^ 543250397 ^ 405463856 ^ 1230147806) + 56643184 + 266900427 - 1958420635 ^ 1683743454) - 358530477;
      MethodHandle var10000 = field_2048[((var10 ^ 56634067 ^ 543250397 ^ 405463856 ^ 1230147806) + 56643184 + 266900427 - 1958420635 ^ 1683743454)
         - 358530477
         - 143947542];
      if (field_2048[var10001 - 143947542] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = 1801624279 >> 1801624279 ^ 214; var24 < var14.length(); var24 += (1871190185 << -426474278 | 1) & 1224962445) {
            int var43 = var14.charAt(var24) - 211;
            int var10004 = (var43 & 65532) >> 2;
            int var44 = (var43 & 65532) >> 2 | var43 << 14;
            int var94 = (((var43 & 65532) >> 2 | var43 << 14) & 65532) >> 2;
            var43 = ((var10004 | var43 << 14) & 65532) >> 2 | ((var43 & 65532) >> 2 | var43 << 14) << 14;
            var10004 = ((var94 | var44 << 14) & 64512) >> 10;
            int var46 = (((var94 | var44 << 14) & 64512) >> 10 | var43 << 6) + 105 - 55;
            int var96 = ((((var94 | var44 << 14) & 64512) >> 10 | var43 << 6) + 105 - 55 & 65024) >> 9;
            char var47 = (char)(
               ((((var10004 | var43 << 6) + 105 - 55 & 65024) >> 9 | (((var94 | var44 << 14) & 64512) >> 10 | var43 << 6) + 105 - 55 << 7) ^ 36) + 239 - 189
            );
            var14.setCharAt(var24, (char)(((var96 | var46 << 7) ^ 36) + 239 - 189));
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = (-1638140298 | 2105519129 | 0) & 128; var30 < var17.length(); var30 += -2058240521 ^ -589430122 ^ 1502592864) {
            int var52 = var17.charAt(var30);
            int var97 = (var52 & 65532) >> 2;
            int var53 = ((var52 & 65532) >> 2 | var52 << 14) + 1;
            int var98 = (((var52 & 65532) >> 2 | var52 << 14) + 1 & 65408) >> 7;
            var52 = (((var97 | var52 << 14) + 1 & 65408) >> 7 | ((var52 & 65532) >> 2 | var52 << 14) + 1 << 9) + 65 ^ 149;
            var97 = (((var98 | var53 << 9) + 65 ^ 149) & 65024) >> 9;
            int var55 = ((((var98 | var53 << 9) + 65 ^ 149) & 65024) >> 9 | var52 << 7) ^ 1;
            int var100 = ((((((var98 | var53 << 9) + 65 ^ 149) & 65024) >> 9 | var52 << 7) ^ 1) & 49152) >> 14;
            char var56 = (char)(
               (((((var97 | var52 << 7) ^ 1) & 49152) >> 14 | (((((var98 | var53 << 9) + 65 ^ 149) & 65024) >> 9 | var52 << 7) ^ 1) << 2) ^ 88) - 211
            );
            var17.setCharAt(var30, (char)(((var100 | var55 << 2) ^ 88) - 211));
         }

         Class var6 = Class.forName(var17.toString(), false, Class_176.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = -375811708 << -43111876 ^ 1073741824; var36 < var20.length(); var36 += (857394279 & 1319696233 << 1319696233 | 1) & 1247085155) {
            int var61 = var20.charAt(var36);
            int var101 = (var61 & 64512) >> 10;
            int var62 = (var61 & 64512) >> 10 | var61 << 6;
            int var102 = (((var61 & 64512) >> 10 | var61 << 6) & 65532) >> 2;
            var61 = ((var101 | var61 << 6) & 65532) >> 2 | ((var61 & 64512) >> 10 | var61 << 6) << 14;
            var101 = ((var102 | var62 << 14) & 32768) >> 15;
            int var64 = ((var102 | var62 << 14) & 32768) >> 15 | var61 << 1;
            int var104 = ((((var102 | var62 << 14) & 32768) >> 15 | var61 << 1) & 65534) >> 1;
            var61 = ((var101 | var61 << 1) & 65534) >> 1 | (((var102 | var62 << 14) & 32768) >> 15 | var61 << 1) << 15;
            var101 = ((var104 | var64 << 15) & 57344) >> 13;
            int var66 = ((var104 | var64 << 15) & 57344) >> 13 | var61 << 3;
            int var106 = ((((var104 | var64 << 15) & 57344) >> 13 | var61 << 3) & 65408) >> 7;
            var61 = ((var101 | var61 << 3) & 65408) >> 7 | (((var104 | var64 << 15) & 57344) >> 13 | var61 << 3) << 9;
            var101 = ((var106 | var66 << 9) & 65408) >> 7;
            int var68 = ((var106 | var66 << 9) & 65408) >> 7 | var61 << 9;
            int var108 = ((((var106 | var66 << 9) & 65408) >> 7 | var61 << 9) & 65520) >> 4;
            char var69 = (char)(((((var101 | var61 << 9) & 65520) >> 4 | (((var106 | var66 << 9) & 65408) >> 7 | var61 << 9) << 12) ^ 141) + 75);
            var20.setCharAt(var36, (char)(((var108 | var68 << 12) ^ 141) + 75));
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_176.class.getClassLoader()).returnType();
         switch ((var4 ^ 1583817927 ^ 1165458437) - 1510707354 + 4140128 - 1377700240 - 1365025707 + 667108601 - 2002625913 + 1795700342 + 1971717647) {
            case 570624982:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            case 610757079:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            case 1442715173:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            case 1811278092:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_2048[((var10 ^ 56634067 ^ 543250397 ^ 405463856 ^ 1230147806) + 56643184 + 266900427 - 1958420635 ^ 1683743454) - 358530477 - 143947542] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
