import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;
import net.minecraft.class_1269;

public class Class_246 extends Class_342 {
   // $VF: renamed from: rd Class_115
   public Class_115 field_1889;
   // $VF: renamed from: wb Class_49
   public Class_49 field_1890;
   // $VF: renamed from: ks Class_105
   public Class_105 field_1891;
   // $VF: renamed from: oht Class_49
   public Class_49 field_1892;
   // $VF: renamed from: oau Class_105
   public Class_105 field_1893;
   // $VF: renamed from: at boolean
   public boolean field_1894;
   // $VF: renamed from: tg boolean
   public boolean field_1895;
   // $VF: renamed from: dk int
   public int field_1896;
   // $VF: renamed from: fd int
   public int field_1897;
   // $VF: renamed from: nm int
   public int field_1898;
   // $VF: renamed from: xfq java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_1899 = new MethodHandle[110];

   public Class_246() {
      int var10001 = (-668828847 >> (-2067043444 << -668828847) | 0) & 549815466;

      StringBuilder var10002;
      for (var10002 = (StringBuilder)0<"JNT",-1982347696,"ﱎ⁏㑏⁏ᱏ\uf44e","늽냽껝뀍꾝뀍뇭껽뀍괝국뇭꼭굽굝꺍괝국뎭늍ꦝ","ꚩ뺨ڬ뺨䚧隩뺨䚩躩䚧溪嚩暩纩䚩躩\ue6a9庩纩隩효\udea8暩",-1900036498>(
            "Tn\u0082)Ynj{u"
         );
         var10001 < (-281944470 & 1742366572 << (-281944470 >>> 1742366572) ^ -2147483639);
         var10001 += -1167743265 * -1167743265 ^ 616298048
      ) {
         0<"JNT",-1243984355,"ᡏ偏ᱏ\ud84eⱏ䁏я쁎ᱏ","늽낍눭늍ꦝ","ꚩ뺨ڬ뺨䚧隩뺨䚩躩䚧溪嚩暩纩䚩躩\ue6a9庩纩隩효\udea8暩",-1900036508>(
            var10002,
            var10001,
            (char)(0<"JNT",-1243984355,"塏ⱏ䁏я쁎ᱏ","늽낍늍눭","ꚩ뺨ڬ뺨䚧隩뺨䚩躩䚧溪嚩暩纩䚩躩\ue6a9庩纩隩효\udea8暩",-1900036505>(var10002, var10001) - 228 + 131 - 184 + 193 + 79)
         );
      }

      String var2 = 0<"JNT",-1243984355,"ᱏࡏ顎ᱏя⁏㑏⡏","늽늍냽껝뀍꾝뀍뇭껽뀍괝국뇭꼭굽굝꺍괝국뎭","ꚩ뺨ڬ뺨䚧隩뺨䚩躩䚧溪嚩暩纩䚩躩\ue6a9庩纩隩효\udea8暩",-1900036288>(var10002);
      int var17 = 2128303301 & 470589097 ^ 470291585;

      StringBuilder var34;
      for (var34 = (StringBuilder)0<"JNT",-1982347696,"ﱎ⁏㑏⁏ᱏ\uf44e","늽냽껝뀍꾝뀍뇭껽뀍괝국뇭꼭굽굝꺍괝국뎭늍ꦝ","ꚩ뺨ڬ뺨䚧隩뺨䚩躩䚧溪嚩暩纩䚩躩\ue6a9庩纩隩효\udea8暩",-1900036287>(
            "澅꾇쾆羇澆뾆辆澇㾂羇⾇㾂來ᾇ㾂辆ᾇ羆辆徇㾂㾇辆來徇ﾇ㾂來ᾇ羆㾂羇뾆徇⾇꾇澇㾂쾆羇㾂꾇뾆辆ᾇ㾂쾇⾇辇㾂㾇徇辆澇澇㾂來㾂徆쾆ᾇ羆"
         );
         var17 < (-609705406 ^ 1760424025 ^ -1287302619);
         var17 += 927232385 & 1455063743 ^ 369098880
      ) {
         int var65 = 0<"JNT",-1243984355,"塏ⱏ䁏я쁎ᱏ","늽낍늍눭","ꚩ뺨ڬ뺨䚧隩뺨䚩躩䚧溪嚩暩纩䚩躩\ue6a9庩纩隩효\udea8暩",-1900036263>(var34, var17) + '*' + 102;
         char var66 = (char)(((var65 & 61440) >> 12 | var65 << 4) - 9 - 251);
         0<"JNT",-1243984355,"ᡏ偏ᱏ\ud84eⱏ䁏я쁎ᱏ","늽낍눭늍ꦝ","ꚩ뺨ڬ뺨䚧隩뺨䚩躩䚧溪嚩暩纩䚩躩\ue6a9庩纩隩효\udea8暩",-1900036274>(
            var34, var17, (char)(((var65 & 61440) >> 12 | var65 << 4) - 9 - 251)
         );
      }

      super(
         var2,
         0<"JNT",-1243984355,"ᱏࡏ顎ᱏя⁏㑏⡏","늽늍냽껝뀍꾝뀍뇭껽뀍괝국뇭꼭굽굝꺍괝국뎭","ꚩ뺨ڬ뺨䚧隩뺨䚩躩䚧溪嚩暩纩䚩躩\ue6a9庩纩隩효\udea8暩",-1900036290>(var34),
         -1,
         1<"JNT",1808354218,"쩲\uf272\u0e72","瞰Ⴐ","셱텱Ÿ텶慵\uf172",1336033579>()
      );
      var10001 = -1192451776 << -1432458053 ^ 0;

      for (var10002 = (StringBuilder)0<"JNT",-1982347696,"ﱎ⁏㑏⁏ᱏ\uf44e","늽냽껝뀍꾝뀍뇭껽뀍괝국뇭꼭굽굝꺍괝국뎭늍ꦝ","ꚩ뺨ڬ뺨䚧隩뺨䚩躩䚧溪嚩暩纩䚩躩\ue6a9庩纩隩효\udea8暩",-1900036292>(
            "Ѹͨϐ̸π\u0378ϐ͘ŰШ͘θ"
         );
         var10001 < ((1837160769 - -640983214 | 4) & 134775308);
         var10001 += -446401805 << (129876616 ^ 129876616) ^ -446401806
      ) {
         int var37 = 0<"JNT",-1243984355,"塏ⱏ䁏я쁎ᱏ","늽낍늍눭","ꚩ뺨ڬ뺨䚧隩뺨䚩躩䚧溪嚩暩纩䚩躩\ue6a9庩纩隩효\udea8暩",-1900036309>(var10002, var10001) - 'm' - 147;
         int var88 = (var37 & 0) >> 16;
         int var38 = (var37 & 0) >> 16 | var37 << 0;
         int var89 = (((var37 & 0) >> 16 | var37 << 0) & 65528) >> 3;
         char var39 = (char)((((var88 | var37 << 0) & 65528) >> 3 | ((var37 & 0) >> 16 | var37 << 0) << 13) ^ 46);
         0<"JNT",-1243984355,"ᡏ偏ᱏ\ud84eⱏ䁏я쁎ᱏ","늽낍눭늍ꦝ","ꚩ뺨ڬ뺨䚧隩뺨䚩躩䚧溪嚩暩纩䚩躩\ue6a9庩纩隩효\udea8暩",-1900036312>(var10002, var10001, (char)((var89 | var38 << 13) ^ 46));
      }

      this.field_1889 = (Class_115)0<"JNT",-1982347696,"ﱎ⁏㑏⁏ᱏ\uf44e","늽냽껝뀍꾝뀍뇭껽뀍괝국뇭꼭굽굝꺍괝국뎭낍\ua9dd늍ꦝ","皩㺩",-1900036286>(
         0<"JNT",-1243984355,"ᱏࡏ顎ᱏя⁏㑏⡏","늽늍냽껝뀍꾝뀍뇭껽뀍괝국뇭꼭굽굝꺍괝국뎭","ꚩ뺨ڬ뺨䚧隩뺨䚩躩䚧溪嚩暩纩䚩躩\ue6a9庩纩隩효\udea8暩",-1900036275>(var10002), -1, false
      );
      var10001 = 1703831741 * 1703831741 ^ 2122718089;

      for (var10002 = (StringBuilder)0<"JNT",-1982347696,"ﱎ⁏㑏⁏ᱏ\uf44e","늽냽껝뀍꾝뀍뇭껽뀍괝국뇭꼭굽굝꺍괝국뎭늍ꦝ","ꚩ뺨ڬ뺨䚧隩뺨䚩躩䚧溪嚩暩纩䚩躩\ue6a9庩纩隩효\udea8暩",-1900036285>("㳐볠㳤볞볪");
         var10001 < ((-1174320134 >>> -1902235079 | 0) & 1200407687);
         var10001 += 760459889 & -1028895603
      ) {
         char var42 = 0<"JNT",-1243984355,"塏ⱏ䁏я쁎ᱏ","늽낍늍눭","ꚩ뺨ڬ뺨䚧隩뺨䚩躩䚧溪嚩暩纩䚩躩\ue6a9庩纩隩효\udea8暩",-1900036497>(var10002, var10001);
         int var90 = (var42 & 'ﰀ') >> 10;
         int var43 = ((var42 & 'ﰀ') >> 10 | var42 << 6) + 113;
         int var91 = (((var42 & 'ﰀ') >> 10 | var42 << 6) + 113 & 65504) >> 5;
         char var44 = (char)((((var90 | var42 << 6) + 113 & 65504) >> 5 | ((var42 & 'ﰀ') >> 10 | var42 << 6) + 113 << 11) - 157 - 195);
         0<"JNT",-1243984355,"ᡏ偏ᱏ\ud84eⱏ䁏я쁎ᱏ","늽낍눭늍ꦝ","ꚩ뺨ڬ뺨䚧隩뺨䚩躩䚧溪嚩暩纩䚩躩\ue6a9庩纩隩효\udea8暩",-1900036500>(
            var10002, var10001, (char)((var91 | var43 << 11) - 157 - 195)
         );
      }

      this.field_1890 = (Class_49)0<"JNT",-1982347696,"ﱎ⁏㑏⁏ᱏ\uf44e","늽냽껝뀍꾝뀍뇭껽뀍괝국뇭꼭굽굝꺍괝국뎭뉽뉽뉽뉽늍ꦝ","효\ueea8",-1900036297>(
         0<"JNT",-1243984355,"ᱏࡏ顎ᱏя⁏㑏⡏","늽늍냽껝뀍꾝뀍뇭껽뀍괝국뇭꼭굽굝꺍괝국뎭","ꚩ뺨ڬ뺨䚧隩뺨䚩躩䚧溪嚩暩纩䚩躩\ue6a9庩纩隩효\udea8暩",-1900036298>(var10002), 0.0, 20.0, 0.0, 1.0
      );
      var10001 = (-832086773 | -832086773 | -832086773 - -832086773 | 0) & 536904400;

      for (var10002 = (StringBuilder)0<"JNT",-1982347696,"ﱎ⁏㑏⁏ᱏ\uf44e","늽냽껝뀍꾝뀍뇭껽뀍괝국뇭꼭굽굝꺍괝국뎭늍ꦝ","ꚩ뺨ڬ뺨䚧隩뺨䚩躩䚧溪嚩暩纩䚩躩\ue6a9庩纩隩효\udea8暩",-1900036300>(
            "\udff1忶鿴\ufff5\udff3翴翫뿯鿳\udff3\udff4"
         );
         var10001 < ((1532304042 | 1532304042) ^ 1532304033);
         var10001 += -1388119087 * 1907702409 ^ 833297624
      ) {
         char var47 = 0<"JNT",-1243984355,"塏ⱏ䁏я쁎ᱏ","늽낍늍눭","ꚩ뺨ڬ뺨䚧隩뺨䚩躩䚧溪嚩暩纩䚩躩\ue6a9庩纩隩효\udea8暩",-1900036273>(var10002, var10001);
         int var92 = (var47 & 'ﰀ') >> 10;
         int var48 = (var47 & 'ﰀ') >> 10 | var47 << 6;
         int var93 = (((var47 & 'ﰀ') >> 10 | var47 << 6) & 61440) >> 12;
         int var49 = ((var92 | var47 << 6) & 61440) >> 12 | ((var47 & 'ﰀ') >> 10 | var47 << 6) << 4;
         var92 = ((var93 | var48 << 4) & 63488) >> 11;
         int var50 = ((var93 | var48 << 4) & 63488) >> 11 | var49 << 5;
         int var95 = ((((var93 | var48 << 4) & 63488) >> 11 | var49 << 5) & 61440) >> 12;
         char var51 = (char)((((var92 | var49 << 5) & 61440) >> 12 | (((var93 | var48 << 4) & 63488) >> 11 | var49 << 5) << 4) + 197);
         0<"JNT",-1243984355,"ᡏ偏ᱏ\ud84eⱏ䁏я쁎ᱏ","늽낍눭늍ꦝ","ꚩ뺨ڬ뺨䚧隩뺨䚩躩䚧溪嚩暩纩䚩躩\ue6a9庩纩隩효\udea8暩",-1900036276>(var10002, var10001, (char)((var95 | var50 << 4) + 197));
      }

      this.field_1891 = (Class_105)0<"JNT",-1982347696,"ﱎ⁏㑏⁏ᱏ\uf44e","늽냽껝뀍꾝뀍뇭껽뀍괝국뇭꼭굽굝꺍괝국뎭\ua9dd늍ꦝ","躩暩",-1900036331>(
         0<"JNT",-1243984355,"ᱏࡏ顎ᱏя⁏㑏⡏","늽늍냽껝뀍꾝뀍뇭껽뀍괝국뇭꼭굽굝꺍괝국뎭","ꚩ뺨ڬ뺨䚧隩뺨䚩躩䚧溪嚩暩纩䚩躩\ue6a9庩纩隩효\udea8暩",-1900036332>(var10002), true
      );
      var10001 = (2113311135 * 1717574887 | 0) & 1757745538;

      for (var10002 = (StringBuilder)0<"JNT",-1982347696,"ﱎ⁏㑏⁏ᱏ\uf44e","늽냽껝뀍꾝뀍뇭껽뀍괝국뇭꼭굽굝꺍괝국뎭늍ꦝ","ꚩ뺨ڬ뺨䚧隩뺨䚩躩䚧溪嚩暩纩䚩躩\ue6a9庩纩隩효\udea8暩",-1900036310>(
            "︍ﺅ﹡﹋︭﹣ﾳ\ufdeb﹩﹛︱ﺁ"
         );
         var10001 < ((-456659378 >> 1376228681 | 12) & 825356);
         var10001 += (-99964218 ^ -698354633 | 0) & -761102329
      ) {
         char var54 = 0<"JNT",-1243984355,"塏ⱏ䁏я쁎ᱏ","늽낍늍눭","ꚩ뺨ڬ뺨䚧隩뺨䚩躩䚧溪嚩暩纩䚩躩\ue6a9庩纩隩효\udea8暩",-1900036330>(var10002, var10001);
         char var55 = (char)((((var54 & '\ufffe') >> 1 | var54 << 15) + 11 ^ 50 ^ 189) + 181);
         0<"JNT",-1243984355,"ᡏ偏ᱏ\ud84eⱏ䁏я쁎ᱏ","늽낍눭늍ꦝ","ꚩ뺨ڬ뺨䚧隩뺨䚩躩䚧溪嚩暩纩䚩躩\ue6a9庩纩隩효\udea8暩",-1900036329>(
            var10002, var10001, (char)((((var54 & '\ufffe') >> 1 | var54 << 15) + 11 ^ 50 ^ 189) + 181)
         );
      }

      Class_49 var11 = (Class_49)0<"JNT",-1982347696,"ﱎ⁏㑏⁏ᱏ\uf44e","늽냽껝뀍꾝뀍뇭껽뀍괝국뇭꼭굽굝꺍괝국뎭뉽뉽뉽뉽늍ꦝ","효\ueea8",-1900036512>(
         0<"JNT",-1243984355,"ᱏࡏ顎ᱏя⁏㑏⡏","늽늍냽껝뀍꾝뀍뇭껽뀍괝국뇭꼭굽굝꺍괝국뎭","ꚩ뺨ڬ뺨䚧隩뺨䚩躩䚧溪嚩暩纩䚩躩\ue6a9庩纩隩효\udea8暩",-1900036509>(var10002), 0.0, 20.0, 0.0, 1.0
      );
      int var27 = (1985466110 * 814377359 | 0) & -1944055800;

      for (var34 = (StringBuilder)0<"JNT",-1982347696,"ﱎ⁏㑏⁏ᱏ\uf44e","늽냽껝뀍꾝뀍뇭껽뀍괝국뇭꼭굽굝꺍괝국뎭늍ꦝ","ꚩ뺨ڬ뺨䚧隩뺨䚩躩䚧溪嚩暩纩䚩躩\ue6a9庩纩隩효\udea8暩",-1900036511>(
            "氀䴀䐀䤀儀ࠀ䤀一尀䴀娀ࠀ尀䀀娀䜀开䄀䘀伀ࠀ堀䴀䤀娀䐀ࠀ䨀䴀一䜀娀䴀ࠀ嬀开䄀尀䬀䀀䄀䘀伀ࠀ䨀䤀䬀䌀"
         );
         var27 < (-285369820 ^ -285369820 ^ 48);
         var27 += 1
      ) {
         char var78 = 0<"JNT",-1243984355,"塏ⱏ䁏я쁎ᱏ","늽낍늍눭","ꚩ뺨ڬ뺨䚧隩뺨䚩躩䚧溪嚩暩纩䚩躩\ue6a9庩纩隩효\udea8暩",-1900036488>(var34, var27);
         char var81 = (char)(
            (
                  (((((var78 & '\ue000') >> 13 | var78 << 3) + 4 & 65472) >> 6 | ((var78 & '\ue000') >> 13 | var78 << 3) + 4 << 10) & 65504) >> 5
                     | ((((var78 & '\ue000') >> 13 | var78 << 3) + 4 & 65472) >> 6 | ((var78 & '\ue000') >> 13 | var78 << 3) + 4 << 10) << 11
               )
               ^ 168
         );
         0<"JNT",-1243984355,"ᡏ偏ᱏ\ud84eⱏ䁏я쁎ᱏ","늽낍눭늍ꦝ","ꚩ뺨ڬ뺨䚧隩뺨䚩躩䚧溪嚩暩纩䚩躩\ue6a9庩纩隩효\udea8暩",-1900036487>(
            var34,
            var27,
            (char)(
               (
                     (((((var78 & '\ue000') >> 13 | var78 << 3) + 4 & 65472) >> 6 | ((var78 & '\ue000') >> 13 | var78 << 3) + 4 << 10) & 65504) >> 5
                        | ((((var78 & '\ue000') >> 13 | var78 << 3) + 4 & 65472) >> 6 | ((var78 & '\ue000') >> 13 | var78 << 3) + 4 << 10) << 11
                  )
                  ^ 168
            )
         );
      }

      this.field_1892 = 0<"JNT",-1243984355,"ࡏ⁏ⱏ","늽냽껝뀍꾝뀍뇭껽뀍괝국뇭꼭굽굝꺍괝국뎭늍냽끽뀭뎭","효\ueea8",-1900036486>(
         var11, 0<"JNT",-1243984355,"ᱏࡏ顎ᱏя⁏㑏⡏","늽늍냽껝뀍꾝뀍뇭껽뀍괝국뇭꼭굽굝꺍괝국뎭","ꚩ뺨ڬ뺨䚧隩뺨䚩躩䚧溪嚩暩纩䚩躩\ue6a9庩纩隩효\udea8暩",-1900036507>(var34)
      );
      var10001 = -1175546407 * -1175546407 ^ -1724755471;

      for (var10002 = (StringBuilder)0<"JNT",-1982347696,"ﱎ⁏㑏⁏ᱏ\uf44e","늽냽껝뀍꾝뀍뇭껽뀍괝국뇭꼭굽굝꺍괝국뎭늍ꦝ","ꚩ뺨ڬ뺨䚧隩뺨䚩躩䚧溪嚩暩纩䚩躩\ue6a9庩纩隩효\udea8暩",-1900036485>(
            "ￔ翚㿛翙뿛㿝㿈ￔ\uffdd翚㿝\uffd8㿚"
         );
         var10001 < ((-579617444 | -579617444) ^ -579617455);
         var10001 += (1269343849 | -1845456933 & 1269343849 | 0) & 809980181
      ) {
         char var60 = 0<"JNT",-1243984355,"塏ⱏ䁏я쁎ᱏ","늽낍늍눭","ꚩ뺨ڬ뺨䚧隩뺨䚩躩䚧溪嚩暩纩䚩躩\ue6a9庩纩隩효\udea8暩",-1900036499>(var10002, var10001);
         char var61 = (char)(((var60 & '쀀') >> 14 | var60 << 2) + 218 - 251 + 237 + 52);
         0<"JNT",-1243984355,"ᡏ偏ᱏ\ud84eⱏ䁏я쁎ᱏ","늽낍눭늍ꦝ","ꚩ뺨ڬ뺨䚧隩뺨䚩躩䚧溪嚩暩纩䚩躩\ue6a9庩纩隩효\udea8暩",-1900036510>(
            var10002, var10001, (char)(((var60 & '쀀') >> 14 | var60 << 2) + 218 - 251 + 237 + 52)
         );
      }

      Class_105 var14 = (Class_105)0<"JNT",-1982347696,"ﱎ⁏㑏⁏ᱏ\uf44e","늽냽껝뀍꾝뀍뇭껽뀍괝국뇭꼭굽굝꺍괝국뎭\ua9dd늍ꦝ","躩暩",-1900036280>(
         0<"JNT",-1243984355,"ᱏࡏ顎ᱏя⁏㑏⡏","늽늍냽껝뀍꾝뀍뇭껽뀍괝국뇭꼭굽굝꺍괝국뎭","ꚩ뺨ڬ뺨䚧隩뺨䚩躩䚧溪嚩暩纩䚩躩\ue6a9庩纩隩효\udea8暩",-1900036277>(var10002), false
      );
      int var31 = 1064429481 & 1064429481 ^ 1064429481;

      for (var34 = (StringBuilder)0<"JNT",-1982347696,"ﱎ⁏㑏⁏ᱏ\uf44e","늽냽껝뀍꾝뀍뇭껽뀍괝국뇭꼭굽굝꺍괝국뎭늍ꦝ","ꚩ뺨ڬ뺨䚧隩뺨䚩躩䚧溪嚩暩纩䚩躩\ue6a9庩纩隩효\udea8暩",-1900036279>(
            "供㾘\uf798徘\uf798龘澘䞘쾚䞛枘鞘澘잘辘鞘龘\ue798쾚澘Ꞙ쾚힘龘Ꞙ澘辘\uf798㾘쾚䞘꾘Ꞙ澘쾚枘辘\uf798龘쾚澘辘㾘Ꞙ枘鞘龘\ue798쾚侘\uf798힘㾘꾘䞘龚"
         );
         var31 < ((-105351166 << 2043415706 | 56) & -2023707846);
         var31 += (819349112 | 59190203 | 0) & 69763073
      ) {
         int var85 = (0<"JNT",-1243984355,"塏ⱏ䁏я쁎ᱏ","늽낍늍눭","ꚩ뺨ڬ뺨䚧隩뺨䚩躩䚧溪嚩暩纩䚩躩\ue6a9庩纩隩효\udea8暩",-1900036299>(var34, var31) ^ '"') + 125 ^ 50;
         char var86 = (char)(((var85 & 63488) >> 11 | var85 << 5) ^ 218);
         0<"JNT",-1243984355,"ᡏ偏ᱏ\ud84eⱏ䁏я쁎ᱏ","늽낍눭늍ꦝ","ꚩ뺨ڬ뺨䚧隩뺨䚩躩䚧溪嚩暩纩䚩躩\ue6a9庩纩隩효\udea8暩",-1900036278>(
            var34, var31, (char)(((var85 & 63488) >> 11 | var85 << 5) ^ 218)
         );
      }

      this.field_1893 = 0<"JNT",-1243984355,"䁏၏屏","늽냽껝뀍꾝뀍뇭껽뀍괝국뇭꼭굽굝꺍괝국뎭늍냽국굝뎭","躩暩",-1900036302>(
         var14, 0<"JNT",-1243984355,"ᱏࡏ顎ᱏя⁏㑏⡏","늽늍냽껝뀍꾝뀍뇭껽뀍괝국뇭꼭굽굝꺍괝국뎭","ꚩ뺨ڬ뺨䚧隩뺨䚩躩䚧溪嚩暩纩䚩躩\ue6a9庩纩隩효\udea8暩",-1900036291>(var34)
      );
      Class_49 var10000 = 1<"JNT",-168370741,"\uea72칲ﹲ","ධְ","셱텱Ÿ腵煵\uf172",1336033583>(this);
      Class_105 var15 = 1<"JNT",-168370741,"\uda72全","ධְ","셱텱Ÿ녵慶\uf172",1336033584>(this);
      0<"JNT",-807171033,"я偏O၏⁏я偏둎ࡏ㑏둎၏㱏㱏","늽냽껝뀍꾝뀍뇭껽뀍괝국뇭꿭끝껝끍뀭굽뎭늍냽껝뀍꾝뀍뇭껽뀍괝국뇭꿭끝껝끍뀭굽뎭","ꚩ뺨ڬ뺨䚧庩嚩纩隩䚧亪\ue6a8ꚩ\udea8\ueea8嚩溩",-1900036303>(var15);
      0<"JNT",-1243984355,"㑏\ue44fᡏ","늽냽껝뀍꾝뀍뇭굍굽꺍껽뇭꺝굍괝뀭굽꺍귭괝뇭꼭굍괽괽껽꺍끍굝뎭늍냽괍끍끍뎭","효\ueea8",-1900036282>(var10000, var15::ax);
      0<"JNT",-1243984355,"O၏","늽ꦭ냽괍끍끍뎭늍ꦝ","亩ຬ",-1900036264>(
         this,
         new Class_271[]{
            1<"JNT",-168370741,"\uf672빲","ධְ","셱텱Ÿ셵其\uf172",1336033587>(this),
            1<"JNT",-168370741,"ੲ뙲","ධְ","셱텱Ÿ腵煵\uf172",1336033588>(this),
            1<"JNT",-168370741,"\uda72全","ධְ","셱텱Ÿ녵慶\uf172",1336033553>(this),
            1<"JNT",-168370741,"\uea72칲ﹲ","ධְ","셱텱Ÿ腵煵\uf172",1336033554>(this),
            1<"JNT",-168370741,"\uea72뉲ɲ","ධְ","셱텱Ÿ녵慶\uf172",1336033559>(this)
         }
      );
   }

   // $VF: renamed from: mg () void
   @Override
   public void method_1407() {
      0<"JNT",-1243984355,"ᑏ\ue84f","늽늍ꦝ","亩ຬ",-1900036311>(this);
      0<"JNT",-831878164,"く⡏","늽늍ꦝ","庩溩蚩",-1900036322>(this);
   }

   // $VF: renamed from: q () void
   @Override
   public void method_1408() {
      0<"JNT",-831878164,"O","늽늍ꦝ","庩溩蚩",-1900036321>(this);
   }

   // $VF: renamed from: gd (Class_207) void
   @Class_21
   public void method_1662(Class_207 var1) {
      int var3 = 8591958;
      if (1<"JNT",-168370741,"왲퉲쉲\ude72빲ꩲ\uf273ੳɳɳ","ರᎰʰ쳯ரްರᎰᆰ°ྰᒰʰ쳯ᆰરྰưưᶰ쇯뿯컯","셱텱Ÿⅶ酵腶ㅲᅶ텵ⅶ酵煵慶兵ꅵ腶ㅲ煵Ŷ兵煶煶ㅵ腲煲녲\uf172",1336033545>(
            1<"JNT",-168370741,"\ude72\uf672","ධְ","셱텱Ÿⅶ酵腶ㅲᅶ텵ⅶ酵煵慶兵ꅵ腶ㅲ煵Ŷ兵煶煶ㅵ煲兲䅲\uf172",1336033548>(this)
         )
         == null) {
         var3 = -1797328919;

         while (true) {
            switch (((var3 - 359177458 ^ 1743938195 ^ 1440404367) - 1616484727 ^ 128703157) + 1440263604) {
               case -606183394:
                  return;
               case -274820566:
                  0<"JNT",-807171033,"ᑏ\ue44f䑏","늽냽괝끍굽뇭껍꺍괝끍뀭굝뀍꺝굽뇭뀭껽뀍괭괭냭넍뉭뎍녝뎭늍\ua9dd","皩",-1900036318>(
                     1<"JNT",1808354218,"왲퉲쉲\ude72빲ꩲ\u0e73ٳ侀ﹳ","ರᎰʰ쳯ரްರᎰᆰ°ྰᒰʰ쳯ᆰરྰưưᶰ뿯웯컯샯","셱텱Ÿⅶ酵腶ㅲᅶ텵ⅶ酵煵慶兵ꅵ腶ㅲ煵Ŷ兵煶煶ㅵ兲녲텲慲\uf172",1336033529>()
                  );
                  if (1<"JNT",-168370741,"빲\uda72","ධְ","셱텱텷",1336033535>(this)
                     < 0<"JNT",-1243984355,"呏\ue44f⡏","늽늍낍","효\ueea8",-1900036319>(1<"JNT",-168370741,"ੲ뙲","ධְ","셱텱Ÿ腵煵\uf172",1336033536>(this))) {
                     1<"JNT",-183214259,"빲\uda72","ධְ","셱텱텷",1336033539>(this, 1<"JNT",-168370741,"빲\uda72","ධְ","셱텱텷",1336033534>(this) + 1);
                     return;
                  }

                  var3 = (1051339710 * 1051339710 | 272634433) & 1056668413;
                  continue;
               case -227510448:
                  0<"JNT",-1243984355,"ᑏ\ue84f","늽늍ꦝ","亩ຬ",-1900036108>(this);
                  break;
               case 187022881:
                  if (!1<"JNT",-168370741,"ﹲ쩲","ධְ","셱텱\ue178",1336034145>(this)) {
                     class_1269 var2 = 0<"JNT",-1243984355,"く偏ᱏⱏࡏ屏䡏ю\ue04eN\ue04e","늽냽괝끍굽뇭껍꺍괝끍뀭굝뀍꺝굽뇭뀭껽뀍괭괭냭넍뎝녍뉭뎭냽괝끍굽뇭껍꺍괝끍뀭굝뀍꺝굽뇭뀭껽뀍괭괭냭넍녝뎝뎽뎭늍냽괝끍굽뇭껍꺍괝끍뀭굝뀍꺝굽뇭뀭껽뀍괭괭냭넍녝뎝뎍뎭","䚩\udea8嚩䚧麩纩䚩\udea8\ueea8暩뺨蚩嚩䚧\ueea8隩뺨溩溩캨ڪ溧ڪ",-1900036097>(
                        1<"JNT",-168370741,"왲퉲쉲\ude72빲ꩲ\uf273ੳٳ\uf273","ರᎰʰ쳯ரްರᎰᆰ°ྰᒰʰ쳯ᆰરྰưưᶰ쇯뿯컯","셱텱Ÿⅶ酵腶ㅲᅶ텵ⅶ酵煵慶兵ꅵ腶ㅲ煵Ŷ兵煶煶ㅵꅲ煲ꅲ\uf172",1336034151>(
                           1<"JNT",-168370741,"\ude72\uf672","ධְ","셱텱Ÿⅶ酵腶ㅲᅶ텵ⅶ酵煵慶兵ꅵ腶ㅲ煵Ŷ兵煶煶ㅵ煲兲䅲\uf172",1336034146>(this)
                        ),
                        1<"JNT",-168370741,"왲퉲쉲\ude72빲ꩲ\uf273ੳ\uf673ﹳ","ರᎰʰ쳯ரްರᎰᆰ°ྰᒰʰ쳯ᆰરྰưưᶰ쇯뿯컯","셱텱Ÿⅶ酵腶ㅲᅶ텵ⅶ酵煵慶兵ꅵ腶ㅲ煵Ŷ兵煶煶ㅵ녲腲ꅲ\uf172",1336034149>(
                           1<"JNT",-168370741,"\ude72\uf672","ධְ","셱텱Ÿⅶ酵腶ㅲᅶ텵ⅶ酵煵慶兵ꅵ腶ㅲ煵Ŷ兵煶煶ㅵ煲兲䅲\uf172",1336034152>(this)
                        ),
                        1<"JNT",1808354218,"왲퉲쉲\ude72빲ꩲɳ\u0e73\uee73\u0e73","ರᎰʰ쳯ரްರᎰᆰ°ྰᒰʰ쳯ᆰરྰưưᶰ뿯샯쓯웯","셱텱Ÿⅶ酵腶ㅲᅶ텵ⅶ酵煵慶兵ꅵ腶ㅲ煵Ŷ兵煶煶ㅵ兲慲ꅲ셲\uf172",1336034150>()
                     );
                     if (0<"JNT",-1217109558,"く偏ᱏⱏࡏ屏䡏юᡎᑎᑎ၎","늽늍\ua9dd","䚩\udea8嚩䚧麩纩䚩\udea8\ueea8暩뺨蚩嚩䚧\ueea8隩뺨溩溩캨㺧暧ڪﺪ",-1900036100>(var2)
                        && 0<"JNT",-1217109558,"く偏ᱏⱏࡏ屏䡏юᡎᑎᑎ၎","늽늍\ua9dd","䚩\udea8嚩䚧麩纩䚩\udea8\ueea8暩뺨蚩嚩䚧\ueea8隩뺨溩溩캨㺧暧ڪﺪ",-1900036099>(var2)
                        && !0<"JNT",-1243984355,"䁏\uec4f","늽늍\ua9dd","躩暩",-1900036109>(1<"JNT",-168370741,"\uea72뉲ɲ","ධְ","셱텱Ÿ녵慶\uf172",1336034154>(this))) {
                        0<"JNT",-1243984355,"く偏ᱏⱏࡏ屏䡏ᑎN\u0c4eᱎ","늽냽괝끍굽뇭껍꺍괝끍뀭굝뀍꺝굽뇭뀭껽뀍괭괭냭넍녝뎝뎽뎭늍ꦝ","䚩\udea8嚩䚧麩纩䚩\udea8\ueea8暩뺨蚩嚩䚧\ueea8隩뺨溩溩캨ສ嚧ڪ",-1900036345>(
                           1<"JNT",-168370741,"왲퉲쉲\ude72빲ꩲ\uf273ੳ\uf673ﹳ","ರᎰʰ쳯ரްರᎰᆰ°ྰᒰʰ쳯ᆰરྰưưᶰ쇯뿯컯","셱텱Ÿⅶ酵腶ㅲᅶ텵ⅶ酵煵慶兵ꅵ腶ㅲ煵Ŷ兵煶煶ㅵ녲腲ꅲ\uf172",1336034157>(
                              1<"JNT",-168370741,"\ude72\uf672","ධְ","셱텱Ÿⅶ酵腶ㅲᅶ텵ⅶ酵煵慶兵ꅵ腶ㅲ煵Ŷ兵煶煶ㅵ煲兲䅲\uf172",1336034160>(this)
                           ),
                           1<"JNT",1808354218,"왲퉲쉲\ude72빲ꩲɳ\u0e73\uee73\u0e73","ರᎰʰ쳯ரްರᎰᆰ°ྰᒰʰ쳯ᆰરྰưưᶰ뿯샯쓯웯","셱텱Ÿⅶ酵腶ㅲᅶ텵ⅶ酵煵慶兵ꅵ腶ㅲ煵Ŷ兵煶煶ㅵ兲慲ꅲ셲\uf172",1336034158>()
                        );
                     }

                     1<"JNT",-183214259,"ﹲ쩲","ධְ","셱텱\ue178",1336033532>(this, true);
                  }

                  var3 = (-932936315 + 74679215 | 612720842) & 614949835;
                  continue;
               case 598367422:
                  if (1<"JNT",-168370741,"뉲ﹲ","ධְ","셱텱\ue178",1336034161>(this)) {
                     if (1<"JNT",-168370741,"왲빲","ධְ","셱텱텷",1336034162>(this) == -1) {
                        1<"JNT",-183214259,"왲빲","ධְ","셱텱텷",1336033531>(
                           this,
                           0<"JNT",-1243984355,"く偏ᱏⱏࡏ屏䡏ᑎ\ue84e၎ᡎю","늽늍낍","䚩\udea8嚩䚧麩纩䚩\udea8\ueea8暩뺨蚩嚩䚧\ueea8隩뺨溩溩캨㺧ڪڪ㺧",-1900036306>(
                              0<"JNT",-1243984355,"く偏ᱏⱏࡏ屏䡏ᡎN၎ᱎ\uec4e","늽늍냽괝끍굽뇭껍꺍괝끍뀭굝뀍꺝굽뇭뀭껽뀍괭괭냭넍뎝뎝넍뎭","䚩\udea8嚩䚧麩纩䚩\udea8\ueea8暩뺨蚩嚩䚧\ueea8隩뺨溩溩캨ສ嚧ڪ",-1900036295>(
                                 1<"JNT",-168370741,"왲퉲쉲\ude72빲ꩲ\uf273ੳ\uf673ﹳ","ರᎰʰ쳯ரްರᎰᆰ°ྰᒰʰ쳯ᆰરྰưưᶰ쇯뿯컯","셱텱Ÿⅶ酵腶ㅲᅶ텵ⅶ酵煵慶兵ꅵ腶ㅲ煵Ŷ兵煶煶ㅵ녲腲ꅲ\uf172",1336034168>(
                                    1<"JNT",-168370741,"\ude72\uf672","ධְ","셱텱Ÿⅶ酵腶ㅲᅶ텵ⅶ酵煵慶兵ꅵ腶ㅲ煵Ŷ兵煶煶ㅵ煲兲䅲\uf172",1336034167>(this)
                                 )
                              )
                           )
                        );
                     }

                     var3 = -1369616981 ^ -1369616981 << -1369616981 ^ -1503128653;
                     continue;
                  }
                  break;
               case 826913964:
                  if (!0<"JNT",-1243984355,"䁏\uec4f","늽늍\ua9dd","躩暩",-1900036313>(1<"JNT",-168370741,"\uda72全","ධְ","셱텱Ÿ녵慶\uf172",1336033550>(this))) {
                     var3 = (660826211 >> -421164305 | -551176148) & -542655553;
                     continue;
                  }

                  0<"JNT",-1243984355,"ᡏᱏ","늽늍ꦝ","亩ຬ",-1900036316>(this);
                  break;
               case 1082605173:
               default:
                  if (0<"JNT",-807171033,"く塏","늽낍늍\ua9dd","隩\ue6a8",-1900036336>(
                     0<"JNT",-1243984355,"呏ⱏ","늽늍낍","皩㺩",-1900036333>(1<"JNT",-168370741,"\uf672빲","ධְ","셱텱Ÿ셵其\uf172",1336033546>(this))
                  )) {
                     1<"JNT",-183214259,"뉲ﹲ","ධְ","셱텱\ue178",1336033549>(this, true);
                  }

                  var3 = (1214623492 ^ -647985548 >>> (1214623492 << -647985548) | 778326796) & 780098461;
                  continue;
            }

            var3 = -443985860;
         }
      }
   }

   // $VF: renamed from: st () void
   public void method_1663() {
      if (1<"JNT",-168370741,"\ue672\ue272","ධְ","셱텱텷",1336034164>(this)
         < 0<"JNT",-1243984355,"呏\ue44f⡏","늽늍낍","효\ueea8",-1900036326>(1<"JNT",-168370741,"\uea72칲ﹲ","ධְ","셱텱Ÿ腵煵\uf172",1336034129>(this))) {
         1<"JNT",-183214259,"\ue672\ue272","ධְ","셱텱텷",1336034136>(this, 1<"JNT",-168370741,"\ue672\ue272","ධְ","셱텱텷",1336034135>(this) + 1);
      } else {
         0<"JNT",-807171033,"ᑏᱏ\u244f","늽낍늍ꦝ","皩",-1900036338>(1<"JNT",-168370741,"왲빲","ධְ","셱텱텷",1336034133>(this));
         0<"JNT",-1243984355,"ᑏ\ue84f","늽늍ꦝ","亩ຬ",-1900036337>(this);
      }
   }

   // $VF: renamed from: vw () void
   public void method_1664() {
      1<"JNT",-183214259,"왲빲","ධְ","셱텱텷",1336034140>(this, -1);
      1<"JNT",-183214259,"빲\uda72","ධְ","셱텱텷",1336034137>(this, 0);
      1<"JNT",-183214259,"\ue672\ue272","ධְ","셱텱텷",1336034138>(this, 0);
      1<"JNT",-183214259,"뉲ﹲ","ධְ","셱텱\ue178",1336034143>(this, false);
      1<"JNT",-183214259,"ﹲ쩲","ධְ","셱텱\ue178",1336034144>(this, false);
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1413(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 ^ 132802698) + 1012261804 ^ 1621059176) - 531375261 + 1685559158 - 1067019924 - 408634569 + 60991169 + 2055096294;
      MethodHandle var10000 = field_1899[((var10 ^ 132802698) + 1012261804 ^ 1621059176)
         - 531375261
         + 1685559158
         - 1067019924
         - 408634569
         + 60991169
         + 2055096294
         - 271354644];
      if (field_1899[var10001 - 271354644] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = (1110467043 << -2118094707 | 0) & -498985510; var23 < var13.length(); var23 += (-555862583 | 128802206) ^ -536904226) {
            int var42 = var13.charAt(var23) + 204 + 167 - 171;
            char var45 = (char)(
               (
                     (
                           (((((var42 & 0) >> 16 | var42 << 0) - 177 - 98 & 65535) >> 0 | ((var42 & 0) >> 16 | var42 << 0) - 177 - 98 << 16) & 64512) >> 10
                              | ((((var42 & 0) >> 16 | var42 << 0) - 177 - 98 & 65535) >> 0 | ((var42 & 0) >> 16 | var42 << 0) - 177 - 98 << 16) << 6
                        )
                        ^ 26
                  )
                  - 169
            );
            var13.setCharAt(
               var23,
               (char)(
                  (
                        (
                              (((((var42 & 0) >> 16 | var42 << 0) - 177 - 98 & 65535) >> 0 | ((var42 & 0) >> 16 | var42 << 0) - 177 - 98 << 16) & 64512) >> 10
                                 | ((((var42 & 0) >> 16 | var42 << 0) - 177 - 98 & 65535) >> 0 | ((var42 & 0) >> 16 | var42 << 0) - 177 - 98 << 16) << 6
                           )
                           ^ 26
                     )
                     - 169
               )
            );
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = -1477552369 << -34174235 ^ -37035552; var29 < var16.length(); var29 += -961305501 << -3157612 ^ 1177550849) {
            int var50 = var16.charAt(var29) ^ 245 ^ 119;
            int var79 = (var50 & 65472) >> 6;
            int var51 = ((var50 & 65472) >> 6 | var50 << 10) + 188;
            int var80 = (((var50 & 65472) >> 6 | var50 << 10) + 188 & 49152) >> 14;
            char var52 = (char)(
               (((((var79 | var50 << 10) + 188 & 49152) >> 14 | ((var50 & 65472) >> 6 | var50 << 10) + 188 << 2) ^ 62) + 135 ^ 214) + 254 + 200
            );
            var16.setCharAt(var29, (char)((((var80 | var51 << 2) ^ 62) + 135 ^ 214) + 254 + 200));
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_246.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = (-609217525 >> -551823174 | 0) & 8; var35 < var19.length(); var35 += (2099478823 | 520945851 | 1) & -2146428863) {
            int var57 = var19.charAt(var35) + 143 + 247 - 92 + 49;
            char var60 = (char)(
               (
                     (
                              (((((var57 & 65504) >> 5 | var57 << 11) & 65520) >> 4 | ((var57 & 65504) >> 5 | var57 << 11) << 12) & 65532) >> 2
                                 | ((((var57 & 65504) >> 5 | var57 << 11) & 65520) >> 4 | ((var57 & 65504) >> 5 | var57 << 11) << 12) << 14
                           )
                           + 137
                        ^ 42
                  )
                  - 202
            );
            var19.setCharAt(
               var35,
               (char)(
                  (
                        (
                                 (((((var57 & 65504) >> 5 | var57 << 11) & 65520) >> 4 | ((var57 & 65504) >> 5 | var57 << 11) << 12) & 65532) >> 2
                                    | ((((var57 & 65504) >> 5 | var57 << 11) & 65520) >> 4 | ((var57 & 65504) >> 5 | var57 << 11) << 12) << 14
                              )
                              + 137
                           ^ 42
                     )
                     - 202
               )
            );
         }

         Class var7 = Class.forName(var19.toString(), false, Class_246.class.getClassLoader());
         switch (((var4 ^ 1983039744) - 310629970 ^ 1695081177) - 413976317 - 2121834967 + 856267975 + 1911774677 + 437222980 - 1305217877 - 1629442180) {
            case 23432794:
               var10000 = var0.findConstructor(var7, var6);
               break;
            case 970474102:
               var10000 = var0.findSpecial(var7, var5, var6, Class_246.class);
               break;
            case 994132031:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            case 1153819860:
            case 1298662981:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_1899[((var10 ^ 132802698) + 1012261804 ^ 1621059176) - 531375261 + 1685559158 - 1067019924 - 408634569 + 60991169 + 2055096294 - 271354644] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1414(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 - 511756329 + 1158033392 ^ 1528227491 ^ 2016000926) + 1792756714 ^ 477366015 ^ 388922096) - 1337301604 + 268917806;
      MethodHandle var10000 = field_1899[((var10 - 511756329 + 1158033392 ^ 1528227491 ^ 2016000926) + 1792756714 ^ 477366015 ^ 388922096)
         - 1337301604
         + 268917806
         - 1962934120];
      if (field_1899[var10001 - 1962934120] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = 1304920548 - (478286031 ^ 478286031) ^ 1304920548; var24 < var14.length(); var24 += 1323235824 * 1323235824 ^ -1337671423) {
            int var43 = var14.charAt(var24);
            int var10004 = (var43 & 32768) >> 15;
            int var44 = (((var43 & 32768) >> 15 | var43 << 1) ^ 35) + 123 - 186;
            int var88 = ((((var43 & 32768) >> 15 | var43 << 1) ^ 35) + 123 - 186 & 65472) >> 6;
            var43 = (((var10004 | var43 << 1) ^ 35) + 123 - 186 & 65472) >> 6 | (((var43 & 32768) >> 15 | var43 << 1) ^ 35) + 123 - 186 << 10;
            var10004 = ((var88 | var44 << 10) & 32768) >> 15;
            int var46 = (((var88 | var44 << 10) & 32768) >> 15 | var43 << 1) + 92;
            int var90 = ((((var88 | var44 << 10) & 32768) >> 15 | var43 << 1) + 92 & 65472) >> 6;
            char var47 = (char)((((var10004 | var43 << 1) + 92 & 65472) >> 6 | (((var88 | var44 << 10) & 32768) >> 15 | var43 << 1) + 92 << 10) - 229 + 88);
            var14.setCharAt(var24, (char)((var90 | var46 << 10) - 229 + 88));
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = -1748851410 & -1491761449 >> -230220507 ^ -1795120090; var30 < var17.length(); var30 += 287955439 * -281109241 ^ 195987592) {
            int var52 = var17.charAt(var30) + 190;
            char var57 = (char)(
               (
                        (
                                 (
                                       (
                                                (
                                                      (
                                                               (
                                                                        (((var52 & 32768) >> 15 | var52 << 1) & 65532) >> 2
                                                                           | ((var52 & 32768) >> 15 | var52 << 1) << 14
                                                                     )
                                                                     - 55
                                                                  & 65024
                                                            )
                                                            >> 9
                                                         | ((((var52 & 32768) >> 15 | var52 << 1) & 65532) >> 2 | ((var52 & 32768) >> 15 | var52 << 1) << 14)
                                                               - 55
                                                            << 7
                                                   )
                                                   & 61440
                                             )
                                             >> 12
                                          | (
                                                (
                                                         ((((var52 & 32768) >> 15 | var52 << 1) & 65532) >> 2 | ((var52 & 32768) >> 15 | var52 << 1) << 14)
                                                               - 55
                                                            & 65024
                                                      )
                                                      >> 9
                                                   | ((((var52 & 32768) >> 15 | var52 << 1) & 65532) >> 2 | ((var52 & 32768) >> 15 | var52 << 1) << 14) - 55
                                                      << 7
                                             )
                                             << 4
                                    )
                                    ^ 227
                              )
                              + 142
                              + 83
                           & 65532
                     )
                     >> 2
                  | (
                           (
                                 (
                                          (
                                                (
                                                         ((((var52 & 32768) >> 15 | var52 << 1) & 65532) >> 2 | ((var52 & 32768) >> 15 | var52 << 1) << 14)
                                                               - 55
                                                            & 65024
                                                      )
                                                      >> 9
                                                   | ((((var52 & 32768) >> 15 | var52 << 1) & 65532) >> 2 | ((var52 & 32768) >> 15 | var52 << 1) << 14) - 55
                                                      << 7
                                             )
                                             & 61440
                                       )
                                       >> 12
                                    | (
                                          (((((var52 & 32768) >> 15 | var52 << 1) & 65532) >> 2 | ((var52 & 32768) >> 15 | var52 << 1) << 14) - 55 & 65024)
                                                >> 9
                                             | ((((var52 & 32768) >> 15 | var52 << 1) & 65532) >> 2 | ((var52 & 32768) >> 15 | var52 << 1) << 14) - 55 << 7
                                       )
                                       << 4
                              )
                              ^ 227
                        )
                        + 142
                        + 83
                     << 14
            );
            var17.setCharAt(
               var30,
               (char)(
                  (
                           (
                                    (
                                          (
                                                   (
                                                         (
                                                                  (
                                                                           (((var52 & 32768) >> 15 | var52 << 1) & 65532) >> 2
                                                                              | ((var52 & 32768) >> 15 | var52 << 1) << 14
                                                                        )
                                                                        - 55
                                                                     & 65024
                                                               )
                                                               >> 9
                                                            | ((((var52 & 32768) >> 15 | var52 << 1) & 65532) >> 2 | ((var52 & 32768) >> 15 | var52 << 1) << 14)
                                                                  - 55
                                                               << 7
                                                      )
                                                      & 61440
                                                )
                                                >> 12
                                             | (
                                                   (
                                                            ((((var52 & 32768) >> 15 | var52 << 1) & 65532) >> 2 | ((var52 & 32768) >> 15 | var52 << 1) << 14)
                                                                  - 55
                                                               & 65024
                                                         )
                                                         >> 9
                                                      | ((((var52 & 32768) >> 15 | var52 << 1) & 65532) >> 2 | ((var52 & 32768) >> 15 | var52 << 1) << 14) - 55
                                                         << 7
                                                )
                                                << 4
                                       )
                                       ^ 227
                                 )
                                 + 142
                                 + 83
                              & 65532
                        )
                        >> 2
                     | (
                              (
                                    (
                                             (
                                                   (
                                                            ((((var52 & 32768) >> 15 | var52 << 1) & 65532) >> 2 | ((var52 & 32768) >> 15 | var52 << 1) << 14)
                                                                  - 55
                                                               & 65024
                                                         )
                                                         >> 9
                                                      | ((((var52 & 32768) >> 15 | var52 << 1) & 65532) >> 2 | ((var52 & 32768) >> 15 | var52 << 1) << 14) - 55
                                                         << 7
                                                )
                                                & 61440
                                          )
                                          >> 12
                                       | (
                                             (((((var52 & 32768) >> 15 | var52 << 1) & 65532) >> 2 | ((var52 & 32768) >> 15 | var52 << 1) << 14) - 55 & 65024)
                                                   >> 9
                                                | ((((var52 & 32768) >> 15 | var52 << 1) & 65532) >> 2 | ((var52 & 32768) >> 15 | var52 << 1) << 14) - 55 << 7
                                          )
                                          << 4
                                 )
                                 ^ 227
                           )
                           + 142
                           + 83
                        << 14
               )
            );
         }

         Class var6 = Class.forName(var17.toString(), false, Class_246.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = 1378497799 << 992324723 ^ -1472724992; var36 < var20.length(); var36 += (112153278 * 112153278 | 1) & -665505767) {
            int var62 = (var20.charAt(var36) - 253 ^ 162) - 184;
            int var96 = (var62 & 49152) >> 14;
            int var63 = ((var62 & 49152) >> 14 | var62 << 2) + 62 - 17;
            int var97 = (((var62 & 49152) >> 14 | var62 << 2) + 62 - 17 & 65408) >> 7;
            var62 = ((var96 | var62 << 2) + 62 - 17 & 65408) >> 7 | ((var62 & 49152) >> 14 | var62 << 2) + 62 - 17 << 9;
            var96 = ((var97 | var63 << 9) & 64512) >> 10;
            int var65 = (((var97 | var63 << 9) & 64512) >> 10 | var62 << 6) - 79;
            int var99 = ((((var97 | var63 << 9) & 64512) >> 10 | var62 << 6) - 79 & 57344) >> 13;
            char var66 = (char)(((var96 | var62 << 6) - 79 & 57344) >> 13 | (((var97 | var63 << 9) & 64512) >> 10 | var62 << 6) - 79 << 3);
            var20.setCharAt(var36, (char)(var99 | var65 << 3));
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_246.class.getClassLoader()).returnType();
         switch (((((var4 ^ 1212109016) - 188665842 - 1544041641 ^ 1643432494) + 2013760364 ^ 424325272) + 1983125341 ^ 814872388) + 1261699587 ^ 1578611921) {
            case 909758759:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            case 945639845:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            case 1125211175:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            case 1612168688:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_1899[((var10 - 511756329 + 1158033392 ^ 1528227491 ^ 2016000926) + 1792756714 ^ 477366015 ^ 388922096) - 1337301604 + 268917806 - 1962934120] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
