import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;
import net.minecraft.class_634;

public class Class_403 extends Class_342 {
   // $VF: renamed from: jhr Class_419
   public Class_419 field_1559;
   // $VF: renamed from: ikg Class_321
   public Class_321 field_1560;
   // $VF: renamed from: euj Class_168
   public Class_168 field_1561;
   // $VF: renamed from: hb int
   public int field_1562;
   // $VF: renamed from: njb java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_1563 = new MethodHandle[62];

   public Class_403() {
      int var10001 = 0;

      StringBuilder var10002;
      for (var10002 = (StringBuilder)0<"JNT",1922066698,"p\u001d\u0002\u001d\br","ﾑﾧｮ罫ｸ罫羔ｷ罫ｴ罰羔羢ｻｲ罯ｴ罰羖羏ﾨ","ᔃႃᬃႃ眃ᘃႃᜃᎃ眃⦃ᨃᤃᒃᜃᎃ℃᪃ᒃᘃሃኃᤃ",-1908081836>("큁큵큶큯퀢큖큲큡");
         var10001 < (-1068203142 << -1068203142 ^ -402653176);
         var10001 += (1784645108 | 1) & -1876928501
      ) {
         char var21 = 0<"JNT",-1141659462,"\u0017\u001c\u0015\u0006u\b","ﾑ羟羏羚","ᔃႃᬃႃ眃ᘃႃᜃᎃ眃⦃ᨃᤃᒃᜃᎃ℃᪃ᒃᘃሃኃᤃ",-1908081831>(var10002, var10001);
         int var10005 = (var21 & '︀') >> 9;
         int var22 = (((var21 & '︀') >> 9 | var21 << 7) - 215 ^ 244) - 101;
         int var66 = ((((var21 & '︀') >> 9 | var21 << 7) - 215 ^ 244) - 101 & 65408) >> 7;
         var21 = (char)((((var10005 | var21 << 7) - 215 ^ 244) - 101 & 65408) >> 7 | (((var21 & '︀') >> 9 | var21 << 7) - 215 ^ 244) - 101 << 9);
         0<"JNT",-1141659462,"\u0007\u0019\bw\u001c\u0015\u0006u\b","ﾑ羟羚羏ﾨ","ᔃႃᬃႃ眃ᘃႃᜃᎃ眃⦃ᨃᤃᒃᜃᎃ℃᪃ᒃᘃሃኃᤃ",-1908081820>(
            var10002, var10001, (char)(var66 | var22 << 9)
         );
      }

      String var2 = 0<"JNT",-1141659462,"\b\u0003g\b\u0006\u001d\u0002\u001b","ﾑ羏ﾧｮ罫ｸ罫羔ｷ罫ｴ罰羔羢ｻｲ罯ｴ罰羖","ᔃႃᬃႃ眃ᘃႃᜃᎃ眃⦃ᨃᤃᒃᜃᎃ℃᪃ᒃᘃሃኃᤃ",-1908081819>(var10002);
      int var11 = 1345136533 >>> 1569866083 ^ 168142066;

      StringBuilder var25;
      for (var25 = (StringBuilder)0<"JNT",1922066698,"p\u001d\u0002\u001d\br","ﾑﾧｮ罫ｸ罫羔ｷ罫ｴ罰羔羢ｻｲ罯ｴ罰羖羏ﾨ","ᔃႃᬃႃ眃ᘃႃᜃᎃ眃⦃ᨃᤃᒃᜃᎃ℃᪃ᒃᘃሃኃᤃ",-1908081824>(
            "柑\uefd1쏑ߐ\ue3d1쟑럎ϐ폑럑ϐ럎폑쟑\ue3d1\uf3d1\uffd0럎័\uefd1ߐ럎ϐ쟑\ue3d1쟑\uf3d1\uefd1\ufbd1ϐ럎\uffd0ϐ\ufbd1쟑럑\ue7d1쟑\ufbd1\uffd0럎ϐ\uefd1럎័\uefd1ߐ"
         );
         var11 < (1950444751 >> 1950444751 ^ 59565);
         var11 += 1
      ) {
         char var48 = 0<"JNT",-1141659462,"\u0017\u001c\u0015\u0006u\b","ﾑ羟羏羚","ᔃႃᬃႃ眃ᘃႃᜃᎃ眃⦃ᨃᤃᒃᜃᎃ℃᪃ᒃᘃሃኃᤃ",-1908081833>(var25, var11);
         int var10006 = (var48 & '\uffff') >> 0;
         int var49 = (((var48 & '\uffff') >> 0 | var48 << 16) ^ 225) + 208;
         int var80 = ((((var48 & '\uffff') >> 0 | var48 << 16) ^ 225) + 208 & 64512) >> 10;
         var48 = (char)(((((var10006 | var48 << 16) ^ 225) + 208 & 64512) >> 10 | (((var48 & '\uffff') >> 0 | var48 << 16) ^ 225) + 208 << 6) + 51);
         0<"JNT",-1141659462,"\u0007\u0019\bw\u001c\u0015\u0006u\b","ﾑ羟羚羏ﾨ","ᔃႃᬃႃ眃ᘃႃᜃᎃ眃⦃ᨃᤃᒃᜃᎃ℃᪃ᒃᘃሃኃᤃ",-1908081830>(
            var25, var11, (char)((var80 | var49 << 6) + 51)
         );
      }

      super(
         var2,
         0<"JNT",-1141659462,"\b\u0003g\b\u0006\u001d\u0002\u001b","ﾑ羏ﾧｮ罫ｸ罫羔ｷ罫ｴ罰羔羢ｻｲ罯ｴ罰羖","ᔃႃᬃႃ眃ᘃႃᜃᎃ眃⦃ᨃᤃᒃᜃᎃ℃᪃ᒃᘃሃኃᤃ",-1908081810>(var25),
         -1,
         1<"JNT",1800166445,"ᣞ룝⣑","協刌","ȉȅɹ˅ˡƽ",1859526456>()
      );
      var10001 = (1584390921 & (-1228431152 ^ 1584390921) | 0) & -1789850524;

      for (var10002 = (StringBuilder)0<"JNT",1922066698,"p\u001d\u0002\u001d\br","ﾑﾧｮ罫ｸ罫羔ｷ罫ｴ罰羔羢ｻｲ罯ｴ罰羖羏ﾨ","ᔃႃᬃႃ眃ᘃႃᜃᎃ眃⦃ᨃᤃᒃᜃᎃ℃᪃ᒃᘃሃኃᤃ",-1908081804>("ʠΨϠΈш");
         var10001 < (1648283396 >> 864231715 ^ 206035429);
         var10001 += (1435345971 | -1150563773 ^ -1630327440) ^ 1975379762
      ) {
         char var28 = 0<"JNT",-1141659462,"\u0017\u001c\u0015\u0006u\b","ﾑ羟羏羚","ᔃႃᬃႃ眃ᘃႃᜃᎃ眃⦃ᨃᤃᒃᜃᎃ℃᪃ᒃᘃሃኃᤃ",-1908081821>(var10002, var10001);
         char var31 = (char)(
            (
                  (((((var28 & '\ufff0') >> 4 | var28 << '\f') & 49152) >> 14 | ((var28 & '\ufff0') >> 4 | var28 << '\f') << 2) & 65534) >> 1
                     | ((((var28 & '\ufff0') >> 4 | var28 << '\f') & 49152) >> 14 | ((var28 & '\ufff0') >> 4 | var28 << '\f') << 2) << 15
               )
               - 45
               + 29
         );
         0<"JNT",-1141659462,"\u0007\u0019\bw\u001c\u0015\u0006u\b","ﾑ羟羚羏ﾨ","ᔃႃᬃႃ眃ᘃႃᜃᎃ眃⦃ᨃᤃᒃᜃᎃ℃᪃ᒃᘃሃኃᤃ",-1908081818>(
            var10002,
            var10001,
            (char)(
               (
                     (((((var28 & '\ufff0') >> 4 | var28 << '\f') & 49152) >> 14 | ((var28 & '\ufff0') >> 4 | var28 << '\f') << 2) & 65534) >> 1
                        | ((((var28 & '\ufff0') >> 4 | var28 << '\f') & 49152) >> 14 | ((var28 & '\ufff0') >> 4 | var28 << '\f') << 2) << 15
                  )
                  - 45
                  + 29
            )
         );
      }

      this.field_1559 = (Class_419)0<"JNT",1922066698,"p\u001d\u0002\u001d\br","ﾑﾧｮ罫ｸ罫羔ｷ罫ｴ罰羔羢ｻｲ罯ｴ罰羖ﾣﾣﾣﾣﾣ羏ﾨ","ᴃᚃ",-1908081838>(
         0<"JNT",-1141659462,"\b\u0003g\b\u0006\u001d\u0002\u001b","ﾑ羏ﾧｮ罫ｸ罫羔ｷ罫ｴ罰羔羢ｻｲ罯ｴ罰羖","ᔃႃᬃႃ眃ᘃႃᜃᎃ眃⦃ᨃᤃᒃᜃᎃ℃᪃ᒃᘃሃኃᤃ",-1908081809>(var10002),
         1.0,
         80.0,
         1.0,
         10.0,
         30.0
      );
      var10001 = -891356133 ^ -891356133 ^ 0;

      for (var10002 = (StringBuilder)0<"JNT",1922066698,"p\u001d\u0002\u001d\br","ﾑﾧｮ罫ｸ罫羔ｷ罫ｴ罰羔羢ｻｲ罯ｴ罰羖羏ﾨ","ᔃႃᬃႃ眃ᘃႃᜃᎃ眃⦃ᨃᤃᒃᜃᎃ℃᪃ᒃᘃሃኃᤃ",-1908081811>("\u008f±¦§");
         var10001 < (-506094827 & -506094827 ^ -506094831);
         var10001 += (918871003 + 1845798202 | 0) & 403708449
      ) {
         int var34 = 0<"JNT",-1141659462,"\u0017\u001c\u0015\u0006u\b","ﾑ羟羏羚","ᔃႃᬃႃ眃ᘃႃᜃᎃ眃⦃ᨃᤃᒃᜃᎃ℃᪃ᒃᘃሃኃᤃ",-1908081817>(var10002, var10001) - 'M';
         int var72 = (var34 & 65535) >> 0;
         int var35 = ((var34 & 65535) >> 0 | var34 << 16) + 28 - 17;
         int var73 = (((var34 & 65535) >> 0 | var34 << 16) + 28 - 17 & 65535) >> 0;
         char var36 = (char)(((var72 | var34 << 16) + 28 - 17 & 65535) >> 0 | ((var34 & 65535) >> 0 | var34 << 16) + 28 - 17 << 16);
         0<"JNT",-1141659462,"\u0007\u0019\bw\u001c\u0015\u0006u\b","ﾑ羟羚羏ﾨ","ᔃႃᬃႃ眃ᘃႃᜃᎃ眃⦃ᨃᤃᒃᜃᎃ℃᪃ᒃᘃሃኃᤃ",-1908081814>(
            var10002, var10001, (char)(var73 | var35 << 16)
         );
      }

      this.field_1560 = (Class_321)0<"JNT",1922066698,"p\u001d\u0002\u001d\br","ﾑﾧｮ罫ｸ罫羔ｷ罫ｴ罰羔羢ｻｲ罯ｴ罰羖ﾧｮ罫ｸ罫羔ｷ罫ｴ罰羔羡ｴ罹罵羖ﾧｮ罫ｸ罫羔ｷ罫ｴ罰羔羚ｷ罫署署羖羏ﾨ","ᨃឃ",-1908081837>(
         0<"JNT",-1141659462,"\b\u0003g\b\u0006\u001d\u0002\u001b","ﾑ羏ﾧｮ罫ｸ罫羔ｷ罫ｴ罰羔羢ｻｲ罯ｴ罰羖","ᔃႃᬃႃ眃ᘃႃᜃᎃ眃⦃ᨃᤃᒃᜃᎃ℃᪃ᒃᘃሃኃᤃ",-1908081835>(var10002),
         1<"JNT",1800166445,"棝\ue8dd\ue8dd","勼却","ȉȅɹ˙ʕƽ",1859526631>(),
         Class_61.class
      );
      var10001 = (-976390579 & -976390579 | 0) & 304089106;

      for (var10002 = (StringBuilder)0<"JNT",1922066698,"p\u001d\u0002\u001d\br","ﾑﾧｮ罫ｸ罫羔ｷ罫ｴ罰羔羢ｻｲ罯ｴ罰羖羏ﾨ","ᔃႃᬃႃ眃ᘃႃᜃᎃ眃⦃ᨃᤃᒃᜃᎃ℃᪃ᒃᘃሃኃᤃ",-1908081834>("ƮǦǐȀǘǲ");
         var10001 < (-1235633149 & 1556901958 ^ 340275204);
         var10001 += -1482266701 >> (905566502 | 905566502) ^ -23160417
      ) {
         char var39 = 0<"JNT",-1141659462,"\u0017\u001c\u0015\u0006u\b","ﾑ羟羏羚","ᔃႃᬃႃ眃ᘃႃᜃᎃ眃⦃ᨃᤃᒃᜃᎃ℃᪃ᒃᘃሃኃᤃ",-1908081816>(var10002, var10001);
         char var42 = (char)(
            (((((var39 & 'ﾀ') >> 7 | var39 << '\t') & 64512) >> 10 | ((var39 & 'ﾀ') >> 7 | var39 << '\t') << 6) + 117 - 252 & 65535) >> 0
               | ((((var39 & 'ﾀ') >> 7 | var39 << '\t') & 64512) >> 10 | ((var39 & 'ﾀ') >> 7 | var39 << '\t') << 6) + 117 - 252 << 16
         );
         0<"JNT",-1141659462,"\u0007\u0019\bw\u001c\u0015\u0006u\b","ﾑ羟羚羏ﾨ","ᔃႃᬃႃ眃ᘃႃᜃᎃ眃⦃ᨃᤃᒃᜃᎃ℃᪃ᒃᘃሃኃᤃ",-1908081813>(
            var10002,
            var10001,
            (char)(
               (((((var39 & 'ﾀ') >> 7 | var39 << '\t') & 64512) >> 10 | ((var39 & 'ﾀ') >> 7 | var39 << '\t') << 6) + 117 - 252 & 65535) >> 0
                  | ((((var39 & 'ﾀ') >> 7 | var39 << '\t') & 64512) >> 10 | ((var39 & 'ﾀ') >> 7 | var39 << '\t') << 6) + 117 - 252 << 16
            )
         );
      }

      String var9 = 0<"JNT",-1141659462,"\b\u0003g\b\u0006\u001d\u0002\u001b","ﾑ羏ﾧｮ罫ｸ罫羔ｷ罫ｴ罰羔羢ｻｲ罯ｴ罰羖","ᔃႃᬃႃ眃ᘃႃᜃᎃ眃⦃ᨃᤃᒃᜃᎃ℃᪃ᒃᘃሃኃᤃ",-1908081839>(var10002);
      int var19 = (-882650939 + (-882650939 | 1818793747) | 0) & 1157633794;

      for (var25 = (StringBuilder)0<"JNT",1922066698,"p\u001d\u0002\u001d\br","ﾑﾧｮ罫ｸ罫羔ｷ罫ｴ罰羔羢ｻｲ罯ｴ罰羖羏ﾨ","ᔃႃᬃႃ眃ᘃႃᜃᎃ眃⦃ᨃᤃᒃᜃᎃ℃᪃ᒃᘃሃኃᤃ",-1908081828>("႑좑႑벑뢑풑킑킑");
         var19 < (1896394280 ^ 66791812 ^ 1928562596);
         var19 += 1757068211 >>> 640799289 ^ 53
      ) {
         int var61 = (0<"JNT",-1141659462,"\u0017\u001c\u0015\u0006u\b","ﾑ羟羏羚","ᔃႃᬃႃ眃ᘃႃᜃᎃ眃⦃ᨃᤃᒃᜃᎃ℃᪃ᒃᘃሃኃᤃ",-1908081823>(var25, var19) ^ 181) - 35;
         char var64 = (char)(
            (((((var61 & 61440) >> 12 | var61 << 4) & 32768) >> 15 | ((var61 & 61440) >> 12 | var61 << 4) << 1) & 32768) >> 15
               | ((((var61 & 61440) >> 12 | var61 << 4) & 32768) >> 15 | ((var61 & 61440) >> 12 | var61 << 4) << 1) << 1
         );
         0<"JNT",-1141659462,"\u0007\u0019\bw\u001c\u0015\u0006u\b","ﾑ羟羚羏ﾨ","ᔃႃᬃႃ眃ᘃႃᜃᎃ眃⦃ᨃᤃᒃᜃᎃ℃᪃ᒃᘃሃኃᤃ",-1908081812>(
            var25,
            var19,
            (char)(
               (((((var61 & 61440) >> 12 | var61 << 4) & 32768) >> 15 | ((var61 & 61440) >> 12 | var61 << 4) << 1) & 32768) >> 15
                  | ((((var61 & 61440) >> 12 | var61 << 4) & 32768) >> 15 | ((var61 & 61440) >> 12 | var61 << 4) << 1) << 1
            )
         );
      }

      this.field_1561 = (Class_168)0<"JNT",1922066698,"p\u001d\u0002\u001d\br","ﾑﾧｮ罫ｸ罫羔ｷ罫ｴ罰羔羢ｻｲ罯ｴ罰羖ﾧｮ罫ｸ罫羔ｷ罫ｴ罰羔羢ｻｲ罯ｴ罰羖羏ﾨ","ᖃᢃ",-1908081854>(
         var9, 0<"JNT",-1141659462,"\b\u0003g\b\u0006\u001d\u0002\u001b","ﾑ羏ﾧｮ罫ｸ罫羔ｷ罫ｴ罰羔羢ｻｲ罯ｴ罰羖","ᔃႃᬃႃ眃ᘃႃᜃᎃ眃⦃ᨃᤃᒃᜃᎃ℃᪃ᒃᘃሃኃᤃ",-1908081825>(var25)
      );
      0<"JNT",-1141659462,"\u0005\t","ﾑ羦ﾧ罳罱罱羖羏ﾨ","ᲃᔃ",-1908081826>(
         this,
         new Class_271[]{
            1<"JNT",-1063812174,"㣞壝ᣞ","協勌","ȉȅɹʙ˭ƽ",1859526620>(this),
            1<"JNT",-1063812174,"죝⣞䣝","協勌","ȉȅɹˁ˵ƽ",1859526623>(this),
            1<"JNT",-1063812174,"\uf8dd\uf8d0죝","協勌","ȉȅɹ˽ʥƽ",1859526410>(this)
         }
      );
   }

   // $VF: renamed from: mg () void
   @Override
   public void method_1407() {
      0<"JNT",1433984708,"\u0001\u001b","ﾑ羏ﾨ","᪃ᦃጃ",-1908081801>(this);
   }

   // $VF: renamed from: q () void
   @Override
   public void method_1408() {
      0<"JNT",1433984708,"\u0005","ﾑ羏ﾨ","᪃ᦃጃ",-1908081798>(this);
   }

   // $VF: renamed from: gd (Class_207) void
   // $VF: Irreducible bytecode was duplicated to produce valid code
   @Class_21
   public void method_1441(Class_207 var1) {
      int var4 = -1033877664;
      if (1<"JNT",-1063812174,"⣞䣞","協勌","ȉȅʅ",1859526635>(this) > 0) {
         1<"JNT",-27016946,"⣞䣞","協勌","ȉȅʅ",1859526641>(this, 1<"JNT",-1063812174,"⣞䣞","協勌","ȉȅʅ",1859526646>(this) - 1);
      } else {
         class_634 var10000 = 0<"JNT",-1141659462,"\u0001\u0019\b\u001c\u0003\u0018\u0013EIJF","ﾑ羏ﾧｴ罱ｻ羔罵罯ｴ罱罪ｲ罫ｰｻ羔罪ｷ罫署署罬ﾘ羒ﾛ羖","ᜃኃᨃ眃ᚃᒃᜃኃᆃᤃႃጃᨃ眃ᆃᘃႃᦃᦃ⾃禃碃砃",-1908081919>(
            1<"JNT",-1063812174,"棝䣝","協勌","ȉȅɹ˱˕ʙǭ˵̅˱˕˝ʡ˥ˑʙǭ˝˹˥ʝʝȭƝƥƩƽ",1859526637>(this)
         );
         int var10001;
         StringBuilder var10002;
         if (0<"JNT",-1141659462,"\u0019\u0005\t\u0015\u0000\u0007","ﾑﾧｮ罫ｸ罫羔ｷ罫ｴ罰羔群ｪｮ罱罪ｻ羖羏ﾦ","ሃ᪃",-1908081907>(
            (Class_61)0<"JNT",-1141659462,"\u0019\u000b","ﾑ羏ﾧｮ罫ｸ罫羔ｷ罫ｴ罰羔羡ｴ罹罵羖","ᨃឃ",-1908081905>(1<"JNT",-1063812174,"㣞壝ᣞ","協勌","ȉȅɹʙ˭ƽ",1859526627>(this)),
            1<"JNT",1800166445,"裝㣑䣞","勼却","ȉȅɹ˙ʕƽ",1859526633>()
         )) {
            var10001 = 1204975356 ^ 1204975356 ^ 0;
            var10002 = (StringBuilder)0<"JNT",1922066698,"p\u001d\u0002\u001d\br","ﾑﾧｮ罫ｸ罫羔ｷ罫ｴ罰羔羢ｻｲ罯ｴ罰羖羏ﾨ","ᔃႃᬃႃ眃ᘃႃᜃᎃ眃⦃ᨃᤃᒃᜃᎃ℃᪃ᒃᘃሃኃᤃ",-1908081912>("焁洁币ᴁ");
            var4 = 1792518865 & -1940033900 ^ 1826109795;
         } else {
            var10001 = 0;
            var10002 = (StringBuilder)0<"JNT",1922066698,"p\u001d\u0002\u001d\br","ﾑﾧｮ罫ｸ罫羔ｷ罫ｴ罰羔羢ｻｲ罯ｴ罰羖羏ﾨ","ᔃႃᬃႃ眃ᘃႃᜃᎃ眃⦃ᨃᤃᒃᜃᎃ℃᪃ᒃᘃሃኃᤃ",-1908081799>(
               "䃅ÅჄ胄僄\u20c5僄È"
            );
            var4 = 2038224712 >> 2038224712 ^ -1324854781;
         }

         label44:
         while (true) {
            switch (((var4 ^ 386379742) + 105110850 + 619671258 ^ 717597679) + 1272630624 ^ 440568927) {
               case 437583193:
                  var7 = var10002;
                  if (var10001 >= ((-1542822707 | 970314842 | 0) & 1107296804)) {
                     var4 = (-1242676526 | 1567269085 | 1280380928) & -839524568;
                     break label44;
                  }

                  int var17 = 0<"JNT",-1141659462,"\u0017\u001c\u0015\u0006u\b","ﾑ羟羏羚","ᔃႃᬃႃ眃ᘃႃᜃᎃ眃⦃ᨃᤃᒃᜃᎃ℃᪃ᒃᘃሃኃᤃ",-1908081915>(var10002, var10001);
                  int var31 = (var17 & 65472) >> 6;
                  int var18 = (var17 & 65472) >> 6 | var17 << 10;
                  int var32 = (((var17 & 65472) >> 6 | var17 << 10) & 65520) >> 4;
                  var17 = ((var31 | var17 << 10) & 65520) >> 4 | ((var17 & 65472) >> 6 | var17 << 10) << 12;
                  var31 = ((var32 | var18 << 12) & 32768) >> 15;
                  int var20 = ((var32 | var18 << 12) & 32768) >> 15 | var17 << 1;
                  int var34 = ((((var32 | var18 << 12) & 32768) >> 15 | var17 << 1) & 32768) >> 15;
                  char var21 = (char)((((var31 | var17 << 1) & 32768) >> 15 | (((var32 | var18 << 12) & 32768) >> 15 | var17 << 1) << 1) - 253);
                  0<"JNT",-1141659462,"\u0007\u0019\bw\u001c\u0015\u0006u\b","ﾑ羟羚羏ﾨ","ᔃႃᬃႃ眃ᘃႃᜃᎃ眃⦃ᨃᤃᒃᜃᎃ℃᪃ᒃᘃሃኃᤃ",-1908081920>(
                     var10002, var10001, (char)((var34 | var20 << 1) - 253)
                  );
                  var10001 += 1790259681 ^ -606660652 ^ -1318967756;
                  var4 = 1792518865 & -1940033900 ^ 1826109795;
                  break;
               case 1560655990:
               default:
                  var7 = var10002;
                  if (var10001 >= 8) {
                     var4 = (1125600959 ^ 1125600959 & 1125600959 | 956558124) & -1187774532;
                     break label44;
                  }

                  int var11 = 0<"JNT",-1141659462,"\u0017\u001c\u0015\u0006u\b","ﾑ羟羏羚","ᔃႃᬃႃ眃ᘃႃᜃᎃ眃⦃ᨃᤃᒃᜃᎃ℃᪃ᒃᘃሃኃᤃ",-1908081797>(var10002, var10001) + 14;
                  char var14 = (char)(
                     ((((((var11 & 0) >> 16 | var11 << 0) ^ 212) & 64512) >> 10 | (((var11 & 0) >> 16 | var11 << 0) ^ 212) << 6) & 65532) >> 2
                        | (((((var11 & 0) >> 16 | var11 << 0) ^ 212) & 64512) >> 10 | (((var11 & 0) >> 16 | var11 << 0) ^ 212) << 6) << 14
                  );
                  0<"JNT",-1141659462,"\u0007\u0019\bw\u001c\u0015\u0006u\b","ﾑ羟羚羏ﾨ","ᔃႃᬃႃ眃ᘃႃᜃᎃ眃⦃ᨃᤃᒃᜃᎃ℃᪃ᒃᘃሃኃᤃ",-1908081794>(
                     var10002,
                     var10001,
                     (char)(
                        ((((((var11 & 0) >> 16 | var11 << 0) ^ 212) & 64512) >> 10 | (((var11 & 0) >> 16 | var11 << 0) ^ 212) << 6) & 65532) >> 2
                           | (((((var11 & 0) >> 16 | var11 << 0) ^ 212) & 64512) >> 10 | (((var11 & 0) >> 16 | var11 << 0) ^ 212) << 6) << 14
                     )
                  );
                  var10001 += (-2139341983 | 1484460540) ^ -662750212;
                  var4 = 2038224712 >> 2038224712 ^ -1324854781;
            }
         }
         String var8 = switch (var4 - 1234564347 - 113023325 ^ 1483216761 ^ 1112373912 ^ 1114057369 ^ 1923580581) {
            case -1034643191 -> 0<"JNT",-1141659462,"\b\u0003g\b\u0006\u001d\u0002\u001b","ﾑ羏ﾧｮ罫ｸ罫羔ｷ罫ｴ罰羔羢ｻｲ罯ｴ罰羖","ᔃႃᬃႃ眃ᘃႃᜃᎃ眃⦃ᨃᤃᒃᜃᎃ℃᪃ᒃᘃሃኃᤃ",-1908081917>(var7);
            default -> 0<"JNT",-1141659462,"\b\u0003g\b\u0006\u001d\u0002\u001b","ﾑ羏ﾧｮ罫ｸ罫羔ｷ罫ｴ罰羔羢ｻｲ罯ｴ罰羖","ᔃႃᬃႃ眃ᘃႃᜃᎃ眃⦃ᨃᤃᒃᜃᎃ℃᪃ᒃᘃሃኃᤃ",-1908081909>(var7);
         };
         String var3 = 0<"JNT",-1141659462,"\u001f\u001f","ﾑ羏ﾧｮ罫ｸ罫羔ｷ罫ｴ罰羔羢ｻｲ罯ｴ罰羖","ᖃᢃ",-1908081808>(
            1<"JNT",-1063812174,"\uf8dd\uf8d0죝","協勌","ȉȅɹ˽ʥƽ",1859526596>(this)
         );
         String var2 = var8;
         0<"JNT",-1141659462,"\u0001\u0019\b\u001c\u0003\u0018\u0013HIKGD","ﾑﾧｮ罫ｸ罫羔ｷ罫ｴ罰羔羢ｻｲ罯ｴ罰羖羏ﾨ","ᜃኃᨃ眃ᚃᒃᜃኃᆃᤃႃጃᨃ眃ᆃᘃႃᦃᦃ⾃笃禃稃",-1908081793>(
            var10000,
            0<"JNT",-1141659462,"\b\u0003g\b\u0006\u001d\u0002\u001b","ﾑ羏ﾧｮ罫ｸ罫羔ｷ罫ｴ罰羔羢ｻｲ罯ｴ罰羖","ᔃႃᬃႃ眃ᘃႃᜃᎃ眃⦃ᨃᤃᒃᜃᎃ℃᪃ᒃᘃሃኃᤃ",-1908081796>(
               0<"JNT",-1141659462,"\u0015\u0004\u0004\u0019\u0002\u0018","ﾑﾧｮ罫ｸ罫羔ｷ罫ｴ罰羔群ｪｮ罱罪ｻ羖羏ﾧｮ罫ｸ罫羔ｷ罫ｴ罰羔羢ｻｲ罯ｴ罰ﾚ罹罯ｷｳ罱ｲ羖","ᔃႃᬃႃ眃ᘃႃᜃᎃ眃⦃ᨃᤃᒃᜃᎃ℃᪃ᒃᘃሃኃᤃ",-1908081807>(
                  0<"JNT",-1141659462,"\u0015\u0004\u0004\u0019\u0002\u0018","ﾑﾧｮ罫ｸ罫羔ｷ罫ｴ罰羔群ｪｮ罱罪ｻ羖羏ﾧｮ罫ｸ罫羔ｷ罫ｴ罰羔羢ｻｲ罯ｴ罰ﾚ罹罯ｷｳ罱ｲ羖","ᔃႃᬃႃ眃ᘃႃᜃᎃ眃⦃ᨃᤃᒃᜃᎃ℃᪃ᒃᘃሃኃᤃ",-1908081802>(
                     (StringBuilder)0<"JNT",1922066698,"p\u001d\u0002\u001d\br","ﾑ羏ﾨ","ᔃႃᬃႃ眃ᘃႃᜃᎃ眃⦃ᨃᤃᒃᜃᎃ℃᪃ᒃᘃሃኃᤃ",-1908081805>(), var2
                  ),
                  var3
               )
            )
         );
         1<"JNT",-27016946,"⣞䣞","協勌","ȉȅʅ",1859526463>(
            this, 0<"JNT",-1141659462,"\u0006\u0018","ﾑ羏羟","ᴃᚃ",-1908081795>(1<"JNT",-1063812174,"죝⣞䣝","協勌","ȉȅɹˁ˵ƽ",1859526457>(this))
         );
      }
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1413(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = (var10 ^ 1750147267 ^ 1701300827 ^ 634456604 ^ 1240949451 ^ 669429506) + 1124596356 - 962542981 - 824435918 - 1339218624;
      MethodHandle var10000 = field_1563[(var10 ^ 1750147267 ^ 1701300827 ^ 634456604 ^ 1240949451 ^ 669429506)
            + 1124596356
            - 962542981
            - 824435918
            - 1339218624
         ^ 1365562250];
      if (field_1563[var10001 ^ 1365562250] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = (-1447159488 * -2136035828 | 0) & 5066962; var23 < var13.length(); var23 += (-429499509 << -429499509 | 1) & 1092788455) {
            int var42 = var13.charAt(var23);
            int var10004 = (var42 & 65528) >> 3;
            int var43 = ((var42 & 65528) >> 3 | var42 << 13) ^ 90;
            int var87 = ((((var42 & 65528) >> 3 | var42 << 13) ^ 90) & 65535) >> 0;
            var42 = (((var10004 | var42 << 13) ^ 90) & 65535) >> 0 | (((var42 & 65528) >> 3 | var42 << 13) ^ 90) << 16;
            var10004 = ((var87 | var43 << 16) & 32768) >> 15;
            int var45 = (((var87 | var43 << 16) & 32768) >> 15 | var42 << 1) - 70;
            int var89 = ((((var87 | var43 << 16) & 32768) >> 15 | var42 << 1) - 70 & 32768) >> 15;
            var42 = (((var10004 | var42 << 1) - 70 & 32768) >> 15 | (((var87 | var43 << 16) & 32768) >> 15 | var42 << 1) - 70 << 1) - 81 - 85;
            var10004 = ((var89 | var45 << 1) - 81 - 85 & 65532) >> 2;
            int var47 = ((var89 | var45 << 1) - 81 - 85 & 65532) >> 2 | var42 << 14;
            int var91 = ((((var89 | var45 << 1) - 81 - 85 & 65532) >> 2 | var42 << 14) & 57344) >> 13;
            char var48 = (char)(((var10004 | var42 << 14) & 57344) >> 13 | (((var89 | var45 << 1) - 81 - 85 & 65532) >> 2 | var42 << 14) << 3);
            var13.setCharAt(var23, (char)(var91 | var47 << 3));
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = -511669554 - -1314681786 ^ 803012232; var29 < var16.length(); var29 += (-1211914276 >> -1211914276 | 1) & 5) {
            char var53 = var16.charAt(var29);
            char var58 = (char)(
               (
                     (
                              (
                                       (
                                             (
                                                      (
                                                            (
                                                                     (
                                                                              (((var53 & '\uf000') >> 12 | var53 << 4) & 65504) >> 5
                                                                                 | ((var53 & '\uf000') >> 12 | var53 << 4) << 11
                                                                           )
                                                                           + 187
                                                                        & 32768
                                                                  )
                                                                  >> 15
                                                               | (
                                                                        (((var53 & '\uf000') >> 12 | var53 << 4) & 65504) >> 5
                                                                           | ((var53 & '\uf000') >> 12 | var53 << 4) << 11
                                                                     )
                                                                     + 187
                                                                  << 1
                                                         )
                                                         & 32768
                                                   )
                                                   >> 15
                                                | (
                                                      (
                                                               (
                                                                        (((var53 & '\uf000') >> 12 | var53 << 4) & 65504) >> 5
                                                                           | ((var53 & '\uf000') >> 12 | var53 << 4) << 11
                                                                     )
                                                                     + 187
                                                                  & 32768
                                                            )
                                                            >> 15
                                                         | (
                                                                  (((var53 & '\uf000') >> 12 | var53 << 4) & 65504) >> 5
                                                                     | ((var53 & '\uf000') >> 12 | var53 << 4) << 11
                                                               )
                                                               + 187
                                                            << 1
                                                   )
                                                   << 1
                                          )
                                          & 0
                                    )
                                    >> 16
                                 | (
                                       (
                                                (
                                                      (
                                                               (
                                                                        (((var53 & '\uf000') >> 12 | var53 << 4) & 65504) >> 5
                                                                           | ((var53 & '\uf000') >> 12 | var53 << 4) << 11
                                                                     )
                                                                     + 187
                                                                  & 32768
                                                            )
                                                            >> 15
                                                         | (
                                                                  (((var53 & '\uf000') >> 12 | var53 << 4) & 65504) >> 5
                                                                     | ((var53 & '\uf000') >> 12 | var53 << 4) << 11
                                                               )
                                                               + 187
                                                            << 1
                                                   )
                                                   & 32768
                                             )
                                             >> 15
                                          | (
                                                (
                                                         (
                                                                  (((var53 & '\uf000') >> 12 | var53 << 4) & 65504) >> 5
                                                                     | ((var53 & '\uf000') >> 12 | var53 << 4) << 11
                                                               )
                                                               + 187
                                                            & 32768
                                                      )
                                                      >> 15
                                                   | ((((var53 & '\uf000') >> 12 | var53 << 4) & 65504) >> 5 | ((var53 & '\uf000') >> 12 | var53 << 4) << 11)
                                                         + 187
                                                      << 1
                                             )
                                             << 1
                                    )
                                    << 0
                           )
                           + 46
                           - 239
                        ^ 71
                  )
                  - 228
            );
            var16.setCharAt(
               var29,
               (char)(
                  (
                        (
                                 (
                                          (
                                                (
                                                         (
                                                               (
                                                                        (
                                                                                 (((var53 & '\uf000') >> 12 | var53 << 4) & 65504) >> 5
                                                                                    | ((var53 & '\uf000') >> 12 | var53 << 4) << 11
                                                                              )
                                                                              + 187
                                                                           & 32768
                                                                     )
                                                                     >> 15
                                                                  | (
                                                                           (((var53 & '\uf000') >> 12 | var53 << 4) & 65504) >> 5
                                                                              | ((var53 & '\uf000') >> 12 | var53 << 4) << 11
                                                                        )
                                                                        + 187
                                                                     << 1
                                                            )
                                                            & 32768
                                                      )
                                                      >> 15
                                                   | (
                                                         (
                                                                  (
                                                                           (((var53 & '\uf000') >> 12 | var53 << 4) & 65504) >> 5
                                                                              | ((var53 & '\uf000') >> 12 | var53 << 4) << 11
                                                                        )
                                                                        + 187
                                                                     & 32768
                                                               )
                                                               >> 15
                                                            | (
                                                                     (((var53 & '\uf000') >> 12 | var53 << 4) & 65504) >> 5
                                                                        | ((var53 & '\uf000') >> 12 | var53 << 4) << 11
                                                                  )
                                                                  + 187
                                                               << 1
                                                      )
                                                      << 1
                                             )
                                             & 0
                                       )
                                       >> 16
                                    | (
                                          (
                                                   (
                                                         (
                                                                  (
                                                                           (((var53 & '\uf000') >> 12 | var53 << 4) & 65504) >> 5
                                                                              | ((var53 & '\uf000') >> 12 | var53 << 4) << 11
                                                                        )
                                                                        + 187
                                                                     & 32768
                                                               )
                                                               >> 15
                                                            | (
                                                                     (((var53 & '\uf000') >> 12 | var53 << 4) & 65504) >> 5
                                                                        | ((var53 & '\uf000') >> 12 | var53 << 4) << 11
                                                                  )
                                                                  + 187
                                                               << 1
                                                      )
                                                      & 32768
                                                )
                                                >> 15
                                             | (
                                                   (
                                                            (
                                                                     (((var53 & '\uf000') >> 12 | var53 << 4) & 65504) >> 5
                                                                        | ((var53 & '\uf000') >> 12 | var53 << 4) << 11
                                                                  )
                                                                  + 187
                                                               & 32768
                                                         )
                                                         >> 15
                                                      | ((((var53 & '\uf000') >> 12 | var53 << 4) & 65504) >> 5 | ((var53 & '\uf000') >> 12 | var53 << 4) << 11)
                                                            + 187
                                                         << 1
                                                )
                                                << 1
                                       )
                                       << 0
                              )
                              + 46
                              - 239
                           ^ 71
                     )
                     - 228
               )
            );
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_403.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = 212557059 << -212806910 * -212806910 ^ -894054352; var35 < var19.length(); var35 += 745378978 - 1748104921 ^ -1002725944) {
            char var63 = var19.charAt(var35);
            int var97 = (var63 & '︀') >> 9;
            int var64 = ((((var63 & '︀') >> 9 | var63 << 7) ^ 165) - 139 + 28 ^ 0) - 66 - 99 + 28;
            int var98 = (((((var63 & '︀') >> 9 | var63 << 7) ^ 165) - 139 + 28 ^ 0) - 66 - 99 + 28 & 49152) >> 14;
            var63 = (char)(
               (
                     ((((var97 | var63 << 7) ^ 165) - 139 + 28 ^ 0) - 66 - 99 + 28 & 49152) >> 14
                        | ((((var63 & '︀') >> 9 | var63 << 7) ^ 165) - 139 + 28 ^ 0) - 66 - 99 + 28 << 2
                  )
                  ^ 180
            );
            var19.setCharAt(var35, (char)((var98 | var64 << 2) ^ 180));
         }

         Class var7 = Class.forName(var19.toString(), false, Class_403.class.getClassLoader());
         switch (var4 + 1699381401 + 1926377775 - 634405312 - 1656304774 + 2035119190 - 175179898 - 794022196 + 788781416 - 18008554 ^ 680383485) {
            case 118529359:
               var10000 = var0.findConstructor(var7, var6);
               break;
            case 973608849:
               var10000 = var0.findSpecial(var7, var5, var6, Class_403.class);
               break;
            case 1275042211:
            case 1368219039:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 1384355525:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_1563[(var10 ^ 1750147267 ^ 1701300827 ^ 634456604 ^ 1240949451 ^ 669429506) + 1124596356 - 962542981 - 824435918 - 1339218624 ^ 1365562250] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1414(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = (((var10 ^ 1575127226) + 934822071 ^ 1842996256) + 628742318 ^ 1636578661) - 940701481 - 474920932 - 763250935 - 622248054;
      MethodHandle var10000 = field_1563[(((var10 ^ 1575127226) + 934822071 ^ 1842996256) + 628742318 ^ 1636578661)
         - 940701481
         - 474920932
         - 763250935
         - 622248054
         + 1506973431];
      if (field_1563[var10001 + 1506973431] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = (2041528417 - 1505494436 | 0) & 1611400450; var24 < var14.length(); var24 += -1423349231 * (688809406 ^ 688809406) ^ 1) {
            int var43 = (var14.charAt(var24) ^ 3 ^ 107) - 25;
            int var10004 = (var43 & 65472) >> 6;
            int var44 = (((var43 & 65472) >> 6 | var43 << 10) ^ 214) - 204 ^ 40;
            int var80 = (((((var43 & 65472) >> 6 | var43 << 10) ^ 214) - 204 ^ 40) & 65472) >> 6;
            char var45 = (char)(
               ((((((var10004 | var43 << 10) ^ 214) - 204 ^ 40) & 65472) >> 6 | ((((var43 & 65472) >> 6 | var43 << 10) ^ 214) - 204 ^ 40) << 10) ^ 155) - 237
            );
            var14.setCharAt(var24, (char)(((var80 | var44 << 10) ^ 155) - 237));
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = 612026030 << 1128017558 ^ -1417674752; var30 < var17.length(); var30 += (-884382526 | -884382526 | 1) & 280003357) {
            int var50 = (var17.charAt(var30) + 246 ^ 125) - 216 - 23;
            int var81 = (var50 & 65528) >> 3;
            int var51 = ((var50 & 65528) >> 3 | var50 << 13) - 208;
            int var82 = (((var50 & 65528) >> 3 | var50 << 13) - 208 & 65520) >> 4;
            var50 = (((var81 | var50 << 13) - 208 & 65520) >> 4 | ((var50 & 65528) >> 3 | var50 << 13) - 208 << 12) ^ 158;
            var81 = (((var82 | var51 << 12) ^ 158) & 65534) >> 1;
            int var53 = (((var82 | var51 << 12) ^ 158) & 65534) >> 1 | var50 << 15;
            int var84 = (((((var82 | var51 << 12) ^ 158) & 65534) >> 1 | var50 << 15) & 63488) >> 11;
            char var54 = (char)(((var81 | var50 << 15) & 63488) >> 11 | ((((var82 | var51 << 12) ^ 158) & 65534) >> 1 | var50 << 15) << 5);
            var17.setCharAt(var30, (char)(var84 | var53 << 5));
         }

         Class var6 = Class.forName(var17.toString(), false, Class_403.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = (-1205097362 >> 104105884 | 0) & 0; var36 < var20.length(); var36 += (1151638717 >>> 65824739 | 0) & -1039520727) {
            int var59 = var20.charAt(var36) - 4 - 9 + 133 + 146 - 22;
            char var62 = (char)(
               (
                     ((((((var59 & 65504) >> 5 | var59 << 11) & 63488) >> 11 | ((var59 & 65504) >> 5 | var59 << 11) << 5) ^ 109) & 65532) >> 2
                        | (((((var59 & 65504) >> 5 | var59 << 11) & 63488) >> 11 | ((var59 & 65504) >> 5 | var59 << 11) << 5) ^ 109) << 14
                  )
                  ^ 140
            );
            var20.setCharAt(
               var36,
               (char)(
                  (
                        ((((((var59 & 65504) >> 5 | var59 << 11) & 63488) >> 11 | ((var59 & 65504) >> 5 | var59 << 11) << 5) ^ 109) & 65532) >> 2
                           | (((((var59 & 65504) >> 5 | var59 << 11) & 63488) >> 11 | ((var59 & 65504) >> 5 | var59 << 11) << 5) ^ 109) << 14
                     )
                     ^ 140
               )
            );
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_403.class.getClassLoader()).returnType();
         switch (((var4 - 1602519367 + 1131565260 - 1397707057 ^ 1038747481) - 1211879745 + 692862134 ^ 365423992) - 1446900929 - 1232575537 + 1682342891) {
            case 482119845:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            case 891867343:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            case 1255162305:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            case 2003277614:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_1563[(((var10 ^ 1575127226) + 934822071 ^ 1842996256) + 628742318 ^ 1636578661) - 940701481 - 474920932 - 763250935 - 622248054 + 1506973431] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
