import java.io.BufferedReader;
import java.io.InputStream;
import java.io.InputStreamReader;
import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;
import java.util.ArrayList;
import java.util.Iterator;
import java.util.List;
import net.minecraft.class_11905;
import net.minecraft.class_11908;
import net.minecraft.class_11909;
import net.minecraft.class_310;
import net.minecraft.class_332;
import net.minecraft.class_437;

public class Class_359 extends class_437 implements Class_181 {
   // $VF: renamed from: cvs java.util.List
   public List field_2626;
   // $VF: renamed from: qjq Class_127
   public Class_127 field_2627;
   // $VF: renamed from: og Class_262
   public Class_262 field_2628;
   // $VF: renamed from: ie java.lang.String
   public String field_2629;
   // $VF: renamed from: wno int
   public int field_2630;
   // $VF: renamed from: ci int
   public int field_2631;
   // $VF: renamed from: ru double
   public double field_2632;
   // $VF: renamed from: bh java.lang.String
   public String field_2633;
   // $VF: renamed from: dge java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_2634 = new MethodHandle[(711013692 >> 711013692 | 240) & -514738448];

   public Class_359() {
      int var8 = 423317383;
      super(0<"JNT",-1748601245,"՜᭜ẜ֜Ӝ\u1a9cÜຜߜຜໜߜ","ųճ煲辰ᕲ兲ﵲ\uf571ղ辰ᕲ\u2d72楲╲ᥲ兲ﵲ\u2d72\uf171╲浲浲뵲啳楳啳慳䵳","轻콈ཹ轋콆콻轻콈但轺콅轅ཹ轋但ཻ콅佺佺佷轊콌轉콉",-1168900916>());
      this.field_2626 = (ArrayList)0<"JNT",-535254835,"ٜ࢜\u061cٜẜਜ","ųճ\ud972","轼콅轹콅轋콼ཹ콻ཻ轋콽轺轺콅콿ཱི콻佺ཹ",-1168900909>();
      this.field_2629 = null;
      this.field_2632 = -1.0;
      this.field_2633 = null;

      try {
         String var1 = 0<"JNT",-1748601245,"ẜӜග᭜ᦜￜẜᤜٜ\u061c\u1adc","ų襲ճ煲ॲ╲奲╲ﵲ\uf171╲辰ᵲﵲ\ued72兲楲ղ辰ᵲ䵳","轼콅轹콅轋ཻ콅轻佅轋ཱི佻轻佅",-1168901304>(
            0<"JNT",-1748601245,"\u061cᱜ\u061cӜڜٜ՜᭜","ųճ襲","轼콅轹콅轋ཻ콅轻佅轋佲콿佺ཹ콈콆",-1168901303>()
         );
         ClassLoader var10000 = 0<"JNT",-353151799,"\u1adc᭜ẜ\u0bdcҜᱜៜៜಜӜᱜ\u1a9c᭜ᤜ","ųճ煲ॲ╲奲╲ﵲ\uf171╲辰ᵲﵲ굲\uf171╲浲浲煲ﵱ╲ᅲᕲ楲䵳","轼콅轹콅轋ཻ콅轻佅轋佾ཻ콅佺佺",-1168901322>(
            0<"JNT",-353151799,"\u1adc᭜ẜ\u0bdcҜᱜៜៜ","ųճ煲ॲ╲奲╲ﵲ\uf171╲辰ᵲﵲ굲\uf171╲浲浲䵳","轼콅轹콅轋ཻ콅轻佅轋佳轆轼콈但ཹ",-1168901329>(this)
         );
         int var10001 = -746922880 >> -746922880 ^ -746922880;

         StringBuilder var10002;
         for (var10002 = (StringBuilder)0<"JNT",-535254835,"ٜ࢜\u061cٜẜਜ","ų煲ॲ╲奲╲ﵲ\uf171╲辰ᵲﵲ\ued72兲楲ղ辰ᵲ䵳ճ\ud972","轼콅轹콅轋ཻ콅轻佅轋佲ཹ轺콻轻佅轾콼콻ཻཅ콈轺",-1168901323>(
               "˖ˌˠˤ˚ˀˤʐˤʬ"
            );
            var10001 < ((-845395113 - -845395113 | 10) & -1718160438);
            var10001 += 1
         ) {
            int var18 = 0<"JNT",-353151799,"Ϝ֜ᱜᤜќẜ","ų蕲ճ굲","轼콅轹콅轋ཻ콅轻佅轋佲ཹ轺콻轻佅轾콼콻ཻཅ콈轺",-1168901308>(var10002, var10001) + 'F';
            int var10005 = (var18 & 63488) >> 11;
            int var19 = (var18 & 63488) >> 11 | var18 << 5;
            int var23 = (((var18 & 63488) >> 11 | var18 << 5) & 65472) >> 6;
            char var20 = (char)((((var10005 | var18 << 5) & 65472) >> 6 | ((var18 & 63488) >> 11 | var18 << 5) << 10) - 217 ^ 217);
            0<"JNT",-353151799,"ៜ᭜ẜ\u0bdc֜ᱜᤜќẜ","ų蕲굲ճ\ud972","轼콅轹콅轋ཻ콅轻佅轋佲ཹ轺콻轻佅轾콼콻ཻཅ콈轺",-1168901301>(
               var10002, var10001, (char)((var23 | var19 << 10) - 217 ^ 217)
            );
         }

         InputStream var2 = 0<"JNT",-353151799,"\u1adc᭜ẜĜ᭜ៜӜ\u1f5cᤜϜ᭜ќៜￜẜᤜ᭜ᱜ՜","ų煲ॲ╲奲╲ﵲ\uf171╲辰ᵲﵲ\ued72兲楲ղ辰ᵲ䵳ճ煲ॲ╲奲╲ﵲղﵱﵲ蕲辰慲啲兲\ued72兲楲ᕲ╲\uf571䵳","轼콅轹콅轋ཻ콅轻佅轋佾ཻ콅佺佺ཱི佻콅ཅ콈轺",-1168901317>(
            var10000, 0<"JNT",-353151799,"ẜӜￜẜᤜٜ\u061c\u1adc","ųճ煲ॲ╲奲╲ﵲ\uf171╲辰ᵲﵲ\ued72兲楲ղ辰ᵲ䵳","轼콅轹콅轋ཻ콅轻佅轋佲ཹ轺콻轻佅轾콼콻ཻཅ콈轺",-1168901324>(var10002)
         );
         BufferedReader var3 = (BufferedReader)0<"JNT",-535254835,"ٜ࢜\u061cٜẜਜ","ų煲ॲ╲奲╲ﵲղﵱﵲ\ue972ᕲ╲ᅲᕲ楲䵳ճ\ud972","轼콅轹콅轋콻佻轋轾콼轅轅콈轺콈ཅ轲콈콅ཅ콈轺",-1168901328>(
            (InputStreamReader)0<"JNT",-535254835,"ٜ࢜\u061cٜẜਜ","ų煲ॲ╲奲╲ﵲղﵱﵲ蕲辰慲啲兲\ued72兲楲ᕲ╲\uf571䵳煲ॲ╲奲╲ﵲ辰ղﵱﵲ\u2d72Ų╲楲浲ᕲ兲ﵲ굲Ų╲楲浲ᕲ兲䵳ճ\ud972","轼콅轹콅轋콻佻轋콳轻ེ콼ཹ佲ཹ轺콈콅콆轲콈콅ཅ콈轺",-1168901327>(
               var2, 1<"JNT",1507978744,"⣻⤻ⲻ⩻㈻","ꙉ齉뉉齉橉ꩉꝉ굉橉ꅉꑉ齉깉녉ꍉ끉橉酉끉齉ꩉꁉ齉깉ꁉ腉ꑉ齉깉녉ꍉ끉녉","ᏞᏖႾᇮᆖᄎᆖᏆᇎᇖᇆᏆᆦᇞᆖᄮᄦᅶჾᏆႦᇞᆖᄮᄦᅶჾ፦",516436709>()
            )
         );
         String var4 = 0<"JNT",-353151799,"ẜᤜٜ՜","ųճ煲ॲ╲奲╲ﵲ\uf171╲辰ᵲﵲ\ued72兲楲ղ辰ᵲ䵳","轼콅轹콅轋ཻ콅轻佅轋佲ཹ轺콻轻佅",-1168901314>(
            0<"JNT",-353151799,"ᤜ᭜ᱜ\u1a9cಜٜ\u061c᭜","ųճ煲ॲ╲奲╲ﵲ\uf171╲辰ᵲﵲ\ued72兲楲ղ辰ᵲ䵳","轼콅轹콅轋콻佻轋轾콼轅轅콈轺콈ཅ轲콈콅ཅ콈轺",-1168901321>(var3)
         );
         String var5 = 0<"JNT",-1748601245,"ᬜ᭜","ų煲ॲ╲奲╲ﵲ\uf171╲辰ᵲﵲ\ued72兲楲ղ辰ᵲ䵳ճ煲ॲ╲奲╲ﵲ\uf171╲辰ᵲﵲ\ued72兲楲ղ辰ᵲ䵳","ྀ콆",-1168901315>(var4);
         String var6 = 0<"JNT",-1748601245,"⁜ᰜܜ","ųճ煲ॲ╲奲╲ﵲ\uf171╲辰ᵲﵲ\ued72兲楲ղ辰ᵲ䵳","콈ཹ",-1168901316>();
         byte[] var7 = 0<"JNT",-1748601245,"Ờ“\u1a9c","ų煲⥲\uf571\u2d72䵳쵲쵲ꥲճ쵲ꥲ","콈轅",-1168901313>(
            (Class_27)1<"JNT",1507978744,"☻⍻⇻","鹉ꭉꅉ","ᏞᏖႾᇮᆖᄎᆖᏆᆾᆖᇎᆆᏆ\u10c6ᆮᇮᅶᆦჾ፦",516437100>(),
            new byte[][]{
               0<"JNT",-1748601245,"ᰜܜវ","ų煲ॲ╲奲╲ﵲ\uf171╲辰ᵲﵲ\ued72兲楲ղ辰ᵲ䵳ճ쵲ꥲ","콈轅",-1168900902>(var5),
               0<"JNT",-1748601245,"ᰜܜវ","ų煲ॲ╲奲╲ﵲ\uf171╲辰ᵲﵲ\ued72兲楲ղ辰ᵲ䵳ճ쵲ꥲ","콈轅",-1168900903>(var6),
               0<"JNT",-1748601245,"ᰜܜវ","ų煲ॲ╲奲╲ﵲ\uf171╲辰ᵲﵲ\ued72兲楲ղ辰ᵲ䵳ճ쵲ꥲ","콈轅",-1168900904>(var1)
            }
         );
         0<"JNT",-353151799,"Ϝלᩜ","ų쵲ꥲճ\ud972","轼ཹ轅",-1168901307>((Class_150)1<"JNT",1507978744,"⁻⓻⑻","ꉉ齉","ᏞᏖႾᇮᆖᄎᆖᏆᆾᆖᇎᆆᏆ\u10c6ᆮᇮᅶᆦჾ፦",516437081>(), var7);
      } catch (Exception var9) {
         0<"JNT",-1748601245,"᭜ᦜٜẜ","ų蕲ճ\ud972","轼콅轹콅轋ཻ콅轻佅轋佲콿佺ཹ콈콆",-1168900915>(0);
      }

      short var10 = 50;
      Class_400[] var11 = 0<"JNT",-1748601245,"“ᱜҜ\u1f5c᭜ៜ","ųճ쵲煲䕲⥲䵳","콿轆",-1168901310>();
      int var12 = var11.length;
      int var13 = 0;

      while (true) {
         var8 = (-266243 | -1809776320) & -568204984;

         while (true) {
            switch ((var8 + 208735726 ^ 942734924 ^ 338174378) + 1496550578 + 1103833712 - 1704891641) {
               case -1100354238:
                  this.field_2627 = (Class_127)0<"JNT",-535254835,"ٜ࢜\u061cٜẜਜ","ų蕲蕲蕲煲奲慲䵳ճ\ud972","콻佻",-1168901311>(var10, 50, 230, this);
                  return;
               case -68529415:
            }

            if (var13 < var12) {
               Class_400 var14 = var11[var13];
               0<"JNT",-480069133,"ᱜ\u1a9c\u1a9c","ų煲ॲ╲奲╲ﵲ\uf171╲辰ᵲﵲ絲⥲ॲᕲ\u2d72兲䵳ճ쥲","轼콅轹콅轋콼ཹ콻ཻ轋ཱི콻佺ཹ",-1168900914>(
                  1<"JNT",368751000,"⍻₻ύ","뉉걉","ᏞᏖႾᇮᆖᄎᆖᏆჶჾᇖᆾᏆႾᇖᄦჾ፦",516437103>(this),
                  (Class_397)0<"JNT",-535254835,"ٜ࢜\u061cٜẜਜ","ų蕲蕲蕲蕲煲䕲⥲䵳煲奲慲䵳ճ\ud972","ྀྀ",-1168901305>(var10, 50, 230, 30, var14, this)
               );
               var10 += 250;
               var13++;
               break;
            }

            var8 = -1734342895;
         }
      }
   }

   // $VF: renamed from: jzm () boolean
   public boolean method_2108() {
      int var3 = -1013815148;
      Iterator var1 = 0<"JNT",-480069133,"ٜẜ᭜ᤜᱜẜӜᤜ","ųճ煲ॲ╲奲╲ﵲ啲兲ղ\uf171ﵲ蕲兲ᕲ楲╲兲ﵱ楲䵳","轼콅轹콅轋콼ཹ콻ཻ轋ཱི콻佺ཹ",-1168900906>(
         1<"JNT",368751000,"⍻₻ύ","뉉걉","ᏞᏖႾᇮᆖᄎᆖᏆჶჾᇖᆾᏆႾᇖᄦჾ፦",516436840>(this)
      );

      label25:
      while (true) {
         var3 = -1329827511;

         while (true) {
            switch ((var3 + 1305115006 + 1860442242 - 673837215 ^ 183487768) + 1752885564 - 1070833485) {
               case -1924502548:
                  return 1<"JNT",368751000,"☻⁻","ꝉ굉","ᏞᏖၮ",516436851>(1<"JNT",368751000,"Ώ▻Ώ","뉉걉","ᏞᏖႾᇖᇆ፦",516436850>(this));
               case 2018912673:
            }

            if (0<"JNT",-480069133,"֜ᱜៜผ᭜ᦜẜ","ųճ쥲","轼콅轹콅轋콼ཹ콻ཻ轋콳ཹ콈轺콅ཹ佻轺",-1168900886>(var1)) {
               Class_397 var2 = (Class_397)0<"JNT",-480069133,"\u061c᭜ᦜẜ","ųճ煲ॲ╲奲╲ﵲ\uf171╲辰ᵲﵲ絲⥲ॲᕲ\u2d72兲䵳","轼콅轹콅轋콼ཹ콻ཻ轋콳ཹ콈轺콅ཹ佻轺",-1168900887>(var1);
               if (1<"JNT",368751000,"☻⁻","둉둉","ᏞᏖၮ",516436855>(var2)) {
                  break label25;
               }
               break;
            }

            var3 = -641184892;
         }
      }

      return true;
   }

   // $VF: renamed from: chx (java.lang.String, int, int) void
   public void method_2109(String var1, int var2, int var3) {
      1<"JNT",818529947,"◻⓻","뉉걉","ᏞᏖႾᇮᆖᄎᆖᏆᆾᆖᇎᆆᏆဦჾᄮᇖᇎᆆ፦",516436868>(this, var1);
      1<"JNT",818529947,"⁻⚻♻","뉉걉","ᏞᏖზ",516436869>(this, var2);
      1<"JNT",818529947,"⍻◻","뉉걉","ᏞᏖზ",516436862>(this, var3);
   }

   public void method_56131() {
      if (1<"JNT",368751000,"Ⓕ◻⓻✻┻⩻⾻⾻ほ㈻ほ","뉉걉","ᏞᏖႾᇎᅶჾᏆᆶᇖᇎᅶᆦᄮᆖᆎჾᏆᆦᆾᆖᄦᄦ၆ጦ\u1316ጞ፦",516436848>(this) != null) {
         0<"JNT",-239608842,"՜᭜ẜ֜Ӝ\u1a9cÜཛྷလၜߜၜ","ųճ\ud972","轻콈ཹ轋콆콻轻콈但轺콅轅ཹ轋但ཻ콅佺佺佷ཉ佊佉",-1168900912>(this);
      }
   }

   public void method_25420(class_332 var1, int var2, int var3, float var4) {
      if (1<"JNT",368751000,"Ⓕ◻⓻✻┻⩻⿻セ㈻ほ","ꩉꍉ끉橉ꭉꝉꩉꍉꅉ깉齉ꉉ끉橉ꅉꡉ齉녉녉鵉煉潉汉","ᏞᏖႾᇎᅶჾᏆᆶᇖᇎᅶᆦᄮᆖᆎჾᏆᆦᆾᆖᄦᄦ၆ጎጦ፞፦",516436858>(
            (class_310)1<"JNT",1507978744,"✻Ά","ꉉ齉","ᏞᏖႾᇮᆖᄎᆖᏆᆾᆖᇎᆆᏆ\u10c6ᆮᇮᅶᆦჾ፦",516436849>()
         )
         == null) {
         0<"JNT",-239608842,"՜᭜ẜ֜Ӝ\u1a9cÜजཛྷຜजޜ","ų煲辰ᕲ兲ﵲ\uf571ղ辰ᕲ\u2d72楲╲ᥲ兲ﵲ\u2d72\uf171╲浲浲뵲浳浳楳䵳蕲蕲饲ճ\ud972","轻콈ཹ轋콆콻轻콈但轺콅轅ཹ轋但ཻ콅佺佺佷ཉ佊佉",-1168900900>(
            this, var1, var2, var3, var4
         );
      }
   }

   // $VF: Irreducible bytecode was duplicated to produce valid code
   public void method_25394(class_332 var1, int var2, int var3, float var4) {
      int var5 = 1953147723;
      if (1<"JNT",368751000,"Ⓕ◻⓻✻┻⩻⿻ほ・・","ꩉꍉ끉橉ꭉꝉꩉꍉꅉ깉齉ꉉ끉橉ꅉꡉ齉녉녉鵉煉潉汉","ᏞᏖႾᇎᅶჾᏆᆶᇖᇎᅶᆦᄮᆖᆎჾᏆᆦᆾᆖᄦᄦ၆ዾጦጆ፦",516436871>(
            (class_310)1<"JNT",1507978744,"✻Ά","ꉉ齉","ᏞᏖႾᇮᆖᄎᆖᏆᆾᆖᇎᆆᏆ\u10c6ᆮᇮᅶᆦჾ፦",516436870>()
         )
         == this) {
         if ((class_437)1<"JNT",368751000,"♻ύ","ꉉ齉","ᏞᏖႾᇮᆖᄎᆖᏆᆾᆖᇎᆆᏆ\u10c6ᆮᇮᅶᆦჾ፦",516436857>(
               (ScreenUI_78)1<"JNT",1507978744,"⓻\u20fbΏ","ꉉ齉","ᏞᏖႾᇮᆖᄎᆖᏆᆾᆖᇎᆆᏆ\u10c6ᆮᇮᅶᆦჾ፦",516436856>()
            )
            != null) {
            0<"JNT",-353151799,"՜᭜ẜ֜Ӝ\u1a9cÜजཛྷߜੜຜ","ų煲辰ᕲ兲ﵲ\uf571ղ辰ᕲ\u2d72楲╲ᥲ兲ﵲ\u2d72\uf171╲浲浲뵲浳浳楳䵳蕲蕲饲ճ\ud972","轻콈ཹ轋콆콻轻콈但轺콅轅ཹ轋但ཻ콅佺佺佷ཉ佊佉",-1168900885>(
               (class_437)1<"JNT",368751000,"♻ύ","ꉉ齉","ᏞᏖႾᇮᆖᄎᆖᏆᆾᆖᇎᆆᏆ\u10c6ᆮᇮᅶᆦჾ፦",516436867>(
                  (ScreenUI_78)1<"JNT",1507978744,"⓻\u20fbΏ","ꉉ齉","ᏞᏖႾᇮᆖᄎᆖᏆᆾᆖᇎᆆᏆ\u10c6ᆮᇮᅶᆦჾ፦",516436866>()
               ),
               var1,
               0,
               0,
               var4
            );
         }

         var5 = (-1049972337 & -1049972337 >> -1049972337 | 880848520) & -1081802770;
      } else {
         var5 = -400518888 << -2097338389 ^ -290677097;
      }

      while (true) {
         switch (((var5 ^ 1169583354) + 1828998535 ^ 1321017247) + 1661149043 - 1856021469 - 1880615308) {
            case -1747934612:
            default:
               if (1<"JNT",368751000,"♻⑻","뉉걉","ᏞᏖႾᄞᄆ፦",516436821>(this) == null) {
                  1<"JNT",818529947,"♻⑻","뉉걉","ᏞᏖႾᄞᄆ፦",516436879>(
                     this, (Class_262)0<"JNT",-535254835,"ٜ࢜\u061cٜẜਜ","ų蕲蕲蕲蕲ճ\ud972","ེ佹",-1168900895>(0, 0, 0, 0)
                  );
                  var5 = -1992564841;
               } else {
                  var5 = 846639390;
               }
               continue;
            case -696913291:
               return;
            case -75910795:
               if (0<"JNT",-353151799,"Ҝᩜ","ųճ蕲","ེ佹",-1168900881>(1<"JNT",368751000,"♻⑻","뉉걉","ᏞᏖႾᄞᄆ፦",516436759>(this))
                  != (0<"JNT",-353151799,"ᱜᦜ","ųճ쥲","佅轺",-1168900875>(1<"JNT",1507978744,"Ώ⁻","ꝉ뙉녉","ᏞᏖႾᆆᄮ፦",516436745>()) ? 200 : 0)) {
                  1<"JNT",818529947,"♻⑻","뉉걉","ᏞᏖႾᄞᄆ፦",516436758>(
                     this,
                     0<"JNT",-1748601245,"Ờᬜ“","ų饲蕲煲慲嵲䵳ճ煲慲嵲䵳","轆但",-1168900854>(
                        0.05F,
                        0<"JNT",-353151799,"ᱜᦜ","ųճ쥲","佅轺",-1168900870>(1<"JNT",1507978744,"Ώ⁻","ꝉ뙉녉","ᏞᏖႾᆆᄮ፦",516436876>()) ? 200 : 0,
                        1<"JNT",368751000,"♻⑻","뉉걉","ᏞᏖႾᄞᄆ፦",516436764>(this)
                     )
                  );
               }

               var5 = (-2009199491 | -2009199491 | 1486186498) & 1492642142;
               continue;
            case 784516862:
               1<"JNT",818529947,"♻⑻","뉉걉","ᏞᏖႾᄞᄆ፦",516436875>(
                  this,
                  (Class_262)0<"JNT",-535254835,"ٜ࢜\u061cٜẜਜ","ų蕲蕲蕲蕲ճ\ud972","ེ佹",-1168900883>(
                     0, 0, 0, 0<"JNT",-353151799,"Ҝᩜ","ųճ蕲","ེ佹",-1168900882>(1<"JNT",368751000,"♻⑻","뉉걉","ᏞᏖႾᄞᄆ፦",516436864>(this))
                  )
               );
               var5 = -1992564841;
               continue;
            case 1224925118:
         }

         0<"JNT",-239608842,"՜᭜ẜ֜Ӝ\u1a9cÜजཛྷߜੜຜ","ų煲辰ᕲ兲ﵲ\uf571ղ辰ᕲ\u2d72楲╲ᥲ兲ﵲ\u2d72\uf171╲浲浲뵲浳浳楳䵳蕲蕲饲ճ\ud972","轻콈ཹ轋콆콻轻콈但轺콅轅ཹ轋但ཻ콅佺佺佷ཉ佊佉",-1168900876>(
            this, var1, var2, var3, var4
         );
         var5 = -400518888 << -2097338389 ^ -290677097;
      }
   }

   // $VF: renamed from: qpp (net.minecraft.class_332, int, int, float) void
   @Override
   public void method_28(class_332 var1, int var2, int var3, float var4) {
      int var19 = 50863555;
      RenderEngine_216 var5 = 1<"JNT",1507978744,"⁻⍻⏻","ꭉ뉉","ᏞᏖႾᆶᄎ፦",516907686>();
      0<"JNT",-353151799,"ẜ\u061c᭜","ų煲辰ᕲ兲ﵲ\uf571ղ辰ᕲ\u2d72楲╲ᥲ兲ﵲ\u2d72\uf171╲浲浲뵲浳浳楳䵳ճ\ud972","콆轹",-1168900968>(var5, var1);
      int var6 = 0<"JNT",-353151799,"՜᭜ẜ֜Ӝ\u1a9cÜຜຜੜཛྷ","ųճ蕲","轻콈ཹ轋콆콻轻콈但轺콅轅ཹ轋但ཻ콅佺佺佷콉ཊཉ콉",-1168900859>(
         0<"JNT",-353151799,"՜᭜ẜ֜Ӝ\u1a9cÜजजလজߜ","ųճ煲辰ᕲ兲ﵲ\uf571ղ辰ᕲ\u2d72楲╲ᥲ兲ﵲ\u2d72\uf171╲浲浲뵲敳慳关敳䵳","轻콈ཹ轋콆콻轻콈但轺콅轅ཹ轋但ཻ콅佺佺佷佊콉ཊ",-1168900858>(
            (class_310)1<"JNT",1507978744,"✻Ά","ꉉ齉","ᏞᏖႾᇮᆖᄎᆖᏆᆾᆖᇎᆆᏆ\u10c6ᆮᇮᅶᆦჾ፦",516907672>()
         )
      );
      var2 *= var6;
      var3 *= var6;
      if (1<"JNT",368751000,"♻⑻","뉉걉","ᏞᏖႾᄞᄆ፦",516907683>(this) != null
         && 0<"JNT",-353151799,"Ҝᩜ","ųճ蕲","ེ佹",-1168900862>(1<"JNT",368751000,"♻⑻","뉉걉","ᏞᏖႾᄞᄆ፦",516907764>(this)) > 0) {
         0<"JNT",-353151799,"\u061cᱜẜ","ų酲酲酲酲煲慲嵲䵳ճ\ud972","콆轹",-1168900952>(
            var5,
            0.0,
            0.0,
            (double)0<"JNT",-353151799,"՜᭜ẜ֜Ӝ\u1a9cÜຜຜজੜ","ųճ蕲","轻콈ཹ轋콆콻轻콈但轺콅轅ཹ轋但ཻ콅佺佺佷콉ཊཉ콉",-1168900857>(
               0<"JNT",-353151799,"՜᭜ẜ֜Ӝ\u1a9cÜजजလজߜ","ųճ煲辰ᕲ兲ﵲ\uf571ղ辰ᕲ\u2d72楲╲ᥲ兲ﵲ\u2d72\uf171╲浲浲뵲敳慳关敳䵳","轻콈ཹ轋콆콻轻콈但轺콅轅ཹ轋但ཻ콅佺佺佷佊콉ཊ",-1168900864>(
                  (class_310)1<"JNT",1507978744,"✻Ά","ꉉ齉","ᏞᏖႾᇮᆖᄎᆖᏆᆾᆖᇎᆆᏆ\u10c6ᆮᇮᅶᆦჾ፦",516907694>()
               )
            ),
            (double)0<"JNT",-353151799,"՜᭜ẜ֜Ӝ\u1a9cÜຜཛྷޜလ","ųճ蕲","轻콈ཹ轋콆콻轻콈但轺콅轅ཹ轋但ཻ콅佺佺佷콉ཊཉ콉",-1168900980>(
               0<"JNT",-353151799,"՜᭜ẜ֜Ӝ\u1a9cÜजजလজߜ","ųճ煲辰ᕲ兲ﵲ\uf571ղ辰ᕲ\u2d72楲╲ᥲ兲ﵲ\u2d72\uf171╲浲浲뵲敳慳关敳䵳","轻콈ཹ轋콆콻轻콈但轺콅轅ཹ轋但ཻ콅佺佺佷佊콉ཊ",-1168900979>(
                  (class_310)1<"JNT",1507978744,"✻Ά","ꉉ齉","ᏞᏖႾᇮᆖᄎᆖᏆᆾᆖᇎᆆᏆ\u10c6ᆮᇮᅶᆦჾ፦",516907681>()
               )
            ),
            (Class_262)0<"JNT",-535254835,"ٜ࢜\u061cٜẜਜ","ų蕲蕲蕲蕲ճ\ud972","ེ佹",-1168900951>(
               0, 0, 0, 0<"JNT",-353151799,"Ҝᩜ","ųճ蕲","ེ佹",-1168900950>(1<"JNT",368751000,"♻⑻","뉉걉","ᏞᏖႾᄞᄆ፦",516907708>(this))
            )
         );
      }

      Iterator var7 = 0<"JNT",-480069133,"ٜẜ᭜ᤜᱜẜӜᤜ","ųճ煲ॲ╲奲╲ﵲ啲兲ղ\uf171ﵲ蕲兲ᕲ楲╲兲ﵱ楲䵳","轼콅轹콅轋콼ཹ콻ཻ轋ཱི콻佺ཹ",-1168900960>(
         1<"JNT",368751000,"⍻₻ύ","뉉걉","ᏞᏖႾᇮᆖᄎᆖᏆჶჾᇖᆾᏆႾᇖᄦჾ፦",516907726>(this)
      );

      label71:
      while (true) {
         var19 = (801061775 + (-64499022 << (801061775 >>> -64499022)) | 1189924947) & -286404353;

         while (true) {
            switch ((var19 ^ 1648969267) + 936540130 + 2126380141 + 407239480 - 1752624058 - 1384357726) {
               case -2094319691:
               default:
                  int var22 = 0<"JNT",-353151799,"՜᭜ẜ֜Ӝ\u1a9cÜຜຜজੜ","ųճ蕲","轻콈ཹ轋콆콻轻콈但轺콅轅ཹ轋但ཻ콅佺佺佷콉ཊཉ콉",-1168900965>(
                     0<"JNT",-353151799,"՜᭜ẜ֜Ӝ\u1a9cÜजजလজߜ","ųճ煲辰ᕲ兲ﵲ\uf571ղ辰ᕲ\u2d72楲╲ᥲ兲ﵲ\u2d72\uf171╲浲浲뵲敳慳关敳䵳","轻콈ཹ轋콆콻轻콈但轺콅轅ཹ轋但ཻ콅佺佺佷佊콉ཊ",-1168900972>(
                        (class_310)1<"JNT",1507978744,"✻Ά","ꉉ齉","ᏞᏖႾᇮᆖᄎᆖᏆᆾᆖᇎᆆᏆ\u10c6ᆮᇮᅶᆦჾ፦",516907698>()
                     )
                  );
                  int var23 = 0<"JNT",-353151799,"՜᭜ẜ֜Ӝ\u1a9cÜຜཛྷޜလ","ųճ蕲","轻콈ཹ轋콆콻轻콈但轺콅轅ཹ轋但ཻ콅佺佺佷콉ཊཉ콉",-1168900976>(
                     0<"JNT",-353151799,"՜᭜ẜ֜Ӝ\u1a9cÜजजလজߜ","ųճ煲辰ᕲ兲ﵲ\uf571ղ辰ᕲ\u2d72楲╲ᥲ兲ﵲ\u2d72\uf171╲浲浲뵲敳慳关敳䵳","轻콈ཹ轋콆콻轻콈但轺콅轅ཹ轋但ཻ콅佺佺佷佊콉ཊ",-1168900975>(
                        (class_310)1<"JNT",1507978744,"✻Ά","ꉉ齉","ᏞᏖႾᇮᆖᄎᆖᏆᆾᆖᇎᆆᏆ\u10c6ᆮᇮᅶᆦჾ፦",516907717>()
                     )
                  );
                  short var9 = 160;
                  byte var10 = 36;
                  int var11 = (var22 - var9) / 2;
                  int var12 = var23 - 52;
                  boolean var13 = var2 >= var11 && var2 < var11 + var9 && var3 >= var12 && var3 < var12 + var10;
                  Class_262 var14 = var13
                     ? (Class_262)0<"JNT",-535254835,"ٜ࢜\u061cٜẜਜ","ų蕲蕲蕲蕲ճ\ud972","ེ佹",-1168900948>(60, 60, 80, 240)
                     : (Class_262)0<"JNT",-535254835,"ٜ࢜\u061cٜẜਜ","ų蕲蕲蕲蕲ճ\ud972","ེ佹",-1168900964>(28, 28, 38, 215);
                  0<"JNT",-353151799,"ᰜ֜វ","ų煲慲嵲䵳酲酲酲酲酲ճ\ud972","콆轹",-1168900969>(
                     var5, var14, (double)var11, (double)var12, (double)(var11 + var9), (double)(var12 + var10), 7.0
                  );
                  double var15 = 0<"JNT",-353151799,"ៜ⁜ᬜ","ųճ酲","콆轹",-1168900962>(var5);
                  int var10001 = -1736119410 ^ 1123149568 ^ -629863282;

                  StringBuilder var10002;
                  for (var10002 = (StringBuilder)0<"JNT",-535254835,"ٜ࢜\u061cٜẜਜ","ų煲ॲ╲奲╲ﵲ\uf171╲辰ᵲﵲ\ued72兲楲ղ辰ᵲ䵳ճ\ud972","轼콅轹콅轋ཻ콅轻佅轋佲ཹ轺콻轻佅轾콼콻ཻཅ콈轺",-1168900963>(
                        "(\u0094\u0097\u009f\u0082\u009c\u0098"
                     );
                     var10001 < (-374934636 << -374934636 ^ 960495623);
                     var10001 += 1
                  ) {
                     0<"JNT",-353151799,"ៜ᭜ẜ\u0bdc֜ᱜᤜќẜ","ų蕲굲ճ\ud972","轼콅轹콅轋ཻ콅轻佅轋佲ཹ轺콻轻佅轾콼콻ཻཅ콈轺",-1168900970>(
                        var10002,
                        var10001,
                        (char)(((0<"JNT",-353151799,"Ϝ֜ᱜᤜќẜ","ų蕲ճ굲","轼콅轹콅轋ཻ콅轻佅轋佲ཹ轺콻轻佅轾콼콻ཻཅ콈轺",-1168900977>(var10002, var10001) ^ ',') + 61 + 119 ^ 102) - 155)
                     );
                  }

                  double var17 = 0<"JNT",-353151799,"ᩜ\u1f5cܜ","ų煲ॲ╲奲╲ﵲ\uf171╲辰ᵲﵲ\ued72兲楲ղ辰ᵲ䵳ճ酲","콆轹",-1168900946>(
                     var5, 0<"JNT",-353151799,"ẜӜￜẜᤜٜ\u061c\u1adc","ųճ煲ॲ╲奲╲ﵲ\uf171╲辰ᵲﵲ\ued72兲楲ղ辰ᵲ䵳","轼콅轹콅轋ཻ콅轻佅轋佲ཹ轺콻轻佅轾콼콻ཻཅ콈轺",-1168900953>(var10002)
                  );
                  var10001 = (781516621 >>> 1903314503 | 0) & 1503675904;

                  for (var10002 = (StringBuilder)0<"JNT",-535254835,"ٜ࢜\u061cٜẜਜ","ų煲ॲ╲奲╲ﵲ\uf171╲辰ᵲﵲ\ued72兲楲ղ辰ᵲ䵳ճ\ud972","轼콅轹콅轋ཻ콅轻佅轋佲ཹ轺콻轻佅轾콼콻ཻཅ콈轺",-1168900947>(
                        ";o\u0010\u0018\u0015\u0017k"
                     );
                     var10001 < 7;
                     var10001 += (647064719 | 1522673175 | 647064719) ^ 2127785630
                  ) {
                     char var33 = 0<"JNT",-353151799,"Ϝ֜ᱜᤜќẜ","ų蕲ճ굲","轼콅轹콅轋ཻ콅轻佅轋佲ཹ轺콻轻佅轾콼콻ཻཅ콈轺",-1168900957>(var10002, var10001);
                     char var34 = (char)((((var33 & '\uffff') >> 0 | var33 << 16) ^ 175) - 6 - 237 + 162);
                     0<"JNT",-353151799,"ៜ᭜ẜ\u0bdc֜ᱜᤜќẜ","ų蕲굲ճ\ud972","轼콅轹콅轋ཻ콅轻佅轋佲ཹ轺콻轻佅轾콼콻ཻཅ콈轺",-1168900934>(
                        var10002, var10001, (char)((((var33 & '\uffff') >> 0 | var33 << 16) ^ 175) - 6 - 237 + 162)
                     );
                  }

                  0<"JNT",-353151799,"\u1adc֜","ų煲ॲ╲奲╲ﵲ\uf171╲辰ᵲﵲ\ued72兲楲ղ辰ᵲ䵳酲酲煲慲嵲䵳ճ酲","콆轹",-1168900949>(
                     var5,
                     0<"JNT",-353151799,"ẜӜￜẜᤜٜ\u061c\u1adc","ųճ煲ॲ╲奲╲ﵲ\uf171╲辰ᵲﵲ\ued72兲楲ղ辰ᵲ䵳","轼콅轹콅轋ཻ콅轻佅轋佲ཹ轺콻轻佅轾콼콻ཻཅ콈轺",-1168900955>(var10002),
                     (double)(var11 + var9 / 2 - 3) - var17 / 2.0,
                     (double)var12 + ((double)var10 - var15) / 2.0,
                     1<"JNT",1507978744,"♻✻↻","걉땉","ᏞᏖႾᄞᄆ፦",516907715>()
                  );
                  0<"JNT",-353151799,"᭜\u1a9cٜ","ųճ\ud972","콆轹",-1168900958>(var5);
                  return;
               case 1082227547:
                  if (0<"JNT",-480069133,"֜ᱜៜผ᭜ᦜẜ","ųճ쥲","轼콅轹콅轋콼ཹ콻ཻ轋콳ཹ콈轺콅ཹ佻轺",-1168900935>(var7)) {
                     Class_397 var8 = (Class_397)0<"JNT",-480069133,"\u061c᭜ᦜẜ","ųճ煲ॲ╲奲╲ﵲ\uf171╲辰ᵲﵲ絲⥲ॲᕲ\u2d72兲䵳","轼콅轹콅轋콼ཹ콻ཻ轋콳ཹ콈轺콅ཹ佻轺",-1168900936>(var7);
                     0<"JNT",-353151799,"֜ᩜ","ų煲\uf571奲䵳蕲蕲饲ճ\ud972","ྀྀ",-1168900961>(var8, var5, var2, var3, var4);
                     0<"JNT",-353151799,"Ӝ⁜᭜","ų酲酲饲ճ\ud972","ྀྀ",-1168900954>(var8, (double)var2, (double)var3, var4);
                     continue label71;
                  }

                  var19 = -193487453 >> 532898021 ^ -632562331;
                  continue;
               case 1534921770:
            }

            0<"JNT",-353151799,"֜ᩜ","ų煲\uf571奲䵳蕲蕲饲ճ\ud972","콻佻",-1168900878>(1<"JNT",368751000,"Ώ▻Ώ","뉉걉","ᏞᏖႾᇖᇆ፦",516436772>(this), var5, var2, var3, var4);
            0<"JNT",-353151799,"Ӝ⁜᭜","ų酲酲饲ճ\ud972","콻佻",-1168900880>(1<"JNT",368751000,"Ώ▻Ώ","뉉걉","ᏞᏖႾᇖᇆ፦",516907678>(this), (double)var2, (double)var3, var4);
            if (1<"JNT",368751000,"◻⓻","뉉걉","ᏞᏖႾᇮᆖᄎᆖᏆᆾᆖᇎᆆᏆဦჾᄮᇖᇎᆆ፦",516907664>(this) != null) {
               0<"JNT",-353151799,"\u1f5cϜ\u1f5c","ų煲\uf571奲䵳煲ॲ╲奲╲ﵲ\uf171╲辰ᵲﵲ\ued72兲楲ղ辰ᵲ䵳酲酲ճ\ud972","轹ེ",-1168900861>(
                  this,
                  var5,
                  1<"JNT",368751000,"◻⓻","뉉걉","ᏞᏖႾᇮᆖᄎᆖᏆᆾᆖᇎᆆᏆဦჾᄮᇖᇎᆆ፦",516907665>(this),
                  (double)1<"JNT",368751000,"⁻⚻♻","뉉걉","ᏞᏖზ",516907674>(this),
                  (double)1<"JNT",368751000,"⍻◻","뉉걉","ᏞᏖზ",516907675>(this)
               );
               1<"JNT",818529947,"◻⓻","뉉걉","ᏞᏖႾᇮᆖᄎᆖᏆᆾᆖᇎᆆᏆဦჾᄮᇖᇎᆆ፦",516907693>(this, null);
            }

            var19 = (1762751567 * (-959057835 - 1762751567) | 218371381) & 1560679797;
         }
      }
   }

   public boolean method_25404(class_11908 var1) {
      int var4 = -786438777;
      0<"JNT",-353151799,"ᰜỜ","ų煲辰ᕲ兲ﵲ\uf571ղ辰ᕲ\u2d72楲╲ᥲ兲ﵲ\u2d72\uf171╲浲浲뵲敳敳䕳慳䅳䵳ճ\ud972","콻佻",-1168900945>(
         1<"JNT",368751000,"Ώ▻Ώ","뉉걉","ᏞᏖႾᇖᇆ፦",516908119>(this), var1
      );
      Iterator var2 = 0<"JNT",-480069133,"ٜẜ᭜ᤜᱜẜӜᤜ","ųճ煲ॲ╲奲╲ﵲ啲兲ղ\uf171ﵲ蕲兲ᕲ楲╲兲ﵱ楲䵳","轼콅轹콅轋콼ཹ콻ཻ轋ཱི콻佺ཹ",-1168900939>(
         1<"JNT",368751000,"⍻₻ύ","뉉걉","ᏞᏖႾᇮᆖᄎᆖᏆჶჾᇖᆾᏆႾᇖᄦჾ፦",516908105>(this)
      );

      while (true) {
         var4 = 1623959561;

         while (true) {
            switch ((var4 + 1398763141 + 1157789384 ^ 1045796505 ^ 211361357) + 1018697888 + 1420598193) {
               case -1937187170:
                  return 0<"JNT",-239608842,"՜᭜ẜ֜Ӝ\u1a9cÜजཛྷຜޜຜ","ų煲辰ᕲ兲ﵲ\uf571ղ辰ᕲ\u2d72楲╲ᥲ兲ﵲ\u2d72\uf171╲浲浲뵲敳敳䕳慳䅳䵳ճ쥲","轻콈ཹ轋콆콻轻콈但轺콅轅ཹ轋但ཻ콅佺佺佷ཉ佊佉",-1168900940>(
                     this, var1
                  );
               case 1564850643:
            }

            if (0<"JNT",-480069133,"֜ᱜៜผ᭜ᦜẜ","ųճ쥲","轼콅轹콅轋콼ཹ콻ཻ轋콳ཹ콈轺콅ཹ佻轺",-1168900941>(var2)) {
               Class_397 var3 = (Class_397)0<"JNT",-480069133,"\u061c᭜ᦜẜ","ųճ煲ॲ╲奲╲ﵲ\uf171╲辰ᵲﵲ絲⥲ॲᕲ\u2d72兲䵳","轼콅轹콅轋콼ཹ콻ཻ轋콳ཹ콈轺콅ཹ佻轺",-1168900918>(var2);
               0<"JNT",-353151799,"ᰜỜ","ų煲辰ᕲ兲ﵲ\uf571ղ辰ᕲ\u2d72楲╲ᥲ兲ﵲ\u2d72\uf171╲浲浲뵲敳敳䕳慳䅳䵳ճ\ud972","ྀྀ",-1168900919>(var3, var1);
               break;
            }

            var4 = (-1217227124 >> -1217227124 | 805743948) & 830913996;
         }
      }
   }

   public boolean method_25400(class_11905 var1) {
      0<"JNT",-353151799,"ᬜᱜٜ","ų煲辰ᕲ兲ﵲ\uf571ղ辰ᕲ\u2d72楲╲ᥲ兲ﵲ\u2d72\uf171╲浲浲뵲敳敳䕳慳啳䵳ճ\ud972","콻佻",-1168900942>(
         1<"JNT",368751000,"Ώ▻Ώ","뉉걉","ᏞᏖႾᇖᇆ፦",516908132>(this), var1
      );
      return 0<"JNT",-239608842,"՜᭜ẜ֜Ӝ\u1a9cÜजཛྷຜޜޜ","ų煲辰ᕲ兲ﵲ\uf571ղ辰ᕲ\u2d72楲╲ᥲ兲ﵲ\u2d72\uf171╲浲浲뵲敳敳䕳慳啳䵳ճ쥲","轻콈ཹ轋콆콻轻콈但轺콅轅ཹ轋但ཻ콅佺佺佷ཉ佊佉",-1168900943>(this, var1);
   }

   public boolean method_25402(class_11909 var1, boolean var2) {
      int var11 = -2089175638;
      int var3 = 0<"JNT",-353151799,"՜᭜ẜ֜Ӝ\u1a9cÜຜຜੜཛྷ","ųճ蕲","轻콈ཹ轋콆콻轻콈但轺콅轅ཹ轋但ཻ콅佺佺佷콉ཊཉ콉",-1168900922>(
         0<"JNT",-353151799,"՜᭜ẜ֜Ӝ\u1a9cÜजजလজߜ","ųճ煲辰ᕲ兲ﵲ\uf571ղ辰ᕲ\u2d72楲╲ᥲ兲ﵲ\u2d72\uf171╲浲浲뵲敳慳关敳䵳","轻콈ཹ轋콆콻轻콈但轺콅轅ཹ轋但ཻ콅佺佺佷佊콉ཊ",-1168900929>(
            (class_310)1<"JNT",1507978744,"✻Ά","ꉉ齉","ᏞᏖႾᇮᆖᄎᆖᏆᆾᆖᇎᆆᏆ\u10c6ᆮᇮᅶᆦჾ፦",516908007>()
         )
      );
      class_11909 var4 = (class_11909)0<"JNT",-535254835,"ٜ࢜\u061cٜẜਜ","ų酲酲煲辰ᕲ兲ﵲ\uf571ղ辰ᕲ\u2d72楲╲ᥲ兲ﵲ\u2d72\uf171╲浲浲뵲敳敳䕳敳慳䵳ճ\ud972","轻콈ཹ轋콆콻轻콈但轺콅轅ཹ轋但ཻ콅佺佺佷콉콉콏ཊ콏",-1168900926>(
         0<"JNT",-353151799,"ϜӜ՜វÜຜໜੜজ","ųճ酲","轻콈ཹ轋콆콻轻콈但轺콅轅ཹ轋但ཻ콅佺佺佷콉콉콏ཊ콏",-1168900923>(var1) * (double)var3,
         0<"JNT",-353151799,"ϜӜ՜វÜຜໜੜੜ","ųճ酲","轻콈ཹ轋콆콻轻콈但轺콅轅ཹ轋但ཻ콅佺佺佷콉콉콏ཊ콏",-1168900924>(var1) * (double)var3,
         0<"JNT",-353151799,"ϜӜ՜វÜຜজޜޜ","ųճ煲辰ᕲ兲ﵲ\uf571ղ辰ᕲ\u2d72楲╲ᥲ兲ﵲ\u2d72\uf171╲浲浲뵲敳敳䕳敳慳䵳","轻콈ཹ轋콆콻轻콈但轺콅轅ཹ轋但ཻ콅佺佺佷콉콉콏ཊ콏",-1168900917>(var1)
      );
      if (0<"JNT",-353151799,"՜᭜ẜ֜Ӝ\u1a9cÜໜຜजຜཛྷ","ųճ蕲","轻콈ཹ轋콆콻轻콈但轺콅轅ཹ轋但ཻ콅佺佺佷콉콉콏ཊ콏",-1168900927>(var1) == 0) {
         int var5 = 0<"JNT",-353151799,"՜᭜ẜ֜Ӝ\u1a9cÜຜຜজੜ","ųճ蕲","轻콈ཹ轋콆콻轻콈但轺콅轅ཹ轋但ཻ콅佺佺佷콉ཊཉ콉",-1168901042>(
            0<"JNT",-353151799,"՜᭜ẜ֜Ӝ\u1a9cÜजजလজߜ","ųճ煲辰ᕲ兲ﵲ\uf571ղ辰ᕲ\u2d72楲╲ᥲ兲ﵲ\u2d72\uf171╲浲浲뵲敳慳关敳䵳","轻콈ཹ轋콆콻轻콈但轺콅轅ཹ轋但ཻ콅佺佺佷佊콉ཊ",-1168900921>(
               (class_310)1<"JNT",1507978744,"✻Ά","ꉉ齉","ᏞᏖႾᇮᆖᄎᆖᏆᆾᆖᇎᆆᏆ\u10c6ᆮᇮᅶᆦჾ፦",516908015>()
            )
         );
         int var6 = 0<"JNT",-353151799,"՜᭜ẜ֜Ӝ\u1a9cÜຜཛྷޜလ","ųճ蕲","轻콈ཹ轋콆콻轻콈但轺콅轅ཹ轋但ཻ콅佺佺佷콉ཊཉ콉",-1168901037>(
            0<"JNT",-353151799,"՜᭜ẜ֜Ӝ\u1a9cÜजजလজߜ","ųճ煲辰ᕲ兲ﵲ\uf571ղ辰ᕲ\u2d72楲╲ᥲ兲ﵲ\u2d72\uf171╲浲浲뵲敳慳关敳䵳","轻콈ཹ轋콆콻轻콈但轺콅轅ཹ轋但ཻ콅佺佺佷佊콉ཊ",-1168901044>(
               (class_310)1<"JNT",1507978744,"✻Ά","ꉉ齉","ᏞᏖႾᇮᆖᄎᆖᏆᆾᆖᇎᆆᏆ\u10c6ᆮᇮᅶᆦჾ፦",516908010>()
            )
         );
         short var7 = 160;
         byte var8 = 36;
         int var9 = (var5 - var7) / 2;
         int var10 = var6 - 52;
         if (0<"JNT",-353151799,"ϜӜ՜វÜຜໜੜজ","ųճ酲","轻콈ཹ轋콆콻轻콈但轺콅轅ཹ轋但ཻ콅佺佺佷콉콉콏ཊ콏",-1168901014>(var4) >= (double)var9
            && 0<"JNT",-353151799,"ϜӜ՜វÜຜໜੜজ","ųճ酲","轻콈ཹ轋콆콻轻콈但轺콅轅ཹ轋但ཻ콅佺佺佷콉콉콏ཊ콏",-1168901015>(var4) < (double)(var9 + var7)
            && 0<"JNT",-353151799,"ϜӜ՜វÜຜໜੜੜ","ųճ酲","轻콈ཹ轋콆콻轻콈但轺콅轅ཹ轋但ཻ콅佺佺佷콉콉콏ཊ콏",-1168901016>(var4) >= (double)var10
            && 0<"JNT",-353151799,"ϜӜ՜វÜຜໜੜੜ","ųճ酲","轻콈ཹ轋콆콻轻콈但轺콅轅ཹ轋但ཻ콅佺佺佷콉콉콏ཊ콏",-1168901041>(var4) < (double)(var10 + var8)) {
            0<"JNT",-353151799,"՜᭜ẜ֜Ӝ\u1a9cÜၜཛྷޜໜ","ų煲辰ᕲ兲ﵲ\uf571ղ辰ᕲ\u2d72楲╲ᥲ兲ﵲ\u2d72\uf171╲浲浲뵲关浳嵳䵳ճ\ud972","轻콈ཹ轋콆콻轻콈但轺콅轅ཹ轋但ཻ콅佺佺佷佊콉ཊ",-1168901036>(
               (class_310)1<"JNT",1507978744,"✻Ά","ꉉ齉","ᏞᏖႾᇮᆖᄎᆖᏆᆾᆖᇎᆆᏆ\u10c6ᆮᇮᅶᆦჾ፦",516907753>(),
               (Class_225)0<"JNT",-535254835,"ٜ࢜\u061cٜẜਜ","ųճ\ud972","轻佼콻",-1168901035>()
            );
            return 0<"JNT",-239608842,"՜᭜ẜ֜Ӝ\u1a9cÜजཛྷຜޜज","ų煲辰ᕲ兲ﵲ\uf571ղ辰ᕲ\u2d72楲╲ᥲ兲ﵲ\u2d72\uf171╲浲浲뵲敳敳䕳慳䕳䵳쥲ճ쥲","轻콈ཹ轋콆콻轻콈但轺콅轅ཹ轋但ཻ콅佺佺佷ཉ佊佉",-1168901029>(
               this, var1, var2
            );
         }
      }

      0<"JNT",-353151799,"՜Ờᰜ","ų煲辰ᕲ兲ﵲ\uf571ղ辰ᕲ\u2d72楲╲ᥲ兲ﵲ\u2d72\uf171╲浲浲뵲敳敳䕳慳䕳䵳쥲ճ\ud972","콻佻",-1168900925>(
         1<"JNT",368751000,"Ώ▻Ώ","뉉걉","ᏞᏖႾᇖᇆ፦",516907995>(this), var4, var2
      );
      Iterator var12 = 0<"JNT",-480069133,"ٜẜ᭜ᤜᱜẜӜᤜ","ųճ煲ॲ╲奲╲ﵲ啲兲ղ\uf171ﵲ蕲兲ᕲ楲╲兲ﵱ楲䵳","轼콅轹콅轋콼ཹ콻ཻ轋ཱི콻佺ཹ",-1168901031>(
         1<"JNT",368751000,"⍻₻ύ","뉉걉","ᏞᏖႾᇮᆖᄎᆖᏆჶჾᇖᆾᏆႾᇖᄦჾ፦",516908013>(this)
      );

      while (true) {
         var11 = 995846844;

         while (true) {
            switch ((var11 ^ 133774985) - 763816085 - 238498667 ^ 2031777247 ^ 132038505 ^ 1880668737) {
               case -1158664353:
                  return 0<"JNT",-239608842,"՜᭜ẜ֜Ӝ\u1a9cÜजཛྷຜޜज","ų煲辰ᕲ兲ﵲ\uf571ղ辰ᕲ\u2d72楲╲ᥲ兲ﵲ\u2d72\uf171╲浲浲뵲敳敳䕳慳䕳䵳쥲ճ쥲","轻콈ཹ轋콆콻轻콈但轺콅轅ཹ轋但ཻ콅佺佺佷ཉ佊佉",-1168900944>(
                     this, var1, var2
                  );
               case 238569666:
            }

            if (0<"JNT",-480069133,"֜ᱜៜผ᭜ᦜẜ","ųճ쥲","轼콅轹콅轋콼ཹ콻ཻ轋콳ཹ콈轺콅ཹ佻轺",-1168900937>(var12)) {
               Class_397 var13 = (Class_397)0<"JNT",-480069133,"\u061c᭜ᦜẜ","ųճ煲ॲ╲奲╲ﵲ\uf171╲辰ᵲﵲ絲⥲ॲᕲ\u2d72兲䵳","轼콅轹콅轋콼ཹ콻ཻ轋콳ཹ콈轺콅ཹ佻轺",-1168900930>(var12);
               0<"JNT",-353151799,"՜Ờᰜ","ų煲辰ᕲ兲ﵲ\uf571ղ辰ᕲ\u2d72楲╲ᥲ兲ﵲ\u2d72\uf171╲浲浲뵲敳敳䕳慳䕳䵳쥲ճ\ud972","ྀྀ",-1168900931>(var13, var4, var2);
               break;
            }

            var11 = -401390303;
         }
      }
   }

   public boolean method_25403(class_11909 var1, double var2, double var4) {
      int var10 = -1236735096;
      int var6 = 0<"JNT",-353151799,"՜᭜ẜ֜Ӝ\u1a9cÜຜຜੜཛྷ","ųճ蕲","轻콈ཹ轋콆콻轻콈但轺콅轅ཹ轋但ཻ콅佺佺佷콉ཊཉ콉",-1168901040>(
         0<"JNT",-353151799,"՜᭜ẜ֜Ӝ\u1a9cÜजजလজߜ","ųճ煲辰ᕲ兲ﵲ\uf571ղ辰ᕲ\u2d72楲╲ᥲ兲ﵲ\u2d72\uf171╲浲浲뵲敳慳关敳䵳","轻콈ཹ轋콆콻轻콈但轺콅轅ཹ轋但ཻ콅佺佺佷佊콉ཊ",-1168901039>(
            (class_310)1<"JNT",1507978744,"✻Ά","ꉉ齉","ᏞᏖႾᇮᆖᄎᆖᏆᆾᆖᇎᆆᏆ\u10c6ᆮᇮᅶᆦჾ፦",516907781>()
         )
      );
      class_11909 var7 = (class_11909)0<"JNT",-535254835,"ٜ࢜\u061cٜẜਜ","ų酲酲煲辰ᕲ兲ﵲ\uf571ղ辰ᕲ\u2d72楲╲ᥲ兲ﵲ\u2d72\uf171╲浲浲뵲敳敳䕳敳慳䵳ճ\ud972","轻콈ཹ轋콆콻轻콈但轺콅轅ཹ轋但ཻ콅佺佺佷콉콉콏ཊ콏",-1168901028>(
         0<"JNT",-353151799,"ϜӜ՜វÜຜໜੜজ","ųճ酲","轻콈ཹ轋콆콻轻콈但轺콅轅ཹ轋但ཻ콅佺佺佷콉콉콏ཊ콏",-1168901033>(var1) * (double)var6,
         0<"JNT",-353151799,"ϜӜ՜វÜຜໜੜੜ","ųճ酲","轻콈ཹ轋콆콻轻콈但轺콅轅ཹ轋但ཻ콅佺佺佷콉콉콏ཊ콏",-1168901026>(var1) * (double)var6,
         0<"JNT",-353151799,"ϜӜ՜វÜຜজޜޜ","ųճ煲辰ᕲ兲ﵲ\uf571ղ辰ᕲ\u2d72楲╲ᥲ兲ﵲ\u2d72\uf171╲浲浲뵲敳敳䕳敳慳䵳","轻콈ཹ轋콆콻轻콈但轺콅轅ཹ轋但ཻ콅佺佺佷콉콉콏ཊ콏",-1168901027>(var1)
      );
      0<"JNT",-353151799,"Ӝ᭜","ų煲辰ᕲ兲ﵲ\uf571ղ辰ᕲ\u2d72楲╲ᥲ兲ﵲ\u2d72\uf171╲浲浲뵲敳敳䕳慳䕳䵳酲酲ճ\ud972","콻佻",-1168900998>(
         1<"JNT",368751000,"Ώ▻Ώ","뉉걉","ᏞᏖႾᇖᇆ፦",516907788>(this), var7, var2, var4
      );
      Iterator var8 = 0<"JNT",-480069133,"ٜẜ᭜ᤜᱜẜӜᤜ","ųճ煲ॲ╲奲╲ﵲ啲兲ղ\uf171ﵲ蕲兲ᕲ楲╲兲ﵱ楲䵳","轼콅轹콅轋콼ཹ콻ཻ轋ཱི콻佺ཹ",-1168901000>(
         1<"JNT",368751000,"⍻₻ύ","뉉걉","ᏞᏖႾᇮᆖᄎᆖᏆჶჾᇖᆾᏆႾᇖᄦჾ፦",516907782>(this)
      );

      label22:
      while (true) {
         var10 = 945593285 + 945593285 ^ -8710381;

         while (true) {
            switch (((var10 ^ 1484820306) + 595933232 + 1086932875 ^ 1874945159) + 1216748513 + 80095892) {
               case -1583574666:
                  if (0<"JNT",-480069133,"֜ᱜៜผ᭜ᦜẜ","ųճ쥲","轼콅轹콅轋콼ཹ콻ཻ轋콳ཹ콈轺콅ཹ佻轺",-1168901025>(var8)) {
                     Class_397 var9 = (Class_397)0<"JNT",-480069133,"\u061c᭜ᦜẜ","ųճ煲ॲ╲奲╲ﵲ\uf171╲辰ᵲﵲ絲⥲ॲᕲ\u2d72兲䵳","轼콅轹콅轋콼ཹ콻ཻ轋콳ཹ콈轺콅ཹ佻轺",-1168901018>(var8);
                     0<"JNT",-353151799,"Ӝ᭜","ų煲辰ᕲ兲ﵲ\uf571ղ辰ᕲ\u2d72楲╲ᥲ兲ﵲ\u2d72\uf171╲浲浲뵲敳敳䕳慳䕳䵳酲酲ճ\ud972","ྀྀ",-1168901019>(var9, var7, var2, var4);
                     continue label22;
                  }

                  var10 = -2070571903;
                  break;
               case 2096055678:
               default:
                  return 0<"JNT",-239608842,"՜᭜ẜ֜Ӝ\u1a9cÜजཛྷຜޜߜ","ų煲辰ᕲ兲ﵲ\uf571ղ辰ᕲ\u2d72楲╲ᥲ兲ﵲ\u2d72\uf171╲浲浲뵲敳敳䕳慳䕳䵳酲酲ճ쥲","轻콈ཹ轋콆콻轻콈但轺콅轅ཹ轋但ཻ콅佺佺佷ཉ佊佉",-1168901020>(
                     this, var1, var2, var4
                  );
            }
         }
      }
   }

   public boolean method_25401(double var1, double var3, double var5, double var7) {
      int var12 = -742717410;
      int var9 = 0<"JNT",-353151799,"՜᭜ẜ֜Ӝ\u1a9cÜຜຜੜཛྷ","ųճ蕲","轻콈ཹ轋콆콻轻콈但轺콅轅ཹ轋但ཻ콅佺佺佷콉ཊཉ콉",-1168901010>(
         0<"JNT",-353151799,"՜᭜ẜ֜Ӝ\u1a9cÜजजလজߜ","ųճ煲辰ᕲ兲ﵲ\uf571ղ辰ᕲ\u2d72楲╲ᥲ兲ﵲ\u2d72\uf171╲浲浲뵲敳慳关敳䵳","轻콈ཹ轋콆콻轻콈但轺콅轅ཹ轋但ཻ콅佺佺佷佊콉ཊ",-1168901017>(
            (class_310)1<"JNT",1507978744,"✻Ά","ꉉ齉","ᏞᏖႾᇮᆖᄎᆖᏆᆾᆖᇎᆆᏆ\u10c6ᆮᇮᅶᆦჾ፦",516907791>()
         )
      );
      var1 *= (double)var9;
      var3 *= (double)var9;
      0<"JNT",-353151799,"វ\u1adc","ų酲酲酲酲ճ\ud972","콻佻",-1168901012>(1<"JNT",368751000,"Ώ▻Ώ","뉉걉","ᏞᏖႾᇖᇆ፦",516907786>(this), var1, var3, var5, var7);
      Iterator var10 = 0<"JNT",-480069133,"ٜẜ᭜ᤜᱜẜӜᤜ","ųճ煲ॲ╲奲╲ﵲ啲兲ղ\uf171ﵲ蕲兲ᕲ楲╲兲ﵱ楲䵳","轼콅轹콅轋콼ཹ콻ཻ轋ཱི콻佺ཹ",-1168900982>(
         1<"JNT",368751000,"⍻₻ύ","뉉걉","ᏞᏖႾᇮᆖᄎᆖᏆჶჾᇖᆾᏆႾᇖᄦჾ፦",516907676>(this)
      );

      label22:
      while (true) {
         var12 = -1133548014 >>> (509860974 | -1133548014) ^ 1348403703;

         while (true) {
            switch ((var12 + 146750810 ^ 1714121786 ^ 745796404 ^ 8615927) + 1838781731 + 1051443262) {
               case -1073009385:
                  if (0<"JNT",-480069133,"֜ᱜៜผ᭜ᦜẜ","ųճ쥲","轼콅轹콅轋콼ཹ콻ཻ轋콳ཹ콈轺콅ཹ佻轺",-1168901013>(var10)) {
                     Class_397 var11 = (Class_397)0<"JNT",-480069133,"\u061c᭜ᦜẜ","ųճ煲ॲ╲奲╲ﵲ\uf171╲辰ᵲﵲ絲⥲ॲᕲ\u2d72兲䵳","轼콅轹콅轋콼ཹ콻ཻ轋콳ཹ콈轺콅ཹ佻轺",-1168901022>(var10);
                     0<"JNT",-353151799,"វ\u1adc","ų酲酲酲酲ճ\ud972","ྀྀ",-1168901023>(var11, var1, var3, var5, var7);
                     continue label22;
                  }

                  var12 = 496257774;
                  break;
               case 416134674:
               default:
                  return 0<"JNT",-239608842,"՜᭜ẜ֜Ӝ\u1a9cÜजཛྷຜޜၜ","ų酲酲酲酲ճ쥲","轻콈ཹ轋콆콻轻콈但轺콅轅ཹ轋但ཻ콅佺佺佷ཉ佊佉",-1168900983>(
                     this, var1 / (double)var9, var3 / (double)var9, var5, var7
                  );
            }
         }
      }
   }

   public boolean method_25421() {
      return false;
   }

   public void method_25419() {
      0<"JNT",-353151799,"Ԝᦜᩜ","ų쥲ճ\ud972","콻辀佺",-1168901003>(
         (Class_139)0<"JNT",-353151799,"ٜៜ","ų煲ॲ╲奲╲ﵲ\uf171╲辰ᵲﵲ굲\uf171╲浲浲䵳ճ煲啲浲ᥲ䵳","轻但",-1168901002>(
            0<"JNT",-353151799,"ᦜវ","ųճ煲辰\u2d72䵳","轅콅",-1168901009>((ScreenUI_78)1<"JNT",1507978744,"⓻\u20fbΏ","ꉉ齉","ᏞᏖႾᇮᆖᄎᆖᏆᆾᆖᇎᆆᏆ\u10c6ᆮᇮᅶᆦჾ፦",516907671>()),
            Class_139.class
         ),
         false
      );
      0<"JNT",-353151799,"֜\u1adcӜ","ųճ\ud972","轹ེ",-1168901004>(this);
   }

   // $VF: renamed from: hgo () void
   public void method_2110() {
      int var3 = 878133248;
      0<"JNT",-353151799,"՜᭜ẜ֜Ӝ\u1a9cÜजੜੜໜޜ","ų煲辰ᕲ兲ﵲ\uf571ղ辰ᕲ\u2d72楲╲ᥲ兲ﵲ\u2d72\uf171╲浲浲뵲关浳嵳䵳ճ\ud972","轻콈ཹ轋콆콻轻콈但轺콅轅ཹ轋但ཻ콅佺佺佷佊콉ཊ",-1168901008>(
         (class_310)1<"JNT",1507978744,"✻Ά","ꉉ齉","ᏞᏖႾᇮᆖᄎᆖᏆᆾᆖᇎᆆᏆ\u10c6ᆮᇮᅶᆦჾ፦",516907684>(),
         (class_437)1<"JNT",368751000,"♻ύ","ꉉ齉","ᏞᏖႾᇮᆖᄎᆖᏆᆾᆖᇎᆆᏆ\u10c6ᆮᇮᅶᆦჾ፦",516908062>(
            (ScreenUI_78)1<"JNT",1507978744,"⓻\u20fbΏ","ꉉ齉","ᏞᏖႾᇮᆖᄎᆖᏆᆾᆖᇎᆆᏆ\u10c6ᆮᇮᅶᆦჾ፦",516907685>()
         )
      );
      1<"JNT",818529947,"♻⑻","뉉걉","ᏞᏖႾᄞᄆ፦",516908048>(this, null);
      0<"JNT",-353151799,"ᤜᤜ","ųճ\ud972","콻佻",-1168900995>(1<"JNT",368751000,"Ώ▻Ώ","뉉걉","ᏞᏖႾᇖᇆ፦",516908049>(this));
      Iterator var1 = 0<"JNT",-480069133,"ٜẜ᭜ᤜᱜẜӜᤜ","ųճ煲ॲ╲奲╲ﵲ啲兲ղ\uf171ﵲ蕲兲ᕲ楲╲兲ﵱ楲䵳","轼콅轹콅轋콼ཹ콻ཻ轋ཱི콻佺ཹ",-1168900989>(
         1<"JNT",368751000,"⍻₻ύ","뉉걉","ᏞᏖႾᇮᆖᄎᆖᏆჶჾᇖᆾᏆႾᇖᄦჾ፦",516908059>(this)
      );

      label22:
      while (true) {
         var3 = 1969499361 << 1969499361 * 1969499361 ^ -1345308037;

         while (true) {
            switch ((var3 + 1595847963 - 733435015 + 523721208 + 860697412 ^ 653249332) - 551953923) {
               case -855280454:
               default:
                  if (0<"JNT",-480069133,"֜ᱜៜผ᭜ᦜẜ","ųճ쥲","轼콅轹콅轋콼ཹ콻ཻ轋콳ཹ콈轺콅ཹ佻轺",-1168901094>(var1)) {
                     Class_397 var2 = (Class_397)0<"JNT",-480069133,"\u061c᭜ᦜẜ","ųճ煲ॲ╲奲╲ﵲ\uf171╲辰ᵲﵲ絲⥲ॲᕲ\u2d72兲䵳","轼콅轹콅轋콼ཹ콻ཻ轋콳ཹ콈轺콅ཹ佻轺",-1168901095>(var1);
                     0<"JNT",-353151799,"ᤜᤜ","ųճ\ud972","ྀྀ",-1168901096>(var2);
                     continue label22;
                  }

                  var3 = -275972684;
                  break;
               case 850459309:
                  return;
            }
         }
      }
   }

   public boolean method_25406(class_11909 var1) {
      int var6 = -1490006995;
      int var2 = 0<"JNT",-353151799,"՜᭜ẜ֜Ӝ\u1a9cÜຜຜੜཛྷ","ųճ蕲","轻콈ཹ轋콆콻轻콈但轺콅轅ཹ轋但ཻ콅佺佺佷콉ཊཉ콉",-1168900990>(
         0<"JNT",-353151799,"՜᭜ẜ֜Ӝ\u1a9cÜजजလজߜ","ųճ煲辰ᕲ兲ﵲ\uf571ղ辰ᕲ\u2d72楲╲ᥲ兲ﵲ\u2d72\uf171╲浲浲뵲敳慳关敳䵳","轻콈ཹ轋콆콻轻콈但轺콅轅ཹ轋但ཻ콅佺佺佷佊콉ཊ",-1168900981>(
            (class_310)1<"JNT",1507978744,"✻Ά","ꉉ齉","ᏞᏖႾᇮᆖᄎᆖᏆᆾᆖᇎᆆᏆ\u10c6ᆮᇮᅶᆦჾ፦",516908067>()
         )
      );
      class_11909 var3 = (class_11909)0<"JNT",-535254835,"ٜ࢜\u061cٜẜਜ","ų酲酲煲辰ᕲ兲ﵲ\uf571ղ辰ᕲ\u2d72楲╲ᥲ兲ﵲ\u2d72\uf171╲浲浲뵲敳敳䕳敳慳䵳ճ\ud972","轻콈ཹ轋콆콻轻콈但轺콅轅ཹ轋但ཻ콅佺佺佷콉콉콏ཊ콏",-1168901106>(
         0<"JNT",-353151799,"ϜӜ՜វÜຜໜੜজ","ųճ酲","轻콈ཹ轋콆콻轻콈但轺콅轅ཹ轋但ཻ콅佺佺佷콉콉콏ཊ콏",-1168900991>(var1) * (double)var2,
         0<"JNT",-353151799,"ϜӜ՜វÜຜໜੜੜ","ųճ酲","轻콈ཹ轋콆콻轻콈但轺콅轅ཹ轋但ཻ콅佺佺佷콉콉콏ཊ콏",-1168900992>(var1) * (double)var2,
         0<"JNT",-353151799,"ϜӜ՜វÜຜজޜޜ","ųճ煲辰ᕲ兲ﵲ\uf571ղ辰ᕲ\u2d72楲╲ᥲ兲ﵲ\u2d72\uf171╲浲浲뵲敳敳䕳敳慳䵳","轻콈ཹ轋콆콻轻콈但轺콅轅ཹ轋但ཻ콅佺佺佷콉콉콏ཊ콏",-1168900985>(var1)
      );
      0<"JNT",-353151799,"Ԝᰜ","ų煲辰ᕲ兲ﵲ\uf571ղ辰ᕲ\u2d72楲╲ᥲ兲ﵲ\u2d72\uf171╲浲浲뵲敳敳䕳慳䕳䵳ճ\ud972","콻佻",-1168901108>(
         1<"JNT",368751000,"Ώ▻Ώ","뉉걉","ᏞᏖႾᇖᇆ፦",516908074>(this), var3
      );
      Iterator var4 = 0<"JNT",-480069133,"ٜẜ᭜ᤜᱜẜӜᤜ","ųճ煲ॲ╲奲╲ﵲ啲兲ղ\uf171ﵲ蕲兲ᕲ楲╲兲ﵱ楲䵳","轼콅轹콅轋콼ཹ콻ཻ轋ཱི콻佺ཹ",-1168901078>(
         1<"JNT",368751000,"⍻₻ύ","뉉걉","ᏞᏖႾᇮᆖᄎᆖᏆჶჾᇖᆾᏆႾᇖᄦჾ፦",516908092>(this)
      );

      label22:
      while (true) {
         var6 = (-40389579 | 1449302315 | -40389579) ^ -673893989;

         while (true) {
            switch ((var6 - 1165925215 + 1440644456 - 1258192758 - 1994821305 ^ 2140192791) - 1143125671) {
               case -991237694:
               default:
                  if (0<"JNT",-480069133,"֜ᱜៜผ᭜ᦜẜ","ųճ쥲","轼콅轹콅轋콼ཹ콻ཻ轋콳ཹ콈轺콅ཹ佻轺",-1168900993>(var4)) {
                     Class_397 var5 = (Class_397)0<"JNT",-480069133,"\u061c᭜ᦜẜ","ųճ煲ॲ╲奲╲ﵲ\uf171╲辰ᵲﵲ絲⥲ॲᕲ\u2d72兲䵳","轼콅轹콅轋콼ཹ콻ཻ轋콳ཹ콈轺콅ཹ佻轺",-1168900986>(var4);
                     0<"JNT",-353151799,"Ԝᰜ","ų煲辰ᕲ兲ﵲ\uf571ղ辰ᕲ\u2d72楲╲ᥲ兲ﵲ\u2d72\uf171╲浲浲뵲敳敳䕳慳䕳䵳ճ\ud972","ྀྀ",-1168900987>(var5, var3);
                     continue label22;
                  }

                  var6 = (-1855393226 + (-1855393226 ^ -850878522) | -1776249847) & -1220807603;
                  break;
               case 907104585:
                  return 0<"JNT",-239608842,"՜᭜ẜ֜Ӝ\u1a9cÜजཛྷຜޜလ","ų煲辰ᕲ兲ﵲ\uf571ղ辰ᕲ\u2d72楲╲ᥲ兲ﵲ\u2d72\uf171╲浲浲뵲敳敳䕳慳䕳䵳ճ쥲","轻콈ཹ轋콆콻轻콈但轺콅轅ཹ轋但ཻ콅佺佺佷ཉ佊佉",-1168901079>(
                     this, var1
                  );
            }
         }
      }
   }

   // $VF: renamed from: ucu (RenderEngine_216, java.lang.String, double, double) void
   public void method_2111(RenderEngine_216 var1, String var2, double var3, double var5) {
      int var10 = 1231956630;
      if (var2 != null && 0<"JNT",-353151799,"Ҝ᭜\u061c\u1adcẜ֜","ųճ蕲","轼콅轹콅轋ཻ콅轻佅轋佲ཹ轺콻轻佅",-1168901574>(var2) != 0) {
         var10 = 119531979;
      } else {
         var10 = 367764172;
      }

      while (true) {
         double var7;
         switch ((var10 + 217487492 - 128474918 - 1929052390 + 554977238 ^ 759893207) + 1391438893) {
            case -901122394:
            default:
               var7 = 0<"JNT",-353151799,"ᩜ\u1f5cܜ","ų煲ॲ╲奲╲ﵲ\uf171╲辰ᵲﵲ\ued72兲楲ղ辰ᵲ䵳ճ酲","콆轹",-1168901603>(var1, var2);
               1<"JNT",818529947,"⎻☻","뉉걉","ᏞᏖႾᇮᆖᄎᆖᏆᆾᆖᇎᆆᏆဦჾᄮᇖᇎᆆ፦",516908091>(this, var2);
               1<"JNT",818529947,"Ά\u20fb","뉉걉","ᏞᏖၾ",516908108>(this, var7);
               break;
            case -356773125:
               if (!0<"JNT",-353151799,"᭜⁜\u1f5cᱜҜៜ","ų煲ॲ╲奲╲ﵲ\uf171╲辰ᵲﵲ絲⥲ॲᕲ\u2d72兲䵳ճ쥲","轼콅轹콅轋ཻ콅轻佅轋佲ཹ轺콻轻佅",-1168901100>(
                     var2, 1<"JNT",368751000,"⎻☻","뉉걉","ᏞᏖႾᇮᆖᄎᆖᏆᆾᆖᇎᆆᏆဦჾᄮᇖᇎᆆ፦",516908082>(this)
                  )
                  || 1<"JNT",368751000,"Ά\u20fb","뉉걉","ᏞᏖၾ",516908100>(this) == -1.0) {
                  var10 = 224597823 + (560272062 << 224597823 + 560272062) ^ 1808453983;
                  continue;
               }

               var7 = 1<"JNT",368751000,"Ά\u20fb","뉉걉","ᏞᏖၾ",516908101>(this);
               break;
            case 923261946:
               return;
         }

         int var9 = 0<"JNT",-353151799,"՜᭜ẜ֜Ӝ\u1a9cÜຜຜজੜ","ųճ蕲","轻콈ཹ轋콆콻轻콈但轺콅轅ཹ轋但ཻ콅佺佺佷콉ཊཉ콉",-1168901098>(
            0<"JNT",-353151799,"՜᭜ẜ֜Ӝ\u1a9cÜजजလজߜ","ųճ煲辰ᕲ兲ﵲ\uf571ղ辰ᕲ\u2d72楲╲ᥲ兲ﵲ\u2d72\uf171╲浲浲뵲敳慳关敳䵳","轻콈ཹ轋콆콻轻콈但轺콅轅ཹ轋但ཻ콅佺佺佷佊콉ཊ",-1168901105>(
               (class_310)1<"JNT",1507978744,"✻Ά","ꉉ齉","ᏞᏖႾᇮᆖᄎᆖᏆᆾᆖᇎᆆᏆ\u10c6ᆮᇮᅶᆦჾ፦",516908087>()
            )
         );
         if (var3 + var7 + 10.0 > (double)var9) {
            var3 = (double)var9 - var7 - 10.0;
         }

         0<"JNT",-353151799,"\u061cϜ\u1a9c","ų煲慲嵲䵳酲酲酲酲酲酲酲酲ճ\ud972","콆轹",-1168901104>(
            var1,
            (Class_262)0<"JNT",-535254835,"ٜ࢜\u061cٜẜਜ","ų蕲蕲蕲蕲ճ\ud972","ེ佹",-1168901103>(40, 40, 40, 200),
            var3 - 5.0,
            var5 - 5.0,
            var3 + var7 + 5.0,
            var5 + 15.0,
            6.0,
            6.0,
            6.0,
            6.0
         );
         0<"JNT",-353151799,"\u1adc֜","ų煲ॲ╲奲╲ﵲ\uf171╲辰ᵲﵲ\ued72兲楲ղ辰ᵲ䵳酲酲煲慲嵲䵳ճ酲","콆轹",-1168901602>(
            var1, var2, var3, var5, 1<"JNT",1507978744,"♻✻↻","걉땉","ᏞᏖႾᄞᄆ፦",516908080>()
         );
         return;
      }
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_2112(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 + 2009538112 + 419427508 ^ 1194901299) + 1807387377 - 1049938718 ^ 464023796) + 1748419906 - 126523129 + 648583641;
      MethodHandle var10000 = field_2634[((var10 + 2009538112 + 419427508 ^ 1194901299) + 1807387377 - 1049938718 ^ 464023796)
         + 1748419906
         - 126523129
         + 648583641
         + 1439315913];
      if (field_2634[var10001 + 1439315913] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = 1042608550 * 1520914575 ^ 1097915322; var23 < var13.length(); var23 += (-671383889 - 700394741 | 1) & 297863745) {
            int var42 = ((var13.charAt(var23) ^ 'S' ^ 7) - 78 ^ 253) + 121;
            char var43 = (char)((((var42 & 65472) >> 6 | var42 << 10) ^ 47) + 171 ^ 211 ^ 89);
            var13.setCharAt(var23, (char)((((var42 & 65472) >> 6 | var42 << 10) ^ 47) + 171 ^ 211 ^ 89));
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = 1527801203 ^ 1926136755 >> -1634070007 ^ 1529414194; var29 < var16.length(); var29 += -769790887 ^ -950100932 ^ 356741220) {
            int var48 = var16.charAt(var29);
            int var79 = (var48 & 64512) >> 10;
            int var49 = (var48 & 64512) >> 10 | var48 << 6;
            int var80 = (((var48 & 64512) >> 10 | var48 << 6) & 64512) >> 10;
            var48 = (((var79 | var48 << 6) & 64512) >> 10 | ((var48 & 64512) >> 10 | var48 << 6) << 6) ^ 215;
            var79 = (((var80 | var49 << 6) ^ 215) & 0) >> 16;
            int var51 = (((var80 | var49 << 6) ^ 215) & 0) >> 16 | var48 << 0;
            int var82 = (((((var80 | var49 << 6) ^ 215) & 0) >> 16 | var48 << 0) & 65472) >> 6;
            char var52 = (char)(
               (((var79 | var48 << 0) & 65472) >> 6 | ((((var80 | var49 << 6) ^ 215) & 0) >> 16 | var48 << 0) << 10) + 115 - 25 + 13 - 227 ^ 111
            );
            var16.setCharAt(var29, (char)((var82 | var51 << 10) + 115 - 25 + 13 - 227 ^ 111));
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_359.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = 1219556282 >>> (-696930835 >> -696930835) ^ 148871;
            var35 < var19.length();
            var35 += 348653313 * -1178299217 * (348653313 ^ -1178299217) ^ -132830733
         ) {
            int var57 = var19.charAt(var35) + 31 ^ 18;
            int var83 = (var57 & 65534) >> 1;
            int var58 = (((var57 & 65534) >> 1 | var57 << 15) ^ 4) + 92;
            int var84 = ((((var57 & 65534) >> 1 | var57 << 15) ^ 4) + 92 & 64512) >> 10;
            var57 = ((((var83 | var57 << 15) ^ 4) + 92 & 64512) >> 10 | (((var57 & 65534) >> 1 | var57 << 15) ^ 4) + 92 << 6) - 186;
            var83 = ((var84 | var58 << 6) - 186 & 0) >> 16;
            int var60 = ((var84 | var58 << 6) - 186 & 0) >> 16 | var57 << 0;
            int var86 = ((((var84 | var58 << 6) - 186 & 0) >> 16 | var57 << 0) & 65528) >> 3;
            char var61 = (char)((((var83 | var57 << 0) & 65528) >> 3 | (((var84 | var58 << 6) - 186 & 0) >> 16 | var57 << 0) << 13) ^ 165);
            var19.setCharAt(var35, (char)((var86 | var60 << 13) ^ 165));
         }

         Class var7 = Class.forName(var19.toString(), false, Class_359.class.getClassLoader());
         switch (((var4 + 120732230 ^ 1452407911) - 335013685 + 1307744032 + 1989351950 + 820564043 - 438864400 ^ 381298415) + 1151258624 + 2114077563) {
            case 638906331:
               var10000 = var0.findSpecial(var7, var5, var6, Class_359.class);
               break;
            case 842276034:
               var10000 = var0.findConstructor(var7, var6);
               break;
            case 1029290222:
            case 1485459960:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 1538166632:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_2634[((var10 + 2009538112 + 419427508 ^ 1194901299) + 1807387377 - 1049938718 ^ 464023796) + 1748419906 - 126523129 + 648583641 + 1439315913] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_2113(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = (((var10 ^ 521030176 ^ 1497028056) + 11298958 ^ 1674592474) + 583430087 - 910175913 ^ 1978490983) + 1637249430 ^ 949266369;
      MethodHandle var10000 = field_2634[(
            (((var10 ^ 521030176 ^ 1497028056) + 11298958 ^ 1674592474) + 583430087 - 910175913 ^ 1978490983) + 1637249430 ^ 949266369
         )
         + 1942106184];
      if (field_2634[var10001 + 1942106184] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = -904359524 & -904359524 ^ -904359524;
            var24 < var14.length();
            var24 += 1315407457 - (-1243171023 & 1315407457 - -1243171023) ^ -1108934864
         ) {
            char var43 = var14.charAt(var24);
            char var48 = (char)(
               (
                     (
                              (
                                    (
                                             (
                                                   (
                                                            (
                                                                  ((((var43 & '耀') >> 15 | var43 << 1) - 40 + 208 + 194 ^ 224) & 65535) >> 0
                                                                     | (((var43 & '耀') >> 15 | var43 << 1) - 40 + 208 + 194 ^ 224) << 16
                                                               )
                                                               & 64512
                                                         )
                                                         >> 10
                                                      | (
                                                            ((((var43 & '耀') >> 15 | var43 << 1) - 40 + 208 + 194 ^ 224) & 65535) >> 0
                                                               | (((var43 & '耀') >> 15 | var43 << 1) - 40 + 208 + 194 ^ 224) << 16
                                                         )
                                                         << 6
                                                )
                                                & 57344
                                          )
                                          >> 13
                                       | (
                                             (
                                                      (
                                                            ((((var43 & '耀') >> 15 | var43 << 1) - 40 + 208 + 194 ^ 224) & 65535) >> 0
                                                               | (((var43 & '耀') >> 15 | var43 << 1) - 40 + 208 + 194 ^ 224) << 16
                                                         )
                                                         & 64512
                                                   )
                                                   >> 10
                                                | (
                                                      ((((var43 & '耀') >> 15 | var43 << 1) - 40 + 208 + 194 ^ 224) & 65535) >> 0
                                                         | (((var43 & '耀') >> 15 | var43 << 1) - 40 + 208 + 194 ^ 224) << 16
                                                   )
                                                   << 6
                                          )
                                          << 3
                                 )
                                 & 65535
                           )
                           >> 0
                        | (
                              (
                                       (
                                             (
                                                      (
                                                            ((((var43 & '耀') >> 15 | var43 << 1) - 40 + 208 + 194 ^ 224) & 65535) >> 0
                                                               | (((var43 & '耀') >> 15 | var43 << 1) - 40 + 208 + 194 ^ 224) << 16
                                                         )
                                                         & 64512
                                                   )
                                                   >> 10
                                                | (
                                                      ((((var43 & '耀') >> 15 | var43 << 1) - 40 + 208 + 194 ^ 224) & 65535) >> 0
                                                         | (((var43 & '耀') >> 15 | var43 << 1) - 40 + 208 + 194 ^ 224) << 16
                                                   )
                                                   << 6
                                          )
                                          & 57344
                                    )
                                    >> 13
                                 | (
                                       (
                                                (
                                                      ((((var43 & '耀') >> 15 | var43 << 1) - 40 + 208 + 194 ^ 224) & 65535) >> 0
                                                         | (((var43 & '耀') >> 15 | var43 << 1) - 40 + 208 + 194 ^ 224) << 16
                                                   )
                                                   & 64512
                                             )
                                             >> 10
                                          | (
                                                ((((var43 & '耀') >> 15 | var43 << 1) - 40 + 208 + 194 ^ 224) & 65535) >> 0
                                                   | (((var43 & '耀') >> 15 | var43 << 1) - 40 + 208 + 194 ^ 224) << 16
                                             )
                                             << 6
                                    )
                                    << 3
                           )
                           << 16
                  )
                  ^ 242
            );
            var14.setCharAt(
               var24,
               (char)(
                  (
                        (
                                 (
                                       (
                                                (
                                                      (
                                                               (
                                                                     ((((var43 & '耀') >> 15 | var43 << 1) - 40 + 208 + 194 ^ 224) & 65535) >> 0
                                                                        | (((var43 & '耀') >> 15 | var43 << 1) - 40 + 208 + 194 ^ 224) << 16
                                                                  )
                                                                  & 64512
                                                            )
                                                            >> 10
                                                         | (
                                                               ((((var43 & '耀') >> 15 | var43 << 1) - 40 + 208 + 194 ^ 224) & 65535) >> 0
                                                                  | (((var43 & '耀') >> 15 | var43 << 1) - 40 + 208 + 194 ^ 224) << 16
                                                            )
                                                            << 6
                                                   )
                                                   & 57344
                                             )
                                             >> 13
                                          | (
                                                (
                                                         (
                                                               ((((var43 & '耀') >> 15 | var43 << 1) - 40 + 208 + 194 ^ 224) & 65535) >> 0
                                                                  | (((var43 & '耀') >> 15 | var43 << 1) - 40 + 208 + 194 ^ 224) << 16
                                                            )
                                                            & 64512
                                                      )
                                                      >> 10
                                                   | (
                                                         ((((var43 & '耀') >> 15 | var43 << 1) - 40 + 208 + 194 ^ 224) & 65535) >> 0
                                                            | (((var43 & '耀') >> 15 | var43 << 1) - 40 + 208 + 194 ^ 224) << 16
                                                      )
                                                      << 6
                                             )
                                             << 3
                                    )
                                    & 65535
                              )
                              >> 0
                           | (
                                 (
                                          (
                                                (
                                                         (
                                                               ((((var43 & '耀') >> 15 | var43 << 1) - 40 + 208 + 194 ^ 224) & 65535) >> 0
                                                                  | (((var43 & '耀') >> 15 | var43 << 1) - 40 + 208 + 194 ^ 224) << 16
                                                            )
                                                            & 64512
                                                      )
                                                      >> 10
                                                   | (
                                                         ((((var43 & '耀') >> 15 | var43 << 1) - 40 + 208 + 194 ^ 224) & 65535) >> 0
                                                            | (((var43 & '耀') >> 15 | var43 << 1) - 40 + 208 + 194 ^ 224) << 16
                                                      )
                                                      << 6
                                             )
                                             & 57344
                                       )
                                       >> 13
                                    | (
                                          (
                                                   (
                                                         ((((var43 & '耀') >> 15 | var43 << 1) - 40 + 208 + 194 ^ 224) & 65535) >> 0
                                                            | (((var43 & '耀') >> 15 | var43 << 1) - 40 + 208 + 194 ^ 224) << 16
                                                      )
                                                      & 64512
                                                )
                                                >> 10
                                             | (
                                                   ((((var43 & '耀') >> 15 | var43 << 1) - 40 + 208 + 194 ^ 224) & 65535) >> 0
                                                      | (((var43 & '耀') >> 15 | var43 << 1) - 40 + 208 + 194 ^ 224) << 16
                                                )
                                                << 6
                                       )
                                       << 3
                              )
                              << 16
                     )
                     ^ 242
               )
            );
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = (-915733652 ^ 7127527 | 0) & 347082036; var30 < var17.length(); var30 += -1585264653 >>> 2024567059 ^ 5169) {
            char var53 = var17.charAt(var30);
            char var60 = (char)(
               (
                     (
                              (
                                    (
                                          (
                                                   (
                                                         (
                                                                  (
                                                                        (
                                                                                 (
                                                                                          (
                                                                                                   (
                                                                                                         (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                                            | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                                      )
                                                                                                      & 65528
                                                                                                )
                                                                                                >> 3
                                                                                             | (
                                                                                                   (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                                      | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                                )
                                                                                                << 13
                                                                                       )
                                                                                       - 231
                                                                                    & 32768
                                                                              )
                                                                              >> 15
                                                                           | (
                                                                                    (
                                                                                             (
                                                                                                   (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                                      | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                                )
                                                                                                & 65528
                                                                                          )
                                                                                          >> 3
                                                                                       | (
                                                                                             (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                                | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                          )
                                                                                          << 13
                                                                                 )
                                                                                 - 231
                                                                              << 1
                                                                     )
                                                                     & 63488
                                                               )
                                                               >> 11
                                                            | (
                                                                  (
                                                                           (
                                                                                    (
                                                                                             (
                                                                                                   (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                                      | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                                )
                                                                                                & 65528
                                                                                          )
                                                                                          >> 3
                                                                                       | (
                                                                                             (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                                | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                          )
                                                                                          << 13
                                                                                 )
                                                                                 - 231
                                                                              & 32768
                                                                        )
                                                                        >> 15
                                                                     | (
                                                                              (
                                                                                       (
                                                                                             (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                                | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                          )
                                                                                          & 65528
                                                                                    )
                                                                                    >> 3
                                                                                 | (
                                                                                       (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                          | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                    )
                                                                                    << 13
                                                                           )
                                                                           - 231
                                                                        << 1
                                                               )
                                                               << 5
                                                      )
                                                      & 65534
                                                )
                                                >> 1
                                             | (
                                                   (
                                                            (
                                                                  (
                                                                           (
                                                                                    (
                                                                                             (
                                                                                                   (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                                      | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                                )
                                                                                                & 65528
                                                                                          )
                                                                                          >> 3
                                                                                       | (
                                                                                             (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                                | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                          )
                                                                                          << 13
                                                                                 )
                                                                                 - 231
                                                                              & 32768
                                                                        )
                                                                        >> 15
                                                                     | (
                                                                              (
                                                                                       (
                                                                                             (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                                | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                          )
                                                                                          & 65528
                                                                                    )
                                                                                    >> 3
                                                                                 | (
                                                                                       (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                          | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                    )
                                                                                    << 13
                                                                           )
                                                                           - 231
                                                                        << 1
                                                               )
                                                               & 63488
                                                         )
                                                         >> 11
                                                      | (
                                                            (
                                                                     (
                                                                              (
                                                                                       (
                                                                                             (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                                | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                          )
                                                                                          & 65528
                                                                                    )
                                                                                    >> 3
                                                                                 | (
                                                                                       (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                          | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                    )
                                                                                    << 13
                                                                           )
                                                                           - 231
                                                                        & 32768
                                                                  )
                                                                  >> 15
                                                               | (
                                                                        (
                                                                                 (
                                                                                       (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                          | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                    )
                                                                                    & 65528
                                                                              )
                                                                              >> 3
                                                                           | (
                                                                                 (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                    | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                              )
                                                                              << 13
                                                                     )
                                                                     - 231
                                                                  << 1
                                                         )
                                                         << 5
                                                )
                                                << 15
                                       )
                                       ^ 187
                                 )
                                 & 65408
                           )
                           >> 7
                        | (
                              (
                                    (
                                             (
                                                   (
                                                            (
                                                                  (
                                                                           (
                                                                                    (
                                                                                             (
                                                                                                   (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                                      | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                                )
                                                                                                & 65528
                                                                                          )
                                                                                          >> 3
                                                                                       | (
                                                                                             (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                                | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                          )
                                                                                          << 13
                                                                                 )
                                                                                 - 231
                                                                              & 32768
                                                                        )
                                                                        >> 15
                                                                     | (
                                                                              (
                                                                                       (
                                                                                             (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                                | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                          )
                                                                                          & 65528
                                                                                    )
                                                                                    >> 3
                                                                                 | (
                                                                                       (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                          | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                    )
                                                                                    << 13
                                                                           )
                                                                           - 231
                                                                        << 1
                                                               )
                                                               & 63488
                                                         )
                                                         >> 11
                                                      | (
                                                            (
                                                                     (
                                                                              (
                                                                                       (
                                                                                             (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                                | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                          )
                                                                                          & 65528
                                                                                    )
                                                                                    >> 3
                                                                                 | (
                                                                                       (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                          | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                    )
                                                                                    << 13
                                                                           )
                                                                           - 231
                                                                        & 32768
                                                                  )
                                                                  >> 15
                                                               | (
                                                                        (
                                                                                 (
                                                                                       (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                          | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                    )
                                                                                    & 65528
                                                                              )
                                                                              >> 3
                                                                           | (
                                                                                 (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                    | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                              )
                                                                              << 13
                                                                     )
                                                                     - 231
                                                                  << 1
                                                         )
                                                         << 5
                                                )
                                                & 65534
                                          )
                                          >> 1
                                       | (
                                             (
                                                      (
                                                            (
                                                                     (
                                                                              (
                                                                                       (
                                                                                             (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                                | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                          )
                                                                                          & 65528
                                                                                    )
                                                                                    >> 3
                                                                                 | (
                                                                                       (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                          | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                    )
                                                                                    << 13
                                                                           )
                                                                           - 231
                                                                        & 32768
                                                                  )
                                                                  >> 15
                                                               | (
                                                                        (
                                                                                 (
                                                                                       (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                          | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                    )
                                                                                    & 65528
                                                                              )
                                                                              >> 3
                                                                           | (
                                                                                 (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                    | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                              )
                                                                              << 13
                                                                     )
                                                                     - 231
                                                                  << 1
                                                         )
                                                         & 63488
                                                   )
                                                   >> 11
                                                | (
                                                      (
                                                               (
                                                                        (
                                                                                 (
                                                                                       (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                          | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                    )
                                                                                    & 65528
                                                                              )
                                                                              >> 3
                                                                           | (
                                                                                 (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                    | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                              )
                                                                              << 13
                                                                     )
                                                                     - 231
                                                                  & 32768
                                                            )
                                                            >> 15
                                                         | (
                                                                  (
                                                                           (
                                                                                 (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                    | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                              )
                                                                              & 65528
                                                                        )
                                                                        >> 3
                                                                     | (
                                                                           (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                              | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                        )
                                                                        << 13
                                                               )
                                                               - 231
                                                            << 1
                                                   )
                                                   << 5
                                          )
                                          << 15
                                 )
                                 ^ 187
                           )
                           << 9
                  )
                  + 253
            );
            var17.setCharAt(
               var30,
               (char)(
                  (
                        (
                                 (
                                       (
                                             (
                                                      (
                                                            (
                                                                     (
                                                                           (
                                                                                    (
                                                                                             (
                                                                                                      (
                                                                                                            (((var53 & '\ue000') >> 13 | var53 << 3) & 65472)
                                                                                                                  >> 6
                                                                                                               | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                                         )
                                                                                                         & 65528
                                                                                                   )
                                                                                                   >> 3
                                                                                                | (
                                                                                                      (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                                         | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                                   )
                                                                                                   << 13
                                                                                          )
                                                                                          - 231
                                                                                       & 32768
                                                                                 )
                                                                                 >> 15
                                                                              | (
                                                                                       (
                                                                                                (
                                                                                                      (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                                         | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                                   )
                                                                                                   & 65528
                                                                                             )
                                                                                             >> 3
                                                                                          | (
                                                                                                (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                                   | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                             )
                                                                                             << 13
                                                                                    )
                                                                                    - 231
                                                                                 << 1
                                                                        )
                                                                        & 63488
                                                                  )
                                                                  >> 11
                                                               | (
                                                                     (
                                                                              (
                                                                                       (
                                                                                                (
                                                                                                      (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                                         | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                                   )
                                                                                                   & 65528
                                                                                             )
                                                                                             >> 3
                                                                                          | (
                                                                                                (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                                   | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                             )
                                                                                             << 13
                                                                                    )
                                                                                    - 231
                                                                                 & 32768
                                                                           )
                                                                           >> 15
                                                                        | (
                                                                                 (
                                                                                          (
                                                                                                (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                                   | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                             )
                                                                                             & 65528
                                                                                       )
                                                                                       >> 3
                                                                                    | (
                                                                                          (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                             | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                       )
                                                                                       << 13
                                                                              )
                                                                              - 231
                                                                           << 1
                                                                  )
                                                                  << 5
                                                         )
                                                         & 65534
                                                   )
                                                   >> 1
                                                | (
                                                      (
                                                               (
                                                                     (
                                                                              (
                                                                                       (
                                                                                                (
                                                                                                      (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                                         | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                                   )
                                                                                                   & 65528
                                                                                             )
                                                                                             >> 3
                                                                                          | (
                                                                                                (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                                   | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                             )
                                                                                             << 13
                                                                                    )
                                                                                    - 231
                                                                                 & 32768
                                                                           )
                                                                           >> 15
                                                                        | (
                                                                                 (
                                                                                          (
                                                                                                (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                                   | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                             )
                                                                                             & 65528
                                                                                       )
                                                                                       >> 3
                                                                                    | (
                                                                                          (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                             | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                       )
                                                                                       << 13
                                                                              )
                                                                              - 231
                                                                           << 1
                                                                  )
                                                                  & 63488
                                                            )
                                                            >> 11
                                                         | (
                                                               (
                                                                        (
                                                                                 (
                                                                                          (
                                                                                                (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                                   | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                             )
                                                                                             & 65528
                                                                                       )
                                                                                       >> 3
                                                                                    | (
                                                                                          (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                             | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                       )
                                                                                       << 13
                                                                              )
                                                                              - 231
                                                                           & 32768
                                                                     )
                                                                     >> 15
                                                                  | (
                                                                           (
                                                                                    (
                                                                                          (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                             | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                       )
                                                                                       & 65528
                                                                                 )
                                                                                 >> 3
                                                                              | (
                                                                                    (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                       | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                 )
                                                                                 << 13
                                                                        )
                                                                        - 231
                                                                     << 1
                                                            )
                                                            << 5
                                                   )
                                                   << 15
                                          )
                                          ^ 187
                                    )
                                    & 65408
                              )
                              >> 7
                           | (
                                 (
                                       (
                                                (
                                                      (
                                                               (
                                                                     (
                                                                              (
                                                                                       (
                                                                                                (
                                                                                                      (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                                         | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                                   )
                                                                                                   & 65528
                                                                                             )
                                                                                             >> 3
                                                                                          | (
                                                                                                (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                                   | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                             )
                                                                                             << 13
                                                                                    )
                                                                                    - 231
                                                                                 & 32768
                                                                           )
                                                                           >> 15
                                                                        | (
                                                                                 (
                                                                                          (
                                                                                                (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                                   | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                             )
                                                                                             & 65528
                                                                                       )
                                                                                       >> 3
                                                                                    | (
                                                                                          (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                             | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                       )
                                                                                       << 13
                                                                              )
                                                                              - 231
                                                                           << 1
                                                                  )
                                                                  & 63488
                                                            )
                                                            >> 11
                                                         | (
                                                               (
                                                                        (
                                                                                 (
                                                                                          (
                                                                                                (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                                   | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                             )
                                                                                             & 65528
                                                                                       )
                                                                                       >> 3
                                                                                    | (
                                                                                          (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                             | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                       )
                                                                                       << 13
                                                                              )
                                                                              - 231
                                                                           & 32768
                                                                     )
                                                                     >> 15
                                                                  | (
                                                                           (
                                                                                    (
                                                                                          (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                             | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                       )
                                                                                       & 65528
                                                                                 )
                                                                                 >> 3
                                                                              | (
                                                                                    (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                       | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                 )
                                                                                 << 13
                                                                        )
                                                                        - 231
                                                                     << 1
                                                            )
                                                            << 5
                                                   )
                                                   & 65534
                                             )
                                             >> 1
                                          | (
                                                (
                                                         (
                                                               (
                                                                        (
                                                                                 (
                                                                                          (
                                                                                                (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                                   | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                             )
                                                                                             & 65528
                                                                                       )
                                                                                       >> 3
                                                                                    | (
                                                                                          (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                             | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                       )
                                                                                       << 13
                                                                              )
                                                                              - 231
                                                                           & 32768
                                                                     )
                                                                     >> 15
                                                                  | (
                                                                           (
                                                                                    (
                                                                                          (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                             | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                       )
                                                                                       & 65528
                                                                                 )
                                                                                 >> 3
                                                                              | (
                                                                                    (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                       | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                 )
                                                                                 << 13
                                                                        )
                                                                        - 231
                                                                     << 1
                                                            )
                                                            & 63488
                                                      )
                                                      >> 11
                                                   | (
                                                         (
                                                                  (
                                                                           (
                                                                                    (
                                                                                          (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                             | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                       )
                                                                                       & 65528
                                                                                 )
                                                                                 >> 3
                                                                              | (
                                                                                    (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                       | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                 )
                                                                                 << 13
                                                                        )
                                                                        - 231
                                                                     & 32768
                                                               )
                                                               >> 15
                                                            | (
                                                                     (
                                                                              (
                                                                                    (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                       | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                                 )
                                                                                 & 65528
                                                                           )
                                                                           >> 3
                                                                        | (
                                                                              (((var53 & '\ue000') >> 13 | var53 << 3) & 65472) >> 6
                                                                                 | ((var53 & '\ue000') >> 13 | var53 << 3) << 10
                                                                           )
                                                                           << 13
                                                                  )
                                                                  - 231
                                                               << 1
                                                      )
                                                      << 5
                                             )
                                             << 15
                                    )
                                    ^ 187
                              )
                              << 9
                     )
                     + 253
               )
            );
         }

         Class var6 = Class.forName(var17.toString(), false, Class_359.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = (1428958923 | 1428958923 | 0) & 143675396; var36 < var20.length(); var36 += (-2147163732 | 538527281) ^ -1608652868) {
            int var65 = var20.charAt(var36) - '$';
            int var109 = (var65 & 65520) >> 4;
            int var66 = ((var65 & 65520) >> 4 | var65 << 12) - 189;
            int var110 = (((var65 & 65520) >> 4 | var65 << 12) - 189 & 65534) >> 1;
            var65 = (((var109 | var65 << 12) - 189 & 65534) >> 1 | ((var65 & 65520) >> 4 | var65 << 12) - 189 << 15) ^ 52;
            var109 = (((var110 | var66 << 15) ^ 52) & 65528) >> 3;
            int var68 = (((var110 | var66 << 15) ^ 52) & 65528) >> 3 | var65 << 13;
            int var112 = (((((var110 | var66 << 15) ^ 52) & 65528) >> 3 | var65 << 13) & 65024) >> 9;
            var65 = (((var109 | var65 << 13) & 65024) >> 9 | ((((var110 | var66 << 15) ^ 52) & 65528) >> 3 | var65 << 13) << 7) ^ 21;
            var109 = (((var112 | var68 << 7) ^ 21) & 65532) >> 2;
            int var70 = (((var112 | var68 << 7) ^ 21) & 65532) >> 2 | var65 << 14;
            int var114 = (((((var112 | var68 << 7) ^ 21) & 65532) >> 2 | var65 << 14) & 0) >> 16;
            char var71 = (char)(((var109 | var65 << 14) & 0) >> 16 | ((((var112 | var68 << 7) ^ 21) & 65532) >> 2 | var65 << 14) << 0);
            var20.setCharAt(var36, (char)(var114 | var70 << 0));
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_359.class.getClassLoader()).returnType();
         switch ((var4 - 883490792 - 1371249616 - 49916148 + 297034852 + 1294189011 ^ 697133109 ^ 1515113951) - 1057409891 + 1807288931 - 1312592034) {
            case 990779591:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            case 1171387225:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            case 1408613418:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            case 1999430951:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_2634[((((var10 ^ 521030176 ^ 1497028056) + 11298958 ^ 1674592474) + 583430087 - 910175913 ^ 1978490983) + 1637249430 ^ 949266369) + 1942106184] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
