import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;
import java.util.HashMap;
import java.util.Iterator;
import java.util.Set;
import java.util.Map.Entry;

public class Class_383 {
   // $VF: renamed from: azw java.util.HashMap
   public HashMap field_96 = (HashMap)0<"JNT",60151218,"ӥԍյԍڥӵ","뤛뤋뭻","彴㽳\udf75㽳\udf6c뽵齵㽴齴\udf6cὰ㽳罵ὴ뽰㽳ή",413120859>();
   // $VF: renamed from: inq java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_97 = new MethodHandle[(-420179987 >>> (-420179987 | 2046819241) | 8) & -1335361415];

   public Class_383(NetworkHandler_261 var1) {
   }

   // $VF: renamed from: scm (java.lang.String, java.lang.Object) void
   public void method_154(String var1, Object var2) {
      if (var2 != null) {
         0<"JNT",-596530676,"Յڭڥ","뤛뫛봻벋뵻벋룫볛벋볻뱫룫뫫벻봻뱋벫뵛먫뫛봻벋뵻벋룫볛벋볻뱫룫뫫벻봻뱋벫뵛먫뤋뫛봻벋뵻벋룫볛벋볻뱫룫뫫벻봻뱋벫뵛먫","彴㽳\udf75㽳\udf6c뽵齵㽴齴\udf6cὰ㽳罵ὴ뽰㽳ή",413120845>(
            1<"JNT",647865963,"ꥠ⥭ꥫ","踎","\uec46\uec48\uec8e\uecca\uecb8\uece2\uecb8\uec54\uece0\uecde\uecc8\uecce\uec54\uec86\uecb8\uecdc\uecc6\uec90\uecb8\uecd6\uec6c",-57026796>(
               this
            ),
            var1,
            var2
         );
      }
   }

   // $VF: Irreducible bytecode was duplicated to produce valid code
   @Override
   public String toString() {
      int var9 = 1224347571;
      StringBuilder var1 = (StringBuilder)0<"JNT",60151218,"ӥԍյԍڥӵ","뤛뤋뭻","彴㽳\udf75㽳\udf6c齴㽳\udf74ｴ\udf6c罱齵彵㽴\udf74ｴ彯뽵㽴齴齳뽳彵",413120947>();
      Set var2 = 0<"JNT",-596530676,"ԭյڥՕڍѝԭڥ","뤛뤋뫛봻벋뵻벋룫뵋뵛봋볛룫뮫뱋뵛먫","彴㽳\udf75㽳\udf6c뽵齵㽴齴\udf6cὰ㽳罵ὴ뽰㽳ή",413120869>(
         1<"JNT",647865963,"ꥠ⥭ꥫ","踎","\uec46\uec48\uec8e\uecca\uecb8\uece2\uecb8\uec54\uece0\uecde\uecc8\uecce\uec54\uec86\uecb8\uecdc\uecc6\uec90\uecb8\uecd6\uec6c",-57028356>(
            this
         )
      );
      0<"JNT",-596530676,"\u05cdՅՅԭյԥ","뤛뫛봻벋뵻벋룫볛벋볻뱫룫뮫뵛붻봋볻뱫먫뤋뫛봻벋뵻벋룫볛벋볻뱫룫뮫뵛붻봋볻뱫못뵋봋볛뱛뱋붻먫","彴㽳\udf75㽳\udf6c齴㽳\udf74ｴ\udf6c罱齵彵㽴\udf74ｴ彯뽵㽴齴齳뽳彵",413120872>(var1, "{");
      int var3 = 0;
      Iterator var4 = 0<"JNT",1984425841,"ԍڥԭՕ\u05cdڥսՕ","뤛뤋뫛봻벋뵻벋룫뵋뵛봋볛룫묋뵛뱋붻벋뵛볫붻먫","彴㽳\udf75㽳\udf6c뽵齵㽴齴\udf6c罱뽳齵",413120871>(var2);

      label92:
      while (true) {
         var9 = 415491752 & 403917029 + 1443055888 ^ -17937105;

         while (true) {
            switch (((var9 - 1467874850 ^ 466795978) - 168191135 + 309148971 ^ 1213966024) - 603855651) {
               case -1862951647:
                  return 0<"JNT",-596530676,"ڥսѝڥՕԍյԽ","뤛뤋뫛봻벋뵻벋룫볛벋볻뱫룫뮫뵛붻봋볻뱫먫","彴㽳\udf75㽳\udf6c齴㽳\udf74ｴ\udf6c罱齵彵㽴\udf74ｴ彯뽵㽴齴齳뽳彵",413120920>(var1);
               case -1585786152:
            }

            if (0<"JNT",1984425841,"ԅ\u05cd՝ѵԭڅڥ","뤛뤋밻","彴㽳\udf75㽳\udf6c뽵齵㽴齴\udf6c㽰齵뽳彵㽳齵ｵ彵",413120874>(var4)) {
               Entry var5 = (Entry)0<"JNT",1984425841,"յԭڅڥ","뤛뤋뫛봻벋뵻벋룫볛벋볻뱫룫뫫벻봻뱋벫뵛먫","彴㽳\udf75㽳\udf6c뽵齵㽴齴\udf6c㽰齵뽳彵㽳齵ｵ彵",413120873>(var4);
               Object var6 = 0<"JNT",1984425841,"Խԭڥֵ\u05cdեڭԭ","뤛뤋뫛봻벋뵻벋룫볛벋볻뱫룫뫫벻봻뱋벫뵛먫","彴㽳\udf75㽳\udf6c뽵齵㽴齴\udf6c뽰㽳ή齫뽯\udf74齵彵㽶",413120940>(var5);
               0<"JNT",-596530676,"\u05cdՅՅԭյԥ","뤛뫛봻벋뵻벋룫볛벋볻뱫룫뮫뵛붻봋볻뱫먫뤋뫛봻벋뵻벋룫볛벋볻뱫룫뮫뵛붻봋볻뱫못뵋봋볛뱛뱋붻먫","彴㽳\udf75㽳\udf6c齴㽳\udf74ｴ\udf6c罱齵彵㽴\udf74ｴ彯뽵㽴齴齳뽳彵",413120928>(
                  0<"JNT",-596530676,"\u05cdՅՅԭյԥ","뤛뫛봻벋뵻벋룫볛벋볻뱫룫뮫뵛붻봋볻뱫먫뤋뫛봻벋뵻벋룫볛벋볻뱫룫뮫뵛붻봋볻뱫못뵋봋볛뱛뱋붻먫","彴㽳\udf75㽳\udf6c齴㽳\udf74ｴ\udf6c罱齵彵㽴\udf74ｴ彯뽵㽴齴齳뽳彵",413120925>(
                     var1,
                     0<"JNT",-596530676,"ԵԵՕ","뤛뫛봻벋뵻벋룫볛벋볻뱫룫뮫뵛붻봋볻뱫먫뤋뫛봻벋뵻벋룫볛벋볻뱫룫뮫뵛붻봋볻뱫먫","ὶ",413120926>(
                        this, (String)0<"JNT",1984425841,"ԽԭڥНԭڍ","뤛뤋뫛봻벋뵻벋룫볛벋볻뱫룫뫫벻봻뱋벫뵛먫","彴㽳\udf75㽳\udf6c뽵齵㽴齴\udf6c뽰㽳ή齫뽯\udf74齵彵㽶",413120875>(var5)
                     )
                  ),
                  ":"
               );
               if (var6 instanceof String) {
                  0<"JNT",-596530676,"\u05cdՅՅԭյԥ","뤛뫛봻벋뵻벋룫볛벋볻뱫룫뮫뵛붻봋볻뱫먫뤋뫛봻벋뵻벋룫볛벋볻뱫룫뮫뵛붻봋볻뱫못뵋봋볛뱛뱋붻먫","彴㽳\udf75㽳\udf6c齴㽳\udf74ｴ\udf6c罱齵彵㽴\udf74ｴ彯뽵㽴齴齳뽳彵",413120945>(
                     var1,
                     0<"JNT",-596530676,"ԵԵՕ","뤛뫛봻벋뵻벋룫볛벋볻뱫룫뮫뵛붻봋볻뱫먫뤋뫛봻벋뵻벋룫볛벋볻뱫룫뮫뵛붻봋볻뱫먫","ὶ",413120946>(
                        this,
                        0<"JNT",-881828998,"ڵ\u05cdեڭԭѽԵ","뤛뫛봻벋뵻벋룫볛벋볻뱫룫뫫벻봻뱋벫뵛먫뤋뫛봻벋뵻벋룫볛벋볻뱫룫뮫뵛붻봋볻뱫먫","彴㽳\udf75㽳\udf6c齴㽳\udf74ｴ\udf6c罱齵彵㽴\udf74ｴ",413120927>(var6)
                     )
                  );
                  var9 = -1963636041 - -1227727179 ^ -291162807;
               } else {
                  var9 = 1106072361;
               }

               while (true) {
                  switch (((var9 ^ 38762710) + 830916374 - 326777781 ^ 388680065) + 762491014 - 1507066428) {
                     case -1531778029:
                        if (0<"JNT",-596530676,"ԍ՝ӍՕՕ\u05cdڍ","뤛뤋밻","彴㽳\udf75㽳\udf6c齴㽳\udf74ｴ\udf6c罯齴㽳罵罵",413120956>(
                           0<"JNT",-596530676,"Խԭڥӝե\u05cd՝՝","뤛뤋뫛봻벋뵻벋룫볛벋볻뱫룫몫볛벋붫붫먫","彴㽳\udf75㽳\udf6c齴㽳\udf74ｴ\udf6cｱ彳彴뽳罳齵",413120953>(var6)
                        )) {
                           0<"JNT",-596530676,"\u05cdՅՅԭյԥ","뤛뫛봻벋뵻벋룫볛벋볻뱫룫뮫뵛붻봋볻뱫먫뤋뫛봻벋뵻벋룫볛벋볻뱫룫뮫뵛붻봋볻뱫못뵋봋볛뱛뱋붻먫","彴㽳\udf75㽳\udf6c齴㽳\udf74ｴ\udf6c罱齵彵㽴\udf74ｴ彯뽵㽴齴齳뽳彵",413120955>(
                              var1, "["
                           );
                           int var7 = 0<"JNT",-881828998,"ԽԭڥѥԭյԽڥԅ","뤛뫛봻벋뵻벋룫볛벋볻뱫룫뫫벻봻뱋벫뵛먫뤋묋","彴㽳\udf75㽳\udf6c齴㽳\udf74ｴ\udf6c彵뽳\udf73齴뽳罳齵\udf6c㽯彵彵㽳㽶",413120942>(
                              var6
                           );
                           int var8 = 0;
                           var9 = (-674871582 + -605128145 | 13282368) & 231386862;

                           label80:
                           while (true) {
                              switch (((var9 + 1063245534 ^ 46323145) - 1096033971 ^ 677687001) - 1414049954 - 797024612) {
                                 case -1490662153:
                                 default:
                                    if (var8 < var7) {
                                       0<"JNT",-596530676,"\u05cdՅՅԭյԥ","뤛뫛봻벋뵻벋룫볛벋볻뱫룫뮫뵛붻봋볻뱫먫뤋뫛봻벋뵻벋룫볛벋볻뱫룫뮫뵛붻봋볻뱫못뵋봋볛뱛뱋붻먫","彴㽳\udf75㽳\udf6c齴㽳\udf74ｴ\udf6c罱齵彵㽴\udf74ｴ彯뽵㽴齴齳뽳彵",413120948>(
                                          0<"JNT",-596530676,"\u05cdՅՅԭյԥ","뤛뫛봻벋뵻벋룫볛벋볻뱫룫뮫뵛붻봋볻뱫먫뤋뫛봻벋뵻벋룫볛벋볻뱫룫뮫뵛붻봋볻뱫못뵋봋볛뱛뱋붻먫","彴㽳\udf75㽳\udf6c齴㽳\udf74ｴ\udf6c罱齵彵㽴\udf74ｴ彯뽵㽴齴齳뽳彵",413120917>(
                                             var1,
                                             0<"JNT",-596530676,"ڥսѝڥՕԍյԽ","뤛뤋뫛봻벋뵻벋룫볛벋볻뱫룫뮫뵛붻봋볻뱫먫","彴㽳\udf75㽳\udf6c齴㽳\udf74ｴ\udf6cｱ彳彴뽳罳齵",413120918>(
                                                0<"JNT",-881828998,"Խԭڥ","뤛뫛봻벋뵻벋룫볛벋볻뱫룫뫫벻봻뱋벫뵛먫묋뤋뫛봻벋뵻벋룫볛벋볻뱫룫뫫벻봻뱋벫뵛먫","彴㽳\udf75㽳\udf6c齴㽳\udf74ｴ\udf6c彵뽳\udf73齴뽳罳齵\udf6c㽯彵彵㽳㽶",413120931>(
                                                   var6, var8
                                                )
                                             )
                                          ),
                                          var8 != var7 - 1 ? "," : ""
                                       );
                                       var8++;
                                       var9 = (-674871582 + -605128145 | 13282368) & 231386862;
                                    } else {
                                       var9 = (-1099755286 | -1099755286) ^ 353699229;
                                    }
                                    break;
                                 case 185428522:
                                    0<"JNT",-596530676,"\u05cdՅՅԭյԥ","뤛뫛봻벋뵻벋룫볛벋볻뱫룫뮫뵛붻봋볻뱫먫뤋뫛봻벋뵻벋룫볛벋볻뱫룫뮫뵛붻봋볻뱫못뵋봋볛뱛뱋붻먫","彴㽳\udf75㽳\udf6c齴㽳\udf74ｴ\udf6c罱齵彵㽴\udf74ｴ彯뽵㽴齴齳뽳彵",413120941>(
                                       var1, "]"
                                    );
                                    break label80;
                              }
                           }
                        }

                        var9 = -1963636041 - -1227727179 ^ -291162807;
                        break;
                     case 186248817:
                     default:
                        if (var6 instanceof Boolean) {
                           0<"JNT",-596530676,"\u05cdՅՅԭյԥ","뤛뫛봻벋뵻벋룫볛벋볻뱫룫뫫벻봻뱋벫뵛먫뤋뫛봻벋뵻벋룫볛벋볻뱫룫뮫뵛붻봋볻뱫못뵋봋볛뱛뱋붻먫","彴㽳\udf75㽳\udf6c齴㽳\udf74ｴ\udf6c罱齵彵㽴\udf74ｴ彯뽵㽴齴齳뽳彵",413120848>(
                              var1, var6
                           );
                           var9 = -1963636041 - -1227727179 ^ -291162807;
                        } else {
                           var9 = (1990263123 + -519160859 | 890291017) & -1214650551;
                        }
                        break;
                     case 362714057:
                        var3++;
                        0<"JNT",-596530676,"\u05cdՅՅԭյԥ","뤛뫛봻벋뵻벋룫볛벋볻뱫룫뮫뵛붻봋볻뱫먫뤋뫛봻벋뵻벋룫볛벋볻뱫룫뮫뵛붻봋볻뱫못뵋봋볛뱛뱋붻먫","彴㽳\udf75㽳\udf6c齴㽳\udf74ｴ\udf6c罱齵彵㽴\udf74ｴ彯뽵㽴齴齳뽳彵",413120919>(
                           var1, var3 == 0<"JNT",1984425841,"՝ԍڕԭ","뤛뤋묋","彴㽳\udf75㽳\udf6c뽵齵㽴齴\udf6c罱뽳齵",413120954>(var2) ? "}" : ","
                        );
                        continue label92;
                     case 409505995:
                        if (var6 instanceof Class_383) {
                           0<"JNT",-596530676,"\u05cdՅՅԭյԥ","뤛뫛봻벋뵻벋룫볛벋볻뱫룫뫫벻봻뱋벫뵛먫뤋뫛봻벋뵻벋룫볛벋볻뱫룫뮫뵛붻봋볻뱫못뵋봋볛뱛뱋붻먫","彴㽳\udf75㽳\udf6c齴㽳\udf74ｴ\udf6c罱齵彵㽴\udf74ｴ彯뽵㽴齴齳뽳彵",413120932>(
                              var1, var6
                           );
                           var9 = -1963636041 - -1227727179 ^ -291162807;
                        } else {
                           var9 = -1434644431;
                        }
                        break;
                     case 1243819307:
                        if (var6 instanceof Integer) {
                           0<"JNT",-596530676,"\u05cdՅՅԭյԥ","뤛뫛봻벋뵻벋룫볛벋볻뱫룫뫫벻봻뱋벫뵛먫뤋뫛봻벋뵻벋룫볛벋볻뱫룫뮫뵛붻봋볻뱫못뵋봋볛뱛뱋붻먫","彴㽳\udf75㽳\udf6c齴㽳\udf74ｴ\udf6c罱齵彵㽴\udf74ｴ彯뽵㽴齴齳뽳彵",413120929>(
                              var1,
                              0<"JNT",-881828998,"ڵ\u05cdեڭԭѽԵ","뤛뫛봻벋뵻벋룫볛벋볻뱫룫뮫뵛붻봋볻뱫먫뤋뫛봻벋뵻벋룫볛벋볻뱫룫묋볻뵛뱋뱫뱋붻먫","彴㽳\udf75㽳\udf6c齴㽳\udf74ｴ\udf6c㽰\udf74齵뽳ｴ뽳彵",413120930>(
                                 0<"JNT",-881828998,"ڵ\u05cdեڭԭѽԵ","뤛뫛봻벋뵻벋룫볛벋볻뱫룫뫫벻봻뱋벫뵛먫뤋뫛봻벋뵻벋룫볛벋볻뱫룫뮫뵛붻봋볻뱫먫","彴㽳\udf75㽳\udf6c齴㽳\udf74ｴ\udf6c罱齵彵㽴\udf74ｴ",413120847>(
                                    var6
                                 )
                              )
                           );
                           var9 = -1963636041 - -1227727179 ^ -291162807;
                        } else {
                           var9 = 654687443 * -565409648 ^ 136693795;
                        }
                  }
               }
            }

            var9 = (2078400523 - 2078400523 * 2078400523 | 118616172) & -946472468;
         }
      }
   }

   // $VF: renamed from: ffr (java.lang.String) java.lang.String
   public String method_155(String var1) {
      return 0<"JNT",-596530676,"ڥսѝڥՕԍյԽ","뤛뤋뫛봻벋뵻벋룫볛벋볻뱫룫뮫뵛붻봋볻뱫먫","彴㽳\udf75㽳\udf6c齴㽳\udf74ｴ\udf6c罱齵彵㽴\udf74ｴ彯뽵㽴齴齳뽳彵",413120644>(
         0<"JNT",-596530676,"\u05cdՅՅԭյԥ","뤛뫛봻벋뵻벋룫볛벋볻뱫룫뮫뵛붻봋볻뱫먫뤋뫛봻벋뵻벋룫볛벋볻뱫룫뮫뵛붻봋볻뱫못뵋봋볛뱛뱋붻먫","彴㽳\udf75㽳\udf6c齴㽳\udf74ｴ\udf6c罱齵彵㽴\udf74ｴ彯뽵㽴齴齳뽳彵",413120641>(
            0<"JNT",-596530676,"\u05cdՅՅԭյԥ","뤛뫛봻벋뵻벋룫볛벋볻뱫룫뫫벻봻뱋벫뵛먫뤋뫛봻벋뵻벋룫볛벋볻뱫룫뮫뵛붻봋볻뱫못뵋봋볛뱛뱋붻먫","彴㽳\udf75㽳\udf6c齴㽳\udf74ｴ\udf6c罱齵彵㽴\udf74ｴ彯뽵㽴齴齳뽳彵",413120642>(
               0<"JNT",-596530676,"\u05cdՅՅԭյԥ","뤛뫛봻벋뵻벋룫볛벋볻뱫룫뮫뵛붻봋볻뱫먫뤋뫛봻벋뵻벋룫볛벋볻뱫룫뮫뵛붻봋볻뱫못뵋봋볛뱛뱋붻먫","彴㽳\udf75㽳\udf6c齴㽳\udf74ｴ\udf6c罱齵彵㽴\udf74ｴ彯뽵㽴齴齳뽳彵",413120943>(
                  (StringBuilder)0<"JNT",60151218,"ӥԍյԍڥӵ","뤛뤋뭻","彴㽳\udf75㽳\udf6c齴㽳\udf74ｴ\udf6c罱齵彵㽴\udf74ｴ彯뽵㽴齴齳뽳彵",413120944>(), "\""
               ),
               var1
            ),
            "\""
         )
      );
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_156(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = (((var10 - 727159884 ^ 1559622560) - 23314713 ^ 46082917) - 220700435 + 1457306763 + 272344980 ^ 1652898596) - 739205156;
      MethodHandle var10000 = field_97[(((var10 - 727159884 ^ 1559622560) - 23314713 ^ 46082917) - 220700435 + 1457306763 + 272344980 ^ 1652898596)
         - 739205156
         - 1111742647];
      if (field_97[var10001 - 1111742647] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = (-2011652686 | -1149248961) ^ -1149247553; var23 < var13.length(); var23 += 2139799705 * 1258431770 ^ 1444916363) {
            int var42 = (var13.charAt(var23) ^ 144 ^ 186 ^ 142) + 156 - 61;
            char var45 = (char)(
               (
                     (((((var42 & 65024) >> 9 | var42 << 7) & 65472) >> 6 | ((var42 & 65024) >> 9 | var42 << 7) << 10) + 208 & 65520) >> 4
                        | ((((var42 & 65024) >> 9 | var42 << 7) & 65472) >> 6 | ((var42 & 65024) >> 9 | var42 << 7) << 10) + 208 << 12
                  )
                  - 101
            );
            var13.setCharAt(
               var23,
               (char)(
                  (
                        (((((var42 & 65024) >> 9 | var42 << 7) & 65472) >> 6 | ((var42 & 65024) >> 9 | var42 << 7) << 10) + 208 & 65520) >> 4
                           | ((((var42 & 65024) >> 9 | var42 << 7) & 65472) >> 6 | ((var42 & 65024) >> 9 | var42 << 7) << 10) + 208 << 12
                     )
                     - 101
               )
            );
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = 1885619221 - 1885619221 ^ 0; var29 < var16.length(); var29 += (-471647448 | -471647448) ^ -471647447) {
            int var50 = var16.charAt(var29) + 190 ^ 93;
            int var75 = (var50 & 63488) >> 11;
            int var51 = (((var50 & 63488) >> 11 | var50 << 5) - 114 ^ 195) + 16 - 243;
            int var76 = ((((var50 & 63488) >> 11 | var50 << 5) - 114 ^ 195) + 16 - 243 & 65024) >> 9;
            char var52 = (char)(
               ((((var75 | var50 << 5) - 114 ^ 195) + 16 - 243 & 65024) >> 9 | (((var50 & 63488) >> 11 | var50 << 5) - 114 ^ 195) + 16 - 243 << 7) - 233 - 135
            );
            var16.setCharAt(var29, (char)((var76 | var51 << 7) - 233 - 135));
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_383.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = (-640928054 + 1815441526 | 0) & 539645998; var35 < var19.length(); var35 += -2065805801 * (1654178723 << -975202128) ^ 1034223617) {
            int var57 = var19.charAt(var35) - '3' - 19 + 218 + 133 - 103;
            char var58 = (char)(((var57 & 57344) >> 13 | var57 << 3) - 203 - 72 - 153 + 227);
            var19.setCharAt(var35, (char)(((var57 & 57344) >> 13 | var57 << 3) - 203 - 72 - 153 + 227));
         }

         Class var7 = Class.forName(var19.toString(), false, Class_383.class.getClassLoader());
         switch (((var4 ^ 241272942 ^ 1307878569) - 2001436509 - 754894836 ^ 234873015) - 234861849 - 387873152 + 702912170 + 1923201550 ^ 1217676985) {
            case 626739029:
            case 1534392392:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 676967491:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            case 1160131083:
               var10000 = var0.findConstructor(var7, var6);
               break;
            case 1502253372:
               var10000 = var0.findSpecial(var7, var5, var6, Class_383.class);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_97[(((var10 - 727159884 ^ 1559622560) - 23314713 ^ 46082917) - 220700435 + 1457306763 + 272344980 ^ 1652898596) - 739205156 - 1111742647] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_157(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = (var10 ^ 2039773258 ^ 1953967280) + 2088810255 + 284768007 - 1860490832 - 733670592 + 1736067573 - 1122697529 + 1398437647;
      MethodHandle var10000 = field_97[(var10 ^ 2039773258 ^ 1953967280)
         + 2088810255
         + 284768007
         - 1860490832
         - 733670592
         + 1736067573
         - 1122697529
         + 1398437647
         - 1547595454];
      if (field_97[var10001 - 1547595454] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = (-830272579 + 1340912786 | 0) & 1060912; var24 < var14.length(); var24 += 4616044 >>> -1033696806 ^ 1) {
            char var43 = var14.charAt(var24);
            char var46 = (char)(
               (
                        (
                              (((((var43 & '\ufff0') >> 4 | var43 << '\f') - 154 ^ 241) - 161 - 4 + 81 ^ 109 ^ 215) & 65024) >> 9
                                 | ((((var43 & '\ufff0') >> 4 | var43 << '\f') - 154 ^ 241) - 161 - 4 + 81 ^ 109 ^ 215) << 7
                           )
                           & 65532
                     )
                     >> 2
                  | (
                        (((((var43 & '\ufff0') >> 4 | var43 << '\f') - 154 ^ 241) - 161 - 4 + 81 ^ 109 ^ 215) & 65024) >> 9
                           | ((((var43 & '\ufff0') >> 4 | var43 << '\f') - 154 ^ 241) - 161 - 4 + 81 ^ 109 ^ 215) << 7
                     )
                     << 14
            );
            var14.setCharAt(
               var24,
               (char)(
                  (
                           (
                                 (((((var43 & '\ufff0') >> 4 | var43 << '\f') - 154 ^ 241) - 161 - 4 + 81 ^ 109 ^ 215) & 65024) >> 9
                                    | ((((var43 & '\ufff0') >> 4 | var43 << '\f') - 154 ^ 241) - 161 - 4 + 81 ^ 109 ^ 215) << 7
                              )
                              & 65532
                        )
                        >> 2
                     | (
                           (((((var43 & '\ufff0') >> 4 | var43 << '\f') - 154 ^ 241) - 161 - 4 + 81 ^ 109 ^ 215) & 65024) >> 9
                              | ((((var43 & '\ufff0') >> 4 | var43 << '\f') - 154 ^ 241) - 161 - 4 + 81 ^ 109 ^ 215) << 7
                        )
                        << 14
               )
            );
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = (-830960874 | 2093612865 << -830960874 | 0) & 536954056;
            var30 < var17.length();
            var30 += (-1929467332 >>> 1318664462 | 1) & 1777419265
         ) {
            int var51 = var17.charAt(var30);
            int var92 = (var51 & 65024) >> 9;
            int var52 = ((var51 & 65024) >> 9 | var51 << 7) + 201;
            int var93 = (((var51 & 65024) >> 9 | var51 << 7) + 201 & 65472) >> 6;
            var51 = ((var92 | var51 << 7) + 201 & 65472) >> 6 | ((var51 & 65024) >> 9 | var51 << 7) + 201 << 10;
            var92 = ((var93 | var52 << 10) & 64512) >> 10;
            int var54 = (((var93 | var52 << 10) & 64512) >> 10 | var51 << 6) - 86 - 250;
            int var95 = ((((var93 | var52 << 10) & 64512) >> 10 | var51 << 6) - 86 - 250 & 65528) >> 3;
            char var55 = (char)(
               (((var92 | var51 << 6) - 86 - 250 & 65528) >> 3 | (((var93 | var52 << 10) & 64512) >> 10 | var51 << 6) - 86 - 250 << 13) + 26 - 0 - 122
            );
            var17.setCharAt(var30, (char)((var95 | var54 << 13) + 26 - 0 - 122));
         }

         Class var6 = Class.forName(var17.toString(), false, Class_383.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = -1617683851 + -385315312 ^ -2002999163; var36 < var20.length(); var36 += (258137596 ^ -421153 | 1) & 134250701) {
            int var60 = var20.charAt(var36) + 'e';
            char var67 = (char)(
               (
                        (
                              (
                                       (
                                             (
                                                      (
                                                            (
                                                                     (
                                                                              (
                                                                                       (
                                                                                             (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                                                | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                                          )
                                                                                          & 61440
                                                                                    )
                                                                                    >> 12
                                                                                 | (
                                                                                       (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                                          | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                                    )
                                                                                    << 4
                                                                           )
                                                                           - 110
                                                                        & 61440
                                                                  )
                                                                  >> 12
                                                               | (
                                                                        (
                                                                                 (
                                                                                       (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                                          | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                                    )
                                                                                    & 61440
                                                                              )
                                                                              >> 12
                                                                           | (
                                                                                 (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                                    | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                              )
                                                                              << 4
                                                                     )
                                                                     - 110
                                                                  << 4
                                                         )
                                                         & 65472
                                                   )
                                                   >> 6
                                                | (
                                                      (
                                                               (
                                                                        (
                                                                                 (
                                                                                       (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                                          | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                                    )
                                                                                    & 61440
                                                                              )
                                                                              >> 12
                                                                           | (
                                                                                 (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                                    | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                              )
                                                                              << 4
                                                                     )
                                                                     - 110
                                                                  & 61440
                                                            )
                                                            >> 12
                                                         | (
                                                                  (
                                                                           (
                                                                                 (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                                    | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                              )
                                                                              & 61440
                                                                        )
                                                                        >> 12
                                                                     | (
                                                                           (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                              | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                        )
                                                                        << 4
                                                               )
                                                               - 110
                                                            << 4
                                                   )
                                                   << 10
                                          )
                                          & 65534
                                    )
                                    >> 1
                                 | (
                                       (
                                                (
                                                      (
                                                               (
                                                                        (
                                                                                 (
                                                                                       (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                                          | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                                    )
                                                                                    & 61440
                                                                              )
                                                                              >> 12
                                                                           | (
                                                                                 (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                                    | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                              )
                                                                              << 4
                                                                     )
                                                                     - 110
                                                                  & 61440
                                                            )
                                                            >> 12
                                                         | (
                                                                  (
                                                                           (
                                                                                 (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                                    | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                              )
                                                                              & 61440
                                                                        )
                                                                        >> 12
                                                                     | (
                                                                           (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                              | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                        )
                                                                        << 4
                                                               )
                                                               - 110
                                                            << 4
                                                   )
                                                   & 65472
                                             )
                                             >> 6
                                          | (
                                                (
                                                         (
                                                                  (
                                                                           (
                                                                                 (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                                    | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                              )
                                                                              & 61440
                                                                        )
                                                                        >> 12
                                                                     | (
                                                                           (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                              | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                        )
                                                                        << 4
                                                               )
                                                               - 110
                                                            & 61440
                                                      )
                                                      >> 12
                                                   | (
                                                            (
                                                                     (
                                                                           (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                              | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                        )
                                                                        & 61440
                                                                  )
                                                                  >> 12
                                                               | (
                                                                     (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                        | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                  )
                                                                  << 4
                                                         )
                                                         - 110
                                                      << 4
                                             )
                                             << 10
                                    )
                                    << 15
                           )
                           & 57344
                     )
                     >> 13
                  | (
                        (
                                 (
                                       (
                                                (
                                                      (
                                                               (
                                                                        (
                                                                                 (
                                                                                       (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                                          | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                                    )
                                                                                    & 61440
                                                                              )
                                                                              >> 12
                                                                           | (
                                                                                 (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                                    | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                              )
                                                                              << 4
                                                                     )
                                                                     - 110
                                                                  & 61440
                                                            )
                                                            >> 12
                                                         | (
                                                                  (
                                                                           (
                                                                                 (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                                    | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                              )
                                                                              & 61440
                                                                        )
                                                                        >> 12
                                                                     | (
                                                                           (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                              | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                        )
                                                                        << 4
                                                               )
                                                               - 110
                                                            << 4
                                                   )
                                                   & 65472
                                             )
                                             >> 6
                                          | (
                                                (
                                                         (
                                                                  (
                                                                           (
                                                                                 (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                                    | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                              )
                                                                              & 61440
                                                                        )
                                                                        >> 12
                                                                     | (
                                                                           (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                              | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                        )
                                                                        << 4
                                                               )
                                                               - 110
                                                            & 61440
                                                      )
                                                      >> 12
                                                   | (
                                                            (
                                                                     (
                                                                           (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                              | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                        )
                                                                        & 61440
                                                                  )
                                                                  >> 12
                                                               | (
                                                                     (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                        | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                  )
                                                                  << 4
                                                         )
                                                         - 110
                                                      << 4
                                             )
                                             << 10
                                    )
                                    & 65534
                              )
                              >> 1
                           | (
                                 (
                                          (
                                                (
                                                         (
                                                                  (
                                                                           (
                                                                                 (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                                    | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                              )
                                                                              & 61440
                                                                        )
                                                                        >> 12
                                                                     | (
                                                                           (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                              | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                        )
                                                                        << 4
                                                               )
                                                               - 110
                                                            & 61440
                                                      )
                                                      >> 12
                                                   | (
                                                            (
                                                                     (
                                                                           (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                              | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                        )
                                                                        & 61440
                                                                  )
                                                                  >> 12
                                                               | (
                                                                     (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                        | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                  )
                                                                  << 4
                                                         )
                                                         - 110
                                                      << 4
                                             )
                                             & 65472
                                       )
                                       >> 6
                                    | (
                                          (
                                                   (
                                                            (
                                                                     (
                                                                           (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                              | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                        )
                                                                        & 61440
                                                                  )
                                                                  >> 12
                                                               | (
                                                                     (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                        | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                  )
                                                                  << 4
                                                         )
                                                         - 110
                                                      & 61440
                                                )
                                                >> 12
                                             | (
                                                      (
                                                               (
                                                                     (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                        | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                  )
                                                                  & 61440
                                                            )
                                                            >> 12
                                                         | (
                                                               (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                  | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                            )
                                                            << 4
                                                   )
                                                   - 110
                                                << 4
                                       )
                                       << 10
                              )
                              << 15
                     )
                     << 3
            );
            var20.setCharAt(
               var36,
               (char)(
                  (
                           (
                                 (
                                          (
                                                (
                                                         (
                                                               (
                                                                        (
                                                                                 (
                                                                                          (
                                                                                                (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                                                   | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                                             )
                                                                                             & 61440
                                                                                       )
                                                                                       >> 12
                                                                                    | (
                                                                                          (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                                             | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                                       )
                                                                                       << 4
                                                                              )
                                                                              - 110
                                                                           & 61440
                                                                     )
                                                                     >> 12
                                                                  | (
                                                                           (
                                                                                    (
                                                                                          (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                                             | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                                       )
                                                                                       & 61440
                                                                                 )
                                                                                 >> 12
                                                                              | (
                                                                                    (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                                       | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                                 )
                                                                                 << 4
                                                                        )
                                                                        - 110
                                                                     << 4
                                                            )
                                                            & 65472
                                                      )
                                                      >> 6
                                                   | (
                                                         (
                                                                  (
                                                                           (
                                                                                    (
                                                                                          (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                                             | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                                       )
                                                                                       & 61440
                                                                                 )
                                                                                 >> 12
                                                                              | (
                                                                                    (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                                       | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                                 )
                                                                                 << 4
                                                                        )
                                                                        - 110
                                                                     & 61440
                                                               )
                                                               >> 12
                                                            | (
                                                                     (
                                                                              (
                                                                                    (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                                       | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                                 )
                                                                                 & 61440
                                                                           )
                                                                           >> 12
                                                                        | (
                                                                              (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                                 | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                           )
                                                                           << 4
                                                                  )
                                                                  - 110
                                                               << 4
                                                      )
                                                      << 10
                                             )
                                             & 65534
                                       )
                                       >> 1
                                    | (
                                          (
                                                   (
                                                         (
                                                                  (
                                                                           (
                                                                                    (
                                                                                          (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                                             | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                                       )
                                                                                       & 61440
                                                                                 )
                                                                                 >> 12
                                                                              | (
                                                                                    (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                                       | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                                 )
                                                                                 << 4
                                                                        )
                                                                        - 110
                                                                     & 61440
                                                               )
                                                               >> 12
                                                            | (
                                                                     (
                                                                              (
                                                                                    (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                                       | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                                 )
                                                                                 & 61440
                                                                           )
                                                                           >> 12
                                                                        | (
                                                                              (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                                 | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                           )
                                                                           << 4
                                                                  )
                                                                  - 110
                                                               << 4
                                                      )
                                                      & 65472
                                                )
                                                >> 6
                                             | (
                                                   (
                                                            (
                                                                     (
                                                                              (
                                                                                    (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                                       | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                                 )
                                                                                 & 61440
                                                                           )
                                                                           >> 12
                                                                        | (
                                                                              (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                                 | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                           )
                                                                           << 4
                                                                  )
                                                                  - 110
                                                               & 61440
                                                         )
                                                         >> 12
                                                      | (
                                                               (
                                                                        (
                                                                              (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                                 | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                           )
                                                                           & 61440
                                                                     )
                                                                     >> 12
                                                                  | (
                                                                        (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                           | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                     )
                                                                     << 4
                                                            )
                                                            - 110
                                                         << 4
                                                )
                                                << 10
                                       )
                                       << 15
                              )
                              & 57344
                        )
                        >> 13
                     | (
                           (
                                    (
                                          (
                                                   (
                                                         (
                                                                  (
                                                                           (
                                                                                    (
                                                                                          (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                                             | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                                       )
                                                                                       & 61440
                                                                                 )
                                                                                 >> 12
                                                                              | (
                                                                                    (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                                       | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                                 )
                                                                                 << 4
                                                                        )
                                                                        - 110
                                                                     & 61440
                                                               )
                                                               >> 12
                                                            | (
                                                                     (
                                                                              (
                                                                                    (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                                       | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                                 )
                                                                                 & 61440
                                                                           )
                                                                           >> 12
                                                                        | (
                                                                              (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                                 | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                           )
                                                                           << 4
                                                                  )
                                                                  - 110
                                                               << 4
                                                      )
                                                      & 65472
                                                )
                                                >> 6
                                             | (
                                                   (
                                                            (
                                                                     (
                                                                              (
                                                                                    (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                                       | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                                 )
                                                                                 & 61440
                                                                           )
                                                                           >> 12
                                                                        | (
                                                                              (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                                 | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                           )
                                                                           << 4
                                                                  )
                                                                  - 110
                                                               & 61440
                                                         )
                                                         >> 12
                                                      | (
                                                               (
                                                                        (
                                                                              (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                                 | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                           )
                                                                           & 61440
                                                                     )
                                                                     >> 12
                                                                  | (
                                                                        (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                           | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                     )
                                                                     << 4
                                                            )
                                                            - 110
                                                         << 4
                                                )
                                                << 10
                                       )
                                       & 65534
                                 )
                                 >> 1
                              | (
                                    (
                                             (
                                                   (
                                                            (
                                                                     (
                                                                              (
                                                                                    (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                                       | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                                 )
                                                                                 & 61440
                                                                           )
                                                                           >> 12
                                                                        | (
                                                                              (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                                 | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                           )
                                                                           << 4
                                                                  )
                                                                  - 110
                                                               & 61440
                                                         )
                                                         >> 12
                                                      | (
                                                               (
                                                                        (
                                                                              (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                                 | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                           )
                                                                           & 61440
                                                                     )
                                                                     >> 12
                                                                  | (
                                                                        (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                           | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                     )
                                                                     << 4
                                                            )
                                                            - 110
                                                         << 4
                                                )
                                                & 65472
                                          )
                                          >> 6
                                       | (
                                             (
                                                      (
                                                               (
                                                                        (
                                                                              (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                                 | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                           )
                                                                           & 61440
                                                                     )
                                                                     >> 12
                                                                  | (
                                                                        (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                           | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                     )
                                                                     << 4
                                                            )
                                                            - 110
                                                         & 61440
                                                   )
                                                   >> 12
                                                | (
                                                         (
                                                                  (
                                                                        (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                           | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                                     )
                                                                     & 61440
                                                               )
                                                               >> 12
                                                            | (
                                                                  (((var60 & 65408) >> 7 | var60 << 9) + 41 & 49152) >> 14
                                                                     | ((var60 & 65408) >> 7 | var60 << 9) + 41 << 2
                                                               )
                                                               << 4
                                                      )
                                                      - 110
                                                   << 4
                                          )
                                          << 10
                                 )
                                 << 15
                        )
                        << 3
               )
            );
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_383.class.getClassLoader()).returnType();
         switch (((var4 - 365942264 + 1934182075 - 88725130 ^ 925844261) - 909392022 ^ 1074860095 ^ 185869200) + 512114115 + 613084511 - 1519875537) {
            case 600422928:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            case 1073557050:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            case 1092791957:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            case 1820358886:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_97[(var10 ^ 2039773258 ^ 1953967280) + 2088810255 + 284768007 - 1860490832 - 733670592 + 1736067573 - 1122697529 + 1398437647 - 1547595454] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
