import com.google.gson.JsonArray;
import com.google.gson.JsonElement;
import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;
import java.util.ArrayList;
import java.util.Iterator;
import java.util.List;

public class Class_87 extends Class_271 {
   // $VF: renamed from: ud java.util.List
   public List field_926;
   // $VF: renamed from: ne java.util.List
   public List field_927;
   // $VF: renamed from: fvl java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_928 = new MethodHandle[76];

   public Class_87(String var1, String... var2) {
      super(var1);
      this.field_926 = 0<"JNT",-1342987797,"겍걱걭걵걉걝걑걝갽걁걩걍߭걝겅겉","琈吉䐊谉\ue40a谉㰈\uec0aᐊ䰊吊㰈吉䰊ᰊᐊ\udc08䰈吉䐊谉\ue40a谉㰈\uec0aᐊ䰊吊㰈吉䰊ᰊᐊ\udc08","ᤷᤰ᥋ᤰᤃ\u193c\u193dᤸᤵᤃᤎ\u1942ᤵᤵ\u192c\u192e\u193dᤸ\u1942\u1943\u193e",-1107207723>(
         (ArrayList)0<"JNT",-2002417928,"ޭ걝걱걝겉\u07b5","琈吉䐊谉\ue40a谉㰈\uec0aᐊ䰊吊㰈鰈㰊吊吊氊鰉ᐊ䰊㰊␊\udc08䰈\ue409","ᤷᤰ᥋ᤰᤃ\u193c\u193dᤸᤵᤃᤐ\u193f\u193fᤰ᥈ᤕᤸ\u193e\u193d",-1107207724>(
            0<"JNT",-1342987797,"갽겅߭걝겅겉","琈\udc09吉䐊谉\ue40a谉㰈吊谉␊簊㰈㰉萉䐊氊鰉ᐊ\udc08䰈吉䐊谉\ue40a谉㰈\uec0aᐊ䰊吊㰈吉䰊ᰊᐊ\udc08","ᤷᤰ᥋ᤰᤃ\u193c\u193dᤸᤵᤃᤐ\u193f\u193fᤰ᥈\u193e",-1107207721>(
               var2
            )
         )
      );
      this.field_927 = (ArrayList)0<"JNT",-2002417928,"ޭ걝걱걝겉\u07b5","琈吉䐊谉\ue40a谉㰈\uec0aᐊ䰊吊㰈鰈㰊吊吊氊鰉ᐊ䰊㰊␊\udc08䰈\ue409","ᤷᤰ᥋ᤰᤃ\u193c\u193dᤸᤵᤃᤐ\u193f\u193fᤰ᥈ᤕᤸ\u193e\u193d",-1107207701>(
         0<"JNT",-1342987797,"갽겅߭걝겅겉","琈\udc09吉䐊谉\ue40a谉㰈吊谉␊簊㰈㰉萉䐊氊鰉ᐊ\udc08䰈吉䐊谉\ue40a谉㰈\uec0aᐊ䰊吊㰈吉䰊ᰊᐊ\udc08","ᤷᤰ᥋ᤰᤃ\u193c\u193dᤸᤵᤃᤐ\u193f\u193fᤰ᥈\u193e",-1107207726>(
            var2
         )
      );
   }

   public Class_87(String var1, List var2) {
      super(var1);
      this.field_926 = 0<"JNT",-1342987797,"겍걱걭걵걉걝걑걝갽걁걩걍߭걝겅겉","琈吉䐊谉\ue40a谉㰈\uec0aᐊ䰊吊㰈吉䰊ᰊᐊ\udc08䰈吉䐊谉\ue40a谉㰈\uec0aᐊ䰊吊㰈吉䰊ᰊᐊ\udc08","ᤷᤰ᥋ᤰᤃ\u193c\u193dᤸᤵᤃᤎ\u1942ᤵᤵ\u192c\u192e\u193dᤸ\u1942\u1943\u193e",-1107207719>(
         (ArrayList)0<"JNT",-2002417928,"ޭ걝걱걝겉\u07b5","琈吉䐊谉\ue40a谉㰈\uec0aᐊ䰊吊㰈鰈㰊吊吊氊鰉ᐊ䰊㰊␊\udc08䰈\ue409","ᤷᤰ᥋ᤰᤃ\u193c\u193dᤸᤵᤃᤐ\u193f\u193fᤰ᥈ᤕᤸ\u193e\u193d",-1107207720>(
            var2
         )
      );
      this.field_927 = (ArrayList)0<"JNT",-2002417928,"ޭ걝걱걝겉\u07b5","琈吉䐊谉\ue40a谉㰈\uec0aᐊ䰊吊㰈鰈㰊吊吊氊鰉ᐊ䰊㰊␊\udc08䰈\ue409","ᤷᤰ᥋ᤰᤃ\u193c\u193dᤸᤵᤃᤐ\u193f\u193fᤰ᥈ᤕᤸ\u193e\u193d",-1107207722>(
         var2
      );
   }

   // $VF: renamed from: tz () java.util.List
   public List method_1038() {
      return 1<"JNT",558232615,"퓂틢","흊풊훊","㿕䟕忨俧ߧ꿧ߧ矕\ua7e7鿧䟧忧矕忨䟧韧鿧ퟕ",2892152>(this);
   }

   // $VF: renamed from: jk () java.util.List
   public List method_1039() {
      return (ArrayList)0<"JNT",-2002417928,"ޭ걝걱걝겉\u07b5","琈吉䐊谉\ue40a谉㰈\uec0aᐊ䰊吊㰈鰈㰊吊吊氊鰉ᐊ䰊㰊␊\udc08䰈\ue409","ᤷᤰ᥋ᤰᤃ\u193c\u193dᤸᤵᤃᤐ\u193f\u193fᤰ᥈ᤕᤸ\u193e\u193d",-1107207619>(
         1<"JNT",558232615,"팢틂","흊풊훊","㿕䟕忨俧ߧ꿧ߧ矕\ua7e7鿧䟧忧矕忨䟧韧鿧ퟕ",2892193>(this)
      );
   }

   // $VF: renamed from: ob (java.util.List) void
   public void method_1040(List var1) {
      1<"JNT",-1501210696,"팢틂","흊풊훊","㿕䟕忨俧ߧ꿧ߧ矕\ua7e7鿧䟧忧矕忨䟧韧鿧ퟕ",2892196>(
         this,
         (ArrayList)0<"JNT",-2002417928,"ޭ걝걱걝겉\u07b5","琈吉䐊谉\ue40a谉㰈\uec0aᐊ䰊吊㰈鰈㰊吊吊氊鰉ᐊ䰊㰊␊\udc08䰈\ue409","ᤷᤰ᥋ᤰᤃ\u193c\u193dᤸᤵᤃᤐ\u193f\u193fᤰ᥈ᤕᤸ\u193e\u193d",-1107207622>(
            var1
         )
      );
      0<"JNT",859727085,"걉갽걽","琈䰈\ue409","᤻\u1941\u192f",-1107207616>(this);
   }

   // $VF: renamed from: jd (java.lang.String) void
   public void method_1041(String var1) {
      if (!0<"JNT",910987547,"걅걵걱겉갽걝걱겅","琈吉䐊谉\ue40a谉㰈吊谉␊簊㰈㰉萉䐊氊鰉ᐊ\udc08䰈쐉","ᤷᤰ᥋ᤰᤃ\u193c\u193dᤸᤵᤃᤕᤸ\u193e\u193d",-1107207618>(
         1<"JNT",558232615,"팢틂","흊풊훊","㿕䟕忨俧ߧ꿧ߧ矕\ua7e7鿧䟧忧矕忨䟧韧鿧ퟕ",2892202>(this), var1
      )) {
         0<"JNT",910987547,"갽걉걉","琈吉䐊谉\ue40a谉㰈吊谉␊簊㰈㰉萉䐊氊鰉ᐊ\udc08䰈쐉","ᤷᤰ᥋ᤰᤃ\u193c\u193dᤸᤵᤃᤕᤸ\u193e\u193d",-1107207708>(
            1<"JNT",558232615,"팢틂","흊풊훊","㿕䟕忨俧ߧ꿧ߧ矕\ua7e7鿧䟧忧矕忨䟧韧鿧ퟕ",2892192>(this), var1
         );
         0<"JNT",859727085,"걉갽걽","琈䰈\ue409","᤻\u1941\u192f",-1107207707>(this);
      }
   }

   // $VF: renamed from: gz (java.lang.String) void
   public void method_1042(String var1) {
      0<"JNT",910987547,"겁걍걭걵겑걍","琈吉䐊谉\ue40a谉㰈吊谉␊簊㰈㰉萉䐊氊鰉ᐊ\udc08䰈쐉","ᤷᤰ᥋ᤰᤃ\u193c\u193dᤸᤵᤃᤕᤸ\u193e\u193d",-1107207685>(
         1<"JNT",558232615,"팢틂","흊풊훊","㿕䟕忨俧ߧ꿧ߧ矕\ua7e7鿧䟧忧矕忨䟧韧鿧ퟕ",2892191>(this), var1
      );
      0<"JNT",859727085,"걉갽걽","琈䰈\ue409","᤻\u1941\u192f",-1107207704>(this);
   }

   // $VF: renamed from: gbf (int) void
   public void method_1043(int var1) {
      if (var1 >= 0
         && var1
            < 0<"JNT",910987547,"겅걝겡걍","琈䰈䰉","ᤷᤰ᥋ᤰᤃ\u193c\u193dᤸᤵᤃᤕᤸ\u193e\u193d",-1107207706>(
               1<"JNT",558232615,"팢틂","흊풊훊","㿕䟕忨俧ߧ꿧ߧ矕\ua7e7鿧䟧忧矕忨䟧韧鿧ퟕ",2892178>(this)
            )) {
         0<"JNT",910987547,"겁걍걭걵겑걍","琈䰉䰈吉䐊谉\ue40a谉㰈吊谉␊簊㰈㰉萉䐊氊鰉ᐊ\udc08","ᤷᤰ᥋ᤰᤃ\u193c\u193dᤸᤵᤃᤕᤸ\u193e\u193d",-1107207796>(
            1<"JNT",558232615,"팢틂","흊풊훊","㿕䟕忨俧ߧ꿧ߧ矕\ua7e7鿧䟧忧矕忨䟧韧鿧ퟕ",2892200>(this), var1
         );
         0<"JNT",859727085,"걉갽걽","琈䰈\ue409","᤻\u1941\u192f",-1107207795>(this);
      }
   }

   // $VF: renamed from: bn (java.lang.String) boolean
   public boolean method_1044(String var1) {
      return 0<"JNT",910987547,"걅걵걱겉갽걝걱겅","琈吉䐊谉\ue40a谉㰈吊谉␊簊㰈㰉萉䐊氊鰉ᐊ\udc08䰈쐉","ᤷᤰ᥋ᤰᤃ\u193c\u193dᤸᤵᤃᤕᤸ\u193e\u193d",-1107207805>(
         1<"JNT",558232615,"팢틂","흊풊훊","㿕䟕忨俧ߧ꿧ߧ矕\ua7e7鿧䟧忧矕忨䟧韧鿧ퟕ",2892199>(this), var1
      );
   }

   // $VF: renamed from: fm () int
   public int method_1045() {
      return 0<"JNT",910987547,"겅걝겡걍","琈䰈䰉","ᤷᤰ᥋ᤰᤃ\u193c\u193dᤸᤵᤃᤕᤸ\u193e\u193d",-1107207791>(
         1<"JNT",558232615,"팢틂","흊풊훊","㿕䟕忨俧ߧ꿧ߧ矕\ua7e7鿧䟧忧矕忨䟧韧鿧ퟕ",2892173>(this)
      );
   }

   // $VF: renamed from: bo () void
   public void method_1046() {
      0<"JNT",910987547,"걅걩걍갽겁","琈䰈\ue409","ᤷᤰ᥋ᤰᤃ\u193c\u193dᤸᤵᤃᤕᤸ\u193e\u193d",-1107207945>(
         1<"JNT",558232615,"팢틂","흊풊훊","㿕䟕忨俧ߧ꿧ߧ矕\ua7e7鿧䟧忧矕忨䟧韧鿧ퟕ",2892179>(this)
      );
      0<"JNT",859727085,"걉갽걽","琈䰈\ue409","᤻\u1941\u192f",-1107207948>(this);
   }

   // $VF: renamed from: nt (int) java.lang.String
   public String method_1047(int var1) {
      return var1 >= 0
            && var1
               < 0<"JNT",910987547,"겅걝겡걍","琈䰈䰉","ᤷᤰ᥋ᤰᤃ\u193c\u193dᤸᤵᤃᤕᤸ\u193e\u193d",-1107207950>(
                  1<"JNT",558232615,"팢틂","흊풊훊","㿕䟕忨俧ߧ꿧ߧ矕\ua7e7鿧䟧忧矕忨䟧韧鿧ퟕ",2892182>(this)
               )
         ? (String)0<"JNT",910987547,"걕걍겉","琈䰉䰈吉䐊谉\ue40a谉㰈吊谉␊簊㰈㰉萉䐊氊鰉ᐊ\udc08","ᤷᤰ᥋ᤰᤃ\u193c\u193dᤸᤵᤃᤕᤸ\u193e\u193d",-1107207944>(
            1<"JNT",558232615,"팢틂","흊풊훊","㿕䟕忨俧ߧ꿧ߧ矕\ua7e7鿧䟧忧矕忨䟧韧鿧ퟕ",2892188>(this), var1
         )
         : null;
   }

   // $VF: renamed from: qir (int, java.lang.String) void
   public void method_1048(int var1, String var2) {
      if (var1 >= 0
         && var1
            < 0<"JNT",910987547,"겅걝겡걍","琈䰈䰉","ᤷᤰ᥋ᤰᤃ\u193c\u193dᤸᤵᤃᤕᤸ\u193e\u193d",-1107207946>(
               1<"JNT",558232615,"팢틂","흊풊훊","㿕䟕忨俧ߧ꿧ߧ矕\ua7e7鿧䟧忧矕忨䟧韧鿧ퟕ",2892482>(this)
            )) {
         0<"JNT",910987547,"겅걍겉","琈䰉吉䐊谉\ue40a谉㰈吊谉␊簊㰈㰉萉䐊氊鰉ᐊ\udc08䰈吉䐊谉\ue40a谉㰈吊谉␊簊㰈㰉萉䐊氊鰉ᐊ\udc08","ᤷᤰ᥋ᤰᤃ\u193c\u193dᤸᤵᤃᤕᤸ\u193e\u193d",-1107207716>(
            1<"JNT",558232615,"팢틂","흊풊훊","㿕䟕忨俧ߧ꿧ߧ矕\ua7e7鿧䟧忧矕忨䟧韧鿧ퟕ",2892184>(this), var1, var2
         );
         0<"JNT",859727085,"걉갽걽","琈䰈\ue409","᤻\u1941\u192f",-1107207715>(this);
      }
   }

   // $VF: renamed from: s () boolean
   @Override
   public boolean method_923() {
      return 0<"JNT",910987547,"걍걽겍갽걩겅","琈吉䐊谉\ue40a谉㰈吊谉␊簊㰈㰉萉䐊氊鰉ᐊ\udc08䰈쐉","ᤷᤰ᥋ᤰᤃ\u193c\u193dᤸᤵᤃᤕᤸ\u193e\u193d",-1107207712>(
         1<"JNT",558232615,"팢틂","흊풊훊","㿕䟕忨俧ߧ꿧ߧ矕\ua7e7鿧䟧忧矕忨䟧韧鿧ퟕ",2892183>(this), 1<"JNT",558232615,"퓂틢","흊풊훊","㿕䟕忨俧ߧ꿧ߧ矕\ua7e7鿧䟧忧矕忨䟧韧鿧ퟕ",2892484>(this)
      );
   }

   // $VF: renamed from: r () com.google.gson.JsonElement
   @Override
   public JsonElement method_924() {
      int var4 = -513561904;
      JsonArray var1 = (JsonArray)0<"JNT",-2002417928,"ޭ걝걱걝겉\u07b5","琈䰈\ue409","\u192e\u1942ᤴᤃ᤺\u1942\u1942᤺ᤵ\u192cᤃ᤺\u193e\u1942\u1943ᤃᤗ\u193e\u1942\u1943ᤐ\u193f\u193fᤰ᥈",-1107207804>();
      Iterator var2 = 0<"JNT",910987547,"걝겉걍겁갽겉걵겁","琈䰈吉䐊谉\ue40a谉㰈\uec0aᐊ䰊吊㰈䰉ᐊ氊Њ谉ᐊ㰊Њ\udc08","ᤷᤰ᥋ᤰᤃ\u193c\u193dᤸᤵᤃᤕᤸ\u193e\u193d",-1107207806>(
         1<"JNT",558232615,"팢틂","흊풊훊","㿕䟕忨俧ߧ꿧ߧ矕\ua7e7鿧䟧忧矕忨䟧韧鿧ퟕ",2892486>(this)
      );

      label22:
      while (true) {
         var4 = 425081208;

         while (true) {
            switch (((var4 ^ 1948904643) + 650098016 + 2115712776 ^ 352422416) + 953897063 + 1382903179) {
               case -1834744283:
                  if (0<"JNT",910987547,"걙갽겅ߵ걍겙겉","琈䰈쐉","ᤷᤰ᥋ᤰᤃ\u193c\u193dᤸᤵᤃᤘ\u193d\u192c\u193fᤰ\u193d\u1942\u193f",-1107207711>(var2)) {
                     String var3 = (String)0<"JNT",910987547,"걱걍겙겉","琈䰈吉䐊谉\ue40a谉㰈吊谉␊簊㰈㰉萉䐊氊鰉ᐊ\udc08","ᤷᤰ᥋ᤰᤃ\u193c\u193dᤸᤵᤃᤘ\u193d\u192c\u193fᤰ\u193d\u1942\u193f",-1107207714>(
                        var2
                     );
                     0<"JNT",859727085,"갽걉걉","琈吉䐊谉\ue40a谉㰈吊谉␊簊㰈ᰉᐊЊ䰊␊簊\udc08䰈\ue409","\u192e\u1942ᤴᤃ᤺\u1942\u1942᤺ᤵ\u192cᤃ᤺\u193e\u1942\u1943ᤃᤗ\u193e\u1942\u1943ᤐ\u193f\u193fᤰ᥈",-1107207801>(
                        var1, var3
                     );
                     continue label22;
                  }

                  var4 = -734071719;
                  break;
               case -583250684:
               default:
                  return var1;
            }
         }
      }
   }

   // $VF: renamed from: vz (com.google.gson.JsonElement) void
   @Override
   public void method_925(JsonElement var1) {
      int var5 = 2141083210;
      if (0<"JNT",859727085,"걝겅ߥ겅걵걱߁겁겁갽겝","琈䰈쐉","\u192e\u1942ᤴᤃ᤺\u1942\u1942᤺ᤵ\u192cᤃ᤺\u193e\u1942\u1943ᤃᤗ\u193e\u1942\u1943ᤌᤵ\u192cᤴ\u192c\u1943\u193d",-1107207638>(
         var1
      )) {
         JsonArray var2 = 0<"JNT",859727085,"걕걍겉߁겅ߥ겅걵걱߁겁겁갽겝","琈䰈吉鰉㰊Ⰺ㰈簊㰊㰊簊吊氊㰈簊ᰊ㰊␊㰈䐉ᰊ㰊␊谈ЊЊ谉찊\udc08","\u192e\u1942ᤴᤃ᤺\u1942\u1942᤺ᤵ\u192cᤃ᤺\u193e\u1942\u1943ᤃᤗ\u193e\u1942\u1943ᤌᤵ\u192cᤴ\u192c\u1943\u193d",-1107207645>(
            var1
         );
         0<"JNT",859727085,"걁걵","琈䰈\ue409","᤻\u1941\u192f",-1107207632>(this);
         Iterator var3 = 0<"JNT",859727085,"걝겉걍겁갽겉걵겁","琈䰈吉䐊谉\ue40a谉㰈\uec0aᐊ䰊吊㰈䰉ᐊ氊Њ谉ᐊ㰊Њ\udc08","\u192e\u1942ᤴᤃ᤺\u1942\u1942᤺ᤵ\u192cᤃ᤺\u193e\u1942\u1943ᤃᤗ\u193e\u1942\u1943ᤐ\u193f\u193fᤰ᥈",-1107207631>(
            var2
         );

         while (true) {
            var5 = (65795173 | 65795173 | -330906858) & -280044649;

            while (true) {
               switch (var5 + 1067382266 + 284369901 - 1267028910 + 292491490 - 932287045 - 338177767) {
                  case -1992695904:
                  default:
                     0<"JNT",859727085,"걉갽걽","琈䰈\ue409","᤻\u1941\u192f",-1107207781>(this);
                     return;
                  case -1173296890:
               }

               if (0<"JNT",910987547,"걙갽겅ߵ걍겙겉","琈䰈쐉","ᤷᤰ᥋ᤰᤃ\u193c\u193dᤸᤵᤃᤘ\u193d\u192c\u193fᤰ\u193d\u1942\u193f",-1107207800>(var3)) {
                  JsonElement var4 = (JsonElement)0<"JNT",910987547,"걱걍겙겉","琈䰈吉䐊谉\ue40a谉㰈吊谉␊簊㰈㰉萉䐊氊鰉ᐊ\udc08","ᤷᤰ᥋ᤰᤃ\u193c\u193dᤸᤵᤃᤘ\u193d\u192c\u193fᤰ\u193d\u1942\u193f",-1107207799>(
                     var3
                  );
                  if (0<"JNT",859727085,"걝겅ߥ겅걵걱߽겁걝걭걝겉걝겑걍","琈䰈쐉","\u192e\u1942ᤴᤃ᤺\u1942\u1942᤺ᤵ\u192cᤃ᤺\u193e\u1942\u1943ᤃᤗ\u193e\u1942\u1943ᤌᤵ\u192cᤴ\u192c\u1943\u193d",-1107207802>(
                     var4
                  )) {
                     0<"JNT",910987547,"갽걉걉","琈吉䐊谉\ue40a谉㰈吊谉␊簊㰈㰉萉䐊氊鰉ᐊ\udc08䰈쐉","ᤷᤰ᥋ᤰᤃ\u193c\u193dᤸᤵᤃᤕᤸ\u193e\u193d",-1107207635>(
                        1<"JNT",558232615,"팢틂","흊풊훊","㿕䟕忨俧ߧ꿧ߧ矕\ua7e7鿧䟧忧矕忨䟧韧鿧ퟕ",2892488>(this),
                        0<"JNT",859727085,"걕걍겉߁겅갅겉겁걝걱걕","琈䰈吉䐊谉\ue40a谉㰈吊谉␊簊㰈ᰉᐊЊ䰊␊簊\udc08","\u192e\u1942ᤴᤃ᤺\u1942\u1942᤺ᤵ\u192cᤃ᤺\u193e\u1942\u1943ᤃᤗ\u193e\u1942\u1943ᤌᤵ\u192cᤴ\u192c\u1943\u193d",-1107207636>(
                           var4
                        )
                     );
                  }
                  break;
               }

               var5 = -1099445839;
            }
         }
      }
   }

   // $VF: renamed from: l () void
   @Override
   public void method_926() {
      0<"JNT",859727085,"걵걁","琈吉䐊谉\ue40a谉㰈\uec0aᐊ䰊吊㰈吉䰊ᰊᐊ\udc08䰈\ue409","᤻\u1941\u192f",-1107207660>(
         this,
         (ArrayList)0<"JNT",-2002417928,"ޭ걝걱걝겉\u07b5","琈吉䐊谉\ue40a谉㰈\uec0aᐊ䰊吊㰈鰈㰊吊吊氊鰉ᐊ䰊㰊␊\udc08䰈\ue409","ᤷᤰ᥋ᤰᤃ\u193c\u193dᤸᤵᤃᤐ\u193f\u193fᤰ᥈ᤕᤸ\u193e\u193d",-1107207657>(
            1<"JNT",558232615,"퓂틢","흊풊훊","㿕䟕忨俧ߧ꿧ߧ矕\ua7e7鿧䟧忧矕忨䟧韧鿧ퟕ",2892467>(this)
         )
      );
   }

   // $VF: renamed from: lfc (java.lang.String) Class_87
   public Class_87 method_1049(String var1) {
      0<"JNT",1494487900,"걹","琈吉䐊谉\ue40a谉㰈吊谉␊簊㰈ᰉᐊЊ䰊␊簊\udc08䰈吉ఊ氊氊\udc08","᥀\u192c\u192c",-1107207659>(this, var1);
      return this;
   }

   // $VF: renamed from: hjo () Class_87
   public Class_87 method_1050() {
      0<"JNT",1494487900,"걝걁","琈䰈吉ఊ氊氊\udc08","᥀\u192c\u192c",-1107207662>(this);
      return this;
   }

   @Override
   public String toString() {
      int var10000 = (-1329108018 + -1329108018 | 0) & -1806620638;

      StringBuilder var10001;
      for (var10001 = (StringBuilder)0<"JNT",-2002417928,"ޭ걝걱걝겉\u07b5","琈吉䐊谉\ue40a谉㰈吊谉␊簊㰈ᰉᐊЊ䰊␊簊\udc08䰈\ue409","ᤷᤰ᥋ᤰᤃᤵᤰ\u1943᤺ᤃᤞ\u193d\u193fᤸ\u1943᤺ᤏ\u193cᤸᤵ\u192d\u192c\u193f",-1107207637>(
            "檠庠"
         );
         var10000 < 2;
         var10000 += (-833074606 + -833074606 | 1) & 38283539
      ) {
         int var3 = (0<"JNT",859727085,"걅걙갽겁߁겉","琈䰉䰈鰈","ᤷᤰ᥋ᤰᤃᤵᤰ\u1943᤺ᤃᤞ\u193d\u193fᤸ\u1943᤺ᤏ\u193cᤸᤵ\u192d\u192c\u193f",-1107207656>(var10001, var10000) ^ ';')
            - 156;
         int var10004 = (var3 & 65520) >> 4;
         int var4 = (var3 & 65520) >> 4 | var3 << 12;
         int var8 = (((var3 & 65520) >> 4 | var3 << 12) & 65520) >> 4;
         char var5 = (char)((((var10004 | var3 << 12) & 65520) >> 4 | ((var3 & 65520) >> 4 | var3 << 12) << 12) + 195);
         0<"JNT",859727085,"겅걍겉߉걙갽겁߁겉","琈䰉鰈䰈\ue409","ᤷᤰ᥋ᤰᤃᤵᤰ\u1943᤺ᤃᤞ\u193d\u193fᤸ\u1943᤺ᤏ\u193cᤸᤵ\u192d\u192c\u193f",-1107207655>(
            var10001, var10000, (char)((var8 | var4 << 12) + 195)
         );
      }

      return 0<"JNT",-1342987797,"걡걵걝걱","琈吉䐊谉\ue40a谉㰈吊谉␊簊㰈鰈琊谉Њᰉ氊ఊ\uec0a氊␊鰉氊\udc08吉䐊谉\ue40a谉㰈吊谉␊簊㰈䰉ᐊ氊Њ谉萉吊氊\udc08䰈吉䐊谉\ue40a谉㰈吊谉␊簊㰈ᰉᐊЊ䰊␊簊\udc08","ᤷᤰ᥋ᤰᤃᤵᤰ\u1943᤺ᤃᤞ\u193d\u193fᤸ\u1943᤺",-1107207812>(
         0<"JNT",859727085,"겉걵갅겉겁걝걱걕","琈䰈吉䐊谉\ue40a谉㰈吊谉␊簊㰈ᰉᐊЊ䰊␊簊\udc08","ᤷᤰ᥋ᤰᤃᤵᤰ\u1943᤺ᤃᤞ\u193d\u193fᤸ\u1943᤺ᤏ\u193cᤸᤵ\u192d\u192c\u193f",-1107207658>(var10001),
         1<"JNT",558232615,"팢틂","흊풊훊","㿕䟕忨俧ߧ꿧ߧ矕\ua7e7鿧䟧忧矕忨䟧韧鿧ퟕ",2892472>(this)
      );
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_937(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 + 1275462002 - 1209107300 + 1587480880 ^ 1783684375 ^ 1728252065) + 1187668593 ^ 793404056) + 1172631704 ^ 1836377132;
      MethodHandle var10000 = field_928[(
            ((var10 + 1275462002 - 1209107300 + 1587480880 ^ 1783684375 ^ 1728252065) + 1187668593 ^ 793404056) + 1172631704 ^ 1836377132
         )
         + 860618232];
      if (field_928[var10001 + 860618232] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = (339271413 * 1000555348 | 0) & 14977024; var23 < var13.length(); var23 += 505348004 - 750854081 ^ -245506078) {
            char var42 = var13.charAt(var23);
            char var49 = (char)(
               (
                     (
                              (
                                    (
                                             (
                                                      (
                                                            (
                                                                     (
                                                                           (
                                                                                    (
                                                                                          (
                                                                                                   (
                                                                                                         (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                                            | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                                      )
                                                                                                      & 63488
                                                                                                )
                                                                                                >> 11
                                                                                             | (
                                                                                                   (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                                      | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                                )
                                                                                                << 5
                                                                                       )
                                                                                       & 32768
                                                                                 )
                                                                                 >> 15
                                                                              | (
                                                                                    (
                                                                                             (
                                                                                                   (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                                      | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                                )
                                                                                                & 63488
                                                                                          )
                                                                                          >> 11
                                                                                       | (
                                                                                             (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                                | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                          )
                                                                                          << 5
                                                                                 )
                                                                                 << 1
                                                                        )
                                                                        & 49152
                                                                  )
                                                                  >> 14
                                                               | (
                                                                     (
                                                                              (
                                                                                    (
                                                                                             (
                                                                                                   (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                                      | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                                )
                                                                                                & 63488
                                                                                          )
                                                                                          >> 11
                                                                                       | (
                                                                                             (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                                | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                          )
                                                                                          << 5
                                                                                 )
                                                                                 & 32768
                                                                           )
                                                                           >> 15
                                                                        | (
                                                                              (
                                                                                       (
                                                                                             (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                                | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                          )
                                                                                          & 63488
                                                                                    )
                                                                                    >> 11
                                                                                 | (
                                                                                       (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                          | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                    )
                                                                                    << 5
                                                                           )
                                                                           << 1
                                                                  )
                                                                  << 2
                                                         )
                                                         & 61440
                                                   )
                                                   >> 12
                                                | (
                                                      (
                                                               (
                                                                     (
                                                                              (
                                                                                    (
                                                                                             (
                                                                                                   (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                                      | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                                )
                                                                                                & 63488
                                                                                          )
                                                                                          >> 11
                                                                                       | (
                                                                                             (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                                | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                          )
                                                                                          << 5
                                                                                 )
                                                                                 & 32768
                                                                           )
                                                                           >> 15
                                                                        | (
                                                                              (
                                                                                       (
                                                                                             (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                                | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                          )
                                                                                          & 63488
                                                                                    )
                                                                                    >> 11
                                                                                 | (
                                                                                       (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                          | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                    )
                                                                                    << 5
                                                                           )
                                                                           << 1
                                                                  )
                                                                  & 49152
                                                            )
                                                            >> 14
                                                         | (
                                                               (
                                                                        (
                                                                              (
                                                                                       (
                                                                                             (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                                | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                          )
                                                                                          & 63488
                                                                                    )
                                                                                    >> 11
                                                                                 | (
                                                                                       (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                          | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                    )
                                                                                    << 5
                                                                           )
                                                                           & 32768
                                                                     )
                                                                     >> 15
                                                                  | (
                                                                        (
                                                                                 (
                                                                                       (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                          | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                    )
                                                                                    & 63488
                                                                              )
                                                                              >> 11
                                                                           | (
                                                                                 (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                    | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                              )
                                                                              << 5
                                                                     )
                                                                     << 1
                                                            )
                                                            << 2
                                                   )
                                                   << 4
                                          )
                                          - 173
                                       ^ 41
                                 )
                                 & 65024
                           )
                           >> 9
                        | (
                              (
                                       (
                                                (
                                                      (
                                                               (
                                                                     (
                                                                              (
                                                                                    (
                                                                                             (
                                                                                                   (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                                      | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                                )
                                                                                                & 63488
                                                                                          )
                                                                                          >> 11
                                                                                       | (
                                                                                             (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                                | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                          )
                                                                                          << 5
                                                                                 )
                                                                                 & 32768
                                                                           )
                                                                           >> 15
                                                                        | (
                                                                              (
                                                                                       (
                                                                                             (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                                | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                          )
                                                                                          & 63488
                                                                                    )
                                                                                    >> 11
                                                                                 | (
                                                                                       (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                          | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                    )
                                                                                    << 5
                                                                           )
                                                                           << 1
                                                                  )
                                                                  & 49152
                                                            )
                                                            >> 14
                                                         | (
                                                               (
                                                                        (
                                                                              (
                                                                                       (
                                                                                             (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                                | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                          )
                                                                                          & 63488
                                                                                    )
                                                                                    >> 11
                                                                                 | (
                                                                                       (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                          | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                    )
                                                                                    << 5
                                                                           )
                                                                           & 32768
                                                                     )
                                                                     >> 15
                                                                  | (
                                                                        (
                                                                                 (
                                                                                       (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                          | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                    )
                                                                                    & 63488
                                                                              )
                                                                              >> 11
                                                                           | (
                                                                                 (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                    | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                              )
                                                                              << 5
                                                                     )
                                                                     << 1
                                                            )
                                                            << 2
                                                   )
                                                   & 61440
                                             )
                                             >> 12
                                          | (
                                                (
                                                         (
                                                               (
                                                                        (
                                                                              (
                                                                                       (
                                                                                             (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                                | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                          )
                                                                                          & 63488
                                                                                    )
                                                                                    >> 11
                                                                                 | (
                                                                                       (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                          | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                    )
                                                                                    << 5
                                                                           )
                                                                           & 32768
                                                                     )
                                                                     >> 15
                                                                  | (
                                                                        (
                                                                                 (
                                                                                       (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                          | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                    )
                                                                                    & 63488
                                                                              )
                                                                              >> 11
                                                                           | (
                                                                                 (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                    | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                              )
                                                                              << 5
                                                                     )
                                                                     << 1
                                                            )
                                                            & 49152
                                                      )
                                                      >> 14
                                                   | (
                                                         (
                                                                  (
                                                                        (
                                                                                 (
                                                                                       (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                          | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                    )
                                                                                    & 63488
                                                                              )
                                                                              >> 11
                                                                           | (
                                                                                 (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                    | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                              )
                                                                              << 5
                                                                     )
                                                                     & 32768
                                                               )
                                                               >> 15
                                                            | (
                                                                  (
                                                                           (
                                                                                 (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                    | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                              )
                                                                              & 63488
                                                                        )
                                                                        >> 11
                                                                     | (
                                                                           (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                              | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                        )
                                                                        << 5
                                                               )
                                                               << 1
                                                      )
                                                      << 2
                                             )
                                             << 4
                                    )
                                    - 173
                                 ^ 41
                           )
                           << 7
                  )
                  + 82
            );
            var13.setCharAt(
               var23,
               (char)(
                  (
                        (
                                 (
                                       (
                                                (
                                                         (
                                                               (
                                                                        (
                                                                              (
                                                                                       (
                                                                                             (
                                                                                                      (
                                                                                                            (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                                               | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                                         )
                                                                                                         & 63488
                                                                                                   )
                                                                                                   >> 11
                                                                                                | (
                                                                                                      (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                                         | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                                   )
                                                                                                   << 5
                                                                                          )
                                                                                          & 32768
                                                                                    )
                                                                                    >> 15
                                                                                 | (
                                                                                       (
                                                                                                (
                                                                                                      (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                                         | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                                   )
                                                                                                   & 63488
                                                                                             )
                                                                                             >> 11
                                                                                          | (
                                                                                                (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                                   | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                             )
                                                                                             << 5
                                                                                    )
                                                                                    << 1
                                                                           )
                                                                           & 49152
                                                                     )
                                                                     >> 14
                                                                  | (
                                                                        (
                                                                                 (
                                                                                       (
                                                                                                (
                                                                                                      (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                                         | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                                   )
                                                                                                   & 63488
                                                                                             )
                                                                                             >> 11
                                                                                          | (
                                                                                                (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                                   | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                             )
                                                                                             << 5
                                                                                    )
                                                                                    & 32768
                                                                              )
                                                                              >> 15
                                                                           | (
                                                                                 (
                                                                                          (
                                                                                                (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                                   | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                             )
                                                                                             & 63488
                                                                                       )
                                                                                       >> 11
                                                                                    | (
                                                                                          (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                             | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                       )
                                                                                       << 5
                                                                              )
                                                                              << 1
                                                                     )
                                                                     << 2
                                                            )
                                                            & 61440
                                                      )
                                                      >> 12
                                                   | (
                                                         (
                                                                  (
                                                                        (
                                                                                 (
                                                                                       (
                                                                                                (
                                                                                                      (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                                         | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                                   )
                                                                                                   & 63488
                                                                                             )
                                                                                             >> 11
                                                                                          | (
                                                                                                (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                                   | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                             )
                                                                                             << 5
                                                                                    )
                                                                                    & 32768
                                                                              )
                                                                              >> 15
                                                                           | (
                                                                                 (
                                                                                          (
                                                                                                (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                                   | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                             )
                                                                                             & 63488
                                                                                       )
                                                                                       >> 11
                                                                                    | (
                                                                                          (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                             | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                       )
                                                                                       << 5
                                                                              )
                                                                              << 1
                                                                     )
                                                                     & 49152
                                                               )
                                                               >> 14
                                                            | (
                                                                  (
                                                                           (
                                                                                 (
                                                                                          (
                                                                                                (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                                   | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                             )
                                                                                             & 63488
                                                                                       )
                                                                                       >> 11
                                                                                    | (
                                                                                          (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                             | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                       )
                                                                                       << 5
                                                                              )
                                                                              & 32768
                                                                        )
                                                                        >> 15
                                                                     | (
                                                                           (
                                                                                    (
                                                                                          (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                             | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                       )
                                                                                       & 63488
                                                                                 )
                                                                                 >> 11
                                                                              | (
                                                                                    (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                       | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                 )
                                                                                 << 5
                                                                        )
                                                                        << 1
                                                               )
                                                               << 2
                                                      )
                                                      << 4
                                             )
                                             - 173
                                          ^ 41
                                    )
                                    & 65024
                              )
                              >> 9
                           | (
                                 (
                                          (
                                                   (
                                                         (
                                                                  (
                                                                        (
                                                                                 (
                                                                                       (
                                                                                                (
                                                                                                      (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                                         | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                                   )
                                                                                                   & 63488
                                                                                             )
                                                                                             >> 11
                                                                                          | (
                                                                                                (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                                   | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                             )
                                                                                             << 5
                                                                                    )
                                                                                    & 32768
                                                                              )
                                                                              >> 15
                                                                           | (
                                                                                 (
                                                                                          (
                                                                                                (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                                   | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                             )
                                                                                             & 63488
                                                                                       )
                                                                                       >> 11
                                                                                    | (
                                                                                          (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                             | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                       )
                                                                                       << 5
                                                                              )
                                                                              << 1
                                                                     )
                                                                     & 49152
                                                               )
                                                               >> 14
                                                            | (
                                                                  (
                                                                           (
                                                                                 (
                                                                                          (
                                                                                                (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                                   | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                             )
                                                                                             & 63488
                                                                                       )
                                                                                       >> 11
                                                                                    | (
                                                                                          (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                             | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                       )
                                                                                       << 5
                                                                              )
                                                                              & 32768
                                                                        )
                                                                        >> 15
                                                                     | (
                                                                           (
                                                                                    (
                                                                                          (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                             | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                       )
                                                                                       & 63488
                                                                                 )
                                                                                 >> 11
                                                                              | (
                                                                                    (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                       | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                 )
                                                                                 << 5
                                                                        )
                                                                        << 1
                                                               )
                                                               << 2
                                                      )
                                                      & 61440
                                                )
                                                >> 12
                                             | (
                                                   (
                                                            (
                                                                  (
                                                                           (
                                                                                 (
                                                                                          (
                                                                                                (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                                   | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                             )
                                                                                             & 63488
                                                                                       )
                                                                                       >> 11
                                                                                    | (
                                                                                          (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                             | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                       )
                                                                                       << 5
                                                                              )
                                                                              & 32768
                                                                        )
                                                                        >> 15
                                                                     | (
                                                                           (
                                                                                    (
                                                                                          (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                             | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                       )
                                                                                       & 63488
                                                                                 )
                                                                                 >> 11
                                                                              | (
                                                                                    (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                       | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                 )
                                                                                 << 5
                                                                        )
                                                                        << 1
                                                               )
                                                               & 49152
                                                         )
                                                         >> 14
                                                      | (
                                                            (
                                                                     (
                                                                           (
                                                                                    (
                                                                                          (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                             | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                       )
                                                                                       & 63488
                                                                                 )
                                                                                 >> 11
                                                                              | (
                                                                                    (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                       | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                 )
                                                                                 << 5
                                                                        )
                                                                        & 32768
                                                                  )
                                                                  >> 15
                                                               | (
                                                                     (
                                                                              (
                                                                                    (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                       | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                                 )
                                                                                 & 63488
                                                                           )
                                                                           >> 11
                                                                        | (
                                                                              (((var42 & 0) >> 16 | var42 << 0) & 65504) >> 5
                                                                                 | ((var42 & 0) >> 16 | var42 << 0) << 11
                                                                           )
                                                                           << 5
                                                                  )
                                                                  << 1
                                                         )
                                                         << 2
                                                )
                                                << 4
                                       )
                                       - 173
                                    ^ 41
                              )
                              << 7
                     )
                     + 82
               )
            );
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = (1887508455 >>> -1041044884 | 0) & 2122375494; var29 < var16.length(); var29 += -633747385 & -633747385 ^ -633747386) {
            int var54 = var16.charAt(var29) - 26 - 3;
            char var57 = (char)(
               (
                        (((((var54 & 65534) >> 1 | var54 << 15) + 184 + 83 & 65472) >> 6 | ((var54 & 65534) >> 1 | var54 << 15) + 184 + 83 << 10) ^ 217)
                              + 80
                              - 5
                           & 65520
                     )
                     >> 4
                  | (((((var54 & 65534) >> 1 | var54 << 15) + 184 + 83 & 65472) >> 6 | ((var54 & 65534) >> 1 | var54 << 15) + 184 + 83 << 10) ^ 217) + 80 - 5
                     << 12
            );
            var16.setCharAt(
               var29,
               (char)(
                  (
                           (((((var54 & 65534) >> 1 | var54 << 15) + 184 + 83 & 65472) >> 6 | ((var54 & 65534) >> 1 | var54 << 15) + 184 + 83 << 10) ^ 217)
                                 + 80
                                 - 5
                              & 65520
                        )
                        >> 4
                     | (((((var54 & 65534) >> 1 | var54 << 15) + 184 + 83 & 65472) >> 6 | ((var54 & 65534) >> 1 | var54 << 15) + 184 + 83 << 10) ^ 217)
                           + 80
                           - 5
                        << 12
               )
            );
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_87.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = -815141014 + -1250862432 ^ -2066003446; var35 < var19.length(); var35 += (962588845 - 1403151967 | 1) & 171996305) {
            char var62 = var19.charAt(var35);
            char var67 = (char)(
               (
                        (
                              (
                                       (
                                                (
                                                         (
                                                                  (
                                                                        (
                                                                                 (((var62 & '\uf000') >> 12 | var62 << 4) & 32768) >> 15
                                                                                    | ((var62 & '\uf000') >> 12 | var62 << 4) << 1
                                                                              )
                                                                              + 129
                                                                           ^ 230
                                                                     )
                                                                     & 65504
                                                               )
                                                               >> 5
                                                            | (
                                                                  (
                                                                           (((var62 & '\uf000') >> 12 | var62 << 4) & 32768) >> 15
                                                                              | ((var62 & '\uf000') >> 12 | var62 << 4) << 1
                                                                        )
                                                                        + 129
                                                                     ^ 230
                                                               )
                                                               << 11
                                                      )
                                                      - 210
                                                   & 65472
                                             )
                                             >> 6
                                          | (
                                                   (
                                                            (
                                                                  (
                                                                           (((var62 & '\uf000') >> 12 | var62 << 4) & 32768) >> 15
                                                                              | ((var62 & '\uf000') >> 12 | var62 << 4) << 1
                                                                        )
                                                                        + 129
                                                                     ^ 230
                                                               )
                                                               & 65504
                                                         )
                                                         >> 5
                                                      | (
                                                            (
                                                                     (((var62 & '\uf000') >> 12 | var62 << 4) & 32768) >> 15
                                                                        | ((var62 & '\uf000') >> 12 | var62 << 4) << 1
                                                                  )
                                                                  + 129
                                                               ^ 230
                                                         )
                                                         << 11
                                                )
                                                - 210
                                             << 10
                                    )
                                    + 184
                                 ^ 248
                           )
                           & 64512
                     )
                     >> 10
                  | (
                        (
                                 (
                                          (
                                                   (
                                                            (
                                                                  (
                                                                           (((var62 & '\uf000') >> 12 | var62 << 4) & 32768) >> 15
                                                                              | ((var62 & '\uf000') >> 12 | var62 << 4) << 1
                                                                        )
                                                                        + 129
                                                                     ^ 230
                                                               )
                                                               & 65504
                                                         )
                                                         >> 5
                                                      | (
                                                            (
                                                                     (((var62 & '\uf000') >> 12 | var62 << 4) & 32768) >> 15
                                                                        | ((var62 & '\uf000') >> 12 | var62 << 4) << 1
                                                                  )
                                                                  + 129
                                                               ^ 230
                                                         )
                                                         << 11
                                                )
                                                - 210
                                             & 65472
                                       )
                                       >> 6
                                    | (
                                             (
                                                      (
                                                            (
                                                                     (((var62 & '\uf000') >> 12 | var62 << 4) & 32768) >> 15
                                                                        | ((var62 & '\uf000') >> 12 | var62 << 4) << 1
                                                                  )
                                                                  + 129
                                                               ^ 230
                                                         )
                                                         & 65504
                                                   )
                                                   >> 5
                                                | (
                                                      ((((var62 & '\uf000') >> 12 | var62 << 4) & 32768) >> 15 | ((var62 & '\uf000') >> 12 | var62 << 4) << 1)
                                                            + 129
                                                         ^ 230
                                                   )
                                                   << 11
                                          )
                                          - 210
                                       << 10
                              )
                              + 184
                           ^ 248
                     )
                     << 6
            );
            var19.setCharAt(
               var35,
               (char)(
                  (
                           (
                                 (
                                          (
                                                   (
                                                            (
                                                                     (
                                                                           (
                                                                                    (((var62 & '\uf000') >> 12 | var62 << 4) & 32768) >> 15
                                                                                       | ((var62 & '\uf000') >> 12 | var62 << 4) << 1
                                                                                 )
                                                                                 + 129
                                                                              ^ 230
                                                                        )
                                                                        & 65504
                                                                  )
                                                                  >> 5
                                                               | (
                                                                     (
                                                                              (((var62 & '\uf000') >> 12 | var62 << 4) & 32768) >> 15
                                                                                 | ((var62 & '\uf000') >> 12 | var62 << 4) << 1
                                                                           )
                                                                           + 129
                                                                        ^ 230
                                                                  )
                                                                  << 11
                                                         )
                                                         - 210
                                                      & 65472
                                                )
                                                >> 6
                                             | (
                                                      (
                                                               (
                                                                     (
                                                                              (((var62 & '\uf000') >> 12 | var62 << 4) & 32768) >> 15
                                                                                 | ((var62 & '\uf000') >> 12 | var62 << 4) << 1
                                                                           )
                                                                           + 129
                                                                        ^ 230
                                                                  )
                                                                  & 65504
                                                            )
                                                            >> 5
                                                         | (
                                                               (
                                                                        (((var62 & '\uf000') >> 12 | var62 << 4) & 32768) >> 15
                                                                           | ((var62 & '\uf000') >> 12 | var62 << 4) << 1
                                                                     )
                                                                     + 129
                                                                  ^ 230
                                                            )
                                                            << 11
                                                   )
                                                   - 210
                                                << 10
                                       )
                                       + 184
                                    ^ 248
                              )
                              & 64512
                        )
                        >> 10
                     | (
                           (
                                    (
                                             (
                                                      (
                                                               (
                                                                     (
                                                                              (((var62 & '\uf000') >> 12 | var62 << 4) & 32768) >> 15
                                                                                 | ((var62 & '\uf000') >> 12 | var62 << 4) << 1
                                                                           )
                                                                           + 129
                                                                        ^ 230
                                                                  )
                                                                  & 65504
                                                            )
                                                            >> 5
                                                         | (
                                                               (
                                                                        (((var62 & '\uf000') >> 12 | var62 << 4) & 32768) >> 15
                                                                           | ((var62 & '\uf000') >> 12 | var62 << 4) << 1
                                                                     )
                                                                     + 129
                                                                  ^ 230
                                                            )
                                                            << 11
                                                   )
                                                   - 210
                                                & 65472
                                          )
                                          >> 6
                                       | (
                                                (
                                                         (
                                                               (
                                                                        (((var62 & '\uf000') >> 12 | var62 << 4) & 32768) >> 15
                                                                           | ((var62 & '\uf000') >> 12 | var62 << 4) << 1
                                                                     )
                                                                     + 129
                                                                  ^ 230
                                                            )
                                                            & 65504
                                                      )
                                                      >> 5
                                                   | (
                                                         (
                                                                  (((var62 & '\uf000') >> 12 | var62 << 4) & 32768) >> 15
                                                                     | ((var62 & '\uf000') >> 12 | var62 << 4) << 1
                                                               )
                                                               + 129
                                                            ^ 230
                                                      )
                                                      << 11
                                             )
                                             - 210
                                          << 10
                                 )
                                 + 184
                              ^ 248
                        )
                        << 6
               )
            );
         }

         Class var7 = Class.forName(var19.toString(), false, Class_87.class.getClassLoader());
         switch (((var4 - 2022964922 - 963873630 ^ 1915083943) - 1177575119 ^ 2068611961) - 1461749033 + 1452897022 + 1750625207 - 746377391 ^ 2072970734) {
            case 363167063:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            case 445697840:
               var10000 = var0.findConstructor(var7, var6);
               break;
            case 1250424996:
               var10000 = var0.findSpecial(var7, var5, var6, Class_87.class);
               break;
            case 1754114137:
            case 2103348583:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_928[(((var10 + 1275462002 - 1209107300 + 1587480880 ^ 1783684375 ^ 1728252065) + 1187668593 ^ 793404056) + 1172631704 ^ 1836377132) + 860618232] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_938(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = (((var10 - 823184585 + 765124764 ^ 1859871594) + 147948645 - 532001031 ^ 1754593282) + 1091372107 ^ 441685246) + 1725652804;
      MethodHandle var10000 = field_928[(((var10 - 823184585 + 765124764 ^ 1859871594) + 147948645 - 532001031 ^ 1754593282) + 1091372107 ^ 441685246)
         + 1725652804
         + 1252745102];
      if (field_928[var10001 + 1252745102] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = (-2087782378 ^ 749679314 & -2126812432 | 0) & 1213203497; var24 < var14.length(); var24 += -1923196935 - -2128778403 ^ 205581469) {
            int var43 = var14.charAt(var24) ^ '}';
            int var10004 = (var43 & 65408) >> 7;
            int var44 = ((var43 & 65408) >> 7 | var43 << 9) + 20;
            int var84 = (((var43 & 65408) >> 7 | var43 << 9) + 20 & 49152) >> 14;
            var43 = (((var10004 | var43 << 9) + 20 & 49152) >> 14 | ((var43 & 65408) >> 7 | var43 << 9) + 20 << 2) + 89 + 46;
            var10004 = ((var84 | var44 << 2) + 89 + 46 & 64512) >> 10;
            int var46 = ((var84 | var44 << 2) + 89 + 46 & 64512) >> 10 | var43 << 6;
            int var86 = ((((var84 | var44 << 2) + 89 + 46 & 64512) >> 10 | var43 << 6) & 65472) >> 6;
            char var47 = (char)((((var10004 | var43 << 6) & 65472) >> 6 | (((var84 | var44 << 2) + 89 + 46 & 64512) >> 10 | var43 << 6) << 10) + 215 ^ 38);
            var14.setCharAt(var24, (char)((var86 | var46 << 10) + 215 ^ 38));
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = 1057833152 - (-1997877434 ^ (1057833152 | -1997877434)) ^ 134758464;
            var30 < var17.length();
            var30 += (-1342760554 << -1342760554 | 1) & -1708576241
         ) {
            int var52 = var17.charAt(var30) + 'e';
            char var57 = (char)(
               (
                     (
                              (
                                    (
                                          (
                                                   (
                                                         (
                                                                  ((((var52 & 65504) >> 5 | var52 << 11) & 0) >> 16 | ((var52 & 65504) >> 5 | var52 << 11) << 0)
                                                                        + 251
                                                                        + 166
                                                                     & 57344
                                                               )
                                                               >> 13
                                                            | ((((var52 & 65504) >> 5 | var52 << 11) & 0) >> 16 | ((var52 & 65504) >> 5 | var52 << 11) << 0)
                                                                  + 251
                                                                  + 166
                                                               << 3
                                                      )
                                                      & 65532
                                                )
                                                >> 2
                                             | (
                                                   (
                                                            ((((var52 & 65504) >> 5 | var52 << 11) & 0) >> 16 | ((var52 & 65504) >> 5 | var52 << 11) << 0)
                                                                  + 251
                                                                  + 166
                                                               & 57344
                                                         )
                                                         >> 13
                                                      | ((((var52 & 65504) >> 5 | var52 << 11) & 0) >> 16 | ((var52 & 65504) >> 5 | var52 << 11) << 0)
                                                            + 251
                                                            + 166
                                                         << 3
                                                )
                                                << 14
                                       )
                                       ^ 21
                                 )
                                 & 65534
                           )
                           >> 1
                        | (
                              (
                                    (
                                             (
                                                   (
                                                            ((((var52 & 65504) >> 5 | var52 << 11) & 0) >> 16 | ((var52 & 65504) >> 5 | var52 << 11) << 0)
                                                                  + 251
                                                                  + 166
                                                               & 57344
                                                         )
                                                         >> 13
                                                      | ((((var52 & 65504) >> 5 | var52 << 11) & 0) >> 16 | ((var52 & 65504) >> 5 | var52 << 11) << 0)
                                                            + 251
                                                            + 166
                                                         << 3
                                                )
                                                & 65532
                                          )
                                          >> 2
                                       | (
                                             (
                                                      ((((var52 & 65504) >> 5 | var52 << 11) & 0) >> 16 | ((var52 & 65504) >> 5 | var52 << 11) << 0)
                                                            + 251
                                                            + 166
                                                         & 57344
                                                   )
                                                   >> 13
                                                | ((((var52 & 65504) >> 5 | var52 << 11) & 0) >> 16 | ((var52 & 65504) >> 5 | var52 << 11) << 0) + 251 + 166
                                                   << 3
                                          )
                                          << 14
                                 )
                                 ^ 21
                           )
                           << 15
                  )
                  ^ 50
            );
            var17.setCharAt(
               var30,
               (char)(
                  (
                        (
                                 (
                                       (
                                             (
                                                      (
                                                            (
                                                                     (
                                                                              (((var52 & 65504) >> 5 | var52 << 11) & 0) >> 16
                                                                                 | ((var52 & 65504) >> 5 | var52 << 11) << 0
                                                                           )
                                                                           + 251
                                                                           + 166
                                                                        & 57344
                                                                  )
                                                                  >> 13
                                                               | ((((var52 & 65504) >> 5 | var52 << 11) & 0) >> 16 | ((var52 & 65504) >> 5 | var52 << 11) << 0)
                                                                     + 251
                                                                     + 166
                                                                  << 3
                                                         )
                                                         & 65532
                                                   )
                                                   >> 2
                                                | (
                                                      (
                                                               ((((var52 & 65504) >> 5 | var52 << 11) & 0) >> 16 | ((var52 & 65504) >> 5 | var52 << 11) << 0)
                                                                     + 251
                                                                     + 166
                                                                  & 57344
                                                            )
                                                            >> 13
                                                         | ((((var52 & 65504) >> 5 | var52 << 11) & 0) >> 16 | ((var52 & 65504) >> 5 | var52 << 11) << 0)
                                                               + 251
                                                               + 166
                                                            << 3
                                                   )
                                                   << 14
                                          )
                                          ^ 21
                                    )
                                    & 65534
                              )
                              >> 1
                           | (
                                 (
                                       (
                                                (
                                                      (
                                                               ((((var52 & 65504) >> 5 | var52 << 11) & 0) >> 16 | ((var52 & 65504) >> 5 | var52 << 11) << 0)
                                                                     + 251
                                                                     + 166
                                                                  & 57344
                                                            )
                                                            >> 13
                                                         | ((((var52 & 65504) >> 5 | var52 << 11) & 0) >> 16 | ((var52 & 65504) >> 5 | var52 << 11) << 0)
                                                               + 251
                                                               + 166
                                                            << 3
                                                   )
                                                   & 65532
                                             )
                                             >> 2
                                          | (
                                                (
                                                         ((((var52 & 65504) >> 5 | var52 << 11) & 0) >> 16 | ((var52 & 65504) >> 5 | var52 << 11) << 0)
                                                               + 251
                                                               + 166
                                                            & 57344
                                                      )
                                                      >> 13
                                                   | ((((var52 & 65504) >> 5 | var52 << 11) & 0) >> 16 | ((var52 & 65504) >> 5 | var52 << 11) << 0) + 251 + 166
                                                      << 3
                                             )
                                             << 14
                                    )
                                    ^ 21
                              )
                              << 15
                     )
                     ^ 50
               )
            );
         }

         Class var6 = Class.forName(var17.toString(), false, Class_87.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = (219523168 + 890638135 | 0) & 1007943688; var36 < var20.length(); var36 += (-1690420061 + -1690420061 | 1) & 1082228873) {
            int var62 = (var20.charAt(var36) - 'V' + 151 ^ 201) + 22 - 240;
            int var92 = (var62 & 65534) >> 1;
            int var63 = ((var62 & 65534) >> 1 | var62 << 15) - 250 + 54 + 194;
            int var93 = (((var62 & 65534) >> 1 | var62 << 15) - 250 + 54 + 194 & 64512) >> 10;
            char var64 = (char)(((var92 | var62 << 15) - 250 + 54 + 194 & 64512) >> 10 | ((var62 & 65534) >> 1 | var62 << 15) - 250 + 54 + 194 << 6);
            var20.setCharAt(var36, (char)(var93 | var63 << 6));
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_87.class.getClassLoader()).returnType();
         switch (((var4 + 1369709595 - 1857424985 - 568575719 + 1724848422 ^ 1989688312) - 487116726 ^ 1903744898 ^ 804828298) - 2100342278 + 407953712) {
            case 404682300:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            case 997307090:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            case 1477055714:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            case 1616777901:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_928[(((var10 - 823184585 + 765124764 ^ 1859871594) + 147948645 - 532001031 ^ 1754593282) + 1091372107 ^ 441685246) + 1725652804 + 1252745102] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
