import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;

public enum Class_267 {
   // $VF: renamed from: slo Class_267
   field_1078,
   // $VF: renamed from: zdr Class_267
   field_1079,
   // $VF: renamed from: xoj Class_267
   field_1080,
   // $VF: renamed from: npv Class_267
   field_1081;

   // $VF: renamed from: oil java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_1083 = new MethodHandle[27];

   // $VF: Failed to inline enum fields
   // Please report this to the Vineflower issue tracker, at https://github.com/Vineflower/vineflower/issues with a copy of the class file (if you have the rights to distribute it!)
   static {
      int var10000 = 0;

      StringBuilder var10001;
      for (var10001 = (StringBuilder)0<"JNT",-84380584,"㰄ꐅ찅ꐅﰅ䰄","ﾧ﹗ﻟﺃﻯﺃￋﻗﺃﻏﺫￋﹻﻷ\ufeffﺣﻏﺫ\ufe1bﾣ\ufe6f","꺓넓뢓넓첓ꮓ넓겓뀓첓ꨓ랓몓괓겓뀓ꊓ뜓괓ꮓ꾓꼓몓",-1791987734>("Ô胔胔Þ胟Ð胖Ü胔");
         var10000 < ((730271969 & 730271969 | 8) & -2141140979);
         var10000 += 1163443091 >>> (1713523060 ^ 1163443091 ^ 1713523060) ^ 2218
      ) {
         int var14 = 0<"JNT",-23575512,"琅鰅搅\uec05搄ﰅ","ﾧ︣ﾣ︻","꺓넓뢓넓첓ꮓ넓겓뀓첓ꨓ랓몓괓겓뀓ꊓ뜓괓ꮓ꾓꼓몓",-1791987718>(var10001, var10000) ^ '[' ^ 239;
         char var15 = (char)(((var14 & 32768) >> 15 | var14 << 1) ^ 247 ^ 115);
         0<"JNT",-23575512,"\uf405萅ﰅ琄鰅搅\uec05搄ﰅ","ﾧ︣︻ﾣ\ufe6f","꺓넓뢓넓첓ꮓ넓겓뀓첓ꨓ랓몓괓겓뀓ꊓ뜓괓ꮓ꾓꼓몓",-1791987719>(
            var10001, var10000, (char)(((var14 & 32768) >> 15 | var14 << 1) ^ 247 ^ 115)
         );
      }

      field_1078 = (Class_267)0<"JNT",-84380584,"㰄ꐅ찅ꐅﰅ䰄","ﾧ﹗ﻟﺃﻯﺃￋﻗﺃﻏﺫￋﹻﻷ\ufeffﺣﻏﺫ\ufe1b︣ﾣ\ufe6f","뤓넓",-1791987720>(
         0<"JNT",-23575512,"ﰅ퐅\uf404ﰅ\uec05ꐅ찅鐅","ﾧﾣ﹗ﻟﺃﻯﺃￋﻗﺃﻏﺫￋﹻﻷ\ufeffﺣﻏﺫ\ufe1b","꺓넓뢓넓첓ꮓ넓겓뀓첓ꨓ랓몓괓겓뀓ꊓ뜓괓ꮓ꾓꼓몓",-1791987715>(var10001), 0
      );
      var10000 = 490849923 >>> -779815378 ^ 29959;

      for (var10001 = (StringBuilder)0<"JNT",-84380584,"㰄ꐅ찅ꐅﰅ䰄","ﾧ﹗ﻟﺃﻯﺃￋﻗﺃﻏﺫￋﹻﻷ\ufeffﺣﻏﺫ\ufe1bﾣ\ufe6f","꺓넓뢓넓첓ꮓ넓겓뀓첓ꨓ랓몓괓겓뀓ꊓ뜓괓ꮓ꾓꼓몓",-1791987713>(
            "\u001f\u001a\u0011,\u0011 !\n!  \u001d\u001e\u0019,\u0011 "
         );
         var10000 < (2099642233 * 1145809372 ^ -1631490835);
         var10000 += -1929329901 & -1929329901 ^ -1929329902
      ) {
         int var18 = 0<"JNT",-23575512,"琅鰅搅\uec05搄ﰅ","ﾧ︣ﾣ︻","꺓넓뢓넓첓ꮓ넓겓뀓첓ꨓ랓몓괓겓뀓ꊓ뜓괓ꮓ꾓꼓몓",-1791987743>(var10001, var10000) ^ ';';
         char var19 = (char)(((var18 & 65535) >> 0 | var18 << 16) - 83 + 191 ^ 194);
         0<"JNT",-23575512,"\uf405萅ﰅ琄鰅搅\uec05搄ﰅ","ﾧ︣︻ﾣ\ufe6f","꺓넓뢓넓첓ꮓ넓겓뀓첓ꨓ랓몓괓겓뀓ꊓ뜓괓ꮓ꾓꼓몓",-1791987748>(
            var10001, var10000, (char)(((var18 & 65535) >> 0 | var18 << 16) - 83 + 191 ^ 194)
         );
      }

      field_1079 = (Class_267)0<"JNT",-84380584,"㰄ꐅ찅ꐅﰅ䰄","ﾧ﹗ﻟﺃﻯﺃￋﻗﺃﻏﺫￋﹻﻷ\ufeffﺣﻏﺫ\ufe1b︣ﾣ\ufe6f","뤓넓",-1791987740>(
         0<"JNT",-23575512,"ﰅ퐅\uf404ﰅ\uec05ꐅ찅鐅","ﾧﾣ﹗ﻟﺃﻯﺃￋﻗﺃﻏﺫￋﹻﻷ\ufeffﺣﻏﺫ\ufe1b","꺓넓뢓넓첓ꮓ넓겓뀓첓ꨓ랓몓괓겓뀓ꊓ뜓괓ꮓ꾓꼓몓",-1791987735>(var10001), 1
      );
      var10000 = (-326276582 >> 1125598693 | 0) & 33920;

      for (var10001 = (StringBuilder)0<"JNT",-84380584,"㰄ꐅ찅ꐅﰅ䰄","ﾧ﹗ﻟﺃﻯﺃￋﻗﺃﻏﺫￋﹻﻷ\ufeffﺣﻏﺫ\ufe1bﾣ\ufe6f","꺓넓뢓넓첓ꮓ넓겓뀓첓ꨓ랓몓괓겓뀓ꊓ뜓괓ꮓ꾓꼓몓",-1791987733>("阉⸉嘉ฉ");
         var10000 < (-1902588583 & 1381238820 ^ 34605060);
         var10000 += (-1104280996 + -1104280996 | 1) & -2120052731
      ) {
         int var22 = 0<"JNT",-23575512,"琅鰅搅\uec05搄ﰅ","ﾧ︣ﾣ︻","꺓넓뢓넓첓ꮓ넓겓뀓첓ꨓ랓몓괓겓뀓ꊓ뜓괓ꮓ꾓꼓몓",-1791987738>(var10001, var10000) + '9';
         char var25 = (char)(
            (((((var22 & 65504) >> 5 | var22 << 11) + 206 & 65535) >> 0 | ((var22 & 65504) >> 5 | var22 << 11) + 206 << 16) & 65472) >> 6
               | ((((var22 & 65504) >> 5 | var22 << 11) + 206 & 65535) >> 0 | ((var22 & 65504) >> 5 | var22 << 11) + 206 << 16) << 10
         );
         0<"JNT",-23575512,"\uf405萅ﰅ琄鰅搅\uec05搄ﰅ","ﾧ︣︻ﾣ\ufe6f","꺓넓뢓넓첓ꮓ넓겓뀓첓ꨓ랓몓괓겓뀓ꊓ뜓괓ꮓ꾓꼓몓",-1791987739>(
            var10001,
            var10000,
            (char)(
               (((((var22 & 65504) >> 5 | var22 << 11) + 206 & 65535) >> 0 | ((var22 & 65504) >> 5 | var22 << 11) + 206 << 16) & 65472) >> 6
                  | ((((var22 & 65504) >> 5 | var22 << 11) + 206 & 65535) >> 0 | ((var22 & 65504) >> 5 | var22 << 11) + 206 << 16) << 10
            )
         );
      }

      field_1080 = (Class_267)0<"JNT",-84380584,"㰄ꐅ찅ꐅﰅ䰄","ﾧ﹗ﻟﺃﻯﺃￋﻗﺃﻏﺫￋﹻﻷ\ufeffﺣﻏﺫ\ufe1b︣ﾣ\ufe6f","뤓넓",-1791987717>(
         0<"JNT",-23575512,"ﰅ퐅\uf404ﰅ\uec05ꐅ찅鐅","ﾧﾣ﹗ﻟﺃﻯﺃￋﻗﺃﻏﺫￋﹻﻷ\ufeffﺣﻏﺫ\ufe1b","꺓넓뢓넓첓ꮓ넓겓뀓첓ꨓ랓몓괓겓뀓ꊓ뜓괓ꮓ꾓꼓몓",-1791987724>(var10001), 2
      );
      var10000 = 1773747993 >> (1019041490 ^ 1019041490) ^ 1773747993;

      for (var10001 = (StringBuilder)0<"JNT",-84380584,"㰄ꐅ찅ꐅﰅ䰄","ﾧ﹗ﻟﺃﻯﺃￋﻗﺃﻏﺫￋﹻﻷ\ufeffﺣﻏﺫ\ufe1bﾣ\ufe6f","꺓넓뢓넓첓ꮓ넓겓뀓첓ꨓ랓몓괓겓뀓ꊓ뜓괓ꮓ꾓꼓몓",-1791987722>(
            "ėċăŶĂďűŶŵāĎųűŶăĄ"
         );
         var10000 < (-749072640 & -749072640 ^ -749072624);
         var10000 += (515296568 - -180174626 | 1) & 1082257541
      ) {
         0<"JNT",-23575512,"\uf405萅ﰅ琄鰅搅\uec05搄ﰅ","ﾧ︣︻ﾣ\ufe6f","꺓넓뢓넓첓ꮓ넓겓뀓첓ꨓ랓몓괓겓뀓ꊓ뜓괓ꮓ꾓꼓몓",-1791987746>(
            var10001,
            var10000,
            (char)(((0<"JNT",-23575512,"琅鰅搅\uec05搄ﰅ","ﾧ︣ﾣ︻","꺓넓뢓넓첓ꮓ넓겓뀓첓ꨓ랓몓괓겓뀓ꊓ뜓괓ꮓ꾓꼓몓",-1791987741>(var10001, var10000) ^ 205) - 92 - 31 ^ 121) - 229)
         );
      }

      field_1081 = (Class_267)0<"JNT",-84380584,"㰄ꐅ찅ꐅﰅ䰄","ﾧ﹗ﻟﺃﻯﺃￋﻗﺃﻏﺫￋﹻﻷ\ufeffﺣﻏﺫ\ufe1b︣ﾣ\ufe6f","뤓넓",-1791987737>(
         0<"JNT",-23575512,"ﰅ퐅\uf404ﰅ\uec05ꐅ찅鐅","ﾧﾣ﹗ﻟﺃﻯﺃￋﻗﺃﻏﺫￋﹻﻷ\ufeffﺣﻏﺫ\ufe1b","꺓넓뢓넓첓ꮓ넓겓뀓첓ꨓ랓몓괓겓뀓ꊓ뜓괓ꮓ꾓꼓몓",-1791987744>(var10001), 3
      );
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1182(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 + 1418963576 ^ 565889345) + 643617901 ^ 1213131640 ^ 375261446) + 1227167971 - 593850796 - 2009873940 ^ 1307936978;
      MethodHandle var10000 = field_1083[(
            ((var10 + 1418963576 ^ 565889345) + 643617901 ^ 1213131640 ^ 375261446) + 1227167971 - 593850796 - 2009873940 ^ 1307936978
         )
         - 323692477];
      if (field_1083[var10001 - 323692477] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = 1331839038 ^ -1827111562 ^ -595968696; var23 < var13.length(); var23 += (544023316 * 544023316 | 1) & 338198543) {
            int var42 = var13.charAt(var23) - 239;
            char var47 = (char)(
               (
                     (
                              (
                                       (
                                                (
                                                      (
                                                               (
                                                                     ((((var42 & 0) >> 16 | var42 << 0) ^ 236) & 61440) >> 12
                                                                        | (((var42 & 0) >> 16 | var42 << 0) ^ 236) << 4
                                                                  )
                                                                  & 32768
                                                            )
                                                            >> 15
                                                         | (
                                                               ((((var42 & 0) >> 16 | var42 << 0) ^ 236) & 61440) >> 12
                                                                  | (((var42 & 0) >> 16 | var42 << 0) ^ 236) << 4
                                                            )
                                                            << 1
                                                   )
                                                   & 57344
                                             )
                                             >> 13
                                          | (
                                                (
                                                         (
                                                               ((((var42 & 0) >> 16 | var42 << 0) ^ 236) & 61440) >> 12
                                                                  | (((var42 & 0) >> 16 | var42 << 0) ^ 236) << 4
                                                            )
                                                            & 32768
                                                      )
                                                      >> 15
                                                   | (((((var42 & 0) >> 16 | var42 << 0) ^ 236) & 61440) >> 12 | (((var42 & 0) >> 16 | var42 << 0) ^ 236) << 4)
                                                      << 1
                                             )
                                             << 3
                                    )
                                    + 196
                                 & 65528
                           )
                           >> 3
                        | (
                                 (
                                          (
                                                (
                                                         (
                                                               ((((var42 & 0) >> 16 | var42 << 0) ^ 236) & 61440) >> 12
                                                                  | (((var42 & 0) >> 16 | var42 << 0) ^ 236) << 4
                                                            )
                                                            & 32768
                                                      )
                                                      >> 15
                                                   | (((((var42 & 0) >> 16 | var42 << 0) ^ 236) & 61440) >> 12 | (((var42 & 0) >> 16 | var42 << 0) ^ 236) << 4)
                                                      << 1
                                             )
                                             & 57344
                                       )
                                       >> 13
                                    | (
                                          ((((((var42 & 0) >> 16 | var42 << 0) ^ 236) & 61440) >> 12 | (((var42 & 0) >> 16 | var42 << 0) ^ 236) << 4) & 32768)
                                                >> 15
                                             | (((((var42 & 0) >> 16 | var42 << 0) ^ 236) & 61440) >> 12 | (((var42 & 0) >> 16 | var42 << 0) ^ 236) << 4) << 1
                                       )
                                       << 3
                              )
                              + 196
                           << 13
                  )
                  + 64
                  + 189
            );
            var13.setCharAt(
               var23,
               (char)(
                  (
                        (
                                 (
                                          (
                                                   (
                                                         (
                                                                  (
                                                                        ((((var42 & 0) >> 16 | var42 << 0) ^ 236) & 61440) >> 12
                                                                           | (((var42 & 0) >> 16 | var42 << 0) ^ 236) << 4
                                                                     )
                                                                     & 32768
                                                               )
                                                               >> 15
                                                            | (
                                                                  ((((var42 & 0) >> 16 | var42 << 0) ^ 236) & 61440) >> 12
                                                                     | (((var42 & 0) >> 16 | var42 << 0) ^ 236) << 4
                                                               )
                                                               << 1
                                                      )
                                                      & 57344
                                                )
                                                >> 13
                                             | (
                                                   (
                                                            (
                                                                  ((((var42 & 0) >> 16 | var42 << 0) ^ 236) & 61440) >> 12
                                                                     | (((var42 & 0) >> 16 | var42 << 0) ^ 236) << 4
                                                               )
                                                               & 32768
                                                         )
                                                         >> 15
                                                      | (
                                                            ((((var42 & 0) >> 16 | var42 << 0) ^ 236) & 61440) >> 12
                                                               | (((var42 & 0) >> 16 | var42 << 0) ^ 236) << 4
                                                         )
                                                         << 1
                                                )
                                                << 3
                                       )
                                       + 196
                                    & 65528
                              )
                              >> 3
                           | (
                                    (
                                             (
                                                   (
                                                            (
                                                                  ((((var42 & 0) >> 16 | var42 << 0) ^ 236) & 61440) >> 12
                                                                     | (((var42 & 0) >> 16 | var42 << 0) ^ 236) << 4
                                                               )
                                                               & 32768
                                                         )
                                                         >> 15
                                                      | (
                                                            ((((var42 & 0) >> 16 | var42 << 0) ^ 236) & 61440) >> 12
                                                               | (((var42 & 0) >> 16 | var42 << 0) ^ 236) << 4
                                                         )
                                                         << 1
                                                )
                                                & 57344
                                          )
                                          >> 13
                                       | (
                                             (
                                                      (((((var42 & 0) >> 16 | var42 << 0) ^ 236) & 61440) >> 12 | (((var42 & 0) >> 16 | var42 << 0) ^ 236) << 4)
                                                         & 32768
                                                   )
                                                   >> 15
                                                | (((((var42 & 0) >> 16 | var42 << 0) ^ 236) & 61440) >> 12 | (((var42 & 0) >> 16 | var42 << 0) ^ 236) << 4)
                                                   << 1
                                          )
                                          << 3
                                 )
                                 + 196
                              << 13
                     )
                     + 64
                     + 189
               )
            );
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = 2140735672 * (2140735672 << (2140735672 >> 2140735672)) ^ 0; var29 < var16.length(); var29 += -1695052541 ^ 99081525 ^ -1626320841) {
            char var52 = var16.charAt(var29);
            char var59 = (char)(
               (
                     (
                           (
                                    (
                                          (
                                                   (
                                                         (
                                                                  (
                                                                        (
                                                                                 (
                                                                                       (
                                                                                                (
                                                                                                      (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                                         | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                                                   )
                                                                                                   & 65472
                                                                                             )
                                                                                             >> 6
                                                                                          | (
                                                                                                (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                                   | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                                             )
                                                                                             << 10
                                                                                    )
                                                                                    & 65024
                                                                              )
                                                                              >> 9
                                                                           | (
                                                                                 (
                                                                                          (
                                                                                                (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                                   | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                                             )
                                                                                             & 65472
                                                                                       )
                                                                                       >> 6
                                                                                    | (
                                                                                          (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                             | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                                       )
                                                                                       << 10
                                                                              )
                                                                              << 7
                                                                     )
                                                                     & 65520
                                                               )
                                                               >> 4
                                                            | (
                                                                  (
                                                                           (
                                                                                 (
                                                                                          (
                                                                                                (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                                   | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                                             )
                                                                                             & 65472
                                                                                       )
                                                                                       >> 6
                                                                                    | (
                                                                                          (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                             | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                                       )
                                                                                       << 10
                                                                              )
                                                                              & 65024
                                                                        )
                                                                        >> 9
                                                                     | (
                                                                           (
                                                                                    (
                                                                                          (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                             | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                                       )
                                                                                       & 65472
                                                                                 )
                                                                                 >> 6
                                                                              | (
                                                                                    (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                       | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                                 )
                                                                                 << 10
                                                                        )
                                                                        << 7
                                                               )
                                                               << 12
                                                      )
                                                      & 63488
                                                )
                                                >> 11
                                             | (
                                                   (
                                                            (
                                                                  (
                                                                           (
                                                                                 (
                                                                                          (
                                                                                                (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                                   | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                                             )
                                                                                             & 65472
                                                                                       )
                                                                                       >> 6
                                                                                    | (
                                                                                          (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                             | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                                       )
                                                                                       << 10
                                                                              )
                                                                              & 65024
                                                                        )
                                                                        >> 9
                                                                     | (
                                                                           (
                                                                                    (
                                                                                          (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                             | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                                       )
                                                                                       & 65472
                                                                                 )
                                                                                 >> 6
                                                                              | (
                                                                                    (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                       | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                                 )
                                                                                 << 10
                                                                        )
                                                                        << 7
                                                               )
                                                               & 65520
                                                         )
                                                         >> 4
                                                      | (
                                                            (
                                                                     (
                                                                           (
                                                                                    (
                                                                                          (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                             | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                                       )
                                                                                       & 65472
                                                                                 )
                                                                                 >> 6
                                                                              | (
                                                                                    (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                       | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                                 )
                                                                                 << 10
                                                                        )
                                                                        & 65024
                                                                  )
                                                                  >> 9
                                                               | (
                                                                     (
                                                                              (
                                                                                    (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                       | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                                 )
                                                                                 & 65472
                                                                           )
                                                                           >> 6
                                                                        | (
                                                                              (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                 | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                           )
                                                                           << 10
                                                                  )
                                                                  << 7
                                                         )
                                                         << 12
                                                )
                                                << 5
                                       )
                                       & 65535
                                 )
                                 >> 0
                              | (
                                    (
                                             (
                                                   (
                                                            (
                                                                  (
                                                                           (
                                                                                 (
                                                                                          (
                                                                                                (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                                   | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                                             )
                                                                                             & 65472
                                                                                       )
                                                                                       >> 6
                                                                                    | (
                                                                                          (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                             | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                                       )
                                                                                       << 10
                                                                              )
                                                                              & 65024
                                                                        )
                                                                        >> 9
                                                                     | (
                                                                           (
                                                                                    (
                                                                                          (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                             | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                                       )
                                                                                       & 65472
                                                                                 )
                                                                                 >> 6
                                                                              | (
                                                                                    (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                       | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                                 )
                                                                                 << 10
                                                                        )
                                                                        << 7
                                                               )
                                                               & 65520
                                                         )
                                                         >> 4
                                                      | (
                                                            (
                                                                     (
                                                                           (
                                                                                    (
                                                                                          (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                             | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                                       )
                                                                                       & 65472
                                                                                 )
                                                                                 >> 6
                                                                              | (
                                                                                    (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                       | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                                 )
                                                                                 << 10
                                                                        )
                                                                        & 65024
                                                                  )
                                                                  >> 9
                                                               | (
                                                                     (
                                                                              (
                                                                                    (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                       | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                                 )
                                                                                 & 65472
                                                                           )
                                                                           >> 6
                                                                        | (
                                                                              (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                 | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                           )
                                                                           << 10
                                                                  )
                                                                  << 7
                                                         )
                                                         << 12
                                                )
                                                & 63488
                                          )
                                          >> 11
                                       | (
                                             (
                                                      (
                                                            (
                                                                     (
                                                                           (
                                                                                    (
                                                                                          (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                             | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                                       )
                                                                                       & 65472
                                                                                 )
                                                                                 >> 6
                                                                              | (
                                                                                    (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                       | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                                 )
                                                                                 << 10
                                                                        )
                                                                        & 65024
                                                                  )
                                                                  >> 9
                                                               | (
                                                                     (
                                                                              (
                                                                                    (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                       | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                                 )
                                                                                 & 65472
                                                                           )
                                                                           >> 6
                                                                        | (
                                                                              (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                 | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                           )
                                                                           << 10
                                                                  )
                                                                  << 7
                                                         )
                                                         & 65520
                                                   )
                                                   >> 4
                                                | (
                                                      (
                                                               (
                                                                     (
                                                                              (
                                                                                    (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                       | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                                 )
                                                                                 & 65472
                                                                           )
                                                                           >> 6
                                                                        | (
                                                                              (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                 | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                           )
                                                                           << 10
                                                                  )
                                                                  & 65024
                                                            )
                                                            >> 9
                                                         | (
                                                               (
                                                                        (
                                                                              (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                 | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                           )
                                                                           & 65472
                                                                     )
                                                                     >> 6
                                                                  | (
                                                                        (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                           | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                     )
                                                                     << 10
                                                            )
                                                            << 7
                                                   )
                                                   << 12
                                          )
                                          << 5
                                 )
                                 << 16
                        )
                        ^ 199
                  )
                  + 134
                  + 116
            );
            var16.setCharAt(
               var29,
               (char)(
                  (
                        (
                              (
                                       (
                                             (
                                                      (
                                                            (
                                                                     (
                                                                           (
                                                                                    (
                                                                                          (
                                                                                                   (
                                                                                                         (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                                            | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                                                      )
                                                                                                      & 65472
                                                                                                )
                                                                                                >> 6
                                                                                             | (
                                                                                                   (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                                      | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                                                )
                                                                                                << 10
                                                                                       )
                                                                                       & 65024
                                                                                 )
                                                                                 >> 9
                                                                              | (
                                                                                    (
                                                                                             (
                                                                                                   (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                                      | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                                                )
                                                                                                & 65472
                                                                                          )
                                                                                          >> 6
                                                                                       | (
                                                                                             (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                                | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                                          )
                                                                                          << 10
                                                                                 )
                                                                                 << 7
                                                                        )
                                                                        & 65520
                                                                  )
                                                                  >> 4
                                                               | (
                                                                     (
                                                                              (
                                                                                    (
                                                                                             (
                                                                                                   (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                                      | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                                                )
                                                                                                & 65472
                                                                                          )
                                                                                          >> 6
                                                                                       | (
                                                                                             (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                                | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                                          )
                                                                                          << 10
                                                                                 )
                                                                                 & 65024
                                                                           )
                                                                           >> 9
                                                                        | (
                                                                              (
                                                                                       (
                                                                                             (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                                | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                                          )
                                                                                          & 65472
                                                                                    )
                                                                                    >> 6
                                                                                 | (
                                                                                       (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                          | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                                    )
                                                                                    << 10
                                                                           )
                                                                           << 7
                                                                  )
                                                                  << 12
                                                         )
                                                         & 63488
                                                   )
                                                   >> 11
                                                | (
                                                      (
                                                               (
                                                                     (
                                                                              (
                                                                                    (
                                                                                             (
                                                                                                   (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                                      | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                                                )
                                                                                                & 65472
                                                                                          )
                                                                                          >> 6
                                                                                       | (
                                                                                             (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                                | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                                          )
                                                                                          << 10
                                                                                 )
                                                                                 & 65024
                                                                           )
                                                                           >> 9
                                                                        | (
                                                                              (
                                                                                       (
                                                                                             (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                                | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                                          )
                                                                                          & 65472
                                                                                    )
                                                                                    >> 6
                                                                                 | (
                                                                                       (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                          | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                                    )
                                                                                    << 10
                                                                           )
                                                                           << 7
                                                                  )
                                                                  & 65520
                                                            )
                                                            >> 4
                                                         | (
                                                               (
                                                                        (
                                                                              (
                                                                                       (
                                                                                             (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                                | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                                          )
                                                                                          & 65472
                                                                                    )
                                                                                    >> 6
                                                                                 | (
                                                                                       (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                          | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                                    )
                                                                                    << 10
                                                                           )
                                                                           & 65024
                                                                     )
                                                                     >> 9
                                                                  | (
                                                                        (
                                                                                 (
                                                                                       (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                          | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                                    )
                                                                                    & 65472
                                                                              )
                                                                              >> 6
                                                                           | (
                                                                                 (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                    | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                              )
                                                                              << 10
                                                                     )
                                                                     << 7
                                                            )
                                                            << 12
                                                   )
                                                   << 5
                                          )
                                          & 65535
                                    )
                                    >> 0
                                 | (
                                       (
                                                (
                                                      (
                                                               (
                                                                     (
                                                                              (
                                                                                    (
                                                                                             (
                                                                                                   (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                                      | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                                                )
                                                                                                & 65472
                                                                                          )
                                                                                          >> 6
                                                                                       | (
                                                                                             (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                                | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                                          )
                                                                                          << 10
                                                                                 )
                                                                                 & 65024
                                                                           )
                                                                           >> 9
                                                                        | (
                                                                              (
                                                                                       (
                                                                                             (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                                | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                                          )
                                                                                          & 65472
                                                                                    )
                                                                                    >> 6
                                                                                 | (
                                                                                       (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                          | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                                    )
                                                                                    << 10
                                                                           )
                                                                           << 7
                                                                  )
                                                                  & 65520
                                                            )
                                                            >> 4
                                                         | (
                                                               (
                                                                        (
                                                                              (
                                                                                       (
                                                                                             (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                                | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                                          )
                                                                                          & 65472
                                                                                    )
                                                                                    >> 6
                                                                                 | (
                                                                                       (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                          | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                                    )
                                                                                    << 10
                                                                           )
                                                                           & 65024
                                                                     )
                                                                     >> 9
                                                                  | (
                                                                        (
                                                                                 (
                                                                                       (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                          | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                                    )
                                                                                    & 65472
                                                                              )
                                                                              >> 6
                                                                           | (
                                                                                 (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                    | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                              )
                                                                              << 10
                                                                     )
                                                                     << 7
                                                            )
                                                            << 12
                                                   )
                                                   & 63488
                                             )
                                             >> 11
                                          | (
                                                (
                                                         (
                                                               (
                                                                        (
                                                                              (
                                                                                       (
                                                                                             (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                                | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                                          )
                                                                                          & 65472
                                                                                    )
                                                                                    >> 6
                                                                                 | (
                                                                                       (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                          | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                                    )
                                                                                    << 10
                                                                           )
                                                                           & 65024
                                                                     )
                                                                     >> 9
                                                                  | (
                                                                        (
                                                                                 (
                                                                                       (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                          | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                                    )
                                                                                    & 65472
                                                                              )
                                                                              >> 6
                                                                           | (
                                                                                 (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                    | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                              )
                                                                              << 10
                                                                     )
                                                                     << 7
                                                            )
                                                            & 65520
                                                      )
                                                      >> 4
                                                   | (
                                                         (
                                                                  (
                                                                        (
                                                                                 (
                                                                                       (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                          | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                                    )
                                                                                    & 65472
                                                                              )
                                                                              >> 6
                                                                           | (
                                                                                 (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                    | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                              )
                                                                              << 10
                                                                     )
                                                                     & 65024
                                                               )
                                                               >> 9
                                                            | (
                                                                  (
                                                                           (
                                                                                 (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                                    | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                              )
                                                                              & 65472
                                                                        )
                                                                        >> 6
                                                                     | (
                                                                           (((var52 & '￠') >> 5 | var52 << 11) & 32768) >> 15
                                                                              | ((var52 & '￠') >> 5 | var52 << 11) << 1
                                                                        )
                                                                        << 10
                                                               )
                                                               << 7
                                                      )
                                                      << 12
                                             )
                                             << 5
                                    )
                                    << 16
                           )
                           ^ 199
                     )
                     + 134
                     + 116
               )
            );
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_267.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = (1482473999 * -1259047857 | 0) & 16843036; var35 < var19.length(); var35 += -1911656622 + -578566032 ^ 1804744643) {
            int var64 = ((var19.charAt(var35) ^ 'a' ^ 25) - 18 ^ 192) - 154;
            char var65 = (char)(((var64 & 65408) >> 7 | var64 << 9) + 3 + 231 + 98 ^ 204);
            var19.setCharAt(var35, (char)(((var64 & 65408) >> 7 | var64 << 9) + 3 + 231 + 98 ^ 204));
         }

         Class var7 = Class.forName(var19.toString(), false, Class_267.class.getClassLoader());
         switch ((var4 - 751311151 - 380864870 - 1335884922 + 1080749965 + 741386757 - 1038176448 + 1452691999 ^ 573166810 ^ 2133075234) - 1973986224) {
            case 61564643:
            case 941100610:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 980934162:
               var10000 = var0.findConstructor(var7, var6);
               break;
            case 1264821952:
               var10000 = var0.findSpecial(var7, var5, var6, Class_267.class);
               break;
            case 1411310095:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_1083[(((var10 + 1418963576 ^ 565889345) + 643617901 ^ 1213131640 ^ 375261446) + 1227167971 - 593850796 - 2009873940 ^ 1307936978) - 323692477] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1183(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = (var10 + 1899399721 + 915474582 ^ 953461294 ^ 1402286822) + 1075646586 - 297772836 + 1841622183 + 761532967 ^ 1838621801;
      MethodHandle var10000 = field_1083[(
            (var10 + 1899399721 + 915474582 ^ 953461294 ^ 1402286822) + 1075646586 - 297772836 + 1841622183 + 761532967 ^ 1838621801
         )
         - 1941165451];
      if (field_1083[var10001 - 1941165451] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = -180227217 & -1377339474 ^ -1522437330; var24 < var14.length(); var24 += -1788576778 << 785601187 ^ -1423712335) {
            int var43 = var14.charAt(var24) + 27;
            char var48 = (char)(
               (
                     (
                              (
                                    (
                                             (
                                                   (
                                                         (
                                                                  (
                                                                           (
                                                                                 (((var43 & 65520) >> 4 | var43 << 12) & 0) >> 16
                                                                                    | ((var43 & 65520) >> 4 | var43 << 12) << 0
                                                                              )
                                                                              ^ 37
                                                                        )
                                                                        + 8
                                                                     & 57344
                                                               )
                                                               >> 13
                                                            | (
                                                                     (
                                                                           (((var43 & 65520) >> 4 | var43 << 12) & 0) >> 16
                                                                              | ((var43 & 65520) >> 4 | var43 << 12) << 0
                                                                        )
                                                                        ^ 37
                                                                  )
                                                                  + 8
                                                               << 3
                                                      )
                                                      ^ 140
                                                )
                                                & 32768
                                          )
                                          >> 15
                                       | (
                                             (
                                                   (
                                                            (
                                                                     (
                                                                           (((var43 & 65520) >> 4 | var43 << 12) & 0) >> 16
                                                                              | ((var43 & 65520) >> 4 | var43 << 12) << 0
                                                                        )
                                                                        ^ 37
                                                                  )
                                                                  + 8
                                                               & 57344
                                                         )
                                                         >> 13
                                                      | (((((var43 & 65520) >> 4 | var43 << 12) & 0) >> 16 | ((var43 & 65520) >> 4 | var43 << 12) << 0) ^ 37)
                                                            + 8
                                                         << 3
                                                )
                                                ^ 140
                                          )
                                          << 1
                                 )
                                 & 32768
                           )
                           >> 15
                        | (
                              (
                                       (
                                             (
                                                   (
                                                            (
                                                                     (
                                                                           (((var43 & 65520) >> 4 | var43 << 12) & 0) >> 16
                                                                              | ((var43 & 65520) >> 4 | var43 << 12) << 0
                                                                        )
                                                                        ^ 37
                                                                  )
                                                                  + 8
                                                               & 57344
                                                         )
                                                         >> 13
                                                      | (((((var43 & 65520) >> 4 | var43 << 12) & 0) >> 16 | ((var43 & 65520) >> 4 | var43 << 12) << 0) ^ 37)
                                                            + 8
                                                         << 3
                                                )
                                                ^ 140
                                          )
                                          & 32768
                                    )
                                    >> 15
                                 | (
                                       (
                                             ((((((var43 & 65520) >> 4 | var43 << 12) & 0) >> 16 | ((var43 & 65520) >> 4 | var43 << 12) << 0) ^ 37) + 8 & 57344)
                                                   >> 13
                                                | (((((var43 & 65520) >> 4 | var43 << 12) & 0) >> 16 | ((var43 & 65520) >> 4 | var43 << 12) << 0) ^ 37) + 8
                                                   << 3
                                          )
                                          ^ 140
                                    )
                                    << 1
                           )
                           << 1
                  )
                  + 80
            );
            var14.setCharAt(
               var24,
               (char)(
                  (
                        (
                                 (
                                       (
                                                (
                                                      (
                                                            (
                                                                     (
                                                                              (
                                                                                    (((var43 & 65520) >> 4 | var43 << 12) & 0) >> 16
                                                                                       | ((var43 & 65520) >> 4 | var43 << 12) << 0
                                                                                 )
                                                                                 ^ 37
                                                                           )
                                                                           + 8
                                                                        & 57344
                                                                  )
                                                                  >> 13
                                                               | (
                                                                        (
                                                                              (((var43 & 65520) >> 4 | var43 << 12) & 0) >> 16
                                                                                 | ((var43 & 65520) >> 4 | var43 << 12) << 0
                                                                           )
                                                                           ^ 37
                                                                     )
                                                                     + 8
                                                                  << 3
                                                         )
                                                         ^ 140
                                                   )
                                                   & 32768
                                             )
                                             >> 15
                                          | (
                                                (
                                                      (
                                                               (
                                                                        (
                                                                              (((var43 & 65520) >> 4 | var43 << 12) & 0) >> 16
                                                                                 | ((var43 & 65520) >> 4 | var43 << 12) << 0
                                                                           )
                                                                           ^ 37
                                                                     )
                                                                     + 8
                                                                  & 57344
                                                            )
                                                            >> 13
                                                         | (((((var43 & 65520) >> 4 | var43 << 12) & 0) >> 16 | ((var43 & 65520) >> 4 | var43 << 12) << 0) ^ 37)
                                                               + 8
                                                            << 3
                                                   )
                                                   ^ 140
                                             )
                                             << 1
                                    )
                                    & 32768
                              )
                              >> 15
                           | (
                                 (
                                          (
                                                (
                                                      (
                                                               (
                                                                        (
                                                                              (((var43 & 65520) >> 4 | var43 << 12) & 0) >> 16
                                                                                 | ((var43 & 65520) >> 4 | var43 << 12) << 0
                                                                           )
                                                                           ^ 37
                                                                     )
                                                                     + 8
                                                                  & 57344
                                                            )
                                                            >> 13
                                                         | (((((var43 & 65520) >> 4 | var43 << 12) & 0) >> 16 | ((var43 & 65520) >> 4 | var43 << 12) << 0) ^ 37)
                                                               + 8
                                                            << 3
                                                   )
                                                   ^ 140
                                             )
                                             & 32768
                                       )
                                       >> 15
                                    | (
                                          (
                                                (
                                                         (((((var43 & 65520) >> 4 | var43 << 12) & 0) >> 16 | ((var43 & 65520) >> 4 | var43 << 12) << 0) ^ 37)
                                                               + 8
                                                            & 57344
                                                      )
                                                      >> 13
                                                   | (((((var43 & 65520) >> 4 | var43 << 12) & 0) >> 16 | ((var43 & 65520) >> 4 | var43 << 12) << 0) ^ 37) + 8
                                                      << 3
                                             )
                                             ^ 140
                                       )
                                       << 1
                              )
                              << 1
                     )
                     + 80
               )
            );
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = (-504305051 << -2019765185 | 0) & 1930122230; var30 < var17.length(); var30 += (-999729313 & 119430285 | 1) & -1467702399) {
            int var53 = var17.charAt(var30);
            int var88 = (var53 & 65520) >> 4;
            int var54 = ((var53 & 65520) >> 4 | var53 << 12) - 98 - 237 - 248 + 45;
            int var89 = (((var53 & 65520) >> 4 | var53 << 12) - 98 - 237 - 248 + 45 & 65528) >> 3;
            var53 = (((var88 | var53 << 12) - 98 - 237 - 248 + 45 & 65528) >> 3 | ((var53 & 65520) >> 4 | var53 << 12) - 98 - 237 - 248 + 45 << 13) + 152 - 198;
            var88 = ((var89 | var54 << 13) + 152 - 198 & 65472) >> 6;
            int var56 = ((var89 | var54 << 13) + 152 - 198 & 65472) >> 6 | var53 << 10;
            int var91 = ((((var89 | var54 << 13) + 152 - 198 & 65472) >> 6 | var53 << 10) & 65472) >> 6;
            char var57 = (char)(((var88 | var53 << 10) & 65472) >> 6 | (((var89 | var54 << 13) + 152 - 198 & 65472) >> 6 | var53 << 10) << 10);
            var17.setCharAt(var30, (char)(var91 | var56 << 10));
         }

         Class var6 = Class.forName(var17.toString(), false, Class_267.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = (816163584 & -1377659287 | 0) & -800366320; var36 < var20.length(); var36 += 824593805 >>> 1784567991 ^ 99) {
            int var62 = var20.charAt(var36) + 224;
            int var92 = (var62 & 65520) >> 4;
            int var63 = ((var62 & 65520) >> 4 | var62 << 12) + 234 - 121 - 154 ^ 81 ^ 95;
            int var93 = ((((var62 & 65520) >> 4 | var62 << 12) + 234 - 121 - 154 ^ 81 ^ 95) & 64512) >> 10;
            char var64 = (char)(
               ((((var92 | var62 << 12) + 234 - 121 - 154 ^ 81 ^ 95) & 64512) >> 10 | (((var62 & 65520) >> 4 | var62 << 12) + 234 - 121 - 154 ^ 81 ^ 95) << 6)
                  ^ 189
                  ^ 93
            );
            var20.setCharAt(var36, (char)((var93 | var63 << 6) ^ 189 ^ 93));
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_267.class.getClassLoader()).returnType();
         switch (((var4 - 2146457047 ^ 1885042517 ^ 983866078) + 1444906552 ^ 615553409) + 1472887207 + 8241208 - 1982434053 + 99114747 ^ 79109781) {
            case 611879170:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            case 1319117993:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            case 1411406118:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            case 1937036991:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_1083[((var10 + 1899399721 + 915474582 ^ 953461294 ^ 1402286822) + 1075646586 - 297772836 + 1841622183 + 761532967 ^ 1838621801) - 1941165451] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
