import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;

public enum Class_245 {
   // $VF: renamed from: bq Class_245
   field_1101,
   // $VF: renamed from: gd Class_245
   field_1102,
   // $VF: renamed from: co Class_245
   field_1103,
   // $VF: renamed from: nx Class_245
   field_1104;

   // $VF: renamed from: vc java.lang.String
   public String field_1105;
   // $VF: renamed from: asw java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_1107 = new MethodHandle[(-916525345 * -916525345 | 44) & -2062511938];

   public Class_245(String var3) {
      this.field_1105 = var3;
   }

   @Override
   public String toString() {
      return 1<"JNT",39071231,"汎檮","뼉삩","于侎ꪓ貓螓邓螓䦎誓螓袓膓䦎떓銓钓输袓膓嶎",-1066610293>(this);
   }

   // $VF: Failed to inline enum fields
   // Please report this to the Vineflower issue tracker, at https://github.com/Vineflower/vineflower/issues with a copy of the class file (if you have the rights to distribute it!)
   static {
      int var10000 = (9511340 - 9511340 | 0) & 771463306;

      StringBuilder var10001;
      for (var10001 = (StringBuilder)0<"JNT",-401559159," \uf053䁔\uf053ꁔ䁟","谇㰀됀退쐀退ꠇ밀退ꐀ蠀ꠇ堀\udc00퐀뀀ꐀ蠀\uf807뀇䐀","㾼ﾹ㾿ﾹ㾭뾼ﾹ㾽羻㾭羶뾾㾾ﾻ㾽羻㾲ﾾﾻ뾼뾺ﾺ㾾",-1392963517>(
            "ￍﾶﾹￆﾵﾼ\uffbfￍ"
         );
         var10000 < ((-1076412654 << -1076412654 | 8) & 28526793);
         var10000 += 1
      ) {
         0<"JNT",-1775584616,"達끑ꁔ遟\ue053灑联灟ꁔ","谇　᠀뀇䐀","㾼ﾹ㾿ﾹ㾭뾼ﾹ㾽羻㾭羶뾾㾾ﾻ㾽羻㾲ﾾﾻ뾼뾺ﾺ㾾",-1392963515>(
            var10001,
            var10000,
            (char)((0<"JNT",-1775584616,"遑\ue053灑联灟ꁔ","谇　뀇᠀","㾼ﾹ㾿ﾹ㾭뾼ﾹ㾽羻㾭羶뾾㾾ﾻ㾽羻㾲ﾾﾻ뾼뾺ﾺ㾾",-1392963520>(var10001, var10000) - 180 ^ 201) + 218 - 165 + 79)
         );
      }

      String var1 = 0<"JNT",-1775584616,"ꁔ偔遒ꁔ联\uf053䁔큓","谇뀇㰀됀退쐀退ꠇ밀退ꐀ蠀ꠇ堀\udc00퐀뀀ꐀ蠀\uf807","㾼ﾹ㾿ﾹ㾭뾼ﾹ㾽羻㾭羶뾾㾾ﾻ㾽羻㾲ﾾﾻ뾼뾺ﾺ㾾",-1392963490>(var10001);
      int var19 = (439342244 + 114699635 | 0) & 518075776;

      StringBuilder var10003;
      for (var10003 = (StringBuilder)0<"JNT",-401559159," \uf053䁔\uf053ꁔ䁟","谇㰀됀退쐀退ꠇ밀退ꐀ蠀ꠇ堀\udc00퐀뀀ꐀ蠀\uf807뀇䐀","㾼ﾹ㾿ﾹ㾭뾼ﾹ㾽羻㾭羶뾾㾾ﾻ㾽羻㾲ﾾﾻ뾼뾺ﾺ㾾",-1392963501>("ᕺዚዺჺᙺរឺᅺ");
         var19 < ((-1927078336 >>> 925458422 | 8) & 642699720);
         var19 += -1742447032 >> 399640184 ^ -103
      ) {
         int var50 = 0<"JNT",-1775584616,"遑\ue053灑联灟ꁔ","谇　뀇᠀","㾼ﾹ㾿ﾹ㾭뾼ﾹ㾽羻㾭羶뾾㾾ﾻ㾽羻㾲ﾾﾻ뾼뾺ﾺ㾾",-1392963502>(var10003, var19) + 6;
         char var51 = (char)((((var50 & 65504) >> 5 | var50 << 11) - 9 ^ 40) - 55);
         0<"JNT",-1775584616,"達끑ꁔ遟\ue053灑联灟ꁔ","谇　᠀뀇䐀","㾼ﾹ㾿ﾹ㾭뾼ﾹ㾽羻㾭羶뾾㾾ﾻ㾽羻㾲ﾾﾻ뾼뾺ﾺ㾾",-1392963497>(
            var10003, var19, (char)((((var50 & 65504) >> 5 | var50 << 11) - 9 ^ 40) - 55)
         );
      }

      field_1101 = (Class_245)0<"JNT",-401559159," \uf053䁔\uf053ꁔ䁟","谇㰀됀退쐀退ꠇ밀退ꐀ蠀ꠇ堀\udc00퐀뀀ꐀ蠀\uf807　㰀됀退쐀退ꠇ밀退ꐀ蠀ꠇ堀\udc00퐀뀀ꐀ蠀\uf807뀇䐀","羽ﾾ",-1392963495>(
         var1, 0, 0<"JNT",-1775584616,"ꁔ偔遒ꁔ联\uf053䁔큓","谇뀇㰀됀退쐀退ꠇ밀退ꐀ蠀ꠇ堀\udc00퐀뀀ꐀ蠀\uf807","㾼ﾹ㾿ﾹ㾭뾼ﾹ㾽羻㾭羶뾾㾾ﾻ㾽羻㾲ﾾﾻ뾼뾺ﾺ㾾",-1392963500>(var10003)
      );
      var10000 = (1989110999 | 478652064 >>> -439502844) ^ 2010087167;

      for (var10001 = (StringBuilder)0<"JNT",-401559159," \uf053䁔\uf053ꁔ䁟","谇㰀됀退쐀退ꠇ밀退ꐀ蠀ꠇ堀\udc00퐀뀀ꐀ蠀\uf807뀇䐀","㾼ﾹ㾿ﾹ㾭뾼ﾹ㾽羻㾭羶뾾㾾ﾻ㾽羻㾲ﾾﾻ뾼뾺ﾺ㾾",-1392963162>("ʁȺʅʊʃȠȲȝʁ");
         var10000 < (-1091088544 & -1431806826 ^ -1432335351);
         var10000 += -1565399945 >>> 1131871061 ^ 1300
      ) {
         0<"JNT",-1775584616,"達끑ꁔ遟\ue053灑联灟ꁔ","谇　᠀뀇䐀","㾼ﾹ㾿ﾹ㾭뾼ﾹ㾽羻㾭羶뾾㾾ﾻ㾽羻㾲ﾾﾻ뾼뾺ﾺ㾾",-1392963163>(
            var10001,
            var10000,
            (char)((0<"JNT",-1775584616,"遑\ue053灑联灟ꁔ","谇　뀇᠀","㾼ﾹ㾿ﾹ㾭뾼ﾹ㾽羻㾭羶뾾㾾ﾻ㾽羻㾲ﾾﾻ뾼뾺ﾺ㾾",-1392963168>(var10001, var10000) - 155 ^ 228 ^ 181) - 245 ^ 150)
         );
      }

      String var4 = 0<"JNT",-1775584616,"ꁔ偔遒ꁔ联\uf053䁔큓","谇뀇㰀됀退쐀退ꠇ밀退ꐀ蠀ꠇ堀\udc00퐀뀀ꐀ蠀\uf807","㾼ﾹ㾿ﾹ㾭뾼ﾹ㾽羻㾭羶뾾㾾ﾻ㾽羻㾲ﾾﾻ뾼뾺ﾺ㾾",-1392963504>(var10001);
      var19 = (-1719185498 >>> (-581786387 ^ -1190157085) | 0) & -1576202078;

      for (var10003 = (StringBuilder)0<"JNT",-401559159," \uf053䁔\uf053ꁔ䁟","谇㰀됀退쐀退ꠇ밀退ꐀ蠀ꠇ堀\udc00퐀뀀ꐀ蠀\uf807뀇䐀","㾼ﾹ㾿ﾹ㾭뾼ﾹ㾽羻㾭羶뾾㾾ﾻ㾽羻㾲ﾾﾻ뾼뾺ﾺ㾾",-1392963499>("､뽢｝ｑ罥㽣뽠｣｜");
         var19 < ((763371969 | -1502382513 | 0) & 262169);
         var19 += (531539570 | 2054746342 | 1) & -2147481591
      ) {
         int var54 = 0<"JNT",-1775584616,"遑\ue053灑联灟ꁔ","谇　뀇᠀","㾼ﾹ㾿ﾹ㾭뾼ﾹ㾽羻㾭羶뾾㾾ﾻ㾽羻㾲ﾾﾻ뾼뾺ﾺ㾾",-1392962803>(var10003, var19) + 180;
         int var80 = (var54 & 49152) >> 14;
         int var55 = (var54 & 49152) >> 14 | var54 << 2;
         int var81 = (((var54 & 49152) >> 14 | var54 << 2) & 0) >> 16;
         char var56 = (char)((((var80 | var54 << 2) & 0) >> 16 | ((var54 & 49152) >> 14 | var54 << 2) << 0) ^ 231 ^ 211);
         0<"JNT",-1775584616,"達끑ꁔ遟\ue053灑联灟ꁔ","谇　᠀뀇䐀","㾼ﾹ㾿ﾹ㾭뾼ﾹ㾽羻㾭羶뾾㾾ﾻ㾽羻㾲ﾾﾻ뾼뾺ﾺ㾾",-1392963510>(var10003, var19, (char)((var81 | var55 << 0) ^ 231 ^ 211));
      }

      field_1102 = (Class_245)0<"JNT",-401559159," \uf053䁔\uf053ꁔ䁟","谇㰀됀退쐀退ꠇ밀退ꐀ蠀ꠇ堀\udc00퐀뀀ꐀ蠀\uf807　㰀됀退쐀退ꠇ밀退ꐀ蠀ꠇ堀\udc00퐀뀀ꐀ蠀\uf807뀇䐀","羽ﾾ",-1392962807>(
         var4, 1, 0<"JNT",-1775584616,"ꁔ偔遒ꁔ联\uf053䁔큓","谇뀇㰀됀退쐀退ꠇ밀退ꐀ蠀ꠇ堀\udc00퐀뀀ꐀ蠀\uf807","㾼ﾹ㾿ﾹ㾭뾼ﾹ㾽羻㾭羶뾾㾾ﾻ㾽羻㾲ﾾﾻ뾼뾺ﾺ㾾",-1392963516>(var10003)
      );
      var10000 = (1357702138 ^ 1357702138 | 0) & -1249253621;

      for (var10001 = (StringBuilder)0<"JNT",-401559159," \uf053䁔\uf053ꁔ䁟","谇㰀됀退쐀退ꠇ밀退ꐀ蠀ꠇ堀\udc00퐀뀀ꐀ蠀\uf807뀇䐀","㾼ﾹ㾿ﾹ㾭뾼ﾹ㾽羻㾭羶뾾㾾ﾻ㾽羻㾲ﾾﾻ뾼뾺ﾺ㾾",-1392962794>(
            "嗀礼﨟﨟礼猪﨨益﨎﨑﨟"
         );
         var10000 < ((1946862430 << -365031900 | 11) & 739426315);
         var10000 += -2119254926 * 1335812421 ^ 68484283
      ) {
         var19 = 0<"JNT",-1775584616,"遑\ue053灑联灟ꁔ","谇　뀇᠀","㾼ﾹ㾿ﾹ㾭뾼ﾹ㾽羻㾭羶뾾㾾ﾻ㾽羻㾲ﾾﾻ뾼뾺ﾺ㾾",-1392963474>(var10001, var10000) ^ 'a';
         int var58 = (var19 & 65528) >> 3;
         int var27 = ((var19 & 65528) >> 3 | var19 << 13) ^ 180;
         int var59 = ((((var19 & 65528) >> 3 | var19 << 13) ^ 180) & 57344) >> 13;
         char var28 = (char)(((((var58 | var19 << 13) ^ 180) & 57344) >> 13 | (((var19 & 65528) >> 3 | var19 << 13) ^ 180) << 3) + 118);
         0<"JNT",-1775584616,"達끑ꁔ遟\ue053灑联灟ꁔ","谇　᠀뀇䐀","㾼ﾹ㾿ﾹ㾭뾼ﾹ㾽羻㾭羶뾾㾾ﾻ㾽羻㾲ﾾﾻ뾼뾺ﾺ㾾",-1392963165>(var10001, var10000, (char)((var59 | var27 << 3) + 118));
      }

      String var7 = 0<"JNT",-1775584616,"ꁔ偔遒ꁔ联\uf053䁔큓","谇뀇㰀됀退쐀退ꠇ밀退ꐀ蠀ꠇ堀\udc00퐀뀀ꐀ蠀\uf807","㾼ﾹ㾿ﾹ㾭뾼ﾹ㾽羻㾭羶뾾㾾ﾻ㾽羻㾲ﾾﾻ뾼뾺ﾺ㾾",-1392962805>(var10001);
      var19 = (-245739093 & 1667860443 + -245739093 | 0) & 194347572;

      for (var10003 = (StringBuilder)0<"JNT",-401559159," \uf053䁔\uf053ꁔ䁟","谇㰀됀退쐀退ꠇ밀退ꐀ蠀ꠇ堀\udc00퐀뀀ꐀ蠀\uf807뀇䐀","㾼ﾹ㾿ﾹ㾭뾼ﾹ㾽羻㾭羶뾾㾾ﾻ㾽羻㾲ﾾﾻ뾼뾺ﾺ㾾",-1392962808>(
            "␄縄蠄蠄縄稄\ue003㠄樄氄蠄"
         );
         var19 < (1004225589 >>> -952854976 ^ 1004225598);
         var19 += -1398944230 ^ 2006925026 - (-1398944230 | 2006925026) ^ -614272525
      ) {
         char var61 = 0<"JNT",-1775584616,"遑\ue053灑联灟ꁔ","谇　뀇᠀","㾼ﾹ㾿ﾹ㾭뾼ﾹ㾽羻㾭羶뾾㾾ﾻ㾽羻㾲ﾾﾻ뾼뾺ﾺ㾾",-1392963166>(var10003, var19);
         int var82 = (var61 & 'ﰀ') >> 10;
         int var62 = ((var61 & 'ﰀ') >> 10 | var61 << 6) - 252 + 64 - 44;
         int var83 = (((var61 & 'ﰀ') >> 10 | var61 << 6) - 252 + 64 - 44 & 32768) >> 15;
         var61 = (char)(((var82 | var61 << 6) - 252 + 64 - 44 & 32768) >> 15 | ((var61 & 'ﰀ') >> 10 | var61 << 6) - 252 + 64 - 44 << 1);
         0<"JNT",-1775584616,"達끑ꁔ遟\ue053灑联灟ꁔ","谇　᠀뀇䐀","㾼ﾹ㾿ﾹ㾭뾼ﾹ㾽羻㾭羶뾾㾾ﾻ㾽羻㾲ﾾﾻ뾼뾺ﾺ㾾",-1392963161>(var10003, var19, (char)(var83 | var62 << 1));
      }

      field_1103 = (Class_245)0<"JNT",-401559159," \uf053䁔\uf053ꁔ䁟","谇㰀됀退쐀退ꠇ밀退ꐀ蠀ꠇ堀\udc00퐀뀀ꐀ蠀\uf807　㰀됀退쐀退ꠇ밀退ꐀ蠀ꠇ堀\udc00퐀뀀ꐀ蠀\uf807뀇䐀","羽ﾾ",-1392963492>(
         var7, 2, 0<"JNT",-1775584616,"ꁔ偔遒ꁔ联\uf053䁔큓","谇뀇㰀됀退쐀退ꠇ밀退ꐀ蠀ꠇ堀\udc00퐀뀀ꐀ蠀\uf807","㾼ﾹ㾿ﾹ㾭뾼ﾹ㾽羻㾭羶뾾㾾ﾻ㾽羻㾲ﾾﾻ뾼뾺ﾺ㾾",-1392963489>(var10003)
      );
      var10000 = -43471313 + 1527276733 ^ 1483805420;

      for (var10001 = (StringBuilder)0<"JNT",-401559159," \uf053䁔\uf053ꁔ䁟","谇㰀됀退쐀退ꠇ밀退ꐀ蠀ꠇ堀\udc00퐀뀀ꐀ蠀\uf807뀇䐀","㾼ﾹ㾿ﾹ㾭뾼ﾹ㾽羻㾭羶뾾㾾ﾻ㾽羻㾲ﾾﾻ뾼뾺ﾺ㾾",-1392963167>(
            "丯仿住住仿仟俿伯亟乿亏住"
         );
         var10000 < (1842932875 ^ 1842932875 ^ 12);
         var10000 += (-1858057580 * (255231890 + 650652331) | 1) & 76223121
      ) {
         char var33 = 0<"JNT",-1775584616,"遑\ue053灑联灟ꁔ","谇　뀇᠀","㾼ﾹ㾿ﾹ㾭뾼ﾹ㾽羻㾭羶뾾㾾ﾻ㾽羻㾲ﾾﾻ뾼뾺ﾺ㾾",-1392963491>(var10001, var10000);
         int var65 = (var33 & '\ue000') >> 13;
         int var34 = ((var33 & '\ue000') >> 13 | var33 << 3) ^ 250;
         int var66 = ((((var33 & '\ue000') >> 13 | var33 << 3) ^ 250) & 65408) >> 7;
         var33 = (char)(((((var65 | var33 << 3) ^ 250) & 65408) >> 7 | (((var33 & '\ue000') >> 13 | var33 << 3) ^ 250) << 9) ^ 237 ^ 76);
         0<"JNT",-1775584616,"達끑ꁔ遟\ue053灑联灟ꁔ","谇　᠀뀇䐀","㾼ﾹ㾿ﾹ㾭뾼ﾹ㾽羻㾭羶뾾㾾ﾻ㾽羻㾲ﾾﾻ뾼뾺ﾺ㾾",-1392963494>(var10001, var10000, (char)((var66 | var34 << 9) ^ 237 ^ 76));
      }

      String var10 = 0<"JNT",-1775584616,"ꁔ偔遒ꁔ联\uf053䁔큓","谇뀇㰀됀退쐀退ꠇ밀退ꐀ蠀ꠇ堀\udc00퐀뀀ꐀ蠀\uf807","㾼ﾹ㾿ﾹ㾭뾼ﾹ㾽羻㾭羶뾾㾾ﾻ㾽羻㾲ﾾﾻ뾼뾺ﾺ㾾",-1392963493>(var10001);
      var19 = (-1310166386 >>> -1473655608 | 0) & -771222012;

      for (var10003 = (StringBuilder)0<"JNT",-401559159," \uf053䁔\uf053ꁔ䁟","谇㰀됀退쐀退ꠇ밀退ꐀ蠀ꠇ堀\udc00퐀뀀ꐀ蠀\uf807뀇䐀","㾼ﾹ㾿ﾹ㾭뾼ﾹ㾽羻㾭羶뾾㾾ﾻ㾽羻㾲ﾾﾻ뾼뾺ﾺ㾾",-1392963496>(
            "憎ՀڀڀՀӀ\uf1bf︿π̀\u0380ڀ"
         );
         var19 < 12;
         var19 += (1660814894 >>> -2008048017 | 1) & 1561733123
      ) {
         char var68 = 0<"JNT",-1775584616,"遑\ue053灑联灟ꁔ","谇　뀇᠀","㾼ﾹ㾿ﾹ㾭뾼ﾹ㾽羻㾭羶뾾㾾ﾻ㾽羻㾲ﾾﾻ뾼뾺ﾺ㾾",-1392963518>(var10003, var19);
         char var71 = (char)(
            (
                  (((((var68 & '\ufffe') >> 1 | var68 << 15) + 0 & 63488) >> 11 | ((var68 & '\ufffe') >> 1 | var68 << 15) + 0 << 5) & 64512) >> 10
                     | ((((var68 & '\ufffe') >> 1 | var68 << 15) + 0 & 63488) >> 11 | ((var68 & '\ufffe') >> 1 | var68 << 15) + 0 << 5) << 6
               )
               + 90
         );
         0<"JNT",-1775584616,"達끑ꁔ遟\ue053灑联灟ꁔ","谇　᠀뀇䐀","㾼ﾹ㾿ﾹ㾭뾼ﾹ㾽羻㾭羶뾾㾾ﾻ㾽羻㾲ﾾﾻ뾼뾺ﾺ㾾",-1392963513>(
            var10003,
            var19,
            (char)(
               (
                     (((((var68 & '\ufffe') >> 1 | var68 << 15) + 0 & 63488) >> 11 | ((var68 & '\ufffe') >> 1 | var68 << 15) + 0 << 5) & 64512) >> 10
                        | ((((var68 & '\ufffe') >> 1 | var68 << 15) + 0 & 63488) >> 11 | ((var68 & '\ufffe') >> 1 | var68 << 15) + 0 << 5) << 6
                  )
                  + 90
            )
         );
      }

      field_1104 = (Class_245)0<"JNT",-401559159," \uf053䁔\uf053ꁔ䁟","谇㰀됀退쐀退ꠇ밀退ꐀ蠀ꠇ堀\udc00퐀뀀ꐀ蠀\uf807　㰀됀退쐀退ꠇ밀退ꐀ蠀ꠇ堀\udc00퐀뀀ꐀ蠀\uf807뀇䐀","羽ﾾ",-1392963508>(
         var10, 3, 0<"JNT",-1775584616,"ꁔ偔遒ꁔ联\uf053䁔큓","谇뀇㰀됀退쐀退ꠇ밀退ꐀ蠀ꠇ堀\udc00퐀뀀ꐀ蠀\uf807","㾼ﾹ㾿ﾹ㾭뾼ﾹ㾽羻㾭羶뾾㾾ﾻ㾽羻㾲ﾾﾻ뾼뾺ﾺ㾾",-1392963505>(var10003)
      );
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1194(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = (((var10 ^ 1702499675) + 769497416 ^ 2062040733) + 1674764791 ^ 234447353) + 1841911815 - 464552222 - 730585388 ^ 1357044831;
      MethodHandle var10000 = field_1107[(
            (((var10 ^ 1702499675) + 769497416 ^ 2062040733) + 1674764791 ^ 234447353) + 1841911815 - 464552222 - 730585388 ^ 1357044831
         )
         - 1942830222];
      if (field_1107[var10001 - 1942830222] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = 641834922 >> -627984890 ^ 10028670; var23 < var13.length(); var23 += (2052772959 ^ 2052772959 | 1) & -1466572411) {
            int var42 = var13.charAt(var23) - 'N';
            char var45 = (char)(
               ((((((var42 & 65535) >> 0 | var42 << 16) & 57344) >> 13 | ((var42 & 65535) >> 0 | var42 << 16) << 3) - 222 - 137 - 47 ^ 72) + 220 + 135 & 32768)
                     >> 15
                  | (((((var42 & 65535) >> 0 | var42 << 16) & 57344) >> 13 | ((var42 & 65535) >> 0 | var42 << 16) << 3) - 222 - 137 - 47 ^ 72) + 220 + 135 << 1
            );
            var13.setCharAt(
               var23,
               (char)(
                  (
                           (((((var42 & 65535) >> 0 | var42 << 16) & 57344) >> 13 | ((var42 & 65535) >> 0 | var42 << 16) << 3) - 222 - 137 - 47 ^ 72)
                                 + 220
                                 + 135
                              & 32768
                        )
                        >> 15
                     | (((((var42 & 65535) >> 0 | var42 << 16) & 57344) >> 13 | ((var42 & 65535) >> 0 | var42 << 16) << 3) - 222 - 137 - 47 ^ 72) + 220 + 135
                        << 1
               )
            );
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = (1513915920 * 94997743 | 0) & -686553338; var29 < var16.length(); var29 += (1097091947 * -77150052 | 1) & -1778380789) {
            int var50 = var16.charAt(var29);
            int var87 = (var50 & 65535) >> 0;
            int var51 = (var50 & 65535) >> 0 | var50 << 16;
            int var88 = (((var50 & 65535) >> 0 | var50 << 16) & 63488) >> 11;
            var50 = (((var87 | var50 << 16) & 63488) >> 11 | ((var50 & 65535) >> 0 | var50 << 16) << 5) ^ 154;
            var87 = (((var88 | var51 << 5) ^ 154) & 65534) >> 1;
            int var53 = (((var88 | var51 << 5) ^ 154) & 65534) >> 1 | var50 << 15;
            int var90 = (((((var88 | var51 << 5) ^ 154) & 65534) >> 1 | var50 << 15) & 65532) >> 2;
            var50 = (((var87 | var50 << 15) & 65532) >> 2 | ((((var88 | var51 << 5) ^ 154) & 65534) >> 1 | var50 << 15) << 14) ^ 3;
            var87 = (((var90 | var53 << 14) ^ 3) & 61440) >> 12;
            int var55 = ((((var90 | var53 << 14) ^ 3) & 61440) >> 12 | var50 << 4) - 225;
            int var92 = (((((var90 | var53 << 14) ^ 3) & 61440) >> 12 | var50 << 4) - 225 & 0) >> 16;
            char var56 = (char)((((var87 | var50 << 4) - 225 & 0) >> 16 | ((((var90 | var53 << 14) ^ 3) & 61440) >> 12 | var50 << 4) - 225 << 0) + 34);
            var16.setCharAt(var29, (char)((var92 | var55 << 0) + 34));
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_245.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = 18109043 + 767935146 ^ 786044189; var35 < var19.length(); var35 += -2141981842 >>> 2065404468 ^ 2052) {
            char var61 = var19.charAt(var35);
            char var64 = (char)(
               (
                     (
                              (
                                    (((var61 & '쀀') >> 14 | var61 << 2) - 40 + 244 - 129 + 144 + 57 + 57 & 0) >> 16
                                       | ((var61 & '쀀') >> 14 | var61 << 2) - 40 + 244 - 129 + 144 + 57 + 57 << 0
                                 )
                                 & 0
                           )
                           >> 16
                        | (
                              (((var61 & '쀀') >> 14 | var61 << 2) - 40 + 244 - 129 + 144 + 57 + 57 & 0) >> 16
                                 | ((var61 & '쀀') >> 14 | var61 << 2) - 40 + 244 - 129 + 144 + 57 + 57 << 0
                           )
                           << 0
                  )
                  + 45
            );
            var19.setCharAt(
               var35,
               (char)(
                  (
                        (
                                 (
                                       (((var61 & '쀀') >> 14 | var61 << 2) - 40 + 244 - 129 + 144 + 57 + 57 & 0) >> 16
                                          | ((var61 & '쀀') >> 14 | var61 << 2) - 40 + 244 - 129 + 144 + 57 + 57 << 0
                                    )
                                    & 0
                              )
                              >> 16
                           | (
                                 (((var61 & '쀀') >> 14 | var61 << 2) - 40 + 244 - 129 + 144 + 57 + 57 & 0) >> 16
                                    | ((var61 & '쀀') >> 14 | var61 << 2) - 40 + 244 - 129 + 144 + 57 + 57 << 0
                              )
                              << 0
                     )
                     + 45
               )
            );
         }

         Class var7 = Class.forName(var19.toString(), false, Class_245.class.getClassLoader());
         switch ((var4 + 680782016 + 2136366652 + 2092773401 ^ 657282045 ^ 1100240043 ^ 391741480 ^ 218539408) - 2106214196 + 683282712 ^ 1936031582) {
            case 30812439:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            case 33989241:
            case 421624417:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 1499980648:
               var10000 = var0.findSpecial(var7, var5, var6, Class_245.class);
               break;
            case 1760078602:
               var10000 = var0.findConstructor(var7, var6);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_1107[((((var10 ^ 1702499675) + 769497416 ^ 2062040733) + 1674764791 ^ 234447353) + 1841911815 - 464552222 - 730585388 ^ 1357044831) - 1942830222] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1195(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 + 1535314463 ^ 76179523 ^ 320101340) - 63218602 - 1825020537 - 1804518888 ^ 1192039232 ^ 1111527569) + 977920313;
      MethodHandle var10000 = field_1107[((var10 + 1535314463 ^ 76179523 ^ 320101340) - 63218602 - 1825020537 - 1804518888 ^ 1192039232 ^ 1111527569)
            + 977920313
         ^ 1868908854];
      if (field_1107[var10001 ^ 1868908854] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = 801400424 * 801400424 ^ 674695744; var24 < var14.length(); var24 += (-523064210 >> -1481137790 | 0) & 130175077) {
            int var43 = var14.charAt(var24);
            int var10004 = (var43 & 65472) >> 6;
            int var44 = ((var43 & 65472) >> 6 | var43 << 10) + 205;
            int var82 = (((var43 & 65472) >> 6 | var43 << 10) + 205 & 65024) >> 9;
            var43 = (((var10004 | var43 << 10) + 205 & 65024) >> 9 | ((var43 & 65472) >> 6 | var43 << 10) + 205 << 7) - 28 - 43 ^ 163 ^ 117;
            var10004 = (((var82 | var44 << 7) - 28 - 43 ^ 163 ^ 117) & 65535) >> 0;
            int var46 = (((var82 | var44 << 7) - 28 - 43 ^ 163 ^ 117) & 65535) >> 0 | var43 << 16;
            int var84 = (((((var82 | var44 << 7) - 28 - 43 ^ 163 ^ 117) & 65535) >> 0 | var43 << 16) & 65472) >> 6;
            char var47 = (char)(
               (((var10004 | var43 << 16) & 65472) >> 6 | ((((var82 | var44 << 7) - 28 - 43 ^ 163 ^ 117) & 65535) >> 0 | var43 << 16) << 10) ^ 142
            );
            var14.setCharAt(var24, (char)((var84 | var46 << 10) ^ 142));
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = 937499277 >> 1433544924 ^ 3; var30 < var17.length(); var30 += (-486824754 * (530379832 >>> 530379832) | 1) & 50529033) {
            int var52 = (var17.charAt(var30) - 174 ^ 252) + 77;
            int var85 = (var52 & 65534) >> 1;
            int var53 = (var52 & 65534) >> 1 | var52 << 15;
            int var86 = (((var52 & 65534) >> 1 | var52 << 15) & 64512) >> 10;
            var52 = (((var85 | var52 << 15) & 64512) >> 10 | ((var52 & 65534) >> 1 | var52 << 15) << 6) - 174 - 112 + 135;
            var85 = ((var86 | var53 << 6) - 174 - 112 + 135 & 65520) >> 4;
            int var55 = ((var86 | var53 << 6) - 174 - 112 + 135 & 65520) >> 4 | var52 << 12;
            int var88 = ((((var86 | var53 << 6) - 174 - 112 + 135 & 65520) >> 4 | var52 << 12) & 65504) >> 5;
            char var56 = (char)(((var85 | var52 << 12) & 65504) >> 5 | (((var86 | var53 << 6) - 174 - 112 + 135 & 65520) >> 4 | var52 << 12) << 11);
            var17.setCharAt(var30, (char)(var88 | var55 << 11));
         }

         Class var6 = Class.forName(var17.toString(), false, Class_245.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = -264532604 - 1871861780 ^ -2136394384; var36 < var20.length(); var36 += (1221542820 * 99816888 | 1) & 1074693149) {
            int var61 = var20.charAt(var36) + 171;
            int var89 = (var61 & 32768) >> 15;
            int var62 = (((var61 & 32768) >> 15 | var61 << 1) ^ 61 ^ 238 ^ 6) - 169;
            int var90 = ((((var61 & 32768) >> 15 | var61 << 1) ^ 61 ^ 238 ^ 6) - 169 & 65024) >> 9;
            char var63 = (char)(
               (((((var89 | var61 << 1) ^ 61 ^ 238 ^ 6) - 169 & 65024) >> 9 | (((var61 & 32768) >> 15 | var61 << 1) ^ 61 ^ 238 ^ 6) - 169 << 7) ^ 38) + 198 - 6
            );
            var20.setCharAt(var36, (char)(((var90 | var62 << 7) ^ 38) + 198 - 6));
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_245.class.getClassLoader()).returnType();
         switch (((var4 + 1610316257 ^ 807891315 ^ 445921008 ^ 1839917646) + 846870682 ^ 495142763) + 1847744274 + 2135032154 ^ 118642598 ^ 463630014) {
            case 461412584:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            case 599366819:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            case 721905408:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            case 1514751222:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_1107[((var10 + 1535314463 ^ 76179523 ^ 320101340) - 63218602 - 1825020537 - 1804518888 ^ 1192039232 ^ 1111527569) + 977920313 ^ 1868908854] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
