import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;

public enum Class_404 {
   // $VF: renamed from: ou Class_404
   field_999,
   // $VF: renamed from: byw Class_404
   field_1000,
   // $VF: renamed from: kh Class_404
   field_1001;

   // $VF: renamed from: aue java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_1002 = new MethodHandle[21];

   // $VF: Failed to inline enum fields
   // Please report this to the Vineflower issue tracker, at https://github.com/Vineflower/vineflower/issues with a copy of the class file (if you have the rights to distribute it!)
   static {
      int var10000 = 903280621 * -2115450257 ^ 329155011;

      StringBuilder var10001;
      for (var10001 = (StringBuilder)0<"JNT",1923484247,"\ue765潧坧潧ꝧ흥","筨赧鱧韧ꉧ韧绨鵧韧鹧髧绨郧ꅧꁧ鯧鹧髧蓧篨鉧","性耩\ue026耩\ue031‧耩\ue029쀨\ue031䀤\u2028怨耦\ue029쀨怦(耦‧\u202a*怨",1232381112>(
            "\u0000\u001f$�\ufff1\ufffe"
         );
         var10000 < ((-2009498896 * (-2009498896 - -2009498896) | 6) & -1521508241);
         var10000 += (-1990254441 * 412561782 | 1) & 394854945
      ) {
         0<"JNT",1734012625,"齧ཧꝧὦݧ⽧띧⽦ꝧ","筨诧裧篨鉧","性耩\ue026耩\ue031‧耩\ue029쀨\ue031䀤\u2028怨耦\ue029쀨怦(耦‧\u202a*怨",1232381137>(
            var10001,
            var10000,
            (char)(
               (
                     0<"JNT",1734012625,"ὧݧ⽧띧⽦ꝧ","筨诧篨裧","性耩\ue026耩\ue031‧耩\ue029쀨\ue031䀤\u2028怨耦\ue029쀨怦(耦‧\u202a*怨",1232381140>(var10001, var10000)
                           + 240
                           - 127
                        ^ 17
                  )
                  - 96
                  + 78
            )
         );
      }

      field_999 = (Class_404)0<"JNT",1923484247,"\ue765潧坧潧ꝧ흥","筨赧鱧韧ꉧ韧绨鵧韧鹧髧绨郧ꅧꁧ鯧鹧髧蓧诧篨鉧","耤䀧",1232381136>(
         0<"JNT",1734012625,"ꝧ㽧齦ꝧ띧潧坧ｦ","筨篨赧鱧韧ꉧ韧绨鵧韧鹧髧绨郧ꅧꁧ鯧鹧髧蓧","性耩\ue026耩\ue031‧耩\ue029쀨\ue031䀤\u2028怨耦\ue029쀨怦(耦‧\u202a*怨",1232381199>(var10001), 0
      );
      var10000 = -1804152816 << -1804152816 ^ -804257792;

      for (var10001 = (StringBuilder)0<"JNT",1923484247,"\ue765潧坧潧ꝧ흥","筨赧鱧韧ꉧ韧绨鵧韧鹧髧绨郧ꅧꁧ鯧鹧髧蓧篨鉧","性耩\ue026耩\ue031‧耩\ue029쀨\ue031䀤\u2028怨耦\ue029쀨怦(耦‧\u202a*怨",1232381133>(
            "샽⣾ヾヾ䓾ᓾ䃾䓾ࣾ㓾"
         );
         var10000 < 10;
         var10000 += -1641372494 >> -845791956 ^ -400725
      ) {
         int var12 = 0<"JNT",1734012625,"ὧݧ⽧띧⽦ꝧ","筨诧篨裧","性耩\ue026耩\ue031‧耩\ue029쀨\ue031䀤\u2028怨耦\ue029쀨怦(耦‧\u202a*怨",1232381134>(var10001, var10000)
            - 243
            - 26
            + 17;
         char var13 = (char)(((var12 & 64512) >> 10 | var12 << 6) - 29);
         0<"JNT",1734012625,"齧ཧꝧὦݧ⽧띧⽦ꝧ","筨诧裧篨鉧","性耩\ue026耩\ue031‧耩\ue029쀨\ue031䀤\u2028怨耦\ue029쀨怦(耦‧\u202a*怨",1232381139>(
            var10001, var10000, (char)(((var12 & 64512) >> 10 | var12 << 6) - 29)
         );
      }

      field_1000 = (Class_404)0<"JNT",1923484247,"\ue765潧坧潧ꝧ흥","筨赧鱧韧ꉧ韧绨鵧韧鹧髧绨郧ꅧꁧ鯧鹧髧蓧诧篨鉧","耤䀧",1232381113>(
         0<"JNT",1734012625,"ꝧ㽧齦ꝧ띧潧坧ｦ","筨篨赧鱧韧ꉧ韧绨鵧韧鹧髧绨郧ꅧꁧ鯧鹧髧蓧","性耩\ue026耩\ue031‧耩\ue029쀨\ue031䀤\u2028怨耦\ue029쀨怦(耦‧\u202a*怨",1232381116>(var10001), 1
      );
      var10000 = (-1173280568 - -732529810 | 0) & 402981380;

      for (var10001 = (StringBuilder)0<"JNT",1923484247,"\ue765潧坧潧ꝧ흥","筨赧鱧韧ꉧ韧绨鵧韧鹧髧绨郧ꅧꁧ鯧鹧髧蓧篨鉧","性耩\ue026耩\ue031‧耩\ue029쀨\ue031䀤\u2028怨耦\ue029쀨怦(耦‧\u202a*怨",1232381114>(
            "ǝǹċǽǗčĊ"
         );
         var10000 < (845963735 + 845963735 ^ 1691927465);
         var10000 += (-1979117917 >> -1685875242 | 1) & 343
      ) {
         0<"JNT",1734012625,"齧ཧꝧὦݧ⽧띧⽦ꝧ","筨诧裧篨鉧","性耩\ue026耩\ue031‧耩\ue029쀨\ue031䀤\u2028怨耦\ue029쀨怦(耦‧\u202a*怨",1232381111>(
            var10001,
            var10000,
            (char)(
               (0<"JNT",1734012625,"ὧݧ⽧띧⽦ꝧ","筨诧篨裧","性耩\ue026耩\ue031‧耩\ue029쀨\ue031䀤\u2028怨耦\ue029쀨怦(耦‧\u202a*怨",1232381138>(var10001, var10000) ^ 137)
                  - 161
                  + 184
                  - 146
                  - 148
            )
         );
      }

      field_1001 = (Class_404)0<"JNT",1923484247,"\ue765潧坧潧ꝧ흥","筨赧鱧韧ꉧ韧绨鵧韧鹧髧绨郧ꅧꁧ鯧鹧髧蓧诧篨鉧","耤䀧",1232381110>(
         0<"JNT",1734012625,"ꝧ㽧齦ꝧ띧潧坧ｦ","筨篨赧鱧韧ꉧ韧绨鵧韧鹧髧绨郧ꅧꁧ鯧鹧髧蓧","性耩\ue026耩\ue031‧耩\ue029쀨\ue031䀤\u2028怨耦\ue029쀨怦(耦‧\u202a*怨",1232381109>(var10001), 2
      );
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1137(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = (var10 + 157420544 + 99273547 ^ 372421363 ^ 1787692501 ^ 2057259060) - 1371108640 + 842326 + 297285889 ^ 1231113184;
      MethodHandle var10000 = field_1002[((var10 + 157420544 + 99273547 ^ 372421363 ^ 1787692501 ^ 2057259060) - 1371108640 + 842326 + 297285889 ^ 1231113184)
         - 1469016730];
      if (field_1002[var10001 - 1469016730] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = (1481739932 ^ -1514448141 | 0) & 1387280; var23 < var13.length(); var23 += -550843444 - -77897564 ^ -472945879) {
            int var42 = var13.charAt(var23);
            int var10004 = (var42 & 65534) >> 1;
            int var43 = ((var42 & 65534) >> 1 | var42 << 15) + 30;
            int var89 = (((var42 & 65534) >> 1 | var42 << 15) + 30 & 65532) >> 2;
            var42 = (((var10004 | var42 << 15) + 30 & 65532) >> 2 | ((var42 & 65534) >> 1 | var42 << 15) + 30 << 14) + 76;
            var10004 = ((var89 | var43 << 14) + 76 & 65504) >> 5;
            int var45 = ((var89 | var43 << 14) + 76 & 65504) >> 5 | var42 << 11;
            int var91 = ((((var89 | var43 << 14) + 76 & 65504) >> 5 | var42 << 11) & 0) >> 16;
            var42 = ((var10004 | var42 << 11) & 0) >> 16 | (((var89 | var43 << 14) + 76 & 65504) >> 5 | var42 << 11) << 0;
            var10004 = ((var91 | var45 << 0) & 49152) >> 14;
            int var47 = ((((var91 | var45 << 0) & 49152) >> 14 | var42 << 2) ^ 199) + 17;
            int var93 = (((((var91 | var45 << 0) & 49152) >> 14 | var42 << 2) ^ 199) + 17 & 65504) >> 5;
            char var48 = (char)((((var10004 | var42 << 2) ^ 199) + 17 & 65504) >> 5 | ((((var91 | var45 << 0) & 49152) >> 14 | var42 << 2) ^ 199) + 17 << 11);
            var13.setCharAt(var23, (char)(var93 | var47 << 11));
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = -1218535110 - 2030504735 ^ 1045927451; var29 < var16.length(); var29 += (-39262797 ^ 2015317462 | 0) & 1073747203) {
            char var53 = var16.charAt(var29);
            char var58 = (char)(
               (
                     (
                              (
                                       (
                                                (
                                                      (
                                                               (
                                                                     ((((var53 & '쀀') >> 14 | var53 << 2) + 126 ^ 182) - 168 & 63488) >> 11
                                                                        | (((var53 & '쀀') >> 14 | var53 << 2) + 126 ^ 182) - 168 << 5
                                                                  )
                                                                  & 64512
                                                            )
                                                            >> 10
                                                         | (
                                                               ((((var53 & '쀀') >> 14 | var53 << 2) + 126 ^ 182) - 168 & 63488) >> 11
                                                                  | (((var53 & '쀀') >> 14 | var53 << 2) + 126 ^ 182) - 168 << 5
                                                            )
                                                            << 6
                                                   )
                                                   & 65534
                                             )
                                             >> 1
                                          | (
                                                (
                                                         (
                                                               ((((var53 & '쀀') >> 14 | var53 << 2) + 126 ^ 182) - 168 & 63488) >> 11
                                                                  | (((var53 & '쀀') >> 14 | var53 << 2) + 126 ^ 182) - 168 << 5
                                                            )
                                                            & 64512
                                                      )
                                                      >> 10
                                                   | (
                                                         ((((var53 & '쀀') >> 14 | var53 << 2) + 126 ^ 182) - 168 & 63488) >> 11
                                                            | (((var53 & '쀀') >> 14 | var53 << 2) + 126 ^ 182) - 168 << 5
                                                      )
                                                      << 6
                                             )
                                             << 15
                                    )
                                    - 40
                                 & 65528
                           )
                           >> 3
                        | (
                                 (
                                          (
                                                (
                                                         (
                                                               ((((var53 & '쀀') >> 14 | var53 << 2) + 126 ^ 182) - 168 & 63488) >> 11
                                                                  | (((var53 & '쀀') >> 14 | var53 << 2) + 126 ^ 182) - 168 << 5
                                                            )
                                                            & 64512
                                                      )
                                                      >> 10
                                                   | (
                                                         ((((var53 & '쀀') >> 14 | var53 << 2) + 126 ^ 182) - 168 & 63488) >> 11
                                                            | (((var53 & '쀀') >> 14 | var53 << 2) + 126 ^ 182) - 168 << 5
                                                      )
                                                      << 6
                                             )
                                             & 65534
                                       )
                                       >> 1
                                    | (
                                          (
                                                   (
                                                         ((((var53 & '쀀') >> 14 | var53 << 2) + 126 ^ 182) - 168 & 63488) >> 11
                                                            | (((var53 & '쀀') >> 14 | var53 << 2) + 126 ^ 182) - 168 << 5
                                                      )
                                                      & 64512
                                                )
                                                >> 10
                                             | (
                                                   ((((var53 & '쀀') >> 14 | var53 << 2) + 126 ^ 182) - 168 & 63488) >> 11
                                                      | (((var53 & '쀀') >> 14 | var53 << 2) + 126 ^ 182) - 168 << 5
                                                )
                                                << 6
                                       )
                                       << 15
                              )
                              - 40
                           << 13
                  )
                  - 202
            );
            var16.setCharAt(
               var29,
               (char)(
                  (
                        (
                                 (
                                          (
                                                   (
                                                         (
                                                                  (
                                                                        ((((var53 & '쀀') >> 14 | var53 << 2) + 126 ^ 182) - 168 & 63488) >> 11
                                                                           | (((var53 & '쀀') >> 14 | var53 << 2) + 126 ^ 182) - 168 << 5
                                                                     )
                                                                     & 64512
                                                               )
                                                               >> 10
                                                            | (
                                                                  ((((var53 & '쀀') >> 14 | var53 << 2) + 126 ^ 182) - 168 & 63488) >> 11
                                                                     | (((var53 & '쀀') >> 14 | var53 << 2) + 126 ^ 182) - 168 << 5
                                                               )
                                                               << 6
                                                      )
                                                      & 65534
                                                )
                                                >> 1
                                             | (
                                                   (
                                                            (
                                                                  ((((var53 & '쀀') >> 14 | var53 << 2) + 126 ^ 182) - 168 & 63488) >> 11
                                                                     | (((var53 & '쀀') >> 14 | var53 << 2) + 126 ^ 182) - 168 << 5
                                                               )
                                                               & 64512
                                                         )
                                                         >> 10
                                                      | (
                                                            ((((var53 & '쀀') >> 14 | var53 << 2) + 126 ^ 182) - 168 & 63488) >> 11
                                                               | (((var53 & '쀀') >> 14 | var53 << 2) + 126 ^ 182) - 168 << 5
                                                         )
                                                         << 6
                                                )
                                                << 15
                                       )
                                       - 40
                                    & 65528
                              )
                              >> 3
                           | (
                                    (
                                             (
                                                   (
                                                            (
                                                                  ((((var53 & '쀀') >> 14 | var53 << 2) + 126 ^ 182) - 168 & 63488) >> 11
                                                                     | (((var53 & '쀀') >> 14 | var53 << 2) + 126 ^ 182) - 168 << 5
                                                               )
                                                               & 64512
                                                         )
                                                         >> 10
                                                      | (
                                                            ((((var53 & '쀀') >> 14 | var53 << 2) + 126 ^ 182) - 168 & 63488) >> 11
                                                               | (((var53 & '쀀') >> 14 | var53 << 2) + 126 ^ 182) - 168 << 5
                                                         )
                                                         << 6
                                                )
                                                & 65534
                                          )
                                          >> 1
                                       | (
                                             (
                                                      (
                                                            ((((var53 & '쀀') >> 14 | var53 << 2) + 126 ^ 182) - 168 & 63488) >> 11
                                                               | (((var53 & '쀀') >> 14 | var53 << 2) + 126 ^ 182) - 168 << 5
                                                         )
                                                         & 64512
                                                   )
                                                   >> 10
                                                | (
                                                      ((((var53 & '쀀') >> 14 | var53 << 2) + 126 ^ 182) - 168 & 63488) >> 11
                                                         | (((var53 & '쀀') >> 14 | var53 << 2) + 126 ^ 182) - 168 << 5
                                                   )
                                                   << 6
                                          )
                                          << 15
                                 )
                                 - 40
                              << 13
                     )
                     - 202
               )
            );
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_404.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = -21836331 << 973851222 ^ 1967128576; var35 < var19.length(); var35 += (-2050792629 - -2050792629 | 1) & 723347949) {
            char var63 = var19.charAt(var35);
            char var66 = (char)(
               (
                        (
                              (
                                       (
                                             ((((var63 & '\uf800') >> 11 | var63 << 5) + 188 + 53 ^ 45) & 63488) >> 11
                                                | (((var63 & '\uf800') >> 11 | var63 << 5) + 188 + 53 ^ 45) << 5
                                          )
                                          & 65408
                                    )
                                    >> 7
                                 | (
                                       ((((var63 & '\uf800') >> 11 | var63 << 5) + 188 + 53 ^ 45) & 63488) >> 11
                                          | (((var63 & '\uf800') >> 11 | var63 << 5) + 188 + 53 ^ 45) << 5
                                    )
                                    << 9
                           )
                           ^ 159
                           ^ 159
                     )
                     - 202
                  ^ 216
            );
            var19.setCharAt(
               var35,
               (char)(
                  (
                           (
                                 (
                                          (
                                                ((((var63 & '\uf800') >> 11 | var63 << 5) + 188 + 53 ^ 45) & 63488) >> 11
                                                   | (((var63 & '\uf800') >> 11 | var63 << 5) + 188 + 53 ^ 45) << 5
                                             )
                                             & 65408
                                       )
                                       >> 7
                                    | (
                                          ((((var63 & '\uf800') >> 11 | var63 << 5) + 188 + 53 ^ 45) & 63488) >> 11
                                             | (((var63 & '\uf800') >> 11 | var63 << 5) + 188 + 53 ^ 45) << 5
                                       )
                                       << 9
                              )
                              ^ 159
                              ^ 159
                        )
                        - 202
                     ^ 216
               )
            );
         }

         Class var7 = Class.forName(var19.toString(), false, Class_404.class.getClassLoader());
         switch (((var4 - 606871298 ^ 1872026365 ^ 807384991 ^ 564356903 ^ 1962842596) + 1926402046 ^ 713920836 ^ 88920086) + 402466695 + 2077221676) {
            case 651737073:
            case 1819414185:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 739267667:
               var10000 = var0.findConstructor(var7, var6);
               break;
            case 769784984:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            case 1209436040:
               var10000 = var0.findSpecial(var7, var5, var6, Class_404.class);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_1002[((var10 + 157420544 + 99273547 ^ 372421363 ^ 1787692501 ^ 2057259060) - 1371108640 + 842326 + 297285889 ^ 1231113184) - 1469016730] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1138(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = var10 - 1832885536 + 251647093 + 495217421 + 1933766463 - 296460404 + 110933955 + 1578109381 - 1035999324 + 628728405;
      MethodHandle var10000 = field_1002[var10
         - 1832885536
         + 251647093
         + 495217421
         + 1933766463
         - 296460404
         + 110933955
         + 1578109381
         - 1035999324
         + 628728405
         - 376173427];
      if (field_1002[var10001 - 376173427] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = 1520420359 ^ 1520420359 ^ 0; var24 < var14.length(); var24 += -1905618758 + -560752940 ^ 1828595599) {
            char var43 = var14.charAt(var24);
            char var50 = (char)(
               (
                     (
                              (
                                    (
                                             (
                                                   (
                                                            (
                                                                  (
                                                                           (
                                                                                 (
                                                                                          (
                                                                                                ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512)
                                                                                                      >> 10
                                                                                                   | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                                             )
                                                                                             & 65532
                                                                                       )
                                                                                       >> 2
                                                                                    | (
                                                                                          ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                                             | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                                       )
                                                                                       << 14
                                                                              )
                                                                              & 0
                                                                        )
                                                                        >> 16
                                                                     | (
                                                                           (
                                                                                    (
                                                                                          ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                                             | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                                       )
                                                                                       & 65532
                                                                                 )
                                                                                 >> 2
                                                                              | (
                                                                                    ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                                       | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                                 )
                                                                                 << 14
                                                                        )
                                                                        << 0
                                                               )
                                                               & 65528
                                                         )
                                                         >> 3
                                                      | (
                                                            (
                                                                     (
                                                                           (
                                                                                    (
                                                                                          ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                                             | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                                       )
                                                                                       & 65532
                                                                                 )
                                                                                 >> 2
                                                                              | (
                                                                                    ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                                       | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                                 )
                                                                                 << 14
                                                                        )
                                                                        & 0
                                                                  )
                                                                  >> 16
                                                               | (
                                                                     (
                                                                              (
                                                                                    ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                                       | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                                 )
                                                                                 & 65532
                                                                           )
                                                                           >> 2
                                                                        | (
                                                                              ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                                 | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                           )
                                                                           << 14
                                                                  )
                                                                  << 0
                                                         )
                                                         << 13
                                                )
                                                & 0
                                          )
                                          >> 16
                                       | (
                                             (
                                                      (
                                                            (
                                                                     (
                                                                           (
                                                                                    (
                                                                                          ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                                             | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                                       )
                                                                                       & 65532
                                                                                 )
                                                                                 >> 2
                                                                              | (
                                                                                    ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                                       | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                                 )
                                                                                 << 14
                                                                        )
                                                                        & 0
                                                                  )
                                                                  >> 16
                                                               | (
                                                                     (
                                                                              (
                                                                                    ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                                       | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                                 )
                                                                                 & 65532
                                                                           )
                                                                           >> 2
                                                                        | (
                                                                              ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                                 | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                           )
                                                                           << 14
                                                                  )
                                                                  << 0
                                                         )
                                                         & 65528
                                                   )
                                                   >> 3
                                                | (
                                                      (
                                                               (
                                                                     (
                                                                              (
                                                                                    ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                                       | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                                 )
                                                                                 & 65532
                                                                           )
                                                                           >> 2
                                                                        | (
                                                                              ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                                 | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                           )
                                                                           << 14
                                                                  )
                                                                  & 0
                                                            )
                                                            >> 16
                                                         | (
                                                               (
                                                                        (
                                                                              ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                                 | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                           )
                                                                           & 65532
                                                                     )
                                                                     >> 2
                                                                  | (
                                                                        ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                           | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                     )
                                                                     << 14
                                                            )
                                                            << 0
                                                   )
                                                   << 13
                                          )
                                          << 0
                                 )
                                 & 0
                           )
                           >> 16
                        | (
                              (
                                       (
                                             (
                                                      (
                                                            (
                                                                     (
                                                                           (
                                                                                    (
                                                                                          ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                                             | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                                       )
                                                                                       & 65532
                                                                                 )
                                                                                 >> 2
                                                                              | (
                                                                                    ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                                       | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                                 )
                                                                                 << 14
                                                                        )
                                                                        & 0
                                                                  )
                                                                  >> 16
                                                               | (
                                                                     (
                                                                              (
                                                                                    ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                                       | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                                 )
                                                                                 & 65532
                                                                           )
                                                                           >> 2
                                                                        | (
                                                                              ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                                 | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                           )
                                                                           << 14
                                                                  )
                                                                  << 0
                                                         )
                                                         & 65528
                                                   )
                                                   >> 3
                                                | (
                                                      (
                                                               (
                                                                     (
                                                                              (
                                                                                    ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                                       | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                                 )
                                                                                 & 65532
                                                                           )
                                                                           >> 2
                                                                        | (
                                                                              ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                                 | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                           )
                                                                           << 14
                                                                  )
                                                                  & 0
                                                            )
                                                            >> 16
                                                         | (
                                                               (
                                                                        (
                                                                              ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                                 | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                           )
                                                                           & 65532
                                                                     )
                                                                     >> 2
                                                                  | (
                                                                        ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                           | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                     )
                                                                     << 14
                                                            )
                                                            << 0
                                                   )
                                                   << 13
                                          )
                                          & 0
                                    )
                                    >> 16
                                 | (
                                       (
                                                (
                                                      (
                                                               (
                                                                     (
                                                                              (
                                                                                    ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                                       | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                                 )
                                                                                 & 65532
                                                                           )
                                                                           >> 2
                                                                        | (
                                                                              ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                                 | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                           )
                                                                           << 14
                                                                  )
                                                                  & 0
                                                            )
                                                            >> 16
                                                         | (
                                                               (
                                                                        (
                                                                              ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                                 | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                           )
                                                                           & 65532
                                                                     )
                                                                     >> 2
                                                                  | (
                                                                        ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                           | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                     )
                                                                     << 14
                                                            )
                                                            << 0
                                                   )
                                                   & 65528
                                             )
                                             >> 3
                                          | (
                                                (
                                                         (
                                                               (
                                                                        (
                                                                              ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                                 | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                           )
                                                                           & 65532
                                                                     )
                                                                     >> 2
                                                                  | (
                                                                        ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                           | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                     )
                                                                     << 14
                                                            )
                                                            & 0
                                                      )
                                                      >> 16
                                                   | (
                                                         (
                                                                  (
                                                                        ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                           | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                     )
                                                                     & 65532
                                                               )
                                                               >> 2
                                                            | (
                                                                  ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                     | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                               )
                                                               << 14
                                                      )
                                                      << 0
                                             )
                                             << 13
                                    )
                                    << 0
                           )
                           << 0
                  )
                  - 154
            );
            var14.setCharAt(
               var24,
               (char)(
                  (
                        (
                                 (
                                       (
                                                (
                                                      (
                                                               (
                                                                     (
                                                                              (
                                                                                    (
                                                                                             (
                                                                                                   ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512)
                                                                                                         >> 10
                                                                                                      | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72)
                                                                                                         << 6
                                                                                                )
                                                                                                & 65532
                                                                                          )
                                                                                          >> 2
                                                                                       | (
                                                                                             ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512)
                                                                                                   >> 10
                                                                                                | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                                          )
                                                                                          << 14
                                                                                 )
                                                                                 & 0
                                                                           )
                                                                           >> 16
                                                                        | (
                                                                              (
                                                                                       (
                                                                                             ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512)
                                                                                                   >> 10
                                                                                                | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                                          )
                                                                                          & 65532
                                                                                    )
                                                                                    >> 2
                                                                                 | (
                                                                                       ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                                          | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                                    )
                                                                                    << 14
                                                                           )
                                                                           << 0
                                                                  )
                                                                  & 65528
                                                            )
                                                            >> 3
                                                         | (
                                                               (
                                                                        (
                                                                              (
                                                                                       (
                                                                                             ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512)
                                                                                                   >> 10
                                                                                                | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                                          )
                                                                                          & 65532
                                                                                    )
                                                                                    >> 2
                                                                                 | (
                                                                                       ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                                          | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                                    )
                                                                                    << 14
                                                                           )
                                                                           & 0
                                                                     )
                                                                     >> 16
                                                                  | (
                                                                        (
                                                                                 (
                                                                                       ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                                          | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                                    )
                                                                                    & 65532
                                                                              )
                                                                              >> 2
                                                                           | (
                                                                                 ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                                    | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                              )
                                                                              << 14
                                                                     )
                                                                     << 0
                                                            )
                                                            << 13
                                                   )
                                                   & 0
                                             )
                                             >> 16
                                          | (
                                                (
                                                         (
                                                               (
                                                                        (
                                                                              (
                                                                                       (
                                                                                             ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512)
                                                                                                   >> 10
                                                                                                | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                                          )
                                                                                          & 65532
                                                                                    )
                                                                                    >> 2
                                                                                 | (
                                                                                       ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                                          | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                                    )
                                                                                    << 14
                                                                           )
                                                                           & 0
                                                                     )
                                                                     >> 16
                                                                  | (
                                                                        (
                                                                                 (
                                                                                       ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                                          | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                                    )
                                                                                    & 65532
                                                                              )
                                                                              >> 2
                                                                           | (
                                                                                 ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                                    | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                              )
                                                                              << 14
                                                                     )
                                                                     << 0
                                                            )
                                                            & 65528
                                                      )
                                                      >> 3
                                                   | (
                                                         (
                                                                  (
                                                                        (
                                                                                 (
                                                                                       ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                                          | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                                    )
                                                                                    & 65532
                                                                              )
                                                                              >> 2
                                                                           | (
                                                                                 ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                                    | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                              )
                                                                              << 14
                                                                     )
                                                                     & 0
                                                               )
                                                               >> 16
                                                            | (
                                                                  (
                                                                           (
                                                                                 ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                                    | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                              )
                                                                              & 65532
                                                                        )
                                                                        >> 2
                                                                     | (
                                                                           ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                              | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                        )
                                                                        << 14
                                                               )
                                                               << 0
                                                      )
                                                      << 13
                                             )
                                             << 0
                                    )
                                    & 0
                              )
                              >> 16
                           | (
                                 (
                                          (
                                                (
                                                         (
                                                               (
                                                                        (
                                                                              (
                                                                                       (
                                                                                             ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512)
                                                                                                   >> 10
                                                                                                | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                                          )
                                                                                          & 65532
                                                                                    )
                                                                                    >> 2
                                                                                 | (
                                                                                       ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                                          | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                                    )
                                                                                    << 14
                                                                           )
                                                                           & 0
                                                                     )
                                                                     >> 16
                                                                  | (
                                                                        (
                                                                                 (
                                                                                       ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                                          | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                                    )
                                                                                    & 65532
                                                                              )
                                                                              >> 2
                                                                           | (
                                                                                 ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                                    | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                              )
                                                                              << 14
                                                                     )
                                                                     << 0
                                                            )
                                                            & 65528
                                                      )
                                                      >> 3
                                                   | (
                                                         (
                                                                  (
                                                                        (
                                                                                 (
                                                                                       ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                                          | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                                    )
                                                                                    & 65532
                                                                              )
                                                                              >> 2
                                                                           | (
                                                                                 ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                                    | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                              )
                                                                              << 14
                                                                     )
                                                                     & 0
                                                               )
                                                               >> 16
                                                            | (
                                                                  (
                                                                           (
                                                                                 ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                                    | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                              )
                                                                              & 65532
                                                                        )
                                                                        >> 2
                                                                     | (
                                                                           ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                              | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                        )
                                                                        << 14
                                                               )
                                                               << 0
                                                      )
                                                      << 13
                                             )
                                             & 0
                                       )
                                       >> 16
                                    | (
                                          (
                                                   (
                                                         (
                                                                  (
                                                                        (
                                                                                 (
                                                                                       ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                                          | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                                    )
                                                                                    & 65532
                                                                              )
                                                                              >> 2
                                                                           | (
                                                                                 ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                                    | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                              )
                                                                              << 14
                                                                     )
                                                                     & 0
                                                               )
                                                               >> 16
                                                            | (
                                                                  (
                                                                           (
                                                                                 ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                                    | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                              )
                                                                              & 65532
                                                                        )
                                                                        >> 2
                                                                     | (
                                                                           ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                              | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                        )
                                                                        << 14
                                                               )
                                                               << 0
                                                      )
                                                      & 65528
                                                )
                                                >> 3
                                             | (
                                                   (
                                                            (
                                                                  (
                                                                           (
                                                                                 ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                                    | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                              )
                                                                              & 65532
                                                                        )
                                                                        >> 2
                                                                     | (
                                                                           ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                              | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                        )
                                                                        << 14
                                                               )
                                                               & 0
                                                         )
                                                         >> 16
                                                      | (
                                                            (
                                                                     (
                                                                           ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                              | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                        )
                                                                        & 65532
                                                                  )
                                                                  >> 2
                                                               | (
                                                                     ((((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) & 64512) >> 10
                                                                        | (((var43 & '\uf800') >> 11 | var43 << 5) + 83 ^ 72) << 6
                                                                  )
                                                                  << 14
                                                         )
                                                         << 0
                                                )
                                                << 13
                                       )
                                       << 0
                              )
                              << 0
                     )
                     - 154
               )
            );
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = (1871109992 >> -1123561183 + 1404371583 | 0) & -2146959354; var30 < var17.length(); var30 += (-995185579 >> 1543988531 | 0) & 65) {
            int var55 = var17.charAt(var30);
            int var98 = (var55 & 65534) >> 1;
            int var56 = ((var55 & 65534) >> 1 | var55 << 15) - 197 ^ 49;
            int var99 = ((((var55 & 65534) >> 1 | var55 << 15) - 197 ^ 49) & 65528) >> 3;
            var55 = (((var98 | var55 << 15) - 197 ^ 49) & 65528) >> 3 | (((var55 & 65534) >> 1 | var55 << 15) - 197 ^ 49) << 13;
            var98 = ((var99 | var56 << 13) & 65408) >> 7;
            int var58 = (((var99 | var56 << 13) & 65408) >> 7 | var55 << 9) - 46;
            int var101 = ((((var99 | var56 << 13) & 65408) >> 7 | var55 << 9) - 46 & 65534) >> 1;
            var55 = (((var98 | var55 << 9) - 46 & 65534) >> 1 | (((var99 | var56 << 13) & 65408) >> 7 | var55 << 9) - 46 << 15) - 44;
            var98 = ((var101 | var58 << 15) - 44 & 64512) >> 10;
            int var60 = ((var101 | var58 << 15) - 44 & 64512) >> 10 | var55 << 6;
            int var103 = ((((var101 | var58 << 15) - 44 & 64512) >> 10 | var55 << 6) & 65472) >> 6;
            char var61 = (char)(((var98 | var55 << 6) & 65472) >> 6 | (((var101 | var58 << 15) - 44 & 64512) >> 10 | var55 << 6) << 10);
            var17.setCharAt(var30, (char)(var103 | var60 << 10));
         }

         Class var6 = Class.forName(var17.toString(), false, Class_404.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = -1130496131 + -1130496131 ^ 2033975034; var36 < var20.length(); var36 += (1703907367 >>> 2122713626 | 1) & 2065966275) {
            int var66 = var20.charAt(var36) - 16;
            int var104 = (var66 & 61440) >> 12;
            int var67 = (((var66 & 61440) >> 12 | var66 << 4) ^ 87 ^ 59 ^ 49 ^ 162 ^ 98) - 117;
            int var105 = ((((var66 & 61440) >> 12 | var66 << 4) ^ 87 ^ 59 ^ 49 ^ 162 ^ 98) - 117 & 32768) >> 15;
            char var68 = (char)(
               (
                     (((var104 | var66 << 4) ^ 87 ^ 59 ^ 49 ^ 162 ^ 98) - 117 & 32768) >> 15
                        | (((var66 & 61440) >> 12 | var66 << 4) ^ 87 ^ 59 ^ 49 ^ 162 ^ 98) - 117 << 1
                  )
                  + 129
            );
            var20.setCharAt(var36, (char)((var105 | var67 << 1) + 129));
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_404.class.getClassLoader()).returnType();
         switch (((var4 ^ 775792839) + 819246872 + 43355247 - 1689431218 ^ 1090047560) - 973212806 + 475962112 + 315022679 - 1286966437 + 796426897) {
            case 266807619:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            case 430727547:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            case 990662048:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            case 1159174753:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_1002[var10 - 1832885536 + 251647093 + 495217421 + 1933766463 - 296460404 + 110933955 + 1578109381 - 1035999324 + 628728405 - 376173427] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
