import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;
import net.minecraft.class_1657;
import net.minecraft.class_465;

public class Class_394 extends Class_342 {
   // $VF: renamed from: lfu java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_1568 = new MethodHandle[50];

   public Class_394() {
      int var10001 = 0;

      StringBuilder var10002;
      for (var10002 = (StringBuilder)0<"JNT",778662344,"侤ﾡ澡ﾡ쾠澤","\uef5d\uef46潎⽌潑⽌꽟\uef4e⽌潏꽍꽟꽈\uef50潐⽎潏꽍꽢⽞潉","䅆但᥆但ꥆ㵆但⥆㍆ꥆ歇ⵆㅆ㽆⥆㍆酆ᝆ㽆㵆䵆㝆ㅆ",-472620238>(
            "聪職䁷v䁢쁬職聵䁶䁢쁮聳w聳䁷"
         );
         var10001 < (2110331950 * (1238500814 | 2110331950) ^ 1250126027);
         var10001 += 402653381 & 1642538009
      ) {
         char var6 = 0<"JNT",-1707530166,"龡ྡ羡꾠羣쾠","\uef5d⽆⽞꽄","䅆但᥆但ꥆ㵆但⥆㍆ꥆ歇ⵆㅆ㽆⥆㍆酆ᝆ㽆㵆䵆㝆ㅆ",-472620235>(var10002, var10001);
         int var10005 = (var6 & '쀀') >> 14;
         int var7 = ((var6 & '쀀') >> 14 | var6 << 2) - 166;
         int var17 = (((var6 & '쀀') >> 14 | var6 << 2) - 166 & 65535) >> 0;
         var6 = (char)((((var10005 | var6 << 2) - 166 & 65535) >> 0 | ((var6 & '쀀') >> 14 | var6 << 2) - 166 << 16) + 10 - 205);
         0<"JNT",-1707530166,"龠뾡쾠龣ྡ羡꾠羣쾠","\uef5d⽆꽄⽞潉","䅆但᥆但ꥆ㵆但⥆㍆ꥆ歇ⵆㅆ㽆⥆㍆酆ᝆ㽆㵆䵆㝆ㅆ",-472620234>(var10002, var10001, (char)((var17 | var7 << 16) + 10 - 205));
      }

      String var2 = 0<"JNT",-1707530166,"쾠御龢쾠꾠ﾡ澡\udfa1","\uef5d⽞\uef46潎⽌潑⽌꽟\uef4e⽌潏꽍꽟꽈\uef50潐⽎潏꽍꽢","䅆但᥆但ꥆ㵆但⥆㍆ꥆ歇ⵆㅆ㽆⥆㍆酆ᝆ㽆㵆䵆㝆ㅆ",-472620233>(var10002);
      int var4 = (1305131797 << -331587107 | 0) & 1423227010;

      StringBuilder var10;
      for (var10 = (StringBuilder)0<"JNT",778662344,"侤ﾡ澡ﾡ쾠澤","\uef5d\uef46潎⽌潑⽌꽟\uef4e⽌潏꽍꽟꽈\uef50潐⽎潏꽍꽢⽞潉","䅆但᥆但ꥆ㵆但⥆㍆ꥆ歇ⵆㅆ㽆⥆㍆酆ᝆ㽆㵆䵆㝆ㅆ",-472620232>(
            "ŬʠşŚŘŌşŔŎŌŗŗʤċŕʠŘśŞċʢœŐřċşŌŖŔřŒċŖřŚŎŖōŌŎŖ"
         );
         var4 < (558139510 << (-884697378 >>> -884697378) ^ 170148761);
         var4 += -7586423 >>> -1668519488 ^ -7586424
      ) {
         char var14 = 0<"JNT",-1707530166,"龡ྡ羡꾠羣쾠","\uef5d⽆⽞꽄","䅆但᥆但ꥆ㵆但⥆㍆ꥆ歇ⵆㅆ㽆⥆㍆酆ᝆ㽆㵆䵆㝆ㅆ",-472620231>(var10, var4);
         char var15 = (char)((((var14 & 0) >> 16 | var14 << 0) ^ 160) - 242 - 25 ^ 128);
         0<"JNT",-1707530166,"龠뾡쾠龣ྡ羡꾠羣쾠","\uef5d⽆꽄⽞潉","䅆但᥆但ꥆ㵆但⥆㍆ꥆ歇ⵆㅆ㽆⥆㍆酆ᝆ㽆㵆䵆㝆ㅆ",-472620230>(
            var10, var4, (char)((((var14 & 0) >> 16 | var14 << 0) ^ 160) - 242 - 25 ^ 128)
         );
      }

      super(
         var2,
         0<"JNT",-1707530166,"쾠御龢쾠꾠ﾡ澡\udfa1","\uef5d⽞\uef46潎⽌潑⽌꽟\uef4e⽌潏꽍꽟꽈\uef50潐⽎潏꽍꽢","䅆但᥆但ꥆ㵆但⥆㍆ꥆ歇ⵆㅆ㽆⥆㍆酆ᝆ㽆㵆䵆㝆ㅆ",-472620237>(var10),
         -1,
         1<"JNT",1271632425,"ĔI","⣅ꡙ","邾Ⴟ達ၷ遫ၜ",1160845644>()
      );
   }

   // $VF: renamed from: gd (Class_207) void
   @Class_21
   public void method_1444(Class_207 var1) {
      if (!(
            1<"JNT",1135016231,"QDPKS>\u001c&  ","ꣃ⢿꣄ꡣ⣃⢽ꣃ⢿⢼ꣁ⡙ꢿ꣄ꡣ⢼ꣀ⡙⣄⣄⡞⡤⡡ꡦ","邾Ⴟ達遥ၡ選Ⴢၥၟ遥ၡၠ遣ၫ遡選Ⴢၠ遤ၫၸၸၪ遘ၘၖၜ",1160845636>(
               1<"JNT",1135016231,"KÝ","\ua8ca⣇","邾Ⴟ達遥ၡ選Ⴢၥၟ遥ၡၠ遣ၫ遡選Ⴢၠ遤ၫၸၸၪၘჃ郂ၜ",1160845633>(this)
            ) instanceof class_465
         )
         && !0<"JNT",-1707530166,"㾡뾡쾠ྡ御쾡徢\uefa4辤龤ﾤ","\uef5d⽞潊","⥆㝆ⵆꥆ❆㽆⥆㝆䭆ㅆ但㥆ⵆꥆ䭆㵆但⭆⭆䍆鍆굆饆",-472620225>(
            1<"JNT",1135016231,"QDPKS>\u001c&\u001d#","ꣃ⢿꣄ꡣ⣃⢽ꣃ⢿⢼ꣁ⡙ꢿ꣄ꡣ⢼ꣀ⡙⣄⣄⡞⡤⡡ꡦ","邾Ⴟ達遥ၡ選Ⴢၥၟ遥ၡၠ遣ၫ遡選Ⴢၠ遤ၫၸၸၪၖ遘遙ၜ",1160845626>(
               1<"JNT",1135016231,"KÝ","\ua8ca⣇","邾Ⴟ達遥ၡ選Ⴢၥၟ遥ၡၠ遣ၫ遡選Ⴢၠ遤ၫၸၸၪၘჃ郂ၜ",1160845623>(this)
            )
         )
         && !0<"JNT",-1707530166,"㾡뾡쾠ྡ御쾡徢\uefa4群群뾤","\uef5d⽞潊","⥆㝆ⵆꥆ❆㽆⥆㝆䭆ㅆ但㥆ⵆꥆ䭆㵆但⭆⭆䍆鍆굆饆",-472620222>(
            1<"JNT",1135016231,"QDPKS>\u001c&\u001d#","ꣃ⢿꣄ꡣ⣃⢽ꣃ⢿⢼ꣁ⡙ꢿ꣄ꡣ⢼ꣀ⡙⣄⣄⡞⡤⡡ꡦ","邾Ⴟ達遥ၡ選Ⴢၥၟ遥ၡၠ遣ၫ遡選Ⴢၠ遤ၫၸၸၪၖ遘遙ၜ",1160845627>(
               1<"JNT",1135016231,"KÝ","\ua8ca⣇","邾Ⴟ達遥ၡ選Ⴢၥၟ遥ၡၠ遣ၫ遡選Ⴢၠ遤ၫၸၸၪၘჃ郂ၜ",1160845624>(this)
            )
         )
         && !0<"JNT",-1707530166,"㾡뾡쾠ྡ御쾡徢뾤\udfa4ﾤﾤ","\uef5d⽞潊","⥆㝆ⵆꥆ❆㽆⥆㝆䭆ㅆ但㥆ⵆꥆ䭆㵆但⭆⭆䍆鍆굆饆",-472620219>(
            1<"JNT",1135016231,"QDPKS>\u001c&\u001d#","ꣃ⢿꣄ꡣ⣃⢽ꣃ⢿⢼ꣁ⡙ꢿ꣄ꡣ⢼ꣀ⡙⣄⣄⡞⡤⡡ꡦ","邾Ⴟ達遥ၡ選Ⴢၥၟ遥ၡၠ遣ၫ遡選Ⴢၠ遤ၫၸၸၪၖ遘遙ၜ",1160845628>(
               1<"JNT",1135016231,"KÝ","\ua8ca⣇","邾Ⴟ達遥ၡ選Ⴢၥၟ遥ၡၠ遣ၫ遡選Ⴢၠ遤ၫၸၸၪၘჃ郂ၜ",1160845625>(this)
            )
         )
         && 0<"JNT",-1707530166,"㾡뾡쾠ྡ御쾡徢\uefa4辤\uefa4뾤","\uef5d⽞\uef46潏⽍\uef50꽟⽏⽎潏⽍꽌潐⽌潍\uef50꽟꽌\uef4e⽌꽐꽐꽋⽠꽠\uef5f⽢꽢","⥆㝆ⵆꥆ❆㽆⥆㝆䭆ㅆ但㥆ⵆꥆ䭆㵆但⭆⭆䍆鍆굆饆",-472620216>(
            1<"JNT",1135016231,"QDPKS>\u001c&\u001d#","ꣃ⢿꣄ꡣ⣃⢽ꣃ⢿⢼ꣁ⡙ꢿ꣄ꡣ⢼ꣀ⡙⣄⣄⡞⡤⡡ꡦ","邾Ⴟ達遥ၡ選Ⴢၥၟ遥ၡၠ遣ၫ遡選Ⴢၠ遤ၫၸၸၪၖ遘遙ၜ",1160845677>(
               1<"JNT",1135016231,"KÝ","\ua8ca⣇","邾Ⴟ達遥ၡ選Ⴢၥၟ遥ၡၠ遣ၫ遡選Ⴢၠ遤ၫၸၸၪၘჃ郂ၜ",1160845618>(this)
            )
         ) instanceof class_1657
         && 0<"JNT",-1707530166,"㾡뾡쾠ྡ御쾡徢꾤쾤ྤ꾤ྤ","\uef5d⽞潊","⥆㝆ⵆꥆ❆㽆⥆㝆䭆ㅆ但㥆ⵆꥆ䭆㵆但⭆⭆䍆꽆ꭆꕆ齆",-472620212>(
            0<"JNT",-1707530166,"㾡뾡쾠ྡ御쾡徢\uefa4辤\uefa4뾤","\uef5d⽞\uef46潏⽍\uef50꽟⽏⽎潏⽍꽌潐⽌潍\uef50꽟꽌\uef4e⽌꽐꽐꽋⽠꽠\uef5f⽢꽢","⥆㝆ⵆꥆ❆㽆⥆㝆䭆ㅆ但㥆ⵆꥆ䭆㵆但⭆⭆䍆鍆굆饆",-472620213>(
               1<"JNT",1135016231,"QDPKS>\u001c&\u001d#","ꣃ⢿꣄ꡣ⣃⢽ꣃ⢿⢼ꣁ⡙ꢿ꣄ꡣ⢼ꣀ⡙⣄⣄⡞⡤⡡ꡦ","邾Ⴟ達遥ၡ選Ⴢၥၟ遥ၡၠ遣ၫ遡選Ⴢၠ遤ၫၸၸၪၖ遘遙ၜ",1160845622>(
                  1<"JNT",1135016231,"KÝ","\ua8ca⣇","邾Ⴟ達遥ၡ選Ⴢၥၟ遥ၡၠ遣ၫ遡選Ⴢၠ遤ၫၸၸၪၘჃ郂ၜ",1160845619>(this)
               )
            )
         )
         && 1<"JNT",1135016231,"QDPKS>!\u001d\" ","ꣃ⢿꣄ꡣ⣃⢽ꣃ⢿⢼ꣁ⡙ꢿ꣄ꡣ⢼ꣀ⡙⣄⣄⡞⡡⡤ꡦ⡥","邾Ⴟ၏",1160845672>(
               0<"JNT",-1707530166,"㾡뾡쾠ྡ御쾡徢\uefa4辤\uefa4뾤","\uef5d⽞\uef46潏⽍\uef50꽟⽏⽎潏⽍꽌潐⽌潍\uef50꽟꽌\uef4e⽌꽐꽐꽋⽠꽠\uef5f⽢꽢","⥆㝆ⵆꥆ❆㽆⥆㝆䭆ㅆ但㥆ⵆꥆ䭆㵆但⭆⭆䍆鍆굆饆",-472620209>(
                  1<"JNT",1135016231,"QDPKS>\u001c&\u001d#","ꣃ⢿꣄ꡣ⣃⢽ꣃ⢿⢼ꣁ⡙ꢿ꣄ꡣ⢼ꣀ⡙⣄⣄⡞⡤⡡ꡦ","邾Ⴟ達遥ၡ選Ⴢၥၟ遥ၡၠ遣ၫ遡選Ⴢၠ遤ၫၸၸၪၖ遘遙ၜ",1160845674>(
                     1<"JNT",1135016231,"KÝ","\ua8ca⣇","邾Ⴟ達遥ၡ選Ⴢၥၟ遥ၡၠ遣ၫ遡選Ⴢၠ遤ၫၸၸၪၘჃ郂ၜ",1160845671>(this)
                  )
               )
            )
            > 0
         && 1<"JNT",1135016231,"QDPKS>!\u001d\" ","ꣃ⢿꣄ꡣ⣃⢽ꣃ⢿⢼ꣁ⡙ꢿ꣄ꡣ⢼ꣀ⡙⣄⣄⡞⡡⡤ꡦ⡥","邾Ⴟ၏",1160845676>(
               0<"JNT",-1707530166,"㾡뾡쾠ྡ御쾡徢\uefa4辤\uefa4뾤","\uef5d⽞\uef46潏⽍\uef50꽟⽏⽎潏⽍꽌潐⽌潍\uef50꽟꽌\uef4e⽌꽐꽐꽋⽠꽠\uef5f⽢꽢","⥆㝆ⵆꥆ❆㽆⥆㝆䭆ㅆ但㥆ⵆꥆ䭆㵆但⭆⭆䍆鍆굆饆",-472620205>(
                  1<"JNT",1135016231,"QDPKS>\u001c&\u001d#","ꣃ⢿꣄ꡣ⣃⢽ꣃ⢿⢼ꣁ⡙ꢿ꣄ꡣ⢼ꣀ⡙⣄⣄⡞⡤⡡ꡦ","邾Ⴟ達遥ၡ選Ⴢၥၟ遥ၡၠ遣ၫ遡選Ⴢၠ遤ၫၸၸၪၖ遘遙ၜ",1160845678>(
                     1<"JNT",1135016231,"KÝ","\ua8ca⣇","邾Ⴟ達遥ၡ選Ⴢၥၟ遥ၡၠ遣ၫ遡選Ⴢၠ遤ၫၸၸၪၘჃ郂ၜ",1160845675>(this)
                  )
               )
            )
            < 10
         && 1<"JNT",1135016231,"QDPKS>!\u001d\" ","ꣃ⢿꣄ꡣ⣃⢽ꣃ⢿⢼ꣁ⡙ꢿ꣄ꡣ⢼ꣀ⡙⣄⣄⡞⡡⡤ꡦ⡥","邾Ⴟ၏",1160845664>(
               0<"JNT",-1707530166,"㾡뾡쾠ྡ御쾡徢\uefa4辤\uefa4뾤","\uef5d⽞\uef46潏⽍\uef50꽟⽏⽎潏⽍꽌潐⽌潍\uef50꽟꽌\uef4e⽌꽐꽐꽋⽠꽠\uef5f⽢꽢","⥆㝆ⵆꥆ❆㽆⥆㝆䭆ㅆ但㥆ⵆꥆ䭆㵆但⭆⭆䍆鍆굆饆",-472620201>(
                  1<"JNT",1135016231,"QDPKS>\u001c&\u001d#","ꣃ⢿꣄ꡣ⣃⢽ꣃ⢿⢼ꣁ⡙ꢿ꣄ꡣ⢼ꣀ⡙⣄⣄⡞⡤⡡ꡦ","邾Ⴟ達遥ၡ選Ⴢၥၟ遥ၡၠ遣ၫ遡選Ⴢၠ遤ၫၸၸၪၖ遘遙ၜ",1160845666>(
                     1<"JNT",1135016231,"KÝ","\ua8ca⣇","邾Ⴟ達遥ၡ選Ⴢၥၟ遥ၡၠ遣ၫ遡選Ⴢၠ遤ၫၸၸၪၘჃ郂ၜ",1160845663>(this)
                  )
               )
            )
            == 1<"JNT",1135016231,"QDPKS>!\u001d #","ꣃ⢿꣄ꡣ⣃⢽ꣃ⢿⢼ꣁ⡙ꢿ꣄ꡣ⢼ꣀ⡙⣄⣄⡞⡡⡤ꡦ⡥","邾Ⴟ၏",1160845668>(
                  0<"JNT",-1707530166,"㾡뾡쾠ྡ御쾡徢\uefa4辤\uefa4뾤","\uef5d⽞\uef46潏⽍\uef50꽟⽏⽎潏⽍꽌潐⽌潍\uef50꽟꽌\uef4e⽌꽐꽐꽋⽠꽠\uef5f⽢꽢","⥆㝆ⵆꥆ❆㽆⥆㝆䭆ㅆ但㥆ⵆꥆ䭆㵆但⭆⭆䍆鍆굆饆",-472620197>(
                     1<"JNT",1135016231,"QDPKS>\u001c&\u001d#","ꣃ⢿꣄ꡣ⣃⢽ꣃ⢿⢼ꣁ⡙ꢿ꣄ꡣ⢼ꣀ⡙⣄⣄⡞⡤⡡ꡦ","邾Ⴟ達遥ၡ選Ⴢၥၟ遥ၡၠ遣ၫ遡選Ⴢၠ遤ၫၸၸၪၖ遘遙ၜ",1160845670>(
                        1<"JNT",1135016231,"KÝ","\ua8ca⣇","邾Ⴟ達遥ၡ選Ⴢၥၟ遥ၡၠ遣ၫ遡選Ⴢၠ遤ၫၸၸၪၘჃ郂ၜ",1160845667>(this)
                     )
                  )
               )
               - 1
         && !0<"JNT",-1707530166,"㾡뾡쾠ྡ御쾡徢뾤ྤ辤ﾤ","\uef5d⽞潊","⥆㝆ⵆꥆ❆㽆⥆㝆䭆ㅆ但㥆ⵆꥆ䭆㵆但⭆⭆䍆꽆ꭆꕆ齆",-472620192>(
            0<"JNT",-1707530166,"㾡뾡쾠ྡ御쾡徢\uefa4辤\uefa4뾤","\uef5d⽞\uef46潏⽍\uef50꽟⽏⽎潏⽍꽌潐⽌潍\uef50꽟꽌\uef4e⽌꽐꽐꽋⽠꽠\uef5f⽢꽢","⥆㝆ⵆꥆ❆㽆⥆㝆䭆ㅆ但㥆ⵆꥆ䭆㵆但⭆⭆䍆鍆굆饆",-472620193>(
               1<"JNT",1135016231,"QDPKS>\u001c&\u001d#","ꣃ⢿꣄ꡣ⣃⢽ꣃ⢿⢼ꣁ⡙ꢿ꣄ꡣ⢼ꣀ⡙⣄⣄⡞⡤⡡ꡦ","邾Ⴟ達遥ၡ選Ⴢၥၟ遥ၡၠ遣ၫ遡選Ⴢၠ遤ၫၸၸၪၖ遘遙ၜ",1160845658>(
                  1<"JNT",1135016231,"KÝ","\ua8ca⣇","邾Ⴟ達遥ၡ選Ⴢၥၟ遥ၡၠ遣ၫ遡選Ⴢၠ遤ၫၸၸၪၘჃ郂ၜ",1160845655>(this)
               )
            )
         )) {
         0<"JNT",-1707530166,"㾡뾡쾠ྡ御쾡徢\uefa4辤쾤龤","\uef5d⽞潉","⥆㝆ⵆꥆ❆㽆⥆㝆䭆ㅆ但㥆ⵆꥆ䭆㵆但⭆⭆䍆鍆굆饆",-472620189>(
            1<"JNT",1135016231,"QDPKS>\u001c&\u001d#","ꣃ⢿꣄ꡣ⣃⢽ꣃ⢿⢼ꣁ⡙ꢿ꣄ꡣ⢼ꣀ⡙⣄⣄⡞⡤⡡ꡦ","邾Ⴟ達遥ၡ選Ⴢၥၟ遥ၡၠ遣ၫ遡選Ⴢၠ遤ၫၸၸၪၖ遘遙ၜ",1160845662>(
               1<"JNT",1135016231,"KÝ","\ua8ca⣇","邾Ⴟ達遥ၡ選Ⴢၥၟ遥ၡၠ遣ၫ遡選Ⴢၠ遤ၫၸၸၪၘჃ郂ၜ",1160845659>(this)
            )
         );
      }
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1413(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = var10 - 1329802850 + 1270659893 + 1261195104 - 1720360291 + 100949316 + 1281772892 + 2123031557 + 258215893 + 1564034589;
      MethodHandle var10000 = field_1568[var10
         - 1329802850
         + 1270659893
         + 1261195104
         - 1720360291
         + 100949316
         + 1281772892
         + 2123031557
         + 258215893
         + 1564034589
         - 42108569];
      if (field_1568[var10001 - 42108569] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = 984780709 & 984780709 ^ 984780709; var23 < var13.length(); var23 += -236226380 ^ 136934147 ^ -104723530) {
            int var42 = var13.charAt(var23) + '`';
            char var47 = (char)(
               (
                     (
                              (
                                    (
                                             (
                                                   (
                                                            (
                                                                  ((((var42 & 61440) >> 12 | var42 << 4) ^ 60 ^ 218 ^ 216) & 65472) >> 6
                                                                     | (((var42 & 61440) >> 12 | var42 << 4) ^ 60 ^ 218 ^ 216) << 10
                                                               )
                                                               & 65520
                                                         )
                                                         >> 4
                                                      | (
                                                            ((((var42 & 61440) >> 12 | var42 << 4) ^ 60 ^ 218 ^ 216) & 65472) >> 6
                                                               | (((var42 & 61440) >> 12 | var42 << 4) ^ 60 ^ 218 ^ 216) << 10
                                                         )
                                                         << 12
                                                )
                                                & 65472
                                          )
                                          >> 6
                                       | (
                                             (
                                                      (
                                                            ((((var42 & 61440) >> 12 | var42 << 4) ^ 60 ^ 218 ^ 216) & 65472) >> 6
                                                               | (((var42 & 61440) >> 12 | var42 << 4) ^ 60 ^ 218 ^ 216) << 10
                                                         )
                                                         & 65520
                                                   )
                                                   >> 4
                                                | (
                                                      ((((var42 & 61440) >> 12 | var42 << 4) ^ 60 ^ 218 ^ 216) & 65472) >> 6
                                                         | (((var42 & 61440) >> 12 | var42 << 4) ^ 60 ^ 218 ^ 216) << 10
                                                   )
                                                   << 12
                                          )
                                          << 10
                                 )
                                 & 0
                           )
                           >> 16
                        | (
                              (
                                       (
                                             (
                                                      (
                                                            ((((var42 & 61440) >> 12 | var42 << 4) ^ 60 ^ 218 ^ 216) & 65472) >> 6
                                                               | (((var42 & 61440) >> 12 | var42 << 4) ^ 60 ^ 218 ^ 216) << 10
                                                         )
                                                         & 65520
                                                   )
                                                   >> 4
                                                | (
                                                      ((((var42 & 61440) >> 12 | var42 << 4) ^ 60 ^ 218 ^ 216) & 65472) >> 6
                                                         | (((var42 & 61440) >> 12 | var42 << 4) ^ 60 ^ 218 ^ 216) << 10
                                                   )
                                                   << 12
                                          )
                                          & 65472
                                    )
                                    >> 6
                                 | (
                                       (
                                                (
                                                      ((((var42 & 61440) >> 12 | var42 << 4) ^ 60 ^ 218 ^ 216) & 65472) >> 6
                                                         | (((var42 & 61440) >> 12 | var42 << 4) ^ 60 ^ 218 ^ 216) << 10
                                                   )
                                                   & 65520
                                             )
                                             >> 4
                                          | (
                                                ((((var42 & 61440) >> 12 | var42 << 4) ^ 60 ^ 218 ^ 216) & 65472) >> 6
                                                   | (((var42 & 61440) >> 12 | var42 << 4) ^ 60 ^ 218 ^ 216) << 10
                                             )
                                             << 12
                                    )
                                    << 10
                           )
                           << 0
                  )
                  ^ 71
            );
            var13.setCharAt(
               var23,
               (char)(
                  (
                        (
                                 (
                                       (
                                                (
                                                      (
                                                               (
                                                                     ((((var42 & 61440) >> 12 | var42 << 4) ^ 60 ^ 218 ^ 216) & 65472) >> 6
                                                                        | (((var42 & 61440) >> 12 | var42 << 4) ^ 60 ^ 218 ^ 216) << 10
                                                                  )
                                                                  & 65520
                                                            )
                                                            >> 4
                                                         | (
                                                               ((((var42 & 61440) >> 12 | var42 << 4) ^ 60 ^ 218 ^ 216) & 65472) >> 6
                                                                  | (((var42 & 61440) >> 12 | var42 << 4) ^ 60 ^ 218 ^ 216) << 10
                                                            )
                                                            << 12
                                                   )
                                                   & 65472
                                             )
                                             >> 6
                                          | (
                                                (
                                                         (
                                                               ((((var42 & 61440) >> 12 | var42 << 4) ^ 60 ^ 218 ^ 216) & 65472) >> 6
                                                                  | (((var42 & 61440) >> 12 | var42 << 4) ^ 60 ^ 218 ^ 216) << 10
                                                            )
                                                            & 65520
                                                      )
                                                      >> 4
                                                   | (
                                                         ((((var42 & 61440) >> 12 | var42 << 4) ^ 60 ^ 218 ^ 216) & 65472) >> 6
                                                            | (((var42 & 61440) >> 12 | var42 << 4) ^ 60 ^ 218 ^ 216) << 10
                                                      )
                                                      << 12
                                             )
                                             << 10
                                    )
                                    & 0
                              )
                              >> 16
                           | (
                                 (
                                          (
                                                (
                                                         (
                                                               ((((var42 & 61440) >> 12 | var42 << 4) ^ 60 ^ 218 ^ 216) & 65472) >> 6
                                                                  | (((var42 & 61440) >> 12 | var42 << 4) ^ 60 ^ 218 ^ 216) << 10
                                                            )
                                                            & 65520
                                                      )
                                                      >> 4
                                                   | (
                                                         ((((var42 & 61440) >> 12 | var42 << 4) ^ 60 ^ 218 ^ 216) & 65472) >> 6
                                                            | (((var42 & 61440) >> 12 | var42 << 4) ^ 60 ^ 218 ^ 216) << 10
                                                      )
                                                      << 12
                                             )
                                             & 65472
                                       )
                                       >> 6
                                    | (
                                          (
                                                   (
                                                         ((((var42 & 61440) >> 12 | var42 << 4) ^ 60 ^ 218 ^ 216) & 65472) >> 6
                                                            | (((var42 & 61440) >> 12 | var42 << 4) ^ 60 ^ 218 ^ 216) << 10
                                                      )
                                                      & 65520
                                                )
                                                >> 4
                                             | (
                                                   ((((var42 & 61440) >> 12 | var42 << 4) ^ 60 ^ 218 ^ 216) & 65472) >> 6
                                                      | (((var42 & 61440) >> 12 | var42 << 4) ^ 60 ^ 218 ^ 216) << 10
                                                )
                                                << 12
                                       )
                                       << 10
                              )
                              << 0
                     )
                     ^ 71
               )
            );
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = -1975519106 ^ 1049736441 ^ -1263645561; var29 < var16.length(); var29 += 2077097100 & (-631584435 | 2077097100) ^ 2077097101) {
            char var52 = var16.charAt(var29);
            char var57 = (char)(
               (
                        (
                              (
                                       (
                                                (
                                                      (
                                                               (
                                                                     (
                                                                              (((var52 & '耀') >> 15 | var52 << 1) & 65528) >> 3
                                                                                 | ((var52 & '耀') >> 15 | var52 << 1) << 13
                                                                           )
                                                                           + 168
                                                                           - 33
                                                                        ^ 168
                                                                  )
                                                                  & 65024
                                                            )
                                                            >> 9
                                                         | (
                                                               ((((var52 & '耀') >> 15 | var52 << 1) & 65528) >> 3 | ((var52 & '耀') >> 15 | var52 << 1) << 13)
                                                                     + 168
                                                                     - 33
                                                                  ^ 168
                                                            )
                                                            << 7
                                                   )
                                                   & 65024
                                             )
                                             >> 9
                                          | (
                                                (
                                                         (
                                                               ((((var52 & '耀') >> 15 | var52 << 1) & 65528) >> 3 | ((var52 & '耀') >> 15 | var52 << 1) << 13)
                                                                     + 168
                                                                     - 33
                                                                  ^ 168
                                                            )
                                                            & 65024
                                                      )
                                                      >> 9
                                                   | (
                                                         ((((var52 & '耀') >> 15 | var52 << 1) & 65528) >> 3 | ((var52 & '耀') >> 15 | var52 << 1) << 13)
                                                               + 168
                                                               - 33
                                                            ^ 168
                                                      )
                                                      << 7
                                             )
                                             << 7
                                    )
                                    + 252
                                 ^ 57
                           )
                           & 64512
                     )
                     >> 10
                  | (
                        (
                                 (
                                          (
                                                (
                                                         (
                                                               ((((var52 & '耀') >> 15 | var52 << 1) & 65528) >> 3 | ((var52 & '耀') >> 15 | var52 << 1) << 13)
                                                                     + 168
                                                                     - 33
                                                                  ^ 168
                                                            )
                                                            & 65024
                                                      )
                                                      >> 9
                                                   | (
                                                         ((((var52 & '耀') >> 15 | var52 << 1) & 65528) >> 3 | ((var52 & '耀') >> 15 | var52 << 1) << 13)
                                                               + 168
                                                               - 33
                                                            ^ 168
                                                      )
                                                      << 7
                                             )
                                             & 65024
                                       )
                                       >> 9
                                    | (
                                          (
                                                   (
                                                         ((((var52 & '耀') >> 15 | var52 << 1) & 65528) >> 3 | ((var52 & '耀') >> 15 | var52 << 1) << 13)
                                                               + 168
                                                               - 33
                                                            ^ 168
                                                      )
                                                      & 65024
                                                )
                                                >> 9
                                             | (((((var52 & '耀') >> 15 | var52 << 1) & 65528) >> 3 | ((var52 & '耀') >> 15 | var52 << 1) << 13) + 168 - 33 ^ 168)
                                                << 7
                                       )
                                       << 7
                              )
                              + 252
                           ^ 57
                     )
                     << 6
            );
            var16.setCharAt(
               var29,
               (char)(
                  (
                           (
                                 (
                                          (
                                                   (
                                                         (
                                                                  (
                                                                        (
                                                                                 (((var52 & '耀') >> 15 | var52 << 1) & 65528) >> 3
                                                                                    | ((var52 & '耀') >> 15 | var52 << 1) << 13
                                                                              )
                                                                              + 168
                                                                              - 33
                                                                           ^ 168
                                                                     )
                                                                     & 65024
                                                               )
                                                               >> 9
                                                            | (
                                                                  ((((var52 & '耀') >> 15 | var52 << 1) & 65528) >> 3 | ((var52 & '耀') >> 15 | var52 << 1) << 13)
                                                                        + 168
                                                                        - 33
                                                                     ^ 168
                                                               )
                                                               << 7
                                                      )
                                                      & 65024
                                                )
                                                >> 9
                                             | (
                                                   (
                                                            (
                                                                  ((((var52 & '耀') >> 15 | var52 << 1) & 65528) >> 3 | ((var52 & '耀') >> 15 | var52 << 1) << 13)
                                                                        + 168
                                                                        - 33
                                                                     ^ 168
                                                               )
                                                               & 65024
                                                         )
                                                         >> 9
                                                      | (
                                                            ((((var52 & '耀') >> 15 | var52 << 1) & 65528) >> 3 | ((var52 & '耀') >> 15 | var52 << 1) << 13)
                                                                  + 168
                                                                  - 33
                                                               ^ 168
                                                         )
                                                         << 7
                                                )
                                                << 7
                                       )
                                       + 252
                                    ^ 57
                              )
                              & 64512
                        )
                        >> 10
                     | (
                           (
                                    (
                                             (
                                                   (
                                                            (
                                                                  ((((var52 & '耀') >> 15 | var52 << 1) & 65528) >> 3 | ((var52 & '耀') >> 15 | var52 << 1) << 13)
                                                                        + 168
                                                                        - 33
                                                                     ^ 168
                                                               )
                                                               & 65024
                                                         )
                                                         >> 9
                                                      | (
                                                            ((((var52 & '耀') >> 15 | var52 << 1) & 65528) >> 3 | ((var52 & '耀') >> 15 | var52 << 1) << 13)
                                                                  + 168
                                                                  - 33
                                                               ^ 168
                                                         )
                                                         << 7
                                                )
                                                & 65024
                                          )
                                          >> 9
                                       | (
                                             (
                                                      (
                                                            ((((var52 & '耀') >> 15 | var52 << 1) & 65528) >> 3 | ((var52 & '耀') >> 15 | var52 << 1) << 13)
                                                                  + 168
                                                                  - 33
                                                               ^ 168
                                                         )
                                                         & 65024
                                                   )
                                                   >> 9
                                                | (
                                                      ((((var52 & '耀') >> 15 | var52 << 1) & 65528) >> 3 | ((var52 & '耀') >> 15 | var52 << 1) << 13) + 168 - 33
                                                         ^ 168
                                                   )
                                                   << 7
                                          )
                                          << 7
                                 )
                                 + 252
                              ^ 57
                        )
                        << 6
               )
            );
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_394.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = -1040520453 * -1624038230 ^ -827566418; var35 < var19.length(); var35 += (310162209 << 310162209 | 1) & 184850613) {
            char var62 = var19.charAt(var35);
            char var67 = (char)(
               (
                     (
                              (
                                    (
                                          (
                                                   (
                                                            (
                                                                     (
                                                                           ((((var62 & '\ue000') >> 13 | var62 << 3) ^ 204) & 65504) >> 5
                                                                              | (((var62 & '\ue000') >> 13 | var62 << 3) ^ 204) << 11
                                                                        )
                                                                        & 65528
                                                                  )
                                                                  >> 3
                                                               | (
                                                                     ((((var62 & '\ue000') >> 13 | var62 << 3) ^ 204) & 65504) >> 5
                                                                        | (((var62 & '\ue000') >> 13 | var62 << 3) ^ 204) << 11
                                                                  )
                                                                  << 13
                                                         )
                                                         + 154
                                                         + 87
                                                      & 65532
                                                )
                                                >> 2
                                             | (
                                                      (
                                                               (
                                                                     ((((var62 & '\ue000') >> 13 | var62 << 3) ^ 204) & 65504) >> 5
                                                                        | (((var62 & '\ue000') >> 13 | var62 << 3) ^ 204) << 11
                                                                  )
                                                                  & 65528
                                                            )
                                                            >> 3
                                                         | (
                                                               ((((var62 & '\ue000') >> 13 | var62 << 3) ^ 204) & 65504) >> 5
                                                                  | (((var62 & '\ue000') >> 13 | var62 << 3) ^ 204) << 11
                                                            )
                                                            << 13
                                                   )
                                                   + 154
                                                   + 87
                                                << 14
                                       )
                                       ^ 233
                                 )
                                 & 65532
                           )
                           >> 2
                        | (
                              (
                                    (
                                             (
                                                      (
                                                               (
                                                                     ((((var62 & '\ue000') >> 13 | var62 << 3) ^ 204) & 65504) >> 5
                                                                        | (((var62 & '\ue000') >> 13 | var62 << 3) ^ 204) << 11
                                                                  )
                                                                  & 65528
                                                            )
                                                            >> 3
                                                         | (
                                                               ((((var62 & '\ue000') >> 13 | var62 << 3) ^ 204) & 65504) >> 5
                                                                  | (((var62 & '\ue000') >> 13 | var62 << 3) ^ 204) << 11
                                                            )
                                                            << 13
                                                   )
                                                   + 154
                                                   + 87
                                                & 65532
                                          )
                                          >> 2
                                       | (
                                                (
                                                         (
                                                               ((((var62 & '\ue000') >> 13 | var62 << 3) ^ 204) & 65504) >> 5
                                                                  | (((var62 & '\ue000') >> 13 | var62 << 3) ^ 204) << 11
                                                            )
                                                            & 65528
                                                      )
                                                      >> 3
                                                   | (
                                                         ((((var62 & '\ue000') >> 13 | var62 << 3) ^ 204) & 65504) >> 5
                                                            | (((var62 & '\ue000') >> 13 | var62 << 3) ^ 204) << 11
                                                      )
                                                      << 13
                                             )
                                             + 154
                                             + 87
                                          << 14
                                 )
                                 ^ 233
                           )
                           << 14
                  )
                  + 149
            );
            var19.setCharAt(
               var35,
               (char)(
                  (
                        (
                                 (
                                       (
                                             (
                                                      (
                                                               (
                                                                        (
                                                                              ((((var62 & '\ue000') >> 13 | var62 << 3) ^ 204) & 65504) >> 5
                                                                                 | (((var62 & '\ue000') >> 13 | var62 << 3) ^ 204) << 11
                                                                           )
                                                                           & 65528
                                                                     )
                                                                     >> 3
                                                                  | (
                                                                        ((((var62 & '\ue000') >> 13 | var62 << 3) ^ 204) & 65504) >> 5
                                                                           | (((var62 & '\ue000') >> 13 | var62 << 3) ^ 204) << 11
                                                                     )
                                                                     << 13
                                                            )
                                                            + 154
                                                            + 87
                                                         & 65532
                                                   )
                                                   >> 2
                                                | (
                                                         (
                                                                  (
                                                                        ((((var62 & '\ue000') >> 13 | var62 << 3) ^ 204) & 65504) >> 5
                                                                           | (((var62 & '\ue000') >> 13 | var62 << 3) ^ 204) << 11
                                                                     )
                                                                     & 65528
                                                               )
                                                               >> 3
                                                            | (
                                                                  ((((var62 & '\ue000') >> 13 | var62 << 3) ^ 204) & 65504) >> 5
                                                                     | (((var62 & '\ue000') >> 13 | var62 << 3) ^ 204) << 11
                                                               )
                                                               << 13
                                                      )
                                                      + 154
                                                      + 87
                                                   << 14
                                          )
                                          ^ 233
                                    )
                                    & 65532
                              )
                              >> 2
                           | (
                                 (
                                       (
                                                (
                                                         (
                                                                  (
                                                                        ((((var62 & '\ue000') >> 13 | var62 << 3) ^ 204) & 65504) >> 5
                                                                           | (((var62 & '\ue000') >> 13 | var62 << 3) ^ 204) << 11
                                                                     )
                                                                     & 65528
                                                               )
                                                               >> 3
                                                            | (
                                                                  ((((var62 & '\ue000') >> 13 | var62 << 3) ^ 204) & 65504) >> 5
                                                                     | (((var62 & '\ue000') >> 13 | var62 << 3) ^ 204) << 11
                                                               )
                                                               << 13
                                                      )
                                                      + 154
                                                      + 87
                                                   & 65532
                                             )
                                             >> 2
                                          | (
                                                   (
                                                            (
                                                                  ((((var62 & '\ue000') >> 13 | var62 << 3) ^ 204) & 65504) >> 5
                                                                     | (((var62 & '\ue000') >> 13 | var62 << 3) ^ 204) << 11
                                                               )
                                                               & 65528
                                                         )
                                                         >> 3
                                                      | (
                                                            ((((var62 & '\ue000') >> 13 | var62 << 3) ^ 204) & 65504) >> 5
                                                               | (((var62 & '\ue000') >> 13 | var62 << 3) ^ 204) << 11
                                                         )
                                                         << 13
                                                )
                                                + 154
                                                + 87
                                             << 14
                                    )
                                    ^ 233
                              )
                              << 14
                     )
                     + 149
               )
            );
         }

         Class var7 = Class.forName(var19.toString(), false, Class_394.class.getClassLoader());
         switch ((((var4 ^ 743503527) + 1762789177 ^ 190589525) - 1896048215 + 307643339 - 1736548834 - 687150822 ^ 503503561) - 2139262876 + 2054615855) {
            case 358539281:
               var10000 = var0.findSpecial(var7, var5, var6, Class_394.class);
               break;
            case 905285481:
            case 1851692582:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 1068518406:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            case 1776645875:
               var10000 = var0.findConstructor(var7, var6);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_1568[var10 - 1329802850 + 1270659893 + 1261195104 - 1720360291 + 100949316 + 1281772892 + 2123031557 + 258215893 + 1564034589 - 42108569] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1414(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 - 1245752921 - 14272011 - 899155341 ^ 2102190497) + 875102594 - 833477799 ^ 472038906) + 115864448 + 1699048539;
      MethodHandle var10000 = field_1568[((var10 - 1245752921 - 14272011 - 899155341 ^ 2102190497) + 875102594 - 833477799 ^ 472038906)
         + 115864448
         + 1699048539
         - 331120136];
      if (field_1568[var10001 - 331120136] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = -977393846 << -977393846 ^ -123918336; var24 < var14.length(); var24 += -872894359 & -2105822062 ^ -2106019839) {
            var14.setCharAt(var24, (char)(((var14.charAt(var24) - 216 ^ 155 ^ 176 ^ 54) - 37 + 147 - 177 ^ 87) - 6 + 246));
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = -1937163086 * (1051894752 | -1248428805) ^ 1922027654; var30 < var17.length(); var30 += -888574510 >> -888574510 ^ -3389) {
            char var47 = var17.charAt(var30);
            char var50 = (char)(
               (
                     (
                              (
                                    ((((((var47 & '\uf000') >> 12 | var47 << 4) & 49152) >> 14 | ((var47 & '\uf000') >> 12 | var47 << 4) << 2) ^ 42) & 65504)
                                          >> 5
                                       | (((((var47 & '\uf000') >> 12 | var47 << 4) & 49152) >> 14 | ((var47 & '\uf000') >> 12 | var47 << 4) << 2) ^ 42) << 11
                                 )
                                 ^ 4
                           )
                           - 154
                        ^ 166
                        ^ 197
                  )
                  - 163
                  + 134
            );
            var17.setCharAt(
               var30,
               (char)(
                  (
                        (
                                 (
                                       ((((((var47 & '\uf000') >> 12 | var47 << 4) & 49152) >> 14 | ((var47 & '\uf000') >> 12 | var47 << 4) << 2) ^ 42) & 65504)
                                             >> 5
                                          | (((((var47 & '\uf000') >> 12 | var47 << 4) & 49152) >> 14 | ((var47 & '\uf000') >> 12 | var47 << 4) << 2) ^ 42)
                                             << 11
                                    )
                                    ^ 4
                              )
                              - 154
                           ^ 166
                           ^ 197
                     )
                     - 163
                     + 134
               )
            );
         }

         Class var6 = Class.forName(var17.toString(), false, Class_394.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = -833395426 & -1362233272 ^ -1908318200; var36 < var20.length(); var36 += (-523689779 << (1540321453 & -1290617482) | 1) & 323863051) {
            int var55 = var20.charAt(var36) - 'N' ^ 163;
            char var58 = (char)(
               (
                     ((((((var55 & 0) >> 16 | var55 << 0) ^ 171 ^ 66) & 61440) >> 12 | (((var55 & 0) >> 16 | var55 << 0) ^ 171 ^ 66) << 4) + 55 & 65528) >> 3
                        | (((((var55 & 0) >> 16 | var55 << 0) ^ 171 ^ 66) & 61440) >> 12 | (((var55 & 0) >> 16 | var55 << 0) ^ 171 ^ 66) << 4) + 55 << 13
                  )
                  - 198
                  + 114
            );
            var20.setCharAt(
               var36,
               (char)(
                  (
                        ((((((var55 & 0) >> 16 | var55 << 0) ^ 171 ^ 66) & 61440) >> 12 | (((var55 & 0) >> 16 | var55 << 0) ^ 171 ^ 66) << 4) + 55 & 65528)
                              >> 3
                           | (((((var55 & 0) >> 16 | var55 << 0) ^ 171 ^ 66) & 61440) >> 12 | (((var55 & 0) >> 16 | var55 << 0) ^ 171 ^ 66) << 4) + 55 << 13
                     )
                     - 198
                     + 114
               )
            );
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_394.class.getClassLoader()).returnType();
         switch ((var4 ^ 286393398) + 2027604320 - 1773980957 ^ 629374026 ^ 255295235 ^ 585710597 ^ 78416973 ^ 1751193322 ^ 1721187701 ^ 613934942) {
            case 1195542164:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            case 1332211106:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            case 1642279414:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            case 1905191648:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_1568[((var10 - 1245752921 - 14272011 - 899155341 ^ 2102190497) + 875102594 - 833477799 ^ 472038906) + 115864448 + 1699048539 - 331120136] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
