import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;
import java.util.Iterator;
import java.util.Set;
import java.util.Map.Entry;
import java.util.concurrent.ConcurrentHashMap;
import net.minecraft.class_1923;
import net.minecraft.class_243;
import net.minecraft.class_2676;

public class Class_312 extends Class_342 {
   // $VF: renamed from: ach int
   public static int field_1832 = 5;
   // $VF: renamed from: lqq long
   public static long field_1833 = 1000L;
   // $VF: renamed from: crt int
   public static int field_1834 = 50;
   // $VF: renamed from: zv Class_105
   public Class_105 field_1835;
   // $VF: renamed from: doa java.util.concurrent.ConcurrentHashMap
   public ConcurrentHashMap field_1836;
   // $VF: renamed from: hu java.util.concurrent.ConcurrentHashMap
   public ConcurrentHashMap field_1837;
   // $VF: renamed from: pvh java.util.Set
   public Set field_1838;
   // $VF: renamed from: gl java.util.Set
   public Set field_1839;
   // $VF: renamed from: voj java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_1840 = new MethodHandle[172];

   public Class_312() {
      int var10001 = -983519026 & -191253171 ^ -1006587828;

      StringBuilder var10002;
      for (var10002 = (StringBuilder)0<"JNT",896288505,"承蚀骀蚀芀婿","ᥔ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛ\u197fᤐᤞᤕᤚᤓᥧᥕᤂ","̥ʕťʕﻨ˅ʕ˥˵ﻨＸŅƥ̕˥˵¥ŕ̕˅Ʌɕƥ",1350390461>(
            "쐂첂쩂쭂쥂\ud802샂쨂쵂쮂쫂\ud802솂쩂쮂줂쥂첂"
         );
         var10001 < ((325872849 | -1970359767 | 18) & 1611661590);
         var10001 += (-1793981668 >>> 182735825 | 1) & -1567910813
      ) {
         int var13 = 0<"JNT",-659144677,"뺀銀Ꚁ檀⚀芀","ᥔ\u1975ᥕ\u196f","̥ʕťʕﻨ˅ʕ˥˵ﻨＸŅƥ̕˥˵¥ŕ̕˅Ʌɕƥ",1350390569>(var10002, var10001);
         int var10005 = (var13 & 63488) >> 11;
         int var14 = ((var13 & 63488) >> 11 | var13 << 5) ^ 90;
         int var40 = ((((var13 & 63488) >> 11 | var13 << 5) ^ 90) & 0) >> 16;
         var13 = (((var10005 | var13 << 5) ^ 90) & 0) >> 16 | (((var13 & 63488) >> 11 | var13 << 5) ^ 90) << 0;
         var10005 = ((var40 | var14 << 0) & 61440) >> 12;
         int var16 = ((var40 | var14 << 0) & 61440) >> 12 | var13 << 4;
         int var42 = ((((var40 | var14 << 0) & 61440) >> 12 | var13 << 4) & 32768) >> 15;
         char var17 = (char)(((var10005 | var13 << 4) & 32768) >> 15 | (((var40 | var14 << 0) & 61440) >> 12 | var13 << 4) << 1);
         0<"JNT",-659144677,"纀뚀芀㺀銀Ꚁ檀⚀芀","ᥔ\u1975\u196fᥕᤂ","̥ʕťʕﻨ˅ʕ˥˵ﻨＸŅƥ̕˥˵¥ŕ̕˅Ʌɕƥ",1350390576>(var10002, var10001, (char)(var42 | var16 << 1));
      }

      String var2 = 0<"JNT",-659144677,"芀満ﹿ芀檀蚀骀躀","ᥔᥕ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛ\u197fᤐᤞᤕᤚᤓᥧ","̥ʕťʕﻨ˅ʕ˥˵ﻨＸŅƥ̕˥˵¥ŕ̕˅Ʌɕƥ",1350390518>(var10002);
      int var7 = -1651236016 << -424717082 ^ 1695077376;

      StringBuilder var19;
      for (var19 = (StringBuilder)0<"JNT",896288505,"承蚀骀蚀芀婿","ᥔ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛ\u197fᤐᤞᤕᤚᤓᥧᥕᤂ","̥ʕťʕﻨ˅ʕ˥˵ﻨＸŅƥ̕˥˵¥ŕ̕˅Ʌɕƥ",1350390521>(
            "䒑\ud891\u0892\uf091\ue491傑\udc91\uf091좑첑\u0091뢐\uf891\u0091\udc91\uec91첑뢐ಒ첑\u0091\u0092\udc91\uf491\uf091"
         );
         var7 < 25;
         var7 += 1
      ) {
         int var29 = (0<"JNT",-659144677,"뺀銀Ꚁ檀⚀芀","ᥔ\u1975ᥕ\u196f","̥ʕťʕﻨ˅ʕ˥˵ﻨＸŅƥ̕˥˵¥ŕ̕˅Ʌɕƥ",1350390575>(var19, var7) ^ '\b') - 29 - 125;
         char var30 = (char)(((var29 & 64512) >> 10 | var29 << 6) + 115);
         0<"JNT",-659144677,"纀뚀芀㺀銀Ꚁ檀⚀芀","ᥔ\u1975\u196fᥕᤂ","̥ʕťʕﻨ˅ʕ˥˵ﻨＸŅƥ̕˥˵¥ŕ̕˅Ʌɕƥ",1350390566>(var19, var7, (char)(((var29 & 64512) >> 10 | var29 << 6) + 115));
      }

      super(
         var2,
         0<"JNT",-659144677,"芀満ﹿ芀檀蚀骀躀","ᥔᥕ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛ\u197fᤐᤞᤕᤚᤓᥧ","̥ʕťʕﻨ˅ʕ˥˵ﻨＸŅƥ̕˥˵¥ŕ̕˅Ʌɕƥ",1350390563>(var19),
         -1,
         1<"JNT",1022107669,"N聗胩","ח䷗","䬡匡欢팣ᬣ\ue321",-603786901>()
      );
      var10001 = (1909429430 & 201718888 | 0) & 644497988;

      for (var10002 = (StringBuilder)0<"JNT",896288505,"承蚀骀蚀芀婿","ᥔ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛ\u197fᤐᤞᤕᤚᤓᥧᥕᤂ","̥ʕťʕﻨ˅ʕ˥˵ﻨＸŅƥ̕˥˵¥ŕ̕˅Ʌɕƥ",1350390573>("ĩćĖĘĚćĈ");
         var10001 < ((-1474369046 | 561962704) ^ -1451294723);
         var10001 += (-533966084 | -257831930) ^ -257040641
      ) {
         0<"JNT",-659144677,"纀뚀芀㺀銀Ꚁ檀⚀芀","ᥔ\u1975\u196fᥕᤂ","̥ʕťʕﻨ˅ʕ˥˵ﻨＸŅƥ̕˥˵¥ŕ̕˅Ʌɕƥ",1350390527>(
            var10002,
            var10001,
            (char)((0<"JNT",-659144677,"뺀銀Ꚁ檀⚀芀","ᥔ\u1975ᥕ\u196f","̥ʕťʕﻨ˅ʕ˥˵ﻨＸŅƥ̕˥˵¥ŕ̕˅Ʌɕƥ",1350390556>(var10002, var10001) - 127 ^ 0) - 252 + 246 ^ 240)
         );
      }

      Class_105 var5 = (Class_105)0<"JNT",896288505,"承蚀骀蚀芀婿","ᥔ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛ\u197fᤐᤞᤕᤚᤓᥧᤆᥕᤂ","˵ƥ",1350390515>(
         0<"JNT",-659144677,"芀満ﹿ芀檀蚀骀躀","ᥔᥕ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛ\u197fᤐᤞᤕᤚᤓᥧ","̥ʕťʕﻨ˅ʕ˥˵ﻨＸŅƥ̕˥˵¥ŕ̕˅Ʌɕƥ",1350390528>(var10002), true
      );
      int var11 = (1693944235 | -1315432030 | 0) & 134243904;

      for (var19 = (StringBuilder)0<"JNT",896288505,"承蚀骀蚀芀婿","ᥔ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛ\u197fᤐᤞᤕᤚᤓᥧᥕᤂ","̥ʕťʕﻨ˅ʕ˥˵ﻨＸŅƥ̕˥˵¥ŕ̕˅Ʌɕƥ",1350390522>(
            "\u0088äÂî@Â@ØÒÜÊ@èÞ@ÊÂÆÐ@ÌØÂÎÎÊÈ@ÆÐêÜÖ"
         );
         var11 < (555568537 << -515778103 ^ 983249441);
         var11 += (-760994056 | -760994056) ^ -760994055
      ) {
         char var33 = 0<"JNT",-659144677,"뺀銀Ꚁ檀⚀芀","ᥔ\u1975ᥕ\u196f","̥ʕťʕﻨ˅ʕ˥˵ﻨＸŅƥ̕˥˵¥ŕ̕˅Ʌɕƥ",1350390516>(var19, var11);
         char var38 = (char)(
            (
                     (
                           (
                                    (
                                          (((((var33 & '\uffff') >> 0 | var33 << 16) & 65528) >> 3 | ((var33 & '\uffff') >> 0 | var33 << 16) << 13) & 49152)
                                                >> 14
                                             | ((((var33 & '\uffff') >> 0 | var33 << 16) & 65528) >> 3 | ((var33 & '\uffff') >> 0 | var33 << 16) << 13) << 2
                                       )
                                       & 65535
                                 )
                                 >> 0
                              | (
                                    (((((var33 & '\uffff') >> 0 | var33 << 16) & 65528) >> 3 | ((var33 & '\uffff') >> 0 | var33 << 16) << 13) & 49152) >> 14
                                       | ((((var33 & '\uffff') >> 0 | var33 << 16) & 65528) >> 3 | ((var33 & '\uffff') >> 0 | var33 << 16) << 13) << 2
                                 )
                                 << 16
                        )
                        & 0
                  )
                  >> 16
               | (
                     (
                              (
                                    (((((var33 & '\uffff') >> 0 | var33 << 16) & 65528) >> 3 | ((var33 & '\uffff') >> 0 | var33 << 16) << 13) & 49152) >> 14
                                       | ((((var33 & '\uffff') >> 0 | var33 << 16) & 65528) >> 3 | ((var33 & '\uffff') >> 0 | var33 << 16) << 13) << 2
                                 )
                                 & 65535
                           )
                           >> 0
                        | (
                              (((((var33 & '\uffff') >> 0 | var33 << 16) & 65528) >> 3 | ((var33 & '\uffff') >> 0 | var33 << 16) << 13) & 49152) >> 14
                                 | ((((var33 & '\uffff') >> 0 | var33 << 16) & 65528) >> 3 | ((var33 & '\uffff') >> 0 | var33 << 16) << 13) << 2
                           )
                           << 16
                  )
                  << 0
         );
         0<"JNT",-659144677,"纀뚀芀㺀銀Ꚁ檀⚀芀","ᥔ\u1975\u196fᥕᤂ","̥ʕťʕﻨ˅ʕ˥˵ﻨＸŅƥ̕˥˵¥ŕ̕˅Ʌɕƥ",1350390519>(
            var19,
            var11,
            (char)(
               (
                        (
                              (
                                       (
                                             (((((var33 & '\uffff') >> 0 | var33 << 16) & 65528) >> 3 | ((var33 & '\uffff') >> 0 | var33 << 16) << 13) & 49152)
                                                   >> 14
                                                | ((((var33 & '\uffff') >> 0 | var33 << 16) & 65528) >> 3 | ((var33 & '\uffff') >> 0 | var33 << 16) << 13) << 2
                                          )
                                          & 65535
                                    )
                                    >> 0
                                 | (
                                       (((((var33 & '\uffff') >> 0 | var33 << 16) & 65528) >> 3 | ((var33 & '\uffff') >> 0 | var33 << 16) << 13) & 49152) >> 14
                                          | ((((var33 & '\uffff') >> 0 | var33 << 16) & 65528) >> 3 | ((var33 & '\uffff') >> 0 | var33 << 16) << 13) << 2
                                    )
                                    << 16
                           )
                           & 0
                     )
                     >> 16
                  | (
                        (
                                 (
                                       (((((var33 & '\uffff') >> 0 | var33 << 16) & 65528) >> 3 | ((var33 & '\uffff') >> 0 | var33 << 16) << 13) & 49152) >> 14
                                          | ((((var33 & '\uffff') >> 0 | var33 << 16) & 65528) >> 3 | ((var33 & '\uffff') >> 0 | var33 << 16) << 13) << 2
                                    )
                                    & 65535
                              )
                              >> 0
                           | (
                                 (((((var33 & '\uffff') >> 0 | var33 << 16) & 65528) >> 3 | ((var33 & '\uffff') >> 0 | var33 << 16) << 13) & 49152) >> 14
                                    | ((((var33 & '\uffff') >> 0 | var33 << 16) & 65528) >> 3 | ((var33 & '\uffff') >> 0 | var33 << 16) << 13) << 2
                              )
                              << 16
                     )
                     << 0
            )
         );
      }

      this.field_1835 = 0<"JNT",-659144677,"Ꚁ皀슀","ᥔ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛ\u197fᤐᤞᤕᤚᤓᥧᥕ\u1978ᤓᤞᥧ","˵ƥ",1350390567>(
         var5, 0<"JNT",-659144677,"芀満ﹿ芀檀蚀骀躀","ᥔᥕ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛ\u197fᤐᤞᤕᤚᤓᥧ","̥ʕťʕﻨ˅ʕ˥˵ﻨＸŅƥ̕˥˵¥ŕ̕˅Ʌɕƥ",1350390564>(var19)
      );
      this.field_1836 = (ConcurrentHashMap)0<"JNT",896288505,"承蚀骀蚀芀婿","ᥔᥕᤂ","̥ʕťʕﻨŕŅ̕˅ﻨȵŵ˥ȵŕƥƥɕ˥Ņﻨ5ŵ˥ȵŕƥƥɕ˥Ņąʕĵ̅Õʕƅ",1350390558>();
      this.field_1837 = (ConcurrentHashMap)0<"JNT",896288505,"承蚀骀蚀芀婿","ᥔᥕᤂ","̥ʕťʕﻨŕŅ̕˅ﻨȵŵ˥ȵŕƥƥɕ˥Ņﻨ5ŵ˥ȵŕƥƥɕ˥Ņąʕĵ̅Õʕƅ",1350390561>();
      this.field_1838 = 0<"JNT",-1128591645,"骀뚀亀Ẁ뚀䚀ﹿ뚀芀","ᥔᥕ\u1978ᤖᤍᤢᤍᥛᤡᤐᤕᤘᥛᤏᤛᤚᤏᤡᤞᤞᤑᤚᤐᥛ\u196fᤛᤚᤏᤡᤞᤞᤑᤚᤐᥴᤍ\u191fᤔ\u1979ᤍᤜ᥀\u1977ᤑᤥ\u197fᤑᤐᤂᤕᤑᤣᥧ","̥ʕťʕﻨŕŅ̕˅ﻨȵŵ˥ȵŕƥƥɕ˥Ņﻨ5ŵ˥ȵŕƥƥɕ˥Ņąʕĵ̅Õʕƅ",1350390568>();
      this.field_1839 = 0<"JNT",-1128591645,"骀뚀亀Ẁ뚀䚀ﹿ뚀芀","ᥔᥕ\u1978ᤖᤍᤢᤍᥛᤡᤐᤕᤘᥛᤏᤛᤚᤏᤡᤞᤞᤑᤚᤐᥛ\u196fᤛᤚᤏᤡᤞᤞᤑᤚᤐᥴᤍ\u191fᤔ\u1979ᤍᤜ᥀\u1977ᤑᤥ\u197fᤑᤐᤂᤕᤑᤣᥧ","̥ʕťʕﻨŕŅ̕˅ﻨȵŵ˥ȵŕƥƥɕ˥Ņﻨ5ŵ˥ȵŕƥƥɕ˥Ņąʕĵ̅Õʕƅ",1350390555>();
      0<"JNT",-659144677,"暀皀","ᥔᤇ\u1978ᤝᤑᤑᥧᥕᤂ","Ņȵ",1350390565>(this, new Class_271[]{1<"JNT",-1830278997,"ëI","\uddd6嗗","䬡匡欢䌣鬣\ue321",-603786893>(this)});
   }

   // $VF: renamed from: q () void
   @Override
   public void method_1408() {
      0<"JNT",140639900,"暀","ᥔᥕᤂ","ŕĵɥ",1350390574>(this);
      0<"JNT",-659144677,"뺀ꊀ뚀Ꚁ檀","ᥔᥕᤂ","̥ʕťʕﻨŕŅ̕˅ﻨȵŵ˥ȵŕƥƥɕ˥Ņﻨ5ŵ˥ȵŕƥƥɕ˥Ņąʕĵ̅Õʕƅ",1350390520>(
         1<"JNT",-1830278997,"P聍聖","\uddd6嗗","䬡匡欢嬣ጣ묣ጣ茡댣ꬣ匣欣茡⌣茣笣⌣댣鬣鬣㌣笣ꬣ茡⌢茣笣⌣댣鬣鬣㌣笣ꬣ䬢ጣꌣ䬣猢ጣ謣\ue321",-603786882>(this)
      );
      0<"JNT",-659144677,"뺀ꊀ뚀Ꚁ檀","ᥔᥕᤂ","̥ʕťʕﻨŕŅ̕˅ﻨȵŵ˥ȵŕƥƥɕ˥Ņﻨ5ŵ˥ȵŕƥƥɕ˥Ņąʕĵ̅Õʕƅ",1350390578>(
         1<"JNT",-1830278997,"R聈","\uddd6嗗","䬡匡欢嬣ጣ묣ጣ茡댣ꬣ匣欣茡⌣茣笣⌣댣鬣鬣㌣笣ꬣ茡⌢茣笣⌣댣鬣鬣㌣笣ꬣ䬢ጣꌣ䬣猢ጣ謣\ue321",-603786884>(this)
      );
      0<"JNT",1003128696,"뺀ꊀ뚀Ꚁ檀","ᥔᥕᤂ","̥ʕťʕﻨŕŅ̕˅ﻨＸɕŅ",1350390572>(1<"JNT",-1830278997,"NIR","\uddd6嗗","䬡匡欢嬣ጣ묣ጣ茡댣ꬣ匣欣茡ꌢ㌣ꬣ\ue321",-603786878>(this));
      0<"JNT",1003128696,"뺀ꊀ뚀Ꚁ檀","ᥔᥕᤂ","̥ʕťʕﻨŕŅ̕˅ﻨＸɕŅ",1350390470>(1<"JNT",-1830278997,"聑L","\uddd6嗗","䬡匡欢嬣ጣ묣ጣ茡댣ꬣ匣欣茡ꌢ㌣ꬣ\ue321",-603786880>(this));
   }

   // $VF: renamed from: whs (net.minecraft.class_1923) int
   public int method_1612(class_1923 var1) {
      return 1<"JNT",-1830278997,"Q聒聐LP聕聊耮J耮","귗旗\uddd6귕ꗗ藗귗旗嗗췖䗗淗\uddd6귕嗗鷗䗗헖헖㗘엔ו췔헔","䬡匡匢",-603786906>(var1) * 16 + 8;
   }

   // $VF: renamed from: ucj (net.minecraft.class_1923) int
   public int method_1613(class_1923 var1) {
      return 1<"JNT",-1830278997,"Q聒聐LP聕聊耮J.","귗旗\uddd6귕ꗗ藗귗旗嗗췖䗗淗\uddd6귕嗗鷗䗗헖헖㗘엔ו췔헔","䬡匡匢",-603786907>(var1) * 16 + 8;
   }

   // $VF: renamed from: hmq (net.minecraft.class_1923) void
   public void method_1614(class_1923 var1) {
      int var5 = 831882015;
      int var2 = -3;

      label42:
      while (true) {
         var5 = 1287036718;

         while (true) {
            switch (((var5 ^ 1302188709 ^ 1443127512) + 1018135859 ^ 469959550) + 776848956 - 1366188433) {
               case -1981347827:
                  return;
               case 1824331427:
            }

            if (var2 <= 3) {
               int var3 = -3;

               while (true) {
                  var5 = -670558328 & -1394991154;

                  while (true) {
                     switch (((var5 + 961212578 ^ 1918125383) - 1894632397 + 521668188 ^ 730356089) - 658298975) {
                        case -1698472531:
                        default:
                           var2++;
                           continue label42;
                        case 595396134:
                     }

                     if (var3 <= 3) {
                        class_1923 var4 = (class_1923)0<"JNT",896288505,"承蚀骀蚀芀婿","ᥔ\u1975\u1975ᥕᤂ","˥ɕŅﻨ˕̕˥ɕȵƥʕɥŅﻨȵ˅ʕĵĵɵﶘ︘ﶨﴸ",1350390477>(
                           1<"JNT",-1830278997,"Q聒聐LP聕聊耮J耮","귗旗\uddd6귕ꗗ藗귗旗嗗췖䗗淗\uddd6귕嗗鷗䗗헖헖㗘엔ו췔헔","䬡匡匢",-603786876>(var1) + var2,
                           1<"JNT",-1830278997,"Q聒聐LP聕聊耮J.","귗旗\uddd6귕ꗗ藗귗旗嗗췖䗗淗\uddd6귕嗗鷗䗗헖헖㗘엔ו췔헔","䬡匡匢",-603786869>(var1) + var3
                        );
                        0<"JNT",1003128696,"Ꚁ슀슀","ᥔ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛ\u197bᤎᤖᤑᤏᤐᥧᥕᤆ","̥ʕťʕﻨŕŅ̕˅ﻨＸɕŅ",1350390471>(
                           1<"JNT",-1830278997,"NIR","\uddd6嗗","䬡匡欢嬣ጣ묣ጣ茡댣ꬣ匣欣茡ꌢ㌣ꬣ\ue321",-603786871>(this), var4
                        );
                        0<"JNT",-659144677,"檀뚀隀満窀뚀","ᥔ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛ\u197bᤎᤖᤑᤏᤐᥧᥕ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛ\u197bᤎᤖᤑᤏᤐᥧ","̥ʕťʕﻨŕŅ̕˅ﻨȵŵ˥ȵŕƥƥɕ˥Ņﻨ5ŵ˥ȵŕƥƥɕ˥Ņąʕĵ̅Õʕƅ",1350390465>(
                           1<"JNT",-1830278997,"R聈","\uddd6嗗","䬡匡欢嬣ጣ묣ጣ茡댣ꬣ匣欣茡⌣茣笣⌣댣鬣鬣㌣笣ꬣ茡⌢茣笣⌣댣鬣鬣㌣笣ꬣ䬢ጣꌣ䬣猢ጣ謣\ue321",-603786865>(this), var4
                        );
                        var3++;
                        break;
                     }

                     var5 = (-368440789 >>> 635655430 | 245334231) & -1879059713;
                  }
               }
            }

            var5 = -571268916 - -19254537 ^ -1328265919;
         }
      }
   }

   // $VF: renamed from: mia (Class_83) void
   @Class_21
   public void method_1615(Class_83 var1) {
      if (1<"JNT",-1830278997,"聐职ê","淗闗","䬡匡欢笣㌣ꬣ茡猣匣笣㌣⌣鬣ጣ㬣ꬣ茡⌣欣ጣꌣꌣ̣鬡댡팡묡\ue321",-603786867>(var1) instanceof class_2676 var2) {
         class_1923 var5 = (class_1923)0<"JNT",896288505,"承蚀骀蚀芀婿","ᥔ\u1975\u1975ᥕᤂ","˥ɕŅﻨ˕̕˥ɕȵƥʕɥŅﻨȵ˅ʕĵĵɵﶘ︘ﶨﴸ",1350390469>(
            0<"JNT",-659144677,"隀뚀芀銀満슀꺀晿晿癿癿剿","ᥔᥕ\u1975","˥ɕŅﻨ˕̕˥ɕȵƥʕɥŅﻨȵ˅ʕĵĵɵﶨﵨﷸﵨ",1350390459>(var2),
            0<"JNT",-659144677,"隀뚀芀銀満슀꺀晿晿癿癿艿","ᥔᥕ\u1975","˥ɕŅﻨ˕̕˥ɕȵƥʕɥŅﻨȵ˅ʕĵĵɵﶨﵨﷸﵨ",1350390466>(var2)
         );
         if (!0<"JNT",1003128696,"뺀満骀芀Ꚁ蚀骀纀","ᥔ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛ\u197bᤎᤖᤑᤏᤐᥧᥕᤆ","̥ʕťʕﻨŕŅ̕˅ﻨＸɕŅ",1350390559>(
            1<"JNT",-1830278997,"NIR","\uddd6嗗","䬡匡欢嬣ጣ묣ጣ茡댣ꬣ匣欣茡ꌢ㌣ꬣ\ue321",-603786863>(this), var5
         )) {
            int var4 = 0<"JNT",-659144677,"蚀骀芀奔Ꚁꊀ皀뚀","ᥔᥕ\u1975","̥ʕťʕﻨ˅ʕ˥˵ﻨĕ˥Ņɕ˵ɕƥ",1350390547>(
               (Integer)0<"JNT",-659144677,"隀뚀檀躀뚀","ᥔ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛ\u197bᤎᤖᤑᤏᤐᥧ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛ\u197bᤎᤖᤑᤏᤐᥧ\u1978ᤖᤍᤢᤍᥛᤡᤐᤕᤘᥛᤒᤡᤚᤏᤐᤕᤛᤚᥛ\u196eᤕᥲᤡᤚᤏᤐᤕᤛᤚᥧᥕ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛ\u197bᤎᤖᤑᤏᤐᥧ","̥ʕťʕﻨŕŅ̕˅ﻨȵŵ˥ȵŕƥƥɕ˥Ņﻨ5ŵ˥ȵŕƥƥɕ˥Ņąʕĵ̅Õʕƅ",1350390560>(
                  1<"JNT",-1830278997,"P聍聖","\uddd6嗗","䬡匡欢嬣ጣ묣ጣ茡댣ꬣ匣欣茡⌣茣笣⌣댣鬣鬣㌣笣ꬣ茡⌢茣笣⌣댣鬣鬣㌣笣ꬣ䬢ጣꌣ䬣猢ጣ謣\ue321",-603786889>(this),
                  var5,
                  0<"JNT",-1128591645,"窀Ꚁꊀ皀뚀\uee7f몀","ᥔ\u1975ᥕ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛ\u1975ᤚᤐᤑᤓᤑᤞᥧ","̥ʕťʕﻨ˅ʕ˥˵ﻨĕ˥Ņɕ˵ɕƥ",1350390553>(1),
                  Integer::sum
               )
            );
            if (var4 >= 5) {
               0<"JNT",-659144677,"犀皀芀ڀ몀⚀ꪀ纀뚀骀芀","ᥔ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛ\u197bᤎᤖᤑᤏᤐᥧ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛ\u197bᤎᤖᤑᤏᤐᥧᥕ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛ\u197bᤎᤖᤑᤏᤐᥧ","̥ʕťʕﻨŕŅ̕˅ﻨȵŵ˥ȵŕƥƥɕ˥Ņﻨ5ŵ˥ȵŕƥƥɕ˥Ņąʕĵ̅Õʕƅ",1350390551>(
                  1<"JNT",-1830278997,"R聈","\uddd6嗗","䬡匡欢嬣ጣ묣ጣ茡댣ꬣ匣欣茡⌣茣笣⌣댣鬣鬣㌣笣ꬣ茡⌢茣笣⌣댣鬣鬣㌣笣ꬣ䬢ጣꌣ䬣猢ጣ謣\ue321",-603786853>(this),
                  var5,
                  0<"JNT",-1128591645,"窀Ꚁꊀ皀뚀\uee7f몀","ᥔ\u1976ᥕ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛ\u1978ᤛᤚᤓᥧ","̥ʕťʕﻨ˅ʕ˥˵ﻨÅŵ˥˵",1350390548>(
                     0<"JNT",-1128591645,"뺀皀檀檀뚀骀芀ʀ蚀隀뚀 蚀ꊀꊀ蚀纀","ᥔᥕ\u1976","̥ʕťʕﻨ˅ʕ˥˵ﻨＸȕĵŅɕ˕",1350390493>()
                  )
               );
            }
         }
      }
   }

   // $VF: renamed from: gd (Class_207) void
   @Class_21
   public void method_1616(Class_207 var1) {
      int var18 = -523802307;
      if (1<"JNT",-1830278997,"Q聒聐LP聕耮聉/(","귗旗\uddd6귕ꗗ藗귗旗嗗췖䗗淗\uddd6귕嗗鷗䗗헖헖㗘헔엔뷔","䬡匡欢笣㌣ꬣ茡猣匣笣㌣⌣鬣ጣ㬣ꬣ茡⌣欣ጣꌣꌣ̣쌡ꬡ묡\ue321",-603773254>(
            1<"JNT",-1830278997,"LO","\uddd6嗗","䬡匡欢笣㌣ꬣ茡猣匣笣㌣⌣鬣ጣ㬣ꬣ茡⌣欣ጣꌣꌣ̣ꌡ錡謡\ue321",-603773253>(this)
         )
         != null) {
         class_243 var2 = 0<"JNT",-659144677,"隀뚀芀銀満슀꺀晿剿乿䙿剿","ᥔᥕ\u1978ᤚᤑᤐᥛᤙᤕᤚᤑᤏᤞᤍᤒᤐᥛᤏᤘᤍ\u191f\u191fᤋᥞᥐᥟᥧ","˥ɕŅﻨ˕̕˥ɕȵƥʕɥŅﻨȵ˅ʕĵĵɵﷸ﵈ﵨ",1350391440>(
            1<"JNT",-1830278997,"Q聒聐LP聕耮聉/(","귗旗\uddd6귕ꗗ藗귗旗嗗췖䗗淗\uddd6귕嗗鷗䗗헖헖㗘헔엔뷔","䬡匡欢笣㌣ꬣ茡猣匣笣㌣⌣鬣ጣ㬣ꬣ茡⌣欣ጣꌣꌣ̣쌡ꬡ묡\ue321",-603773274>(
               1<"JNT",-1830278997,"LO","\uddd6嗗","䬡匡欢笣㌣ꬣ茡猣匣笣㌣⌣鬣ጣ㬣ꬣ茡⌣欣ጣꌣꌣ̣ꌡ錡謡\ue321",-603773273>(this)
            )
         );
         double var3 = 0<"JNT",-1128591645,"纀暀檀芀","ᥔᥠᥕᥠ","̥ʕťʕﻨ˅ʕ˥˵ﻨÕʕŅ̅",1350391431>(
               1<"JNT",-1830278997,"Q聒聐LP聕耮耯耨/","귗旗\uddd6귕ꗗ藗귗旗嗗췖䗗淗\uddd6귕嗗鷗䗗헖헖㗘췔\uddd4헔","䬡匡⬢",-603773244>(var2)
                     * 1<"JNT",-1830278997,"Q聒聐LP聕耮耯耨/","귗旗\uddd6귕ꗗ藗귗旗嗗췖䗗淗\uddd6귕嗗鷗䗗헖헖㗘췔\uddd4헔","䬡匡⬢",-603773237>(var2)
                  + 1<"JNT",-1830278997,"Q聒聐LP聕耮耯耨.","귗旗\uddd6귕ꗗ藗귗旗嗗췖䗗淗\uddd6귕嗗鷗䗗헖헖㗘췔\uddd4헔","䬡匡⬢",-603773238>(var2)
                     * 1<"JNT",-1830278997,"Q聒聐LP聕耮耯耨.","귗旗\uddd6귕ꗗ藗귗旗嗗췖䗗淗\uddd6귕嗗鷗䗗헖헖㗘췔\uddd4헔","䬡匡⬢",-603773239>(var2)
            )
            * 20.0;
         if (var3 > 10.0) {
            int var10000 = (885641044 | -1506415937) ^ -1224871937;

            StringBuilder var10001;
            for (var10001 = (StringBuilder)0<"JNT",896288505,"承蚀骀蚀芀婿","ᥔ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛ\u197fᤐᤞᤕᤚᤓᥧᥕᤂ","̥ʕťʕﻨ˅ʕ˥˵ﻨＸŅƥ̕˥˵¥ŕ̕˅Ʌɕƥ",1350391422>(
                  "￼῾뿾뿾鿾\udff7ῴ뿶忶\udff8忿ῴ\udffe῾\ue020"
               );
               var10000 < (-689549806 * -419330127 ^ -1803978627);
               var10000 += 852970904 & 1232527005 ^ 5655705
            ) {
               char var35 = 0<"JNT",-659144677,"뺀銀Ꚁ檀⚀芀","ᥔ\u1975ᥕ\u196f","̥ʕťʕﻨ˅ʕ˥˵ﻨＸŅƥ̕˥˵¥ŕ̕˅Ʌɕƥ",1350391442>(var10001, var10000);
               char var36 = (char)((((var35 & '\ue000') >> 13 | var35 << 3) + 74 + 58 ^ 138) - 142);
               0<"JNT",-659144677,"纀뚀芀㺀銀Ꚁ檀⚀芀","ᥔ\u1975\u196fᥕᤂ","̥ʕťʕﻨ˅ʕ˥˵ﻨＸŅƥ̕˥˵¥ŕ̕˅Ʌɕƥ",1350391253>(
                  var10001, var10000, (char)((((var35 & '\ue000') >> 13 | var35 << 3) + 74 + 58 ^ 138) - 142)
               );
            }

            String var5 = 0<"JNT",-1128591645,"몀満檀隀Ꚁ芀","ᥔ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛ\u197fᤐᤞᤕᤚᤓᥧᤇ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛ\u197bᤎᤖᤑᤏᤐᥧᥕ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛ\u197fᤐᤞᤕᤚᤓᥧ","̥ʕťʕﻨ˅ʕ˥˵ﻨＸŅƥ̕˥˵",1350391419>(
               0<"JNT",-659144677,"芀満ﹿ芀檀蚀骀躀","ᥔᥕ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛ\u197fᤐᤞᤕᤚᤓᥧ","̥ʕťʕﻨ˅ʕ˥˵ﻨＸŅƥ̕˥˵¥ŕ̕˅Ʌɕƥ",1350391425>(var10001),
               new Object[]{0<"JNT",-1128591645,"窀Ꚁꊀ皀뚀\uee7f몀","ᥔᥠᥕ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛᥠᤛᤡᤎᤘᤑᥧ","̥ʕťʕﻨ˅ʕ˥˵ﻨEŵŕʥ˅ɕ",1350391432>(var3)}
            );
            if (var3 > 18.0) {
               StringBuilder var25 = 0<"JNT",-659144677,"Ꚁ犀犀뚀骀슀","ᥔ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛ\u197bᤎᤖᤑᤏᤐᥧᥕ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛ\u197fᤐᤞᤕᤚᤓ\u196eᤡᤕᤘᤀᤑᤞᥧ","̥ʕťʕﻨ˅ʕ˥˵ﻨＸŅƥ̕˥˵¥ŕ̕˅Ʌɕƥ",1350391429>(
                  (StringBuilder)0<"JNT",896288505,"承蚀骀蚀芀婿","ᥔᥕᤂ","̥ʕťʕﻨ˅ʕ˥˵ﻨＸŅƥ̕˥˵¥ŕ̕˅Ʌɕƥ",1350391426>(), var5
               );
               int var30 = -1238917487 + -1238917487 ^ 1817132322;

               StringBuilder var38;
               for (var38 = (StringBuilder)0<"JNT",896288505,"承蚀骀蚀芀婿","ᥔ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛ\u197fᤐᤞᤕᤚᤓᥧᥕᤂ","̥ʕťʕﻨ˅ʕ˥˵ﻨＸŅƥ̕˥˵¥ŕ̕˅Ʌɕƥ",1350391420>(
                     "\u001e\u001e\u001e\u001e\u001e\u001e\u001e\u001e\u001e\u001e§[Kbow\u001eZow`\u001d"
                  );
                  var30 < ((-1833641403 * (1426174600 - 1062787042) | 22) & -997096361);
                  var30 += (306401375 + -2050127976 | 0) & 1088552961
               ) {
                  0<"JNT",-659144677,"纀뚀芀㺀銀Ꚁ檀⚀芀","ᥔ\u1975\u196fᥕᤂ","̥ʕťʕﻨ˅ʕ˥˵ﻨＸŅƥ̕˥˵¥ŕ̕˅Ʌɕƥ",1350391715>(
                     var38,
                     var30,
                     (char)((0<"JNT",-659144677,"뺀銀Ꚁ檀⚀芀","ᥔ\u1975ᥕ\u196f","̥ʕťʕﻨ˅ʕ˥˵ﻨＸŅƥ̕˥˵¥ŕ̕˅Ʌɕƥ",1350391728>(var38, var30) ^ 7) + 96 - 9 + 121 - 201)
                  );
               }

               var5 = 0<"JNT",-659144677,"芀満ﹿ芀檀蚀骀躀","ᥔᥕ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛ\u197fᤐᤞᤕᤚᤓᥧ","̥ʕťʕﻨ˅ʕ˥˵ﻨＸŅƥ̕˥˵¥ŕ̕˅Ʌɕƥ",1350390552>(
                  0<"JNT",-659144677,"Ꚁ犀犀뚀骀슀","ᥔ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛ\u197fᤐᤞᤕᤚᤓᥧᥕ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛ\u197fᤐᤞᤕᤚᤓ\u196eᤡᤕᤘᤀᤑᤞᥧ","̥ʕťʕﻨ˅ʕ˥˵ﻨＸŅƥ̕˥˵¥ŕ̕˅Ʌɕƥ",1350390481>(
                     var25, 0<"JNT",-659144677,"芀満ﹿ芀檀蚀骀躀","ᥔᥕ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛ\u197fᤐᤞᤕᤚᤓᥧ","̥ʕťʕﻨ˅ʕ˥˵ﻨＸŅƥ̕˥˵¥ŕ̕˅Ʌɕƥ",1350390478>(var38)
                  )
               );
            }

            0<"JNT",-659144677,"隀뚀芀銀満슀꺀乿繿癿繿","ᥔ\u1978ᤚᤑᤐᥛᤙᤕᤚᤑᤏᤞᤍᤒᤐᥛᤏᤘᤍ\u191f\u191fᤋᥞᥡᥢᥝᥧᤆᥕᤂ","˥ɕŅﻨ˕̕˥ɕȵƥʕɥŅﻨȵ˅ʕĵĵɵﷸ﵈ﵨ",1350391435>(
               1<"JNT",-1830278997,"Q聒聐LP聕耮聉/(","귗旗\uddd6귕ꗗ藗귗旗嗗췖䗗淗\uddd6귕嗗鷗䗗헖헖㗘헔엔뷔","䬡匡欢笣㌣ꬣ茡猣匣笣㌣⌣鬣ጣ㬣ꬣ茡⌣欣ጣꌣꌣ̣쌡ꬡ묡\ue321",-603773218>(
                  1<"JNT",-1830278997,"LO","\uddd6嗗","䬡匡欢笣㌣ꬣ茡猣匣笣㌣⌣鬣ጣ㬣ꬣ茡⌣欣ጣꌣꌣ̣ꌡ錡謡\ue321",-603773217>(this)
               ),
               0<"JNT",-1128591645,"隀뚀芀銀満슀꺀艿繿艿乿牿","ᥔ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛ\u197fᤐᤞᤕᤚᤓᥧᥕ\u1978ᤚᤑᤐᥛᤙᤕᤚᤑᤏᤞᤍᤒᤐᥛᤏᤘᤍ\u191f\u191fᤋᥡᥞᥡᥜᥧ","˥ɕŅﻨ˕̕˥ɕȵƥʕɥŅﻨȵ˅ʕĵĵɵﶨﵘﵨﶘ",1350391256>(
                  var5
               ),
               true
            );
         }

         var18 = 184891975;

         while (true) {
            switch ((var18 + 318984174 + 1152772657 ^ 1499407584 ^ 1421233127) - 1723269004 - 1626487867) {
               case -1481777254:
                  if (0<"JNT",-659144677,"蚀纀㚀隀犀芀䚀","ᥔᥕᤆ","̥ʕťʕﻨŕŅ̕˅ﻨȵŵ˥ȵŕƥƥɕ˥Ņﻨ5ŵ˥ȵŕƥƥɕ˥Ņąʕĵ̅Õʕƅ",1350391255>(
                     1<"JNT",-1830278997,"R聈","\uddd6嗗","䬡匡欢嬣ጣ묣ጣ茡댣ꬣ匣欣茡⌣茣笣⌣댣鬣鬣㌣笣ꬣ茡⌢茣笣⌣댣鬣鬣㌣笣ꬣ䬢ጣꌣ䬣猢ጣ謣\ue321",-603773223>(this)
                  )) {
                     return;
                  }

                  var18 = (-22844012 >> -22844012 | 1073744961) & -1073714061;
                  break;
               case 78871830:
                  long var19 = 0<"JNT",-1128591645,"뺀皀檀檀뚀骀芀ʀ蚀隀뚀 蚀ꊀꊀ蚀纀","ᥔᥕ\u1976","̥ʕťʕﻨ˅ʕ˥˵ﻨＸȕĵŅɕ˕",1350391263>();
                  Iterator var7 = 0<"JNT",1003128696,"蚀芀뚀檀Ꚁ芀満檀","ᥔᥕ\u1978ᤖᤍᤢᤍᥛᤡᤐᤕᤘᥛ\u1975ᤐᤑᤞᤍᤐᤛᤞᥧ","̥ʕťʕﻨŕŅ̕˅ﻨＸɕŅ",1350391264>(
                     0<"JNT",-659144677,"뚀骀芀檀䚀ﹿ뚀芀","ᥔᥕ\u1978ᤖᤍᤢᤍᥛᤡᤐᤕᤘᥛ\u197fᤑᤐᥧ","̥ʕťʕﻨŕŅ̕˅ﻨȵŵ˥ȵŕƥƥɕ˥Ņﻨ5ŵ˥ȵŕƥƥɕ˥Ņąʕĵ̅Õʕƅ",1350391257>(
                        1<"JNT",-1830278997,"R聈","\uddd6嗗","䬡匡欢嬣ጣ묣ጣ茡댣ꬣ匣欣茡⌣茣笣⌣댣鬣鬣㌣笣ꬣ茡⌢茣笣⌣댣鬣鬣㌣笣ꬣ䬢ጣꌣ䬣猢ጣ謣\ue321",-603773257>(this)
                     )
                  );

                  label97:
                  while (true) {
                     var18 = (-1943619943 - -605774463 | 1335963713) & -810288685;

                     while (true) {
                        switch (var18 - 86879214 + 1481527154 + 1061601304 - 864146613 - 1236918642 - 141136060) {
                           case -597338614:
                              if (0<"JNT",1003128696,"銀Ꚁ纀᪀뚀劀芀","ᥔᥕᤆ","̥ʕťʕﻨŕŅ̕˅ﻨĕŅɕƥʕŅŵƥ",1350390549>(var7)) {
                                 Entry var8 = (Entry)0<"JNT",1003128696,"骀뚀劀芀","ᥔᥕ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛ\u197bᤎᤖᤑᤏᤐᥧ","̥ʕťʕﻨŕŅ̕˅ﻨĕŅɕƥʕŅŵƥ",1350390476>(var7);
                                 if (var19
                                       - 0<"JNT",-659144677,"ꊀ満骀躀奔Ꚁꊀ皀뚀","ᥔᥕ\u1976","̥ʕťʕﻨ˅ʕ˥˵ﻨÅŵ˥˵",1350390502>(
                                          (Long)0<"JNT",1003128696,"躀뚀芀奔Ꚁꊀ皀뚀","ᥔᥕ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛ\u197bᤎᤖᤑᤏᤐᥧ","̥ʕťʕﻨŕŅ̕˅ﻨÕʕƅ﹈U˥Ņƥȕ",1350390511>(var8)
                                       )
                                    >= 1000L) {
                                    0<"JNT",1003128696,"檀뚀隀満窀뚀","ᥔᥕᤂ","̥ʕťʕﻨŕŅ̕˅ﻨĕŅɕƥʕŅŵƥ",1350390505>(var7);
                                    class_1923 var9 = (class_1923)0<"JNT",1003128696,"躀뚀芀Ẁ뚀䚀","ᥔᥕ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛ\u197bᤎᤖᤑᤏᤐᥧ","̥ʕťʕﻨŕŅ̕˅ﻨÕʕƅ﹈U˥Ņƥȕ",1350390512>(
                                       var8
                                    );
                                    if (0<"JNT",1003128696,"Ꚁ슀슀","ᥔ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛ\u197bᤎᤖᤑᤏᤐᥧᥕᤆ","̥ʕťʕﻨŕŅ̕˅ﻨＸɕŅ",1350390506>(
                                       1<"JNT",-1830278997,"NIR","\uddd6嗗","䬡匡欢嬣ጣ묣ጣ茡댣ꬣ匣欣茡ꌢ㌣ꬣ\ue321",-603786844>(this), var9
                                    )) {
                                       int var10 = 0<"JNT",-659144677,"骀뚀劀芀ڀ骀芀","ᥔ\u1975\u1975ᥕ\u1975","̥ʕťʕﻨŕŅ̕˅ﻨȵŵ˥ȵŕƥƥɕ˥Ņﻨｈ̅ƥɕʕɅÅŵȵʕ˅ﾥʕ˥Ʌŵ˕",1350390500>(
                                          0<"JNT",-1128591645,"뺀皀檀檀뚀骀芀","ᥔᥕ\u1978ᤖᤍᤢᤍᥛᤡᤐᤕᤘᥛᤏᤛᤚᤏᤡᤞᤞᤑᤚᤐᥛᥰᤔᤞᤑᤍᤀ\u1978ᤛᤏᤍᤘ\u197eᤍᤚᤀᤛᤙᥧ","̥ʕťʕﻨŕŅ̕˅ﻨȵŵ˥ȵŕƥƥɕ˥Ņﻨｈ̅ƥɕʕɅÅŵȵʕ˅ﾥʕ˥Ʌŵ˕",1350390509>(),
                                          -1,
                                          2
                                       );
                                       int var11 = 0<"JNT",-659144677,"骀뚀劀芀ڀ骀芀","ᥔ\u1975\u1975ᥕ\u1975","̥ʕťʕﻨŕŅ̕˅ﻨȵŵ˥ȵŕƥƥɕ˥Ņﻨｈ̅ƥɕʕɅÅŵȵʕ˅ﾥʕ˥Ʌŵ˕",1350390494>(
                                          0<"JNT",-1128591645,"뺀皀檀檀뚀骀芀","ᥔᥕ\u1978ᤖᤍᤢᤍᥛᤡᤐᤕᤘᥛᤏᤛᤚᤏᤡᤞᤞᤑᤚᤐᥛᥰᤔᤞᤑᤍᤀ\u1978ᤛᤏᤍᤘ\u197eᤍᤚᤀᤛᤙᥧ","̥ʕťʕﻨŕŅ̕˅ﻨȵŵ˥ȵŕƥƥɕ˥Ņﻨｈ̅ƥɕʕɅÅŵȵʕ˅ﾥʕ˥Ʌŵ˕",1350390503>(),
                                          -1,
                                          2
                                       );
                                       class_1923 var12 = (class_1923)0<"JNT",896288505,"承蚀骀蚀芀婿","ᥔ\u1975\u1975ᥕᤂ","˥ɕŅﻨ˕̕˥ɕȵƥʕɥŅﻨȵ˅ʕĵĵɵﶘ︘ﶨﴸ",1350390491>(
                                          1<"JNT",-1830278997,"Q聒聐LP聕聊耮J耮","귗旗\uddd6귕ꗗ藗귗旗嗗췖䗗淗\uddd6귕嗗鷗䗗헖헖㗘엔ו췔헔","䬡匡匢",-603773266>(var9) + var10,
                                          1<"JNT",-1830278997,"Q聒聐LP聕聊耮J.","귗旗\uddd6귕ꗗ藗귗旗嗗췖䗗淗\uddd6귕嗗鷗䗗헖헖㗘엔ו췔헔","䬡匡匢",-603773267>(var9) + var11
                                       );
                                       0<"JNT",1003128696,"Ꚁ슀슀","ᥔ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛ\u197bᤎᤖᤑᤏᤐᥧᥕᤆ","̥ʕťʕﻨŕŅ̕˅ﻨＸɕŅ",1350390501>(
                                          1<"JNT",-1830278997,"聑L","\uddd6嗗","䬡匡欢嬣ጣ묣ጣ茡댣ꬣ匣欣茡ꌢ㌣ꬣ\ue321",-603773261>(this), var12
                                       );
                                       int var13 = 0<"JNT",-659144677,"亀銀纀","ᥔ\u1978ᤚᤑᤐᥛᤙᤕᤚᤑᤏᤞᤍᤒᤐᥛᤏᤘᤍ\u191f\u191fᤋᥝᥥᥞᥟᥧᥕ\u1975","Ņȵ",1350390492>(this, var12);
                                       int var14 = 0<"JNT",-659144677,"皀뺀誀","ᥔ\u1978ᤚᤑᤐᥛᤙᤕᤚᤑᤏᤞᤍᤒᤐᥛᤏᤘᤍ\u191f\u191fᤋᥝᥥᥞᥟᥧᥕ\u1975","Ņȵ",1350390463>(this, var12);
                                       int var26 = (344699529 >> -417095199 | 0) & -1599069023;

                                       StringBuilder var32;
                                       for (var32 = (StringBuilder)0<"JNT",896288505,"承蚀骀蚀芀婿","ᥔ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛ\u197fᤐᤞᤕᤚᤓᥧᥕᤂ","̥ʕťʕﻨ˅ʕ˥˵ﻨＸŅƥ̕˥˵¥ŕ̕˅Ʌɕƥ",1350390454>(
                                             "\u0004ĐÈè¬ﺇﾟÀĨðØﺇﾷÈð¤¬Đ"
                                          );
                                          var26 < ((-345872039 * 1161362603 | 18) & 1426587934);
                                          var26 += (-164776239 + 213554153 | 1) & 1762104645
                                       ) {
                                          char var41 = 0<"JNT",-659144677,"뺀銀Ꚁ檀⚀芀","ᥔ\u1975ᥕ\u196f","̥ʕťʕﻨ˅ʕ˥˵ﻨＸŅƥ̕˥˵¥ŕ̕˅Ʌɕƥ",1350391436>(var32, var26);
                                          int var54 = (var41 & '￼') >> 2;
                                          int var42 = ((var41 & '￼') >> 2 | var41 << 14) - 228 + 182;
                                          int var55 = (((var41 & '￼') >> 2 | var41 << 14) - 228 + 182 & 65534) >> 1;
                                          var41 = (char)(
                                             (((var54 | var41 << 14) - 228 + 182 & 65534) >> 1 | ((var41 & '￼') >> 2 | var41 << 14) - 228 + 182 << 15) + 103
                                          );
                                          0<"JNT",-659144677,"纀뚀芀㺀銀Ꚁ檀⚀芀","ᥔ\u1975\u196fᥕᤂ","̥ʕťʕﻨ˅ʕ˥˵ﻨＸŅƥ̕˥˵¥ŕ̕˅Ʌɕƥ",1350391727>(
                                             var32, var26, (char)((var55 | var42 << 15) + 103)
                                          );
                                       }

                                       String var28 = 0<"JNT",-659144677,"芀満ﹿ芀檀蚀骀躀","ᥔᥕ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛ\u197fᤐᤞᤕᤚᤓᥧ","̥ʕťʕﻨ˅ʕ˥˵ﻨＸŅƥ̕˥˵¥ŕ̕˅Ʌɕƥ",1350391251>(
                                          var32
                                       );
                                       int var16 = var13;
                                       var32 = (StringBuilder)0<"JNT",896288505,"承蚀骀蚀芀婿","ᥔᥕᤂ","̥ʕťʕﻨ˅ʕ˥˵ﻨＸŅƥ̕˥˵¥ŕ̕˅Ʌɕƥ",1350391258>();
                                       int var45 = (1484484051 | 1979069652 | 0) & 512;
                                       StringBuilder var51 = (StringBuilder)0<"JNT",896288505,"承蚀骀蚀芀婿","ᥔ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛ\u197fᤐᤞᤕᤚᤓᥧᥕᤂ","̥ʕťʕﻨ˅ʕ˥˵ﻨＸŅƥ̕˥˵¥ŕ̕˅Ʌɕƥ",1350391453>(
                                          "￩ￏ︡"
                                       );

                                       label94:
                                       while (true) {
                                          var18 = -87308755 ^ -934078283;

                                          while (true) {
                                             label89: {
                                                StringBuilder var46;
                                                switch ((var18 - 1204970166 + 315655616 ^ 1544007813) + 1017563564 + 2046272581 + 1045297153) {
                                                   case -1770186983:
                                                      var46 = var51;
                                                      if (var45 < (2075249281 << 2075249281 ^ -144468735)) {
                                                         int var62 = (
                                                                  0<"JNT",-659144677,"뺀銀Ꚁ檀⚀芀","ᥔ\u1975ᥕ\u196f","̥ʕťʕﻨ˅ʕ˥˵ﻨＸŅƥ̕˥˵¥ŕ̕˅Ʌɕƥ",1350390475>(
                                                                        var51, var45
                                                                     )
                                                                     ^ 251
                                                               )
                                                               + 67
                                                            ^ 164;
                                                         char var63 = (char)(((var62 & 65535) >> 0 | var62 << 16) + 103);
                                                         0<"JNT",-659144677,"纀뚀芀㺀銀Ꚁ檀⚀芀","ᥔ\u1975\u196fᥕᤂ","̥ʕťʕﻨ˅ʕ˥˵ﻨＸŅƥ̕˥˵¥ŕ̕˅Ʌɕƥ",1350390482>(
                                                            var51, var45, (char)(((var62 & 65535) >> 0 | var62 << 16) + 103)
                                                         );
                                                         var45 += (-825354886 << -1221163147 | 1) & 9778929;
                                                         continue label94;
                                                      }

                                                      var18 = -202003510 ^ 1446263614 ^ -668451214;
                                                      break;
                                                   case -750794553:
                                                   default:
                                                      var46 = var51;
                                                      if (var45 < (-1644820190 >> -1285992130 ^ -6)) {
                                                         int var57 = 0<"JNT",-659144677,"뺀銀Ꚁ檀⚀芀","ᥔ\u1975ᥕ\u196f","̥ʕťʕﻨ˅ʕ˥˵ﻨＸŅƥ̕˥˵¥ŕ̕˅Ʌɕƥ",1350391718>(
                                                                  var51, var45
                                                               )
                                                               - 224
                                                            ^ 45;
                                                         int var10006 = (var57 & 65472) >> 6;
                                                         int var58 = (var57 & 65472) >> 6 | var57 << 10;
                                                         int var67 = (((var57 & 65472) >> 6 | var57 << 10) & 32768) >> 15;
                                                         char var59 = (char)(
                                                            (((var10006 | var57 << 10) & 32768) >> 15 | ((var57 & 65472) >> 6 | var57 << 10) << 1) - 224
                                                         );
                                                         0<"JNT",-659144677,"纀뚀芀㺀銀Ꚁ檀⚀芀","ᥔ\u1975\u196fᥕᤂ","̥ʕťʕﻨ˅ʕ˥˵ﻨＸŅƥ̕˥˵¥ŕ̕˅Ʌɕƥ",1350391721>(
                                                            var51, var45, (char)((var67 | var58 << 1) - 224)
                                                         );
                                                         var45 += (1542597343 + 741939505 | 1) & 622105447;
                                                         break label89;
                                                      }

                                                      var18 = -1954191697 & -1954191697 ^ 13411768;
                                                }

                                                switch (((var18 ^ 535451320 ^ 517940688) + 346688276 ^ 1787830030) + 137209797 - 421393883) {
                                                   case -456763769:
                                                   default:
                                                      0<"JNT",-1128591645,"ꊀ䚀蚀","ᥔ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛ\u197fᤐᤞᤕᤚᤓᥧ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛ\u197fᤐᤞᤕᤚᤓᥧᥕᤂ","ɥƕȕ",1350390508>(
                                                         var28,
                                                         0<"JNT",-659144677,"芀満ﹿ芀檀蚀骀躀","ᥔᥕ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛ\u197fᤐᤞᤕᤚᤓᥧ","̥ʕťʕﻨ˅ʕ˥˵ﻨＸŅƥ̕˥˵¥ŕ̕˅Ʌɕƥ",1350390453>(
                                                            0<"JNT",-659144677,"Ꚁ犀犀뚀骀슀","ᥔ\u1975ᥕ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛ\u197fᤐᤞᤕᤚᤓ\u196eᤡᤕᤘᤀᤑᤞᥧ","̥ʕťʕﻨ˅ʕ˥˵ﻨＸŅƥ̕˥˵¥ŕ̕˅Ʌɕƥ",1350390514>(
                                                               0<"JNT",-659144677,"Ꚁ犀犀뚀骀슀","ᥔ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛ\u197fᤐᤞᤕᤚᤓᥧᥕ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛ\u197fᤐᤞᤕᤚᤓ\u196eᤡᤕᤘᤀᤑᤞᥧ","̥ʕťʕﻨ˅ʕ˥˵ﻨＸŅƥ̕˥˵¥ŕ̕˅Ʌɕƥ",1350390507>(
                                                                  var32,
                                                                  0<"JNT",-659144677,"芀満ﹿ芀檀蚀骀躀","ᥔᥕ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛ\u197fᤐᤞᤕᤚᤓᥧ","̥ʕťʕﻨ˅ʕ˥˵ﻨＸŅƥ̕˥˵¥ŕ̕˅Ʌɕƥ",1350390456>(
                                                                     var46
                                                                  )
                                                               ),
                                                               var14
                                                            )
                                                         )
                                                      );
                                                      0<"JNT",-659144677,"銀隀暀","ᥔ\u1978ᤚᤑᤐᥛᤙᤕᤚᤑᤏᤞᤍᤒᤐᥛᤏᤘᤍ\u191f\u191fᤋᥝᥥᥞᥟᥧᥕᤂ","Ņȵ",1350391439>(this, var9);
                                                      continue label97;
                                                   case -366565386:
                                                      var32 = 0<"JNT",-659144677,"Ꚁ犀犀뚀骀슀","ᥔ\u1975ᥕ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛ\u197fᤐᤞᤕᤚᤓ\u196eᤡᤕᤘᤀᤑᤞᥧ","̥ʕťʕﻨ˅ʕ˥˵ﻨＸŅƥ̕˥˵¥ŕ̕˅Ʌɕƥ",1350390510>(
                                                         0<"JNT",-659144677,"Ꚁ犀犀뚀骀슀","ᥔ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛ\u197fᤐᤞᤕᤚᤓᥧᥕ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛ\u197fᤐᤞᤕᤚᤓ\u196eᤡᤕᤘᤀᤑᤞᥧ","̥ʕťʕﻨ˅ʕ˥˵ﻨＸŅƥ̕˥˵¥ŕ̕˅Ʌɕƥ",1350390455>(
                                                            var32,
                                                            0<"JNT",-659144677,"芀満ﹿ芀檀蚀骀躀","ᥔᥕ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛ\u197fᤐᤞᤕᤚᤓᥧ","̥ʕťʕﻨ˅ʕ˥˵ﻨＸŅƥ̕˥˵¥ŕ̕˅Ʌɕƥ",1350390452>(
                                                               var46
                                                            )
                                                         ),
                                                         var16
                                                      );
                                                      var45 = (2085103590 * 2085103590 | 0) & 134748442;
                                                      var51 = (StringBuilder)0<"JNT",896288505,"承蚀骀蚀芀婿","ᥔ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛ\u197fᤐᤞᤕᤚᤓᥧᥕᤂ","̥ʕťʕﻨ˅ʕ˥˵ﻨＸŅƥ̕˥˵¥ŕ̕˅Ʌɕƥ",1350390513>(
                                                         "ℍ⡍\u244dℍ"
                                                      );
                                                }
                                             }

                                             var18 = -557540246 >> -1528592509 ^ 1284390091;
                                          }
                                       }
                                    }
                                 }
                                 continue label97;
                              }

                              var18 = (1940770463 | 341123286 | 403376416) & 1561274666;
                              break;
                           case 1775322595:
                           default:
                              return;
                        }
                     }
                  }
               case 1386712510:
               default:
                  if (0<"JNT",-659144677,"隀뚀芀銀満슀꺀橿繿繿晿剿","ᥔᥕᥠ","˥ɕŅﻨ˕̕˥ɕȵƥʕɥŅﻨȵ˅ʕĵĵɵﷸ﵈ﵨ",1350390451>(
                        1<"JNT",-1830278997,"Q聒聐LP聕耮聉/(","귗旗\uddd6귕ꗗ藗귗旗嗗췖䗗淗\uddd6귕嗗鷗䗗헖헖㗘헔엔뷔","䬡匡欢笣㌣ꬣ茡猣匣笣㌣⌣鬣ጣ㬣ꬣ茡⌣欣ጣꌣꌣ̣쌡ꬡ묡\ue321",-603773163>(
                           1<"JNT",-1830278997,"LO","\uddd6嗗","䬡匡欢笣㌣ꬣ茡猣匣笣㌣⌣鬣ጣ㬣ꬣ茡⌣欣ጣꌣꌣ̣ꌡ錡謡\ue321",-603773162>(this)
                        )
                     )
                     <= 30.0) {
                     return;
                  }

                  var18 = 1038145562 + 126724661 ^ 747773940;
            }
         }
      }
   }

   // $VF: renamed from: jlm (Class_381) void
   @Class_21
   public void method_1617(Class_381 var1) {
      int var17 = -1956693020;
      if (1<"JNT",-1830278997,"Q聒聐LP聕耮)J聉","귗旗\uddd6귕ꗗ藗귗旗嗗췖䗗淗\uddd6귕嗗鷗䗗헖헖㗘헔엔뷔","䬡匡欢笣㌣ꬣ茡猣匣笣㌣⌣鬣ጣ㬣ꬣ茡⌣欣ጣꌣꌣ̣묡ꌡ쬡\ue321",-603772841>(
               1<"JNT",-1830278997,"LO","\uddd6嗗","䬡匡欢笣㌣ꬣ茡猣匣笣㌣⌣鬣ጣ㬣ꬣ茡⌣欣ጣꌣꌣ̣ꌡ錡謡\ue321",-603773200>(this)
            )
            != null
         && !0<"JNT",1003128696,"蚀纀㚀隀犀芀䚀","ᥔᥕᤆ","̥ʕťʕﻨŕŅ̕˅ﻨＸɕŅ",1350391680>(1<"JNT",-1830278997,"聑L","\uddd6嗗","䬡匡欢嬣ጣ묣ጣ茡댣ꬣ匣欣茡ꌢ㌣ꬣ\ue321",-603772842>(this))) {
         var17 = (-209654127 - -209654127 | -991470391) & -453018115;
      } else {
         var17 = (-1887148302 * (-1887148302 >> (-1887148302 >>> -1887148302)) | -1139189547) & -1130800939;
      }

      switch (((var17 ^ 1468612883 ^ 2038412072) - 195964031 ^ 1644714659 ^ 855942194) - 72217945) {
         case -1960736887:
         default:
            Class_262 var2 = (Class_262)0<"JNT",896288505,"承蚀骀蚀芀婿","ᥔ\u1975\u1975\u1975\u1975ᥕᤂ","ƅǵ",1350391722>(0, 255, 0, 40);
            Class_262 var3 = (Class_262)0<"JNT",896288505,"承蚀骀蚀芀婿","ᥔ\u1975\u1975\u1975\u1975ᥕᤂ","ƅǵ",1350391725>(0, 255, 0, 180);
            Class_262 var4 = (Class_262)0<"JNT",896288505,"承蚀骀蚀芀婿","ᥔ\u1975\u1975\u1975\u1975ᥕᤂ","ƅǵ",1350391716>(0, 255, 0, 200);
            int var5 = 0<"JNT",-659144677,"隀뚀芀銀満슀꺀繿晿艿乿乿","ᥔᥕ\u1975","˥ɕŅﻨ˕̕˥ɕȵƥʕɥŅﻨȵ˅ʕĵĵɵﷸ﵈ﵨ",1350391713>(
                  1<"JNT",-1830278997,"Q聒聐LP聕耮聉/(","귗旗\uddd6귕ꗗ藗귗旗嗗췖䗗淗\uddd6귕嗗鷗䗗헖헖㗘헔엔뷔","䬡匡欢笣㌣ꬣ茡猣匣笣㌣⌣鬣ጣ㬣ꬣ茡⌣欣ጣꌣꌣ̣쌡ꬡ묡\ue321",-603773201>(
                     1<"JNT",-1830278997,"LO","\uddd6嗗","䬡匡欢笣㌣ꬣ茡猣匣笣㌣⌣鬣ጣ㬣ꬣ茡⌣欣ጣꌣꌣ̣ꌡ錡謡\ue321",-603773208>(this)
                  )
               )
               >> 4;
            int var6 = 0<"JNT",-659144677,"隀뚀芀銀満슀꺀繿晿艿乿䙿","ᥔᥕ\u1975","˥ɕŅﻨ˕̕˥ɕȵƥʕɥŅﻨȵ˅ʕĵĵɵﷸ﵈ﵨ",1350391714>(
                  1<"JNT",-1830278997,"Q聒聐LP聕耮聉/(","귗旗\uddd6귕ꗗ藗귗旗嗗췖䗗淗\uddd6귕嗗鷗䗗헖헖㗘헔엔뷔","䬡匡欢笣㌣ꬣ茡猣匣笣㌣⌣鬣ጣ㬣ꬣ茡⌣欣ጣꌣꌣ̣쌡ꬡ묡\ue321",-603773204>(
                     1<"JNT",-1830278997,"LO","\uddd6嗗","䬡匡欢笣㌣ꬣ茡猣匣笣㌣⌣鬣ጣ㬣ꬣ茡⌣欣ጣꌣꌣ̣ꌡ錡謡\ue321",-603773203>(this)
                  )
               )
               >> 4;
            Iterator var7 = 0<"JNT",1003128696,"蚀芀뚀檀Ꚁ芀満檀","ᥔᥕ\u1978ᤖᤍᤢᤍᥛᤡᤐᤕᤘᥛ\u1975ᤐᤑᤞᤍᤐᤛᤞᥧ","̥ʕťʕﻨŕŅ̕˅ﻨＸɕŅ",1350391708>(
               1<"JNT",-1830278997,"聑L","\uddd6嗗","䬡匡欢嬣ጣ묣ጣ茡댣ꬣ匣欣茡ꌢ㌣ꬣ\ue321",-603773198>(this)
            );

            while (true) {
               var17 = -1295941526;

               while (true) {
                  switch ((var17 + 1565033853 ^ 826369884) + 247491781 - 586993211 - 1820258806 ^ 1245869433) {
                     case -488072161:
                     default:
                        return;
                     case -355304906:
                  }

                  if (0<"JNT",1003128696,"銀Ꚁ纀᪀뚀劀芀","ᥔᥕᤆ","̥ʕťʕﻨŕŅ̕˅ﻨĕŅɕƥʕŅŵƥ",1350391667>(var7)) {
                     class_1923 var8 = (class_1923)0<"JNT",1003128696,"骀뚀劀芀","ᥔᥕ\u1978ᤖᤍᤢᤍᥛᤘᤍᤚᤓᥛ\u197bᤎᤖᤑᤏᤐᥧ","̥ʕťʕﻨŕŅ̕˅ﻨĕŅɕƥʕŅŵƥ",1350391674>(var7);
                     if (0<"JNT",-1128591645,"Ꚁꪀ纀","ᥔ\u1975ᥕ\u1975","̥ʕťʕﻨ˅ʕ˥˵ﻨÕʕŅ̅",1350391668>(
                              1<"JNT",-1830278997,"Q聒聐LP聕聊耮J耮","귗旗\uddd6귕ꗗ藗귗旗嗗췖䗗淗\uddd6귕嗗鷗䗗헖헖㗘엔ו췔헔","䬡匡匢",-603773190>(var8) - var5
                           )
                           <= 50
                        && 0<"JNT",-1128591645,"Ꚁꪀ纀","ᥔ\u1975ᥕ\u1975","̥ʕťʕﻨ˅ʕ˥˵ﻨÕʕŅ̅",1350391726>(
                              1<"JNT",-1830278997,"Q聒聐LP聕聊耮J.","귗旗\uddd6귕ꗗ藗귗旗嗗췖䗗淗\uddd6귕嗗鷗䗗헖헖㗘엔ו췔헔","䬡匡匢",-603773192>(var8) - var6
                           )
                           <= 50) {
                        double var9 = (double)((1<"JNT",-1830278997,"Q聒聐LP聕聊耮J耮","귗旗\uddd6귕ꗗ藗귗旗嗗췖䗗淗\uddd6귕嗗鷗䗗헖헖㗘엔ו췔헔","䬡匡匢",-603773186>(var8) - 1) * 16);
                        double var11 = (double)((1<"JNT",-1830278997,"Q聒聐LP聕聊耮J.","귗旗\uddd6귕ꗗ藗귗旗嗗췖䗗淗\uddd6귕嗗鷗䗗헖헖㗘엔ו췔헔","䬡匡匢",-603773187>(var8) - 1) * 16);
                        double var13 = var9 + 48.0;
                        double var15 = var11 + 48.0;
                        0<"JNT",-659144677,"窀暀満","ᥔᥠᥠᥠᥠᥠᥠ\u1978ᤜᤣᥧ\u1978ᤜᤣᥧ\u1978ᤐᤐᥧ\u1975ᥕᤂ","˵ƅȥ",1350391669>(
                           1<"JNT",-1830278997,"êR聒","\uf5d6ח","䬡匡欢䌣謣\udb23\ue321",-603773188>(var1),
                           var9,
                           63.0,
                           var11,
                           var13,
                           63.1,
                           var15,
                           var2,
                           var3,
                           1<"JNT",1022107669,"职聓聍","\uddd6\uddd6","䬡匡欢ꬣꬣ\ue321",-603773181>(),
                           0
                        );
                        if (0<"JNT",-659144677,"Ꚁ劀","ᥔᥕᤆ","˵ƥ",1350391631>(1<"JNT",-1830278997,"ëI","\uddd6嗗","䬡匡欢䌣鬣\ue321",-603773183>(this))
                           && 1<"JNT",1022107669,"聍聐聑","痗뷖\u0dd7","䬡匡欢笣㌣ꬣ茡猣匣笣㌣⌣鬣ጣ㬣ꬣ茡⌣欣ጣꌣꌣ̣鬡ꬡꌡ\ue321",-603773209>() != null) {
                           0<"JNT",-659144677,"Ꚁ뚀骀","ᥔᥠᥠᥠᥠᥠᥠ\u1978ᤜᤣᥧᥕᤂ","˵ƅȥ",1350391624>(
                              1<"JNT",-1830278997,"êR聒","\uf5d6ח","䬡匡欢䌣謣\udb23\ue321",-603773210>(var1),
                              1<"JNT",-1830278997,"Q聒聐LP聕耮耯耨/","귗旗\uddd6귕ꗗ藗귗旗嗗췖䗗淗\uddd6귕嗗鷗䗗헖헖㗘췔\uddd4헔","䬡匡⬢",-603773180>(
                                 1<"JNT",1022107669,"聍聐聑","痗뷖\u0dd7","䬡匡欢笣㌣ꬣ茡猣匣笣㌣⌣鬣ጣ㬣ꬣ茡⌣欣ጣꌣꌣ̣鬡ꬡꌡ\ue321",-603773211>()
                              ),
                              1<"JNT",-1830278997,"Q聒聐LP聕耮耯耨耮","귗旗\uddd6귕ꗗ藗귗旗嗗췖䗗淗\uddd6귕嗗鷗䗗헖헖㗘췔\uddd4헔","䬡匡⬢",-603773174>(
                                 1<"JNT",1022107669,"聍聐聑","痗뷖\u0dd7","䬡匡欢笣㌣ꬣ茡猣匣笣㌣⌣鬣ጣ㬣ꬣ茡⌣欣ጣꌣꌣ̣鬡ꬡꌡ\ue321",-603773173>()
                              ),
                              1<"JNT",-1830278997,"Q聒聐LP聕耮耯耨.","귗旗\uddd6귕ꗗ藗귗旗嗗췖䗗淗\uddd6귕嗗鷗䗗헖헖㗘췔\uddd4헔","䬡匡⬢",-603773176>(
                                 1<"JNT",1022107669,"聍聐聑","痗뷖\u0dd7","䬡匡欢笣㌣ꬣ茡猣匣笣㌣⌣鬣ጣ㬣ꬣ茡⌣欣ጣꌣꌣ̣鬡ꬡꌡ\ue321",-603773175>()
                              ),
                              (double)0<"JNT",-659144677,"亀銀纀","ᥔ\u1978ᤚᤑᤐᥛᤙᤕᤚᤑᤏᤞᤍᤒᤐᥛᤏᤘᤍ\u191f\u191fᤋᥝᥥᥞᥟᥧᥕ\u1975","Ņȵ",1350391614>(this, var8),
                              63.05,
                              (double)0<"JNT",-659144677,"皀뺀誀","ᥔ\u1978ᤚᤑᤐᥛᤙᤕᤚᤑᤏᤞᤍᤒᤐᥛᤏᤘᤍ\u191f\u191fᤋᥝᥥᥞᥟᥧᥕ\u1975","Ņȵ",1350391617>(this, var8),
                              var4
                           );
                        }
                     }
                     break;
                  }

                  var17 = -1159801327;
               }
            }
         case -771781723:
      }
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1413(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 - 1257525427 ^ 1037789544 ^ 894070989) - 390029566 - 674334484 - 77931384 ^ 947590554) + 1851617697 ^ 1864550261;
      MethodHandle var10000 = field_1840[((var10 - 1257525427 ^ 1037789544 ^ 894070989) - 390029566 - 674334484 - 77931384 ^ 947590554) + 1851617697
         ^ 1864550261
         ^ 821342211];
      if (field_1840[var10001 ^ 821342211] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = 1106296810 ^ -1772036411 >> 1001726011 ^ -1106296808; var23 < var13.length(); var23 += -1111120604 - 1329180761 ^ 1854665930) {
            char var42 = var13.charAt(var23);
            char var47 = (char)(
               (
                        (
                                 (
                                          (
                                                (
                                                         (
                                                               ((((var42 & 'ﰀ') >> 10 | var42 << 6) & 49152) >> 14 | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 2)
                                                                     + 188
                                                                  ^ 175
                                                                  ^ 192
                                                                  ^ 5
                                                            )
                                                            & 64512
                                                      )
                                                      >> 10
                                                   | (
                                                         ((((var42 & 'ﰀ') >> 10 | var42 << 6) & 49152) >> 14 | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 2) + 188
                                                            ^ 175
                                                            ^ 192
                                                            ^ 5
                                                      )
                                                      << 6
                                             )
                                             & 65504
                                       )
                                       >> 5
                                    | (
                                          (
                                                   (
                                                         ((((var42 & 'ﰀ') >> 10 | var42 << 6) & 49152) >> 14 | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 2) + 188
                                                            ^ 175
                                                            ^ 192
                                                            ^ 5
                                                      )
                                                      & 64512
                                                )
                                                >> 10
                                             | (
                                                   ((((var42 & 'ﰀ') >> 10 | var42 << 6) & 49152) >> 14 | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 2) + 188
                                                      ^ 175
                                                      ^ 192
                                                      ^ 5
                                                )
                                                << 6
                                       )
                                       << 11
                              )
                              + 247
                           & 65528
                     )
                     >> 3
                  | (
                           (
                                    (
                                          (
                                                   (
                                                         ((((var42 & 'ﰀ') >> 10 | var42 << 6) & 49152) >> 14 | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 2) + 188
                                                            ^ 175
                                                            ^ 192
                                                            ^ 5
                                                      )
                                                      & 64512
                                                )
                                                >> 10
                                             | (
                                                   ((((var42 & 'ﰀ') >> 10 | var42 << 6) & 49152) >> 14 | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 2) + 188
                                                      ^ 175
                                                      ^ 192
                                                      ^ 5
                                                )
                                                << 6
                                       )
                                       & 65504
                                 )
                                 >> 5
                              | (
                                    (
                                             (
                                                   ((((var42 & 'ﰀ') >> 10 | var42 << 6) & 49152) >> 14 | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 2) + 188
                                                      ^ 175
                                                      ^ 192
                                                      ^ 5
                                                )
                                                & 64512
                                          )
                                          >> 10
                                       | (((((var42 & 'ﰀ') >> 10 | var42 << 6) & 49152) >> 14 | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 2) + 188 ^ 175 ^ 192 ^ 5)
                                          << 6
                                 )
                                 << 11
                        )
                        + 247
                     << 13
            );
            var13.setCharAt(
               var23,
               (char)(
                  (
                           (
                                    (
                                             (
                                                   (
                                                            (
                                                                  ((((var42 & 'ﰀ') >> 10 | var42 << 6) & 49152) >> 14 | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 2)
                                                                        + 188
                                                                     ^ 175
                                                                     ^ 192
                                                                     ^ 5
                                                               )
                                                               & 64512
                                                         )
                                                         >> 10
                                                      | (
                                                            ((((var42 & 'ﰀ') >> 10 | var42 << 6) & 49152) >> 14 | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 2)
                                                                  + 188
                                                               ^ 175
                                                               ^ 192
                                                               ^ 5
                                                         )
                                                         << 6
                                                )
                                                & 65504
                                          )
                                          >> 5
                                       | (
                                             (
                                                      (
                                                            ((((var42 & 'ﰀ') >> 10 | var42 << 6) & 49152) >> 14 | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 2)
                                                                  + 188
                                                               ^ 175
                                                               ^ 192
                                                               ^ 5
                                                         )
                                                         & 64512
                                                   )
                                                   >> 10
                                                | (
                                                      ((((var42 & 'ﰀ') >> 10 | var42 << 6) & 49152) >> 14 | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 2) + 188
                                                         ^ 175
                                                         ^ 192
                                                         ^ 5
                                                   )
                                                   << 6
                                          )
                                          << 11
                                 )
                                 + 247
                              & 65528
                        )
                        >> 3
                     | (
                              (
                                       (
                                             (
                                                      (
                                                            ((((var42 & 'ﰀ') >> 10 | var42 << 6) & 49152) >> 14 | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 2)
                                                                  + 188
                                                               ^ 175
                                                               ^ 192
                                                               ^ 5
                                                         )
                                                         & 64512
                                                   )
                                                   >> 10
                                                | (
                                                      ((((var42 & 'ﰀ') >> 10 | var42 << 6) & 49152) >> 14 | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 2) + 188
                                                         ^ 175
                                                         ^ 192
                                                         ^ 5
                                                   )
                                                   << 6
                                          )
                                          & 65504
                                    )
                                    >> 5
                                 | (
                                       (
                                                (
                                                      ((((var42 & 'ﰀ') >> 10 | var42 << 6) & 49152) >> 14 | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 2) + 188
                                                         ^ 175
                                                         ^ 192
                                                         ^ 5
                                                   )
                                                   & 64512
                                             )
                                             >> 10
                                          | (
                                                ((((var42 & 'ﰀ') >> 10 | var42 << 6) & 49152) >> 14 | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 2) + 188
                                                   ^ 175
                                                   ^ 192
                                                   ^ 5
                                             )
                                             << 6
                                    )
                                    << 11
                           )
                           + 247
                        << 13
               )
            );
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = (-1381211405 >>> 1617643021 | 0) & -611676028; var29 < var16.length(); var29 += (-1213700426 - -841121128 | 1) & 270860321) {
            char var52 = var16.charAt(var29);
            char var57 = (char)(
               (
                     (
                              (
                                    (
                                             (
                                                      (
                                                               (
                                                                     ((((var52 & '\uffc0') >> 6 | var52 << '\n') ^ 71) & 65535) >> 0
                                                                        | (((var52 & '\uffc0') >> 6 | var52 << '\n') ^ 71) << 16
                                                                  )
                                                                  & 49152
                                                            )
                                                            >> 14
                                                         | (
                                                               ((((var52 & '\uffc0') >> 6 | var52 << '\n') ^ 71) & 65535) >> 0
                                                                  | (((var52 & '\uffc0') >> 6 | var52 << '\n') ^ 71) << 16
                                                            )
                                                            << 2
                                                   )
                                                   - 72
                                                   - 72
                                                & 65472
                                          )
                                          >> 6
                                       | (
                                                (
                                                         (
                                                               ((((var52 & '\uffc0') >> 6 | var52 << '\n') ^ 71) & 65535) >> 0
                                                                  | (((var52 & '\uffc0') >> 6 | var52 << '\n') ^ 71) << 16
                                                            )
                                                            & 49152
                                                      )
                                                      >> 14
                                                   | (
                                                         ((((var52 & '\uffc0') >> 6 | var52 << '\n') ^ 71) & 65535) >> 0
                                                            | (((var52 & '\uffc0') >> 6 | var52 << '\n') ^ 71) << 16
                                                      )
                                                      << 2
                                             )
                                             - 72
                                             - 72
                                          << 10
                                 )
                                 & 65472
                           )
                           >> 6
                        | (
                              (
                                       (
                                                (
                                                         (
                                                               ((((var52 & '\uffc0') >> 6 | var52 << '\n') ^ 71) & 65535) >> 0
                                                                  | (((var52 & '\uffc0') >> 6 | var52 << '\n') ^ 71) << 16
                                                            )
                                                            & 49152
                                                      )
                                                      >> 14
                                                   | (
                                                         ((((var52 & '\uffc0') >> 6 | var52 << '\n') ^ 71) & 65535) >> 0
                                                            | (((var52 & '\uffc0') >> 6 | var52 << '\n') ^ 71) << 16
                                                      )
                                                      << 2
                                             )
                                             - 72
                                             - 72
                                          & 65472
                                    )
                                    >> 6
                                 | (
                                          (
                                                   (
                                                         ((((var52 & '\uffc0') >> 6 | var52 << '\n') ^ 71) & 65535) >> 0
                                                            | (((var52 & '\uffc0') >> 6 | var52 << '\n') ^ 71) << 16
                                                      )
                                                      & 49152
                                                )
                                                >> 14
                                             | (
                                                   ((((var52 & '\uffc0') >> 6 | var52 << '\n') ^ 71) & 65535) >> 0
                                                      | (((var52 & '\uffc0') >> 6 | var52 << '\n') ^ 71) << 16
                                                )
                                                << 2
                                       )
                                       - 72
                                       - 72
                                    << 10
                           )
                           << 10
                  )
                  + 254
                  - 105
            );
            var16.setCharAt(
               var29,
               (char)(
                  (
                        (
                                 (
                                       (
                                                (
                                                         (
                                                                  (
                                                                        ((((var52 & '\uffc0') >> 6 | var52 << '\n') ^ 71) & 65535) >> 0
                                                                           | (((var52 & '\uffc0') >> 6 | var52 << '\n') ^ 71) << 16
                                                                     )
                                                                     & 49152
                                                               )
                                                               >> 14
                                                            | (
                                                                  ((((var52 & '\uffc0') >> 6 | var52 << '\n') ^ 71) & 65535) >> 0
                                                                     | (((var52 & '\uffc0') >> 6 | var52 << '\n') ^ 71) << 16
                                                               )
                                                               << 2
                                                      )
                                                      - 72
                                                      - 72
                                                   & 65472
                                             )
                                             >> 6
                                          | (
                                                   (
                                                            (
                                                                  ((((var52 & '\uffc0') >> 6 | var52 << '\n') ^ 71) & 65535) >> 0
                                                                     | (((var52 & '\uffc0') >> 6 | var52 << '\n') ^ 71) << 16
                                                               )
                                                               & 49152
                                                         )
                                                         >> 14
                                                      | (
                                                            ((((var52 & '\uffc0') >> 6 | var52 << '\n') ^ 71) & 65535) >> 0
                                                               | (((var52 & '\uffc0') >> 6 | var52 << '\n') ^ 71) << 16
                                                         )
                                                         << 2
                                                )
                                                - 72
                                                - 72
                                             << 10
                                    )
                                    & 65472
                              )
                              >> 6
                           | (
                                 (
                                          (
                                                   (
                                                            (
                                                                  ((((var52 & '\uffc0') >> 6 | var52 << '\n') ^ 71) & 65535) >> 0
                                                                     | (((var52 & '\uffc0') >> 6 | var52 << '\n') ^ 71) << 16
                                                               )
                                                               & 49152
                                                         )
                                                         >> 14
                                                      | (
                                                            ((((var52 & '\uffc0') >> 6 | var52 << '\n') ^ 71) & 65535) >> 0
                                                               | (((var52 & '\uffc0') >> 6 | var52 << '\n') ^ 71) << 16
                                                         )
                                                         << 2
                                                )
                                                - 72
                                                - 72
                                             & 65472
                                       )
                                       >> 6
                                    | (
                                             (
                                                      (
                                                            ((((var52 & '\uffc0') >> 6 | var52 << '\n') ^ 71) & 65535) >> 0
                                                               | (((var52 & '\uffc0') >> 6 | var52 << '\n') ^ 71) << 16
                                                         )
                                                         & 49152
                                                   )
                                                   >> 14
                                                | (
                                                      ((((var52 & '\uffc0') >> 6 | var52 << '\n') ^ 71) & 65535) >> 0
                                                         | (((var52 & '\uffc0') >> 6 | var52 << '\n') ^ 71) << 16
                                                   )
                                                   << 2
                                          )
                                          - 72
                                          - 72
                                       << 10
                              )
                              << 10
                     )
                     + 254
                     - 105
               )
            );
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_312.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = (1908687835 ^ -1457546701 | 0) & 538969089; var35 < var19.length(); var35 += (-1532325934 << 1308961590 | 1) & 1167621) {
            int var62 = var19.charAt(var35) + 159;
            char var65 = (char)(
               (
                     (
                              (((((var62 & 65532) >> 2 | var62 << 14) - 51 - 65 & 65535) >> 0 | ((var62 & 65532) >> 2 | var62 << 14) - 51 - 65 << 16) ^ 81)
                                    - 44
                                    - 189
                                 & 65532
                           )
                           >> 2
                        | (((((var62 & 65532) >> 2 | var62 << 14) - 51 - 65 & 65535) >> 0 | ((var62 & 65532) >> 2 | var62 << 14) - 51 - 65 << 16) ^ 81)
                              - 44
                              - 189
                           << 14
                  )
                  + 154
            );
            var19.setCharAt(
               var35,
               (char)(
                  (
                        (
                                 (((((var62 & 65532) >> 2 | var62 << 14) - 51 - 65 & 65535) >> 0 | ((var62 & 65532) >> 2 | var62 << 14) - 51 - 65 << 16) ^ 81)
                                       - 44
                                       - 189
                                    & 65532
                              )
                              >> 2
                           | (((((var62 & 65532) >> 2 | var62 << 14) - 51 - 65 & 65535) >> 0 | ((var62 & 65532) >> 2 | var62 << 14) - 51 - 65 << 16) ^ 81)
                                 - 44
                                 - 189
                              << 14
                     )
                     + 154
               )
            );
         }

         Class var7 = Class.forName(var19.toString(), false, Class_312.class.getClassLoader());
         switch (((((var4 ^ 1504255232 ^ 1474351175) - 575310815 + 1040127570 ^ 705725181) - 1996813580 ^ 194073276) + 1911082129 ^ 881486655) + 1485262679) {
            case 222249097:
               var10000 = var0.findConstructor(var7, var6);
               break;
            case 228440838:
            case 1208296299:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 1158515235:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            case 2117851626:
               var10000 = var0.findSpecial(var7, var5, var6, Class_312.class);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_1840[((var10 - 1257525427 ^ 1037789544 ^ 894070989) - 390029566 - 674334484 - 77931384 ^ 947590554) + 1851617697 ^ 1864550261 ^ 821342211] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1414(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 + 715895707 ^ 1307581188) - 863253440 ^ 1555714484) + 188934804 + 1070344702 - 2084056149 ^ 1294479711 ^ 1814716780;
      MethodHandle var10000 = field_1840[(
            ((var10 + 715895707 ^ 1307581188) - 863253440 ^ 1555714484) + 188934804 + 1070344702 - 2084056149 ^ 1294479711 ^ 1814716780
         )
         - 992318459];
      if (field_1840[var10001 - 992318459] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = -1551311640 + 890320043 ^ -660991597; var24 < var14.length(); var24 += 763239080 >> -1764621306 ^ 11925611) {
            int var43 = (var14.charAt(var24) ^ 'c') - 134 + 51 - 59;
            int var10004 = (var43 & 65535) >> 0;
            int var44 = (var43 & 65535) >> 0 | var43 << 16;
            int var86 = (((var43 & 65535) >> 0 | var43 << 16) & 32768) >> 15;
            char var45 = (char)(((((var10004 | var43 << 16) & 32768) >> 15 | ((var43 & 65535) >> 0 | var43 << 16) << 1) - 153 ^ 95) + 209 + 166);
            var14.setCharAt(var24, (char)(((var86 | var44 << 1) - 153 ^ 95) + 209 + 166));
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = (-328081103 >> -328081103 | 0) & 2434; var30 < var17.length(); var30 += -292041506 - -778857570 * -1569886215 ^ 1120253489) {
            int var50 = var17.charAt(var30) - 211;
            int var87 = (var50 & 61440) >> 12;
            int var51 = (var50 & 61440) >> 12 | var50 << 4;
            int var88 = (((var50 & 61440) >> 12 | var50 << 4) & 65520) >> 4;
            var50 = (((var87 | var50 << 4) & 65520) >> 4 | ((var50 & 61440) >> 12 | var50 << 4) << 12) + 66;
            var87 = ((var88 | var51 << 12) + 66 & 65472) >> 6;
            int var53 = (((var88 | var51 << 12) + 66 & 65472) >> 6 | var50 << 10) - 88 + 176 + 179;
            int var90 = ((((var88 | var51 << 12) + 66 & 65472) >> 6 | var50 << 10) - 88 + 176 + 179 & 65504) >> 5;
            char var54 = (char)(
               (((var87 | var50 << 10) - 88 + 176 + 179 & 65504) >> 5 | (((var88 | var51 << 12) + 66 & 65472) >> 6 | var50 << 10) - 88 + 176 + 179 << 11) ^ 176
            );
            var17.setCharAt(var30, (char)((var90 | var53 << 11) ^ 176));
         }

         Class var6 = Class.forName(var17.toString(), false, Class_312.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = -1131103272 & -1100567766 ^ -1140544760; var36 < var20.length(); var36 += (399852171 << 399852171 - 399852171 | 1) & -1071472315) {
            int var59 = var20.charAt(var36);
            int var91 = (var59 & 65534) >> 1;
            int var60 = (var59 & 65534) >> 1 | var59 << 15;
            int var92 = (((var59 & 65534) >> 1 | var59 << 15) & 65024) >> 9;
            var59 = ((var91 | var59 << 15) & 65024) >> 9 | ((var59 & 65534) >> 1 | var59 << 15) << 7;
            var91 = ((var92 | var60 << 7) & 61440) >> 12;
            int var62 = (((var92 | var60 << 7) & 61440) >> 12 | var59 << 4) + 67;
            int var94 = ((((var92 | var60 << 7) & 61440) >> 12 | var59 << 4) + 67 & 32768) >> 15;
            var59 = ((var91 | var59 << 4) + 67 & 32768) >> 15 | (((var92 | var60 << 7) & 61440) >> 12 | var59 << 4) + 67 << 1;
            var91 = ((var94 | var62 << 1) & 0) >> 16;
            int var64 = ((((var94 | var62 << 1) & 0) >> 16 | var59 << 0) ^ 49) - 204 ^ 34;
            int var96 = ((((((var94 | var62 << 1) & 0) >> 16 | var59 << 0) ^ 49) - 204 ^ 34) & 65472) >> 6;
            char var65 = (char)(
               ((((var91 | var59 << 0) ^ 49) - 204 ^ 34) & 65472) >> 6 | (((((var94 | var62 << 1) & 0) >> 16 | var59 << 0) ^ 49) - 204 ^ 34) << 10
            );
            var20.setCharAt(var36, (char)(var96 | var64 << 10));
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_312.class.getClassLoader()).returnType();
         switch ((((var4 ^ 902140979) - 315680030 + 244814767 - 1659172624 + 1228554475 ^ 1978423232) - 184128455 ^ 453072478 ^ 653569556) - 1336834031) {
            case 1298666123:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            case 1586964434:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            case 1878327587:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            case 2091597512:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_1840[(((var10 + 715895707 ^ 1307581188) - 863253440 ^ 1555714484) + 188934804 + 1070344702 - 2084056149 ^ 1294479711 ^ 1814716780) - 992318459] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
