import dev.krypton.native.Loader;
import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;

public enum Class_284 {
   // $VF: renamed from: wkt Class_284
   field_1068,
   // $VF: renamed from: yem Class_284
   field_1069,
   // $VF: renamed from: dmx Class_284
   field_1070,
   // $VF: renamed from: ysq Class_284
   field_1071,
   // $VF: renamed from: ner Class_284
   field_1072,
   // $VF: renamed from: gra Class_284
   field_1073,
   // $VF: renamed from: haf Class_284
   field_1074,
   // $VF: renamed from: zwf Class_284
   field_1075;

   // $VF: renamed from: oqk java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_1077 = new MethodHandle[(-117568419 ^ -117568419 | 71) & -1331673641];

   // $VF: renamed from: ngq () Class_284
   public Class_284 method_1176() {
      int var1 = 306851407;
      return switch ((
            switch (((0<"JNT",-325423666,"\udb9f鮢ᮝ宠鮟实ᮟ","꾩뾩뾫","Ｂ\ufff3",1293974227>(this) - 925593684 ^ 1620814144) - 1336195340 ^ 613620550)
                     - 900863004
                     + 2108631989) {
                     case -1003057607 -> (1009044125 * (-1026219918 << -1211242861) | 690606180) & -1183974154;
                     case -1003057606 -> 1394386133 * (-71392929 & -71392929) ^ 1642339909;
                     case -1003057605 -> 1310831359 - 1310831359 ^ 266566070;
                     case -1003057604 -> -332834944;
                     case -1003057603 -> 988184245 << 988184245 ^ -1512408290;
                     case -1003057602 -> (1966928367 | -2009002495) & -924622911;
                     case -1003057601 -> 783972929;
                     case -1003057600 -> 2128152358 >> 1043810828 - 609924590 ^ 480992181;
                     default -> (-825000953 + -825000953 | -393116863) & -53096471;
                  }
                  - 1558679404
                  - 1094660230
                  - 402991802
               ^ 1164340801
         )
         - 510699357
         - 1912256820) {
         case -1939439430 -> 1<"JNT",1903545511,"֣̓գ","༨౨","\u0fe5ߥ\uf7e0柣럣韤",587768934>();
         default -> 1<"JNT",1903545511,"\u0603ӣʃ","༨౨","\u0fe5ߥ\uf7e0柣럣韤",587768935>();
         case -1384283837 -> 1<"JNT",1903545511,"ɣ̣ͣ","༨౨","\u0fe5ߥ\uf7e0柣럣韤",587768932>();
         case -957891901 -> 1<"JNT",1903545511,"ɣףӣ","༨౨","\u0fe5ߥ\uf7e0柣럣韤",587768938>();
         case -533749244 -> 1<"JNT",1903545511,"ɃΣ׃","༨౨","\u0fe5ߥ\uf7e0柣럣韤",587768941>();
         case 636496744 -> 1<"JNT",1903545511,"Ӄף̓","༨౨","\u0fe5ߥ\uf7e0柣럣韤",587768931>();
         case 1708383570 -> 1<"JNT",1903545511,"҃գ׃","༨౨","\u0fe5ߥ\uf7e0柣럣韤",587768945>();
         case 1740479906 -> 1<"JNT",1903545511,"ΣУЃ","༨౨","\u0fe5ߥ\uf7e0柣럣韤",587768936>();
         case 1923362379 -> throw (MatchException)0<"JNT",-373049646,"ᮓ宠鮟宠ᮡ鮓","꾩\uefab쁕さ联さᾨ\ue055さT違ᾨ循恔䁔끕T違\udfa8\uefab쁕さ联さᾨ\ue055さT違ᾨ澪ꁕ䁔ၔ達さ䁕\ue055灕\udfa8뾩辪","￮翴\ufff0翴ￌﾇ翴￬翳ￌ翖翴\ufffb翵￩羂\ufff1翵翲ﾝ\ufffb翨羇￬",1293974216>(
         null, null
      );
      };
   }

   // $VF: renamed from: ef () Class_284
   public Class_284 method_1177() {
      int var1 = 272706629;
      return switch (switch (0<"JNT",-325423666,"\udb9f鮢ᮝ宠鮟实ᮟ","꾩뾩뾫","Ｂ\ufff3",1293974217>(this) + 497324218 + 411328617 - 2137840299
               ^ 134091524
               ^ 1046275179
               ^ 790369158) {
               case -1610419568 -> 1576977764;
               case -1610419567 -> (-457418846 >>> -1296356998 | -1484084220) & -1478492777;
               case -1610419566 -> (-954405405 >>> (-2119534024 << -954405405 + -2119534024) | 711166030) & 1802996446;
               case -1610419565 -> (522418843 - (1633479387 >>> 1633479387) | -1576860576) & -296024736;
               case -1610419564 -> -611341063 << -760825806 ^ -1134988939;
               case -1610419563 -> 2098775153 << (2098775153 | 673731074) ^ -867978172;
               case -1610419562 -> (-416919291 << 1090619715 * -416919291 | 1129924146) & -1007034381;
               case -1610419561 -> (-682863431 >>> 32737394 | 788101286) & 1878882535;
               default -> -270533143 & -1173357953;
            }
            - 651854914
            + 390292683
            + 1749889950
            - 1197240173
         ^ 1308101310
         ^ 1128677239) {
         case -1310548781 -> 1<"JNT",1903545511,"ɣףӣ","༨౨","\u0fe5ߥ\uf7e0柣럣韤",587768473>();
         case -1244157718 -> throw (MatchException)0<"JNT",-373049646,"ᮓ宠鮟宠ᮡ鮓","꾩\uefab쁕さ联さᾨ\ue055さT違ᾨ循恔䁔끕T違\udfa8\uefab쁕さ联さᾨ\ue055さT違ᾨ澪ꁕ䁔ၔ達さ䁕\ue055灕\udfa8뾩辪","￮翴\ufff0翴ￌﾇ翴￬翳ￌ翖翴\ufffb翵￩羂\ufff1翵翲ﾝ\ufffb翨羇￬",1293974232>(
         null, null
      );
         case -1235589882 -> 1<"JNT",1903545511,"\u0603ӣʃ","༨౨","\u0fe5ߥ\uf7e0柣럣韤",587768939>();
         case 261844279 -> 1<"JNT",1903545511,"҃գ׃","༨౨","\u0fe5ߥ\uf7e0柣럣韤",587768949>();
         default -> 1<"JNT",1903545511,"Ӄף̓","༨౨","\u0fe5ߥ\uf7e0柣럣韤",587768944>();
         case 1324165224 -> 1<"JNT",1903545511,"ɃΣ׃","༨౨","\u0fe5ߥ\uf7e0柣럣韤",587768467>();
         case 1535991589 -> 1<"JNT",1903545511,"֣̓գ","༨౨","\u0fe5ߥ\uf7e0柣럣韤",587768468>();
         case 1642487767 -> 1<"JNT",1903545511,"ɣ̣ͣ","༨౨","\u0fe5ߥ\uf7e0柣럣韤",587768940>();
         case 1919883329 -> 1<"JNT",1903545511,"ΣУЃ","༨౨","\u0fe5ߥ\uf7e0柣럣韤",587768942>();
      };
   }

   // $VF: Failed to inline enum fields
   // Please report this to the Vineflower issue tracker, at https://github.com/Vineflower/vineflower/issues with a copy of the class file (if you have the rights to distribute it!)
   static {
      Loader.init(Class_284.class);
      int var10000 = -818368707 & 1109099203 ^ 1108902401;

      StringBuilder var10001;
      for (var10001 = (StringBuilder)0<"JNT",-373049646,"ᮓ宠鮟宠ᮡ鮓","꾩\uefab쁕さ联さᾨ\ue055さT違ᾨ循恔䁔끕T違\udfa8뾩辪","￮翴\ufff0翴ￌﾇ翴￬翳ￌ翭\ufffbＢ翨￬翳ﾊ翺翨ﾇ\ufff3翲Ｂ",1293974131>(
            "ࡈࡐࡨࡸ࠘"
         );
         var10000 < ((-1041825588 << -999230144 | 5) & 906534197);
         var10000 += (315554486 + (2019758887 | 468035951) | 1) & 17303761
      ) {
         int var30 = 0<"JNT",-325423666,"\udb9eᮠ实鮢宦ᮡ","꾩뾫뾩徫","￮翴\ufff0翴ￌﾇ翴￬翳ￌ翭\ufffbＢ翨￬翳ﾊ翺翨ﾇ\ufff3翲Ｂ",1293974149>(var10001, var10000);
         int var10004 = (var30 & 65528) >> 3;
         int var31 = (var30 & 65528) >> 3 | var30 << 13;
         int var88 = (((var30 & 65528) >> 3 | var30 << 13) & 57344) >> 13;
         var30 = ((var10004 | var30 << 13) & 57344) >> 13 | ((var30 & 65528) >> 3 | var30 << 13) << 3;
         var10004 = ((var88 | var31 << 3) & 65504) >> 5;
         int var33 = ((var88 | var31 << 3) & 65504) >> 5 | var30 << 11;
         int var90 = ((((var88 | var31 << 3) & 65504) >> 5 | var30 << 11) & 49152) >> 14;
         char var34 = (char)((((var10004 | var30 << 11) & 49152) >> 14 | (((var88 | var31 << 3) & 65504) >> 5 | var30 << 11) << 2) - 155);
         0<"JNT",-325423666,"\udba2宝ᮡ\udba6ᮠ实鮢宦ᮡ","꾩뾫徫뾩辪","￮翴\ufff0翴ￌﾇ翴￬翳ￌ翭\ufffbＢ翨￬翳ﾊ翺翨ﾇ\ufff3翲Ｂ",1293974148>(
            var10001, var10000, (char)((var90 | var33 << 2) - 155)
         );
      }

      field_1068 = (Class_284)0<"JNT",-373049646,"ᮓ宠鮟宠ᮡ鮓","꾩\uefab쁕さ联さᾨ\ue055さT違ᾨ循恔䁔끕T違\udfa8뾫뾩辪","Ｂ\ufff3",1293974233>(
         0<"JNT",-325423666,"ᮡ\udb9f\udbaaᮡ鮢宠鮟\udb9d","꾩뾩\uefab쁕さ联さᾨ\ue055さT違ᾨ循恔䁔끕T違\udfa8","￮翴\ufff0翴ￌﾇ翴￬翳ￌ翭\ufffbＢ翨￬翳ﾊ翺翨ﾇ\ufff3翲Ｂ",1293974230>(var10001), 0
      );
      var10000 = -1544312507 ^ -1544312507;

      for (var10001 = (StringBuilder)0<"JNT",-373049646,"ᮓ宠鮟宠ᮡ鮓","꾩\uefab쁕さ联さᾨ\ue055さT違ᾨ循恔䁔끕T違\udfa8뾩辪","￮翴\ufff0翴ￌﾇ翴￬翳ￌ翭\ufffbＢ翨￬翳ﾊ翺翨ﾇ\ufff3翲Ｂ",1293974120>(
            "㥀ᅀ䕀䝀ཀ"
         );
         var10000 < (-1773114981 & -1782303208 ^ -1807736803);
         var10000 += -1087254815 << -1087254815 + (-1087254815 | -1087254815) ^ -54051963
      ) {
         char var37 = 0<"JNT",-325423666,"\udb9eᮠ实鮢宦ᮡ","꾩뾫뾩徫","￮翴\ufff0翴ￌﾇ翴￬翳ￌ翭\ufffbＢ翨￬翳ﾊ翺翨ﾇ\ufff3翲Ｂ",1293974240>(var10001, var10000);
         char var40 = (char)(
            (
                  (((((var37 & '\uf000') >> 12 | var37 << 4) & 65024) >> 9 | ((var37 & '\uf000') >> 12 | var37 << 4) << 7) - 74 & 65520) >> 4
                     | ((((var37 & '\uf000') >> 12 | var37 << 4) & 65024) >> 9 | ((var37 & '\uf000') >> 12 | var37 << 4) << 7) - 74 << 12
               )
               ^ 107
         );
         0<"JNT",-325423666,"\udba2宝ᮡ\udba6ᮠ实鮢宦ᮡ","꾩뾫徫뾩辪","￮翴\ufff0翴ￌﾇ翴￬翳ￌ翭\ufffbＢ翨￬翳ﾊ翺翨ﾇ\ufff3翲Ｂ",1293974123>(
            var10001,
            var10000,
            (char)(
               (
                     (((((var37 & '\uf000') >> 12 | var37 << 4) & 65024) >> 9 | ((var37 & '\uf000') >> 12 | var37 << 4) << 7) - 74 & 65520) >> 4
                        | ((((var37 & '\uf000') >> 12 | var37 << 4) & 65024) >> 9 | ((var37 & '\uf000') >> 12 | var37 << 4) << 7) - 74 << 12
                  )
                  ^ 107
            )
         );
      }

      field_1069 = (Class_284)0<"JNT",-373049646,"ᮓ宠鮟宠ᮡ鮓","꾩\uefab쁕さ联さᾨ\ue055さT違ᾨ循恔䁔끕T違\udfa8뾫뾩辪","Ｂ\ufff3",1293974126>(
         0<"JNT",-325423666,"ᮡ\udb9f\udbaaᮡ鮢宠鮟\udb9d","꾩뾩\uefab쁕さ联さᾨ\ue055さT違ᾨ循恔䁔끕T違\udfa8","￮翴\ufff0翴ￌﾇ翴￬翳ￌ翭\ufffbＢ翨￬翳ﾊ翺翨ﾇ\ufff3翲Ｂ",1293974127>(var10001), 1
      );
      var10000 = (-1804769397 | 2105633346) ^ -34770997;

      for (var10001 = (StringBuilder)0<"JNT",-373049646,"ᮓ宠鮟宠ᮡ鮓","꾩\uefab쁕さ联さᾨ\ue055さT違ᾨ循恔䁔끕T違\udfa8뾩辪","￮翴\ufff0翴ￌﾇ翴￬翳ￌ翭\ufffbＢ翨￬翳ﾊ翺翨ﾇ\ufff3翲Ｂ",1293974129>(
            "籎籌籕ﱕ"
         );
         var10000 < (2144277466 - 1351001897 ^ 793275573);
         var10000 += 1405894497 & -1301907882 ^ 306460225
      ) {
         int var43 = 0<"JNT",-325423666,"\udb9eᮠ实鮢宦ᮡ","꾩뾫뾩徫","￮翴\ufff0翴ￌﾇ翴￬翳ￌ翭\ufffbＢ翨￬翳ﾊ翺翨ﾇ\ufff3翲Ｂ",1293974118>(var10001, var10000);
         int var94 = (var43 & 65532) >> 2;
         int var44 = ((var43 & 65532) >> 2 | var43 << 14) + 249;
         int var95 = (((var43 & 65532) >> 2 | var43 << 14) + 249 & 65472) >> 6;
         var43 = ((var94 | var43 << 14) + 249 & 65472) >> 6 | ((var43 & 65532) >> 2 | var43 << 14) + 249 << 10;
         var94 = ((var95 | var44 << 10) & 49152) >> 14;
         int var46 = ((var95 | var44 << 10) & 49152) >> 14 | var43 << 2;
         int var97 = ((((var95 | var44 << 10) & 49152) >> 14 | var43 << 2) & 65024) >> 9;
         char var47 = (char)(((var94 | var43 << 2) & 65024) >> 9 | (((var95 | var44 << 10) & 49152) >> 14 | var43 << 2) << 7);
         0<"JNT",-325423666,"\udba2宝ᮡ\udba6ᮠ实鮢宦ᮡ","꾩뾫徫뾩辪","￮翴\ufff0翴ￌﾇ翴￬翳ￌ翭\ufffbＢ翨￬翳ﾊ翺翨ﾇ\ufff3翲Ｂ",1293974121>(var10001, var10000, (char)(var97 | var46 << 7));
      }

      field_1070 = (Class_284)0<"JNT",-373049646,"ᮓ宠鮟宠ᮡ鮓","꾩\uefab쁕さ联さᾨ\ue055さT違ᾨ循恔䁔끕T違\udfa8뾫뾩辪","Ｂ\ufff3",1293974142>(
         0<"JNT",-325423666,"ᮡ\udb9f\udbaaᮡ鮢宠鮟\udb9d","꾩뾩\uefab쁕さ联さᾨ\ue055さT違ᾨ循恔䁔끕T違\udfa8","￮翴\ufff0翴ￌﾇ翴￬翳ￌ翭\ufffbＢ翨￬翳ﾊ翺翨ﾇ\ufff3翲Ｂ",1293974143>(var10001), 2
      );
      var10000 = -1411352844 - -310758645 ^ -1100594199;

      for (var10001 = (StringBuilder)0<"JNT",-373049646,"ᮓ宠鮟宠ᮡ鮓","꾩\uefab쁕さ联さᾨ\ue055さT違ᾨ循恔䁔끕T違\udfa8뾩辪","￮翴\ufff0翴ￌﾇ翴￬翳ￌ翭\ufffbＢ翨￬翳ﾊ翺翨ﾇ\ufff3翲Ｂ",1293974145>(
            "\udbf4鏴꯴\udff4"
         );
         var10000 < ((-1834546797 | -1834546797 | 4) & 692614212);
         var10000 += (847023979 | 1833811638) ^ 2138947582
      ) {
         char var50 = 0<"JNT",-325423666,"\udb9eᮠ实鮢宦ᮡ","꾩뾫뾩徫","￮翴\ufff0翴ￌﾇ翴￬翳ￌ翭\ufffbＢ翨￬翳ﾊ翺翨ﾇ\ufff3翲Ｂ",1293974280>(var10001, var10000);
         int var98 = (var50 & '\uf000') >> 12;
         int var51 = (((var50 & '\uf000') >> 12 | var50 << 4) ^ 217) + 153 ^ 48;
         int var99 = (((((var50 & '\uf000') >> 12 | var50 << 4) ^ 217) + 153 ^ 48) & 49152) >> 14;
         var50 = (char)(((((var98 | var50 << 4) ^ 217) + 153 ^ 48) & 49152) >> 14 | ((((var50 & '\uf000') >> 12 | var50 << 4) ^ 217) + 153 ^ 48) << 2);
         0<"JNT",-325423666,"\udba2宝ᮡ\udba6ᮠ实鮢宦ᮡ","꾩뾫徫뾩辪","￮翴\ufff0翴ￌﾇ翴￬翳ￌ翭\ufffbＢ翨￬翳ﾊ翺翨ﾇ\ufff3翲Ｂ",1293974291>(var10001, var10000, (char)(var99 | var51 << 2));
      }

      field_1071 = (Class_284)0<"JNT",-373049646,"ᮓ宠鮟宠ᮡ鮓","꾩\uefab쁕さ联さᾨ\ue055さT違ᾨ循恔䁔끕T違\udfa8뾫뾩辪","Ｂ\ufff3",1293974134>(
         0<"JNT",-325423666,"ᮡ\udb9f\udbaaᮡ鮢宠鮟\udb9d","꾩뾩\uefab쁕さ联さᾨ\ue055さT違ᾨ循恔䁔끕T違\udfa8","￮翴\ufff0翴ￌﾇ翴￬翳ￌ翭\ufffbＢ翨￬翳ﾊ翺翨ﾇ\ufff3翲Ｂ",1293974135>(var10001), 3
      );
      var10000 = (351951516 & -2108417584 | 0) & -1224097201;

      for (var10001 = (StringBuilder)0<"JNT",-373049646,"ᮓ宠鮟宠ᮡ鮓","꾩\uefab쁕さ联さᾨ\ue055さT違ᾨ循恔䁔끕T違\udfa8뾩辪","￮翴\ufff0翴ￌﾇ翴￬翳ￌ翭\ufffbＢ翨￬翳ﾊ翺翨ﾇ\ufff3翲Ｂ",1293974137>(
            "\udc3f\udc5f\udfbf\udf7f\udcff\udd9f\ude1f\udfdf\udf7f"
         );
         var10000 < ((2021010839 ^ 2021010839 >> 2021010839 | 8) & -2079850343);
         var10000 += (1665407062 - -1153129519 | 0) & 268436265
      ) {
         char var55 = 0<"JNT",-325423666,"\udb9eᮠ实鮢宦ᮡ","꾩뾫뾩徫","￮翴\ufff0翴ￌﾇ翴￬翳ￌ翭\ufffbＢ翨￬翳ﾊ翺翨ﾇ\ufff3翲Ｂ",1293974124>(var10001, var10000);
         char var56 = (char)(((var55 & '￠') >> 5 | var55 << 11) + 197 - 12 + 102 ^ 110);
         0<"JNT",-325423666,"\udba2宝ᮡ\udba6ᮠ实鮢宦ᮡ","꾩뾫徫뾩辪","￮翴\ufff0翴ￌﾇ翴￬翳ￌ翭\ufffbＢ翨￬翳ﾊ翺翨ﾇ\ufff3翲Ｂ",1293974119>(
            var10001, var10000, (char)(((var55 & '￠') >> 5 | var55 << 11) + 197 - 12 + 102 ^ 110)
         );
      }

      field_1072 = (Class_284)0<"JNT",-373049646,"ᮓ宠鮟宠ᮡ鮓","꾩\uefab쁕さ联さᾨ\ue055さT違ᾨ循恔䁔끕T違\udfa8뾫뾩辪","Ｂ\ufff3",1293974147>(
         0<"JNT",-325423666,"ᮡ\udb9f\udbaaᮡ鮢宠鮟\udb9d","꾩뾩\uefab쁕さ联さᾨ\ue055さT違ᾨ循恔䁔끕T違\udfa8","￮翴\ufff0翴ￌﾇ翴￬翳ￌ翭\ufffbＢ翨￬翳ﾊ翺翨ﾇ\ufff3翲Ｂ",1293974136>(var10001), 4
      );
      var10000 = 939070272 * (1857877508 | 939070272 * 1857877508) ^ -422507264;

      for (var10001 = (StringBuilder)0<"JNT",-373049646,"ᮓ宠鮟宠ᮡ鮓","꾩\uefab쁕さ联さᾨ\ue055さT違ᾨ循恔䁔끕T違\udfa8뾩辪","￮翴\ufff0翴ￌﾇ翴￬翳ￌ翭\ufffbＢ翨￬翳ﾊ翺翨ﾇ\ufff3翲Ｂ",1293974146>(
            "煿腿녿텿ᅿſ\ue17e셿텿"
         );
         var10000 < 9;
         var10000 += 1
      ) {
         int var59 = 0<"JNT",-325423666,"\udb9eᮠ实鮢宦ᮡ","꾩뾫뾩徫","￮翴\ufff0翴ￌﾇ翴￬翳ￌ翭\ufffbＢ翨￬翳ﾊ翺翨ﾇ\ufff3翲Ｂ",1293974236>(var10001, var10000) - 198 - 45 - 144;
         char var60 = (char)(((var59 & 61440) >> 12 | var59 << 4) + 168);
         0<"JNT",-325423666,"\udba2宝ᮡ\udba6ᮠ实鮢宦ᮡ","꾩뾫徫뾩辪","￮翴\ufff0翴ￌﾇ翴￬翳ￌ翭\ufffbＢ翨￬翳ﾊ翺翨ﾇ\ufff3翲Ｂ",1293974231>(
            var10001, var10000, (char)(((var59 & 61440) >> 12 | var59 << 4) + 168)
         );
      }

      field_1073 = (Class_284)0<"JNT",-373049646,"ᮓ宠鮟宠ᮡ鮓","꾩\uefab쁕さ联さᾨ\ue055さT違ᾨ循恔䁔끕T違\udfa8뾫뾩辪","Ｂ\ufff3",1293974141>(
         0<"JNT",-325423666,"ᮡ\udb9f\udbaaᮡ鮢宠鮟\udb9d","꾩뾩\uefab쁕さ联さᾨ\ue055さT違ᾨ循恔䁔끕T違\udfa8","￮翴\ufff0翴ￌﾇ翴￬翳ￌ翭\ufffbＢ翨￬翳ﾊ翺翨ﾇ\ufff3翲Ｂ",1293974138>(var10001), 5
      );
      var10000 = -1228367812 ^ 677588174 ^ -1632914190;

      for (var10001 = (StringBuilder)0<"JNT",-373049646,"ᮓ宠鮟宠ᮡ鮓","꾩\uefab쁕さ联さᾨ\ue055さT違ᾨ循恔䁔끕T違\udfa8뾩辪","￮翴\ufff0翴ￌﾇ翴￬翳ￌ翭\ufffbＢ翨￬翳ﾊ翺翨ﾇ\ufff3翲Ｂ",1293974140>(
            "\u0090̐\uffd0\ufff0Ͱǐɐ\u0090\ufff0"
         );
         var10000 < (-1077439448 >> 909154441 ^ -2104381);
         var10000 += -1310807313 >> -1310807313 ^ -40004
      ) {
         int var63 = 0<"JNT",-325423666,"\udb9eᮠ实鮢宦ᮡ","꾩뾫뾩徫","￮翴\ufff0翴ￌﾇ翴￬翳ￌ翭\ufffbＢ翨￬翳ﾊ翺翨ﾇ\ufff3翲Ｂ",1293974122>(var10001, var10000) + 30 - 65 + 83;
         char var64 = (char)(((var63 & 65504) >> 5 | var63 << 11) ^ 117);
         0<"JNT",-325423666,"\udba2宝ᮡ\udba6ᮠ实鮢宦ᮡ","꾩뾫徫뾩辪","￮翴\ufff0翴ￌﾇ翴￬翳ￌ翭\ufffbＢ翨￬翳ﾊ翺翨ﾇ\ufff3翲Ｂ",1293974125>(
            var10001, var10000, (char)(((var63 & 65504) >> 5 | var63 << 11) ^ 117)
         );
      }

      field_1074 = (Class_284)0<"JNT",-373049646,"ᮓ宠鮟宠ᮡ鮓","꾩\uefab쁕さ联さᾨ\ue055さT違ᾨ循恔䁔끕T違\udfa8뾫뾩辪","Ｂ\ufff3",1293974293>(
         0<"JNT",-325423666,"ᮡ\udb9f\udbaaᮡ鮢宠鮟\udb9d","꾩뾩\uefab쁕さ联さᾨ\ue055さT違ᾨ循恔䁔끕T違\udfa8","￮翴\ufff0翴ￌﾇ翴￬翳ￌ翭\ufffbＢ翨￬翳ﾊ翺翨ﾇ\ufff3翲Ｂ",1293974290>(var10001), 6
      );
      var10000 = (-1164123200 + -1164123200 | 0) & -1971048379;

      for (var10001 = (StringBuilder)0<"JNT",-373049646,"ᮓ宠鮟宠ᮡ鮓","꾩\uefab쁕さ联さᾨ\ue055さT違ᾨ循恔䁔끕T違\udfa8뾩辪","￮翴\ufff0翴ￌﾇ翴￬翳ￌ翭\ufffbＢ翨￬翳ﾊ翺翨ﾇ\ufff3翲Ｂ",1293974292>(
            "ﾄﾠﾊﾋﾟﾈﾚﾄﾋ"
         );
         var10000 < (-1846020929 + -1550538488 ^ 898407886);
         var10000 += (-540658615 | -900095096 | -540658615 >> -900095096 | 1) & 2049
      ) {
         char var67 = 0<"JNT",-325423666,"\udb9eᮠ实鮢宦ᮡ","꾩뾫뾩徫","￮翴\ufff0翴ￌﾇ翴￬翳ￌ翭\ufffbＢ翨￬翳ﾊ翺翨ﾇ\ufff3翲Ｂ",1293974128>(var10001, var10000);
         int var103 = (var67 & '\ufffe') >> 1;
         int var68 = ((var67 & '\ufffe') >> 1 | var67 << 15) + 169 + 37 ^ 169;
         int var104 = ((((var67 & '\ufffe') >> 1 | var67 << 15) + 169 + 37 ^ 169) & 32768) >> 15;
         var67 = (char)((((var103 | var67 << 15) + 169 + 37 ^ 169) & 32768) >> 15 | (((var67 & '\ufffe') >> 1 | var67 << 15) + 169 + 37 ^ 169) << 1);
         0<"JNT",-325423666,"\udba2宝ᮡ\udba6ᮠ实鮢宦ᮡ","꾩뾫徫뾩辪","￮翴\ufff0翴ￌﾇ翴￬翳ￌ翭\ufffbＢ翨￬翳ﾊ翺翨ﾇ\ufff3翲Ｂ",1293974139>(var10001, var10000, (char)(var104 | var68 << 1));
      }

      field_1075 = (Class_284)0<"JNT",-373049646,"ᮓ宠鮟宠ᮡ鮓","꾩\uefab쁕さ联さᾨ\ue055さT違ᾨ循恔䁔끕T違\udfa8뾫뾩辪","Ｂ\ufff3",1293974133>(
         0<"JNT",-325423666,"ᮡ\udb9f\udbaaᮡ鮢宠鮟\udb9d","꾩뾩\uefab쁕さ联さᾨ\ue055さT違ᾨ循恔䁔끕T違\udfa8","￮翴\ufff0翴ￌﾇ翴￬翳ￌ翭\ufffbＢ翨￬翳ﾊ翺翨ﾇ\ufff3翲Ｂ",1293974130>(var10001), 7
      );
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1179(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 - 1460176531 + 1389631661 ^ 395702458) + 2029395231 ^ 1893214869 ^ 1398236785 ^ 968634221 ^ 516281150) + 1772390686;
      MethodHandle var10000 = field_1077[((var10 - 1460176531 + 1389631661 ^ 395702458) + 2029395231 ^ 1893214869 ^ 1398236785 ^ 968634221 ^ 516281150)
         + 1772390686
         - 1177236188];
      if (field_1077[var10001 - 1177236188] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = 1733797036 - -64131384 ^ 1797928420; var23 < var13.length(); var23 += (-361302130 - -536217886 | 1) & 880855313) {
            int var42 = var13.charAt(var23);
            int var10004 = (var42 & 63488) >> 11;
            int var43 = (var42 & 63488) >> 11 | var42 << 5;
            int var85 = (((var42 & 63488) >> 11 | var42 << 5) & 61440) >> 12;
            var42 = (((var10004 | var42 << 5) & 61440) >> 12 | ((var42 & 63488) >> 11 | var42 << 5) << 4) - 183;
            var10004 = ((var85 | var43 << 4) - 183 & 49152) >> 14;
            int var45 = ((var85 | var43 << 4) - 183 & 49152) >> 14 | var42 << 2;
            int var87 = ((((var85 | var43 << 4) - 183 & 49152) >> 14 | var42 << 2) & 65024) >> 9;
            char var46 = (char)(
               (((var10004 | var42 << 2) & 65024) >> 9 | (((var85 | var43 << 4) - 183 & 49152) >> 14 | var42 << 2) << 7) + 77 ^ 209 ^ 67 ^ 65 ^ 119
            );
            var13.setCharAt(var23, (char)((var87 | var45 << 7) + 77 ^ 209 ^ 67 ^ 65 ^ 119));
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = (-1263515741 ^ -1263515741 - -1416323289 | 0) & 32; var29 < var16.length(); var29 += -178478605 >>> -1449556983 ^ 8040017) {
            int var51 = var16.charAt(var29) ^ 'U';
            char var58 = (char)(
               (
                     (
                              (
                                    (
                                             (
                                                   (
                                                            (
                                                                     (
                                                                              (
                                                                                    (
                                                                                             (
                                                                                                   (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                                      | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                                                )
                                                                                                & 32768
                                                                                          )
                                                                                          >> 15
                                                                                       | (
                                                                                             (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                                | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                                          )
                                                                                          << 1
                                                                                 )
                                                                                 & 57344
                                                                           )
                                                                           >> 13
                                                                        | (
                                                                              (
                                                                                       (
                                                                                             (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                                | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                                          )
                                                                                          & 32768
                                                                                    )
                                                                                    >> 15
                                                                                 | (
                                                                                       (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                          | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                                    )
                                                                                    << 1
                                                                           )
                                                                           << 3
                                                                  )
                                                                  - 101
                                                               & 64512
                                                         )
                                                         >> 10
                                                      | (
                                                               (
                                                                        (
                                                                              (
                                                                                       (
                                                                                             (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                                | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                                          )
                                                                                          & 32768
                                                                                    )
                                                                                    >> 15
                                                                                 | (
                                                                                       (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                          | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                                    )
                                                                                    << 1
                                                                           )
                                                                           & 57344
                                                                     )
                                                                     >> 13
                                                                  | (
                                                                        (
                                                                                 (
                                                                                       (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                          | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                                    )
                                                                                    & 32768
                                                                              )
                                                                              >> 15
                                                                           | (
                                                                                 (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                    | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                              )
                                                                              << 1
                                                                     )
                                                                     << 3
                                                            )
                                                            - 101
                                                         << 6
                                                )
                                                & 0
                                          )
                                          >> 16
                                       | (
                                             (
                                                      (
                                                               (
                                                                        (
                                                                              (
                                                                                       (
                                                                                             (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                                | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                                          )
                                                                                          & 32768
                                                                                    )
                                                                                    >> 15
                                                                                 | (
                                                                                       (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                          | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                                    )
                                                                                    << 1
                                                                           )
                                                                           & 57344
                                                                     )
                                                                     >> 13
                                                                  | (
                                                                        (
                                                                                 (
                                                                                       (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                          | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                                    )
                                                                                    & 32768
                                                                              )
                                                                              >> 15
                                                                           | (
                                                                                 (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                    | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                              )
                                                                              << 1
                                                                     )
                                                                     << 3
                                                            )
                                                            - 101
                                                         & 64512
                                                   )
                                                   >> 10
                                                | (
                                                         (
                                                                  (
                                                                        (
                                                                                 (
                                                                                       (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                          | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                                    )
                                                                                    & 32768
                                                                              )
                                                                              >> 15
                                                                           | (
                                                                                 (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                    | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                              )
                                                                              << 1
                                                                     )
                                                                     & 57344
                                                               )
                                                               >> 13
                                                            | (
                                                                  (
                                                                           (
                                                                                 (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                    | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                              )
                                                                              & 32768
                                                                        )
                                                                        >> 15
                                                                     | (
                                                                           (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                              | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                        )
                                                                        << 1
                                                               )
                                                               << 3
                                                      )
                                                      - 101
                                                   << 6
                                          )
                                          << 0
                                 )
                                 & 65472
                           )
                           >> 6
                        | (
                              (
                                       (
                                             (
                                                      (
                                                               (
                                                                        (
                                                                              (
                                                                                       (
                                                                                             (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                                | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                                          )
                                                                                          & 32768
                                                                                    )
                                                                                    >> 15
                                                                                 | (
                                                                                       (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                          | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                                    )
                                                                                    << 1
                                                                           )
                                                                           & 57344
                                                                     )
                                                                     >> 13
                                                                  | (
                                                                        (
                                                                                 (
                                                                                       (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                          | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                                    )
                                                                                    & 32768
                                                                              )
                                                                              >> 15
                                                                           | (
                                                                                 (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                    | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                              )
                                                                              << 1
                                                                     )
                                                                     << 3
                                                            )
                                                            - 101
                                                         & 64512
                                                   )
                                                   >> 10
                                                | (
                                                         (
                                                                  (
                                                                        (
                                                                                 (
                                                                                       (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                          | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                                    )
                                                                                    & 32768
                                                                              )
                                                                              >> 15
                                                                           | (
                                                                                 (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                    | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                              )
                                                                              << 1
                                                                     )
                                                                     & 57344
                                                               )
                                                               >> 13
                                                            | (
                                                                  (
                                                                           (
                                                                                 (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                    | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                              )
                                                                              & 32768
                                                                        )
                                                                        >> 15
                                                                     | (
                                                                           (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                              | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                        )
                                                                        << 1
                                                               )
                                                               << 3
                                                      )
                                                      - 101
                                                   << 6
                                          )
                                          & 0
                                    )
                                    >> 16
                                 | (
                                       (
                                                (
                                                         (
                                                                  (
                                                                        (
                                                                                 (
                                                                                       (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                          | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                                    )
                                                                                    & 32768
                                                                              )
                                                                              >> 15
                                                                           | (
                                                                                 (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                    | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                              )
                                                                              << 1
                                                                     )
                                                                     & 57344
                                                               )
                                                               >> 13
                                                            | (
                                                                  (
                                                                           (
                                                                                 (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                    | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                              )
                                                                              & 32768
                                                                        )
                                                                        >> 15
                                                                     | (
                                                                           (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                              | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                        )
                                                                        << 1
                                                               )
                                                               << 3
                                                      )
                                                      - 101
                                                   & 64512
                                             )
                                             >> 10
                                          | (
                                                   (
                                                            (
                                                                  (
                                                                           (
                                                                                 (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                    | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                              )
                                                                              & 32768
                                                                        )
                                                                        >> 15
                                                                     | (
                                                                           (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                              | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                        )
                                                                        << 1
                                                               )
                                                               & 57344
                                                         )
                                                         >> 13
                                                      | (
                                                            (
                                                                     (
                                                                           (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                              | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                        )
                                                                        & 32768
                                                                  )
                                                                  >> 15
                                                               | (
                                                                     (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                        | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                  )
                                                                  << 1
                                                         )
                                                         << 3
                                                )
                                                - 101
                                             << 6
                                    )
                                    << 0
                           )
                           << 10
                  )
                  + 195
            );
            var16.setCharAt(
               var29,
               (char)(
                  (
                        (
                                 (
                                       (
                                                (
                                                      (
                                                               (
                                                                        (
                                                                                 (
                                                                                       (
                                                                                                (
                                                                                                      (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                                         | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                                                   )
                                                                                                   & 32768
                                                                                             )
                                                                                             >> 15
                                                                                          | (
                                                                                                (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                                   | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                                             )
                                                                                             << 1
                                                                                    )
                                                                                    & 57344
                                                                              )
                                                                              >> 13
                                                                           | (
                                                                                 (
                                                                                          (
                                                                                                (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                                   | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                                             )
                                                                                             & 32768
                                                                                       )
                                                                                       >> 15
                                                                                    | (
                                                                                          (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                             | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                                       )
                                                                                       << 1
                                                                              )
                                                                              << 3
                                                                     )
                                                                     - 101
                                                                  & 64512
                                                            )
                                                            >> 10
                                                         | (
                                                                  (
                                                                           (
                                                                                 (
                                                                                          (
                                                                                                (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                                   | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                                             )
                                                                                             & 32768
                                                                                       )
                                                                                       >> 15
                                                                                    | (
                                                                                          (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                             | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                                       )
                                                                                       << 1
                                                                              )
                                                                              & 57344
                                                                        )
                                                                        >> 13
                                                                     | (
                                                                           (
                                                                                    (
                                                                                          (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                             | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                                       )
                                                                                       & 32768
                                                                                 )
                                                                                 >> 15
                                                                              | (
                                                                                    (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                       | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                                 )
                                                                                 << 1
                                                                        )
                                                                        << 3
                                                               )
                                                               - 101
                                                            << 6
                                                   )
                                                   & 0
                                             )
                                             >> 16
                                          | (
                                                (
                                                         (
                                                                  (
                                                                           (
                                                                                 (
                                                                                          (
                                                                                                (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                                   | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                                             )
                                                                                             & 32768
                                                                                       )
                                                                                       >> 15
                                                                                    | (
                                                                                          (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                             | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                                       )
                                                                                       << 1
                                                                              )
                                                                              & 57344
                                                                        )
                                                                        >> 13
                                                                     | (
                                                                           (
                                                                                    (
                                                                                          (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                             | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                                       )
                                                                                       & 32768
                                                                                 )
                                                                                 >> 15
                                                                              | (
                                                                                    (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                       | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                                 )
                                                                                 << 1
                                                                        )
                                                                        << 3
                                                               )
                                                               - 101
                                                            & 64512
                                                      )
                                                      >> 10
                                                   | (
                                                            (
                                                                     (
                                                                           (
                                                                                    (
                                                                                          (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                             | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                                       )
                                                                                       & 32768
                                                                                 )
                                                                                 >> 15
                                                                              | (
                                                                                    (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                       | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                                 )
                                                                                 << 1
                                                                        )
                                                                        & 57344
                                                                  )
                                                                  >> 13
                                                               | (
                                                                     (
                                                                              (
                                                                                    (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                       | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                                 )
                                                                                 & 32768
                                                                           )
                                                                           >> 15
                                                                        | (
                                                                              (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                 | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                           )
                                                                           << 1
                                                                  )
                                                                  << 3
                                                         )
                                                         - 101
                                                      << 6
                                             )
                                             << 0
                                    )
                                    & 65472
                              )
                              >> 6
                           | (
                                 (
                                          (
                                                (
                                                         (
                                                                  (
                                                                           (
                                                                                 (
                                                                                          (
                                                                                                (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                                   | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                                             )
                                                                                             & 32768
                                                                                       )
                                                                                       >> 15
                                                                                    | (
                                                                                          (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                             | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                                       )
                                                                                       << 1
                                                                              )
                                                                              & 57344
                                                                        )
                                                                        >> 13
                                                                     | (
                                                                           (
                                                                                    (
                                                                                          (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                             | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                                       )
                                                                                       & 32768
                                                                                 )
                                                                                 >> 15
                                                                              | (
                                                                                    (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                       | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                                 )
                                                                                 << 1
                                                                        )
                                                                        << 3
                                                               )
                                                               - 101
                                                            & 64512
                                                      )
                                                      >> 10
                                                   | (
                                                            (
                                                                     (
                                                                           (
                                                                                    (
                                                                                          (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                             | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                                       )
                                                                                       & 32768
                                                                                 )
                                                                                 >> 15
                                                                              | (
                                                                                    (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                       | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                                 )
                                                                                 << 1
                                                                        )
                                                                        & 57344
                                                                  )
                                                                  >> 13
                                                               | (
                                                                     (
                                                                              (
                                                                                    (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                       | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                                 )
                                                                                 & 32768
                                                                           )
                                                                           >> 15
                                                                        | (
                                                                              (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                 | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                           )
                                                                           << 1
                                                                  )
                                                                  << 3
                                                         )
                                                         - 101
                                                      << 6
                                             )
                                             & 0
                                       )
                                       >> 16
                                    | (
                                          (
                                                   (
                                                            (
                                                                     (
                                                                           (
                                                                                    (
                                                                                          (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                             | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                                       )
                                                                                       & 32768
                                                                                 )
                                                                                 >> 15
                                                                              | (
                                                                                    (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                       | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                                 )
                                                                                 << 1
                                                                        )
                                                                        & 57344
                                                                  )
                                                                  >> 13
                                                               | (
                                                                     (
                                                                              (
                                                                                    (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                       | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                                 )
                                                                                 & 32768
                                                                           )
                                                                           >> 15
                                                                        | (
                                                                              (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                 | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                           )
                                                                           << 1
                                                                  )
                                                                  << 3
                                                         )
                                                         - 101
                                                      & 64512
                                                )
                                                >> 10
                                             | (
                                                      (
                                                               (
                                                                     (
                                                                              (
                                                                                    (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                       | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                                 )
                                                                                 & 32768
                                                                           )
                                                                           >> 15
                                                                        | (
                                                                              (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                 | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                           )
                                                                           << 1
                                                                  )
                                                                  & 57344
                                                            )
                                                            >> 13
                                                         | (
                                                               (
                                                                        (
                                                                              (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                                 | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                           )
                                                                           & 32768
                                                                     )
                                                                     >> 15
                                                                  | (
                                                                        (((var51 & 65534) >> 1 | var51 << 15) & 32768) >> 15
                                                                           | ((var51 & 65534) >> 1 | var51 << 15) << 1
                                                                     )
                                                                     << 1
                                                            )
                                                            << 3
                                                   )
                                                   - 101
                                                << 6
                                       )
                                       << 0
                              )
                              << 10
                     )
                     + 195
               )
            );
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_284.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = (441414116 >> -1671338375 | 0) & 176405280;
            var35 < var19.length();
            var35 += (2132622027 << (633782051 & -1032974024) | 0) & -2134719195
         ) {
            int var63 = ((var19.charAt(var35) ^ 'Y') + 160 ^ 218) + 118;
            char var64 = (char)(((((var63 & 32768) >> 15 | var63 << 1) ^ 170) - 237 ^ 250) - 172 ^ 243);
            var19.setCharAt(var35, (char)(((((var63 & 32768) >> 15 | var63 << 1) ^ 170) - 237 ^ 250) - 172 ^ 243));
         }

         Class var7 = Class.forName(var19.toString(), false, Class_284.class.getClassLoader());
         switch (((var4 ^ 1699940464) + 344443766 ^ 283205989 ^ 1101928392 ^ 1661744582) + 909136830 - 1213811396 - 577094500 - 52470184 ^ 435054028) {
            case 648412991:
               var10000 = var0.findSpecial(var7, var5, var6, Class_284.class);
               break;
            case 1111623853:
               var10000 = var0.findConstructor(var7, var6);
               break;
            case 1369352274:
            case 1837986689:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 1830755882:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_1077[((var10 - 1460176531 + 1389631661 ^ 395702458) + 2029395231 ^ 1893214869 ^ 1398236785 ^ 968634221 ^ 516281150) + 1772390686 - 1177236188] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1180(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = (((var10 - 1301236351 ^ 1151093986) - 1903452449 ^ 1379328771) - 302942492 - 969686742 ^ 1250218866 ^ 942720610) + 439051161;
      MethodHandle var10000 = field_1077[(((var10 - 1301236351 ^ 1151093986) - 1903452449 ^ 1379328771) - 302942492 - 969686742 ^ 1250218866 ^ 942720610)
         + 439051161
         - 1862992248];
      if (field_1077[var10001 - 1862992248] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = -1945976046 & -1726744251 ^ -2013085440; var24 < var14.length(); var24 += (109449740 >> -980633755 | 1) & 2059456335) {
            int var43 = var14.charAt(var24) - 156 - 7;
            int var10004 = (var43 & 57344) >> 13;
            int var44 = (var43 & 57344) >> 13 | var43 << 3;
            int var84 = (((var43 & 57344) >> 13 | var43 << 3) & 57344) >> 13;
            var43 = ((var10004 | var43 << 3) & 57344) >> 13 | ((var43 & 57344) >> 13 | var43 << 3) << 3;
            var10004 = ((var84 | var44 << 3) & 63488) >> 11;
            int var46 = (((var84 | var44 << 3) & 63488) >> 11 | var43 << 5) + 53 - 231 + 198 ^ 91;
            int var86 = (((((var84 | var44 << 3) & 63488) >> 11 | var43 << 5) + 53 - 231 + 198 ^ 91) & 65535) >> 0;
            char var47 = (char)(
               (((var10004 | var43 << 5) + 53 - 231 + 198 ^ 91) & 65535) >> 0
                  | ((((var84 | var44 << 3) & 63488) >> 11 | var43 << 5) + 53 - 231 + 198 ^ 91) << 16
            );
            var14.setCharAt(var24, (char)(var86 | var46 << 16));
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = -395005351 * -793588115 ^ 857050597; var30 < var17.length(); var30 += 1132278963 - 1132278963 ^ 1) {
            int var52 = var17.charAt(var30);
            int var87 = (var52 & 63488) >> 11;
            int var53 = (var52 & 63488) >> 11 | var52 << 5;
            int var88 = (((var52 & 63488) >> 11 | var52 << 5) & 64512) >> 10;
            var52 = ((var87 | var52 << 5) & 64512) >> 10 | ((var52 & 63488) >> 11 | var52 << 5) << 6;
            var87 = ((var88 | var53 << 6) & 49152) >> 14;
            int var55 = ((((var88 | var53 << 6) & 49152) >> 14 | var52 << 2) ^ 184) + 37 + 131 - 142 - 147;
            int var90 = (((((var88 | var53 << 6) & 49152) >> 14 | var52 << 2) ^ 184) + 37 + 131 - 142 - 147 & 65532) >> 2;
            char var56 = (char)(
               (
                     (((var87 | var52 << 2) ^ 184) + 37 + 131 - 142 - 147 & 65532) >> 2
                        | ((((var88 | var53 << 6) & 49152) >> 14 | var52 << 2) ^ 184) + 37 + 131 - 142 - 147 << 14
                  )
                  ^ 75
            );
            var17.setCharAt(var30, (char)((var90 | var55 << 14) ^ 75));
         }

         Class var6 = Class.forName(var17.toString(), false, Class_284.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = (-550890799 ^ 472230604 | 0) & 281018914; var36 < var20.length(); var36 += (-455387379 ^ 1699656082 | 1) & 33691905) {
            int var61 = var20.charAt(var36) - '\f' + 112 - 40;
            char var64 = (char)(
               (((((((var61 & 49152) >> 14 | var61 << 2) ^ 6) - 129 & 57344) >> 13 | (((var61 & 49152) >> 14 | var61 << 2) ^ 6) - 129 << 3) + 227 ^ 197) & 0)
                     >> 16
                  | ((((((var61 & 49152) >> 14 | var61 << 2) ^ 6) - 129 & 57344) >> 13 | (((var61 & 49152) >> 14 | var61 << 2) ^ 6) - 129 << 3) + 227 ^ 197)
                     << 0
            );
            var20.setCharAt(
               var36,
               (char)(
                  (((((((var61 & 49152) >> 14 | var61 << 2) ^ 6) - 129 & 57344) >> 13 | (((var61 & 49152) >> 14 | var61 << 2) ^ 6) - 129 << 3) + 227 ^ 197) & 0)
                        >> 16
                     | ((((((var61 & 49152) >> 14 | var61 << 2) ^ 6) - 129 & 57344) >> 13 | (((var61 & 49152) >> 14 | var61 << 2) ^ 6) - 129 << 3) + 227 ^ 197)
                        << 0
               )
            );
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_284.class.getClassLoader()).returnType();
         switch (((((var4 ^ 761454421) + 807732193 ^ 1319417514) - 1227982610 - 111983023 ^ 264100294) - 1489944167 ^ 322687237) - 400855244 + 1462830739) {
            case 259512871:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            case 1705464834:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            case 1799761985:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            case 1984929753:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_1077[(((var10 - 1301236351 ^ 1151093986) - 1903452449 ^ 1379328771) - 302942492 - 969686742 ^ 1250218866 ^ 942720610) + 439051161 - 1862992248] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }

   public static native void guard();
}
