import dev.krypton.mixin.MinecraftClientAccessor;
import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;
import net.minecraft.class_1792;
import net.minecraft.class_4174;

public class Class_316 extends Class_342 {
   // $VF: renamed from: ncr int
   public static int field_1822 = 60;
   // $VF: renamed from: vlp int
   public static int field_1823 = 10;
   // $VF: renamed from: nab Class_49
   public Class_49 field_1824;
   // $VF: renamed from: lzs Class_49
   public Class_49 field_1825;
   // $VF: renamed from: sjy boolean
   public boolean field_1826;
   // $VF: renamed from: dtk int
   public int field_1827;
   // $VF: renamed from: lsz int
   public int field_1828;
   // $VF: renamed from: wna int
   public int field_1829;
   // $VF: renamed from: dl int
   public int field_1830;
   // $VF: renamed from: oli java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_1831 = new MethodHandle[101];

   public Class_316() {
      int var10001 = (1888243539 >>> -1240134240 | 0) & -2091798388;

      StringBuilder var10002;
      for (var10002 = (StringBuilder)0<"JNT",-172786503,"깈繋칋繋⹌칈","ᑅ鑉呍둋푎둋瑅鑍둋푍瑌瑅\uf449鑎呎둌푍瑌\uf446둄푊","ﰆﮦ惘ﮦͧﱆﮦﮆ復ͧ\ufde6ᜧᛧ益ﮆ復ﴆᜇ益ﱆ牢臘ᛧ",-1570662983>("梜椄椂棸桚梤棜椂");
         var10001 < ((-253714645 ^ 1335968167 | 0) & 3940425);
         var10001 += -1970798186 ^ 310309295 ^ -1951546127 ^ 324744393
      ) {
         int var14 = 0<"JNT",919125442,"ṋ湋﹊์﹈⹌","ᑅ둈둄\uf447","ﰆﮦ惘ﮦͧﱆﮦﮆ復ͧ\ufde6ᜧᛧ益ﮆ復ﴆᜇ益ﱆ牢臘ᛧ",-1570662963>(var10002, var10001) - 27;
         char var17 = (char)(
            (((((var14 & 65024) >> 9 | var14 << 7) + 76 & 65504) >> 5 | ((var14 & 65024) >> 9 | var14 << 7) + 76 << 11) & 65528) >> 3
               | ((((var14 & 65024) >> 9 | var14 << 7) + 76 & 65504) >> 5 | ((var14 & 65024) >> 9 | var14 << 7) + 76 << 11) << 13
         );
         0<"JNT",919125442,"Ṍ㹋⹌ṉ湋﹊์﹈⹌","ᑅ둈\uf447둄푊","ﰆﮦ惘ﮦͧﱆﮦﮆ復ͧ\ufde6ᜧᛧ益ﮆ復ﴆᜇ益ﱆ牢臘ᛧ",-1570662980>(
            var10002,
            var10001,
            (char)(
               (((((var14 & 65024) >> 9 | var14 << 7) + 76 & 65504) >> 5 | ((var14 & 65024) >> 9 | var14 << 7) + 76 << 11) & 65528) >> 3
                  | ((((var14 & 65024) >> 9 | var14 << 7) + 76 & 65504) >> 5 | ((var14 & 65024) >> 9 | var14 << 7) + 76 << 11) << 13
            )
         );
      }

      String var2 = 0<"JNT",919125442,"⹌\ude4bṊ⹌์繋칋幋","ᑅ둄鑉呍둋푎둋瑅鑍둋푍瑌瑅\uf449鑎呎둌푍瑌\uf446","ﰆﮦ惘ﮦͧﱆﮦﮆ復ͧ\ufde6ᜧᛧ益ﮆ復ﴆᜇ益ﱆ牢臘ᛧ",-1570662973>(var10002);
      int var8 = 0;

      StringBuilder var19;
      for (var19 = (StringBuilder)0<"JNT",-172786503,"깈繋칋繋⹌칈","ᑅ鑉呍둋푎둋瑅鑍둋푍瑌瑅\uf449鑎呎둌푍瑌\uf446둄푊","ﰆﮦ惘ﮦͧﱆﮦﮆ復ͧ\ufde6ᜧᛧ益ﮆ復ﴆᜇ益ﱆ牢臘ᛧ",-1570662974>(
            "┴▆◜┴▼▾◜▾►◜◚┴◢◄▾◐▾◠▾◘┴◜◄▾┴◄◞◐◂▾◘▸▶◘╒◄▾▶◌◜◄┴◀▶◌◌◚┴▶┴►▾◘◜▶◆◐┴◜◄◘▾◚◄◒◌▼╌┴◚▾◌▾►◜◚┴◀◒◒▼┴◆◐┴◦◒◞◘┴◄◒◜▸▶◘╌┴▶◐▼┴◚◜▶◘◜◚┴▾▶◜◆◐◂═"
         );
         var8 < (-191267493 >> -71054389 - -191267493 ^ -2835);
         var8 += (2101346935 << (-318215677 >>> -318215677) | 1) & 34579841
      ) {
         char var34 = 0<"JNT",919125442,"ṋ湋﹊์﹈⹌","ᑅ둈둄\uf447","ﰆﮦ惘ﮦͧﱆﮦﮆ復ͧ\ufde6ᜧᛧ益ﮆ復ﴆᜇ益ﱆ牢臘ᛧ",-1570662984>(var19, var8);
         char var37 = (char)(
            (
                  ((((((var34 & '쀀') >> 14 | var34 << 2) & 64512) >> 10 | ((var34 & '쀀') >> 14 | var34 << 2) << 6) ^ 37) & 65024) >> 9
                     | (((((var34 & '쀀') >> 14 | var34 << 2) & 64512) >> 10 | ((var34 & '쀀') >> 14 | var34 << 2) << 6) ^ 37) << 7
               )
               + 6
         );
         0<"JNT",919125442,"Ṍ㹋⹌ṉ湋﹊์﹈⹌","ᑅ둈\uf447둄푊","ﰆﮦ惘ﮦͧﱆﮦﮆ復ͧ\ufde6ᜧᛧ益ﮆ復ﴆᜇ益ﱆ牢臘ᛧ",-1570662925>(
            var19,
            var8,
            (char)(
               (
                     ((((((var34 & '쀀') >> 14 | var34 << 2) & 64512) >> 10 | ((var34 & '쀀') >> 14 | var34 << 2) << 6) ^ 37) & 65024) >> 9
                        | (((((var34 & '쀀') >> 14 | var34 << 2) & 64512) >> 10 | ((var34 & '쀀') >> 14 | var34 << 2) << 6) ^ 37) << 7
                  )
                  + 6
            )
         );
      }

      super(
         var2,
         0<"JNT",919125442,"⹌\ude4bṊ⹌์繋칋幋","ᑅ둄鑉呍둋푎둋瑅鑍둋푍瑌瑅\uf449鑎呎둌푍瑌\uf446","ﰆﮦ惘ﮦͧﱆﮦﮆ復ͧ\ufde6ᜧᛧ益ﮆ復ﴆᜇ益ﱆ牢臘ᛧ",-1570662924>(var19),
         -1,
         1<"JNT",-1099472603,"ߴࠄߜ","₺ ","堒頒堛頦\ud820᠗",-453901615>()
      );
      var10001 = (1804451472 >> -442863641 | 0) & -819453952;

      for (var10002 = (StringBuilder)0<"JNT",-172786503,"깈繋칋繋⹌칈","ᑅ鑉呍둋푎둋瑅鑍둋푍瑌瑅\uf449鑎呎둌푍瑌\uf446둄푊","ﰆﮦ惘ﮦͧﱆﮦﮆ復ͧ\ufde6ᜧᛧ益ﮆ復ﴆᜇ益ﱆ牢臘ᛧ",-1570662930>(
            "\uf69cࣃःࡓ\uf7dc\u0893\uf51c\uf5dc\u0893࠳ࣃࠣ\u0893ࡣࡓ࣓"
         );
         var10001 < (-1555044683 - -1441351515 ^ -113693184);
         var10001 += (-1120747483 + -921642923 | 1) & 2039234689
      ) {
         char var22 = 0<"JNT",919125442,"ṋ湋﹊์﹈⹌","ᑅ둈둄\uf447","ﰆﮦ惘ﮦͧﱆﮦﮆ復ͧ\ufde6ᜧᛧ益ﮆ復ﴆᜇ益ﱆ牢臘ᛧ",-1570662926>(var10002, var10001);
         int var48 = (var22 & 'ﰀ') >> 10;
         int var23 = ((var22 & 'ﰀ') >> 10 | var22 << 6) ^ 194;
         int var49 = ((((var22 & 'ﰀ') >> 10 | var22 << 6) ^ 194) & 64512) >> 10;
         char var24 = (char)(((((var48 | var22 << 6) ^ 194) & 64512) >> 10 | (((var22 & 'ﰀ') >> 10 | var22 << 6) ^ 194) << 6) + 236 ^ 157);
         0<"JNT",919125442,"Ṍ㹋⹌ṉ湋﹊์﹈⹌","ᑅ둈\uf447둄푊","ﰆﮦ惘ﮦͧﱆﮦﮆ復ͧ\ufde6ᜧᛧ益ﮆ復ﴆᜇ益ﱆ牢臘ᛧ",-1570662939>(var10002, var10001, (char)((var49 | var23 << 6) + 236 ^ 157));
      }

      this.field_1824 = (Class_49)0<"JNT",-172786503,"깈繋칋繋⹌칈","ᑅ鑉呍둋푎둋瑅鑍둋푍瑌瑅\uf449鑎呎둌푍瑌\uf446鑈鑈鑈鑈둄푊","牢ﯦ",-1570662972>(
         0<"JNT",919125442,"⹌\ude4bṊ⹌์繋칋幋","ᑅ둄鑉呍둋푎둋瑅鑍둋푍瑌瑅\uf449鑎呎둌푍瑌\uf446","ﰆﮦ惘ﮦͧﱆﮦﮆ復ͧ\ufde6ᜧᛧ益ﮆ復ﴆᜇ益ﱆ牢臘ᛧ",-1570662987>(var10002), 0.0, 19.0, 17.0, 1.0
      );
      var10001 = 0;

      for (var10002 = (StringBuilder)0<"JNT",-172786503,"깈繋칋繋⹌칈","ᑅ鑉呍둋푎둋瑅鑍둋푍瑌瑅\uf449鑎呎둌푍瑌\uf446둄푊","ﰆﮦ惘ﮦͧﱆﮦﮆ復ͧ\ufde6ᜧᛧ益ﮆ復ﴆᜇ益ﱆ牢臘ᛧ",-1570662913>(
            "퇿篿淿鿿鯿旿Ǿ맿釿旿鯿柿釿濿槿駿"
         );
         var10001 < ((1706242083 >> 1679320334 | 16) & 388645171);
         var10001 += (1205717660 - 1205717660 | 1) & -1044586915
      ) {
         char var27 = 0<"JNT",919125442,"ṋ湋﹊์﹈⹌","ᑅ둈둄\uf447","ﰆﮦ惘ﮦͧﱆﮦﮆ復ͧ\ufde6ᜧᛧ益ﮆ復ﴆᜇ益ﱆ牢臘ᛧ",-1570662985>(var10002, var10001);
         int var50 = (var27 & '\uf000') >> 12;
         int var28 = (var27 & '\uf000') >> 12 | var27 << 4;
         int var51 = (((var27 & '\uf000') >> 12 | var27 << 4) & 57344) >> 13;
         char var29 = (char)(((((var50 | var27 << 4) & 57344) >> 13 | ((var27 & '\uf000') >> 12 | var27 << 4) << 3) ^ 116) + 118 + 54);
         0<"JNT",919125442,"Ṍ㹋⹌ṉ湋﹊์﹈⹌","ᑅ둈\uf447둄푊","ﰆﮦ惘ﮦͧﱆﮦﮆ復ͧ\ufde6ᜧᛧ益ﮆ復ﴆᜇ益ﱆ牢臘ᛧ",-1570662986>(
            var10002, var10001, (char)(((var51 | var28 << 3) ^ 116) + 118 + 54)
         );
      }

      this.field_1825 = (Class_49)0<"JNT",-172786503,"깈繋칋繋⹌칈","ᑅ鑉呍둋푎둋瑅鑍둋푍瑌瑅\uf449鑎呎둌푍瑌\uf446鑈鑈鑈鑈둄푊","牢ﯦ",-1570662975>(
         0<"JNT",919125442,"⹌\ude4bṊ⹌์繋칋幋","ᑅ둄鑉呍둋푎둋瑅鑍둋푍瑌瑅\uf449鑎呎둌푍瑌\uf446","ﰆﮦ惘ﮦͧﱆﮦﮆ復ͧ\ufde6ᜧᛧ益ﮆ復ﴆᜇ益ﱆ牢臘ᛧ",-1570662914>(var10002), 0.0, 19.0, 19.0, 1.0
      );
      0<"JNT",919125442,"﹋㹌","ᑅ\uf44a鑉둍㑌㑌\uf446둄푊","ᜧѧᝇ",-1570662982>(
         this, new Class_271[]{1<"JNT",-173142346,"\u074cބެ","ₒ•₪","堒頒堛堡ᠡ᠗",-453901612>(this), 1<"JNT",-173142346,"\u07bc߬ࠔ","ₒ•₪","堒頒堛堡ᠡ᠗",-453901603>(this)}
      );
   }

   // $VF: renamed from: mg () void
   @Override
   public void method_1407() {
      0<"JNT",262218403,"빋幋","ᑅ둄푊","ᜇ罹ѧ",-1570662927>(this);
   }

   // $VF: renamed from: q () void
   @Override
   public void method_1408() {
      0<"JNT",262218403,"﹋","ᑅ둄푊","ᜇ罹ѧ",-1570662928>(this);
      1<"JNT",42702088,"ࡴ\u074cބ","ₒ•₪","堒頒頚",-453901587>(this, 0);
      1<"JNT",42702088,"\u07fc\u07bc","ₒ•₪","堒頒頚",-453901586>(this, 0);
   }

   // $VF: renamed from: gd (Class_207) void
   @Class_21
   public void method_1606(Class_207 var1) {
      int var3 = 824658416;
      if (1<"JNT",-173142346,"\u07fc\u07bc","ₒ•₪","堒頒頚",-453901617>(this) > 0) {
         1<"JNT",42702088,"\u07fc\u07bc","ₒ•₪","堒頒頚",-453901007>(this, 1<"JNT",-173142346,"\u07fc\u07bc","ₒ•₪","堒頒頚",-453901624>(this) - 1);
      } else {
         var3 = (1764600944 << 1764600944 | 239661133) & 805303533;

         while (true) {
            switch ((var3 + 1815539031 + 1379792253 ^ 883355945 ^ 84692678) + 928156614 + 695754915) {
               case 1041389879:
                  if (1<"JNT",-173142346,"ࠔݬ߄","ₒ•₪","堒頒\ud81e",-453901019>(this)) {
                     1<"JNT",42702088,"ࡴ\u074cބ","ₒ•₪","堒頒頚",-453900993>(this, 1<"JNT",-173142346,"ࡴ\u074cބ","ₒ•₪","堒頒頚",-453901018>(this) + 1);
                     if (1<"JNT",-173142346,"ࡴ\u074cބ","ₒ•₪","堒頒頚",-453901000>(this) >= 60) {
                        0<"JNT",919125442,"鹋乌幋","ᑅ둄푊","ᜧѧᝇ",-1570662945>(this);
                        1<"JNT",42702088,"\u07fc\u07bc","ₒ•₪","堒頒頚",-453901038>(this, 10);
                        return;
                     }

                     var3 = 1746129121;
                  } else {
                     var3 = (1228286309 + -677953089 | 1444713394) & 2119997435;
                  }
                  continue;
               case 1715910098:
                  if (0<"JNT",919125442,"鹋蹌繋","ᑅ둄呋","ᜧѧᝇ",-1570662932>(this)) {
                     1<"JNT",42702088,"\u07fcࡼݔ","ₒ•₪","堒頒頚",-453901606>(this, 0<"JNT",919125442,"湋์","ᑅ둄둈","ᜧѧᝇ",-1570662937>(this));
                     if (1<"JNT",-173142346,"\u07fcࡼݔ","ₒ•₪","堒頒頚",-453901629>(this) != -1) {
                        0<"JNT",919125442,"﹋㹌㹌幌","ᑅ둄푊","ᜧѧᝇ",-1570662936>(this);
                     }
                  }
                  break;
               case 1933819954:
                  0<"JNT",919125442,"鹋乌幋","ᑅ둄푊","ᜧѧᝇ",-1570662958>(this);
                  break;
               case 1970693795:
                  return;
               case 2006535932:
                  0<"JNT",919125442,"์์Ṍ","ᑅ둄푊","ᜧѧᝇ",-1570662915>(this);
                  break;
               case 2012018883:
               default:
                  if (0<"JNT",919125442,"鹋蹌繋","ᑅ둄呋","ᜧѧᝇ",-1570663136>(this)) {
                     if (0<"JNT",919125442,"빋㹋⹌湋\ude4b⹋\ude4a㹈湈么繈⹈","ᑅ鑉푍㑌鑎瑅㑍둌푍㑌\uf44b呎둋푌鑎瑅\uf44b鑍둋\uf44d\uf44d瑋둆\uf445\uf445둅\uf446둄鑉呍둋푎둋瑅鑍둋푍瑌瑅瑉呌呍㑌\uf44b鑎\uf446","ﮆ臘ᜧͧﰦ益ﮆ臘ﯦᛧﮦѧᜧͧﯦﱆﮦ罹罹﹦Ƈｇ\u0087\u0087",-1570663143>(
                           0<"JNT",919125442,"빋㹋⹌湋\ude4b⹋\ude4a㹈⹈Ṉ湈","ᑅ둈둄鑉푍㑌鑎瑅㑍둌푍㑌\uf44b呎둋푌鑎瑅\uf44b鑍둋\uf44d\uf44d瑋둅瑆둆둆\uf446","ﮆ臘ᜧͧﰦ益ﮆ臘ﯦᛧﮦѧᜧͧﯦﱆﮦ罹罹﹦ƇɧɧƇ",-1570663145>(
                              0<"JNT",919125442,"빋㹋⹌湋\ude4b⹋\ude4aṈ﹇㹈⹈湈","ᑅ둄鑉푍㑌鑎瑅㑍둌푍㑌\uf44b呎둋푌鑎瑅\uf44b鑍둋\uf44d\uf44d瑋둅푆푆둅\uf446","ﮆ臘ᜧͧﰦ益ﮆ臘ﯦᛧﮦѧᜧͧﯦﱆﮦ罹罹﹦ｇｆɧ",-1570663123>(
                                 1<"JNT",-173142346,"ތ݄ߤ\u07bc\u07fcܴȄɴȬɼ","\u2062‚ₒ㹪⁚›\u2062‚ ₂。•ₒ㹪 ⁒。₊₊㿲㺒㺂㹺","堒頒堛\ud823頡堥᠔頣頢\ud823頡ᠡ\ud824頠\ud821堥᠔ᠡ堣頠ᠥᠥᠠ᠖堕\ud815᠗",-453900994>(
                                    1<"JNT",-173142346,"\u07bcࠬ","ₒ•₪","堒頒堛\ud823頡堥᠔頣頢\ud823頡ᠡ\ud824頠\ud821堥᠔ᠡ堣頠ᠥᠥᠠ᠕頔堔᠗",-453900995>(this)
                                 )
                              ),
                              1<"JNT",-173142346,"\u07fcࡼݔ","ₒ•₪","堒頒頚",-453901008>(this)
                           ),
                           1<"JNT",-1099472603,"ތ݄ߤ\u07bc\u07fcܴɤȜȜɴɤ","\u2062‚ₒ㹪⁚›\u2062‚ ₂。•ₒ㹪 ⁒。₊₊㿲㻂㺒㺒㺚","堒頒堛\ud823頡堥᠔頣頢\ud823頡ᠡ\ud824頠\ud821堥᠔ᠡ堣頠ᠥᠥᠠ頖᠕᠕頔᠗",-453901014>()
                        )
                        != null) {
                        int var2 = 0<"JNT",919125442,"湋์","ᑅ둄둈","ᜧѧᝇ",-1570663144>(this);
                        if (var2 == -1) {
                           0<"JNT",919125442,"鹋乌幋","ᑅ둄푊","ᜧѧᝇ",-1570662957>(this);
                           return;
                        }

                        0<"JNT",919125442,"⹌湌繋","ᑅ둈둄푊","ᜧѧᝇ",-1570663135>(this, var2);
                     }

                     var3 = (-2128050988 + -803875472 | 1760541352) & 1794113210;
                  } else {
                     var3 = (-1725245837 & -1725245837 - -1725245837 | 1700628818) & -41969162;
                  }
                  continue;
            }

            var3 = 1720509185;
         }
      }
   }

   // $VF: renamed from: kzi () boolean
   public boolean method_1607() {
      int var3 = -253984093;
      boolean var1 = 0<"JNT",919125442,"빋㹋⹌湋\ude4b⹋\ude4a么\uee47Ṉ่","ᑅ둄푈","ﮆ臘ᜧͧﰦ益ﮆ臘ﯦᛧﮦѧᜧͧﯦﱆﮦ罹罹﹦ｇｆɧ",-1570662965>(
            1<"JNT",-173142346,"ތ݄ߤ\u07bc\u07fcܴȄɴȬɼ","\u2062‚ₒ㹪⁚›\u2062‚ ₂。•ₒ㹪 ⁒。₊₊㿲㺒㺂㹺","堒頒堛\ud823頡堥᠔頣頢\ud823頡ᠡ\ud824頠\ud821堥᠔ᠡ堣頠ᠥᠥᠠ᠖堕\ud815᠗",-453901052>(
               1<"JNT",-173142346,"\u07bcࠬ","ₒ•₪","堒頒堛\ud823頡堥᠔頣頢\ud823頡ᠡ\ud824頠\ud821堥᠔ᠡ堣頠ᠥᠥᠠ᠕頔堔᠗",-453901045>(this)
            )
         )
         <= (float)0<"JNT",919125442,"之蹌幋","ᑅ둄둈","牢ﯦ",-1570662947>(1<"JNT",-173142346,"\u074cބެ","ₒ•₪","堒頒堛堡ᠡ᠗",-453901618>(this));
      boolean var2 = 0<"JNT",919125442,"빋㹋⹌湋\ude4b⹋\ude4a幈㹈湈么","ᑅ둄둈","ﮆ臘ᜧͧﰦ益ﮆ臘ﯦᛧﮦѧᜧͧﯦﱆﮦ罹罹﹦ƇｇƧ＆",-1570662967>(
            0<"JNT",919125442,"빋㹋⹌湋\ude4b⹋\ude4a幈Ṉ⹈⹈","ᑅ둄鑉푍㑌鑎瑅㑍둌푍㑌\uf44b呎둋푌鑎瑅\uf44b鑍둋\uf44d\uf44d瑋둅瑆ᑆ呆\uf446","ﮆ臘ᜧͧﰦ益ﮆ臘ﯦᛧﮦѧᜧͧﯦﱆﮦ罹罹﹦ｇｆɧ",-1570662970>(
               1<"JNT",-173142346,"ތ݄ߤ\u07bc\u07fcܴȄɴȬɼ","\u2062‚ₒ㹪⁚›\u2062‚ ₂。•ₒ㹪 ⁒。₊₊㿲㺒㺂㹺","堒頒堛\ud823頡堥᠔頣頢\ud823頡ᠡ\ud824頠\ud821堥᠔ᠡ堣頠ᠥᠥᠠ᠖堕\ud815᠗",-453901623>(
                  1<"JNT",-173142346,"\u07bcࠬ","ₒ•₪","堒頒堛\ud823頡堥᠔頣頢\ud823頡ᠡ\ud824頠\ud821堥᠔ᠡ堣頠ᠥᠥᠠ᠕頔堔᠗",-453901632>(this)
               )
            )
         )
         <= 0<"JNT",919125442,"之蹌幋","ᑅ둄둈","牢ﯦ",-1570663037>(1<"JNT",-173142346,"\u07bc߬ࠔ","ₒ•₪","堒頒堛堡ᠡ᠗",-453900996>(this));
      if (0<"JNT",919125442,"湋์","ᑅ둄둈","ᜧѧᝇ",-1570662962>(this) == -1 || !var1 && !var2) {
         var3 = -10481 & 2055001887;
      } else {
         var3 = 163889370;
      }
      return switch ((var3 ^ 165532015) + 1864415924 - 852918243 + 1091441116 + 13091430 ^ 817873467) {
         default -> false;
         case 1317462771 -> true;
      };
   }

   // $VF: renamed from: hr () int
   public int method_1608() {
      int var7 = 1097443799;
      int var1 = -1;
      int var2 = -1;
      int var3 = 0;

      label29:
      while (true) {
         var7 = 1640734044;

         while (true) {
            switch ((var7 - 244472669 - 672591398 ^ 105168407) + 360347301 - 376810479 - 2013849957) {
               case -1268592865:
                  if (var3 < 9) {
                     class_1792 var4 = 0<"JNT",919125442,"빋㹋⹌湋\ude4b⹋\ude4a幈繈\uee47繈","ᑅ둄鑉푍㑌鑎瑅㑍둌푍㑌\uf44b呎둋푌鑎瑅\uf44b鑍둋\uf44d\uf44d瑋둅瑆둆呆\uf446","ﮆ臘ᜧͧﰦ益ﮆ臘ﯦᛧﮦѧᜧͧﯦﱆﮦ罹罹﹦Ƈｇ\u0087\u0087",-1570662978>(
                        0<"JNT",919125442,"빋㹋⹌湋\ude4b⹋\ude4a㹈⹈Ṉ湈","ᑅ둈둄鑉푍㑌鑎瑅㑍둌푍㑌\uf44b呎둋푌鑎瑅\uf44b鑍둋\uf44d\uf44d瑋둅瑆둆둆\uf446","ﮆ臘ᜧͧﰦ益ﮆ臘ﯦᛧﮦѧᜧͧﯦﱆﮦ罹罹﹦ƇɧɧƇ",-1570662977>(
                           0<"JNT",919125442,"빋㹋⹌湋\ude4b⹋\ude4aṈ﹇㹈⹈湈","ᑅ둄鑉푍㑌鑎瑅㑍둌푍㑌\uf44b呎둋푌鑎瑅\uf44b鑍둋\uf44d\uf44d瑋둅푆푆둅\uf446","ﮆ臘ᜧͧﰦ益ﮆ臘ﯦᛧﮦѧᜧͧﯦﱆﮦ罹罹﹦ｇｆɧ",-1570663036>(
                              1<"JNT",-173142346,"ތ݄ߤ\u07bc\u07fcܴȄɴȬɼ","\u2062‚ₒ㹪⁚›\u2062‚ ₂。•ₒ㹪 ⁒。₊₊㿲㺒㺂㹺","堒頒堛\ud823頡堥᠔頣頢\ud823頡ᠡ\ud824頠\ud821堥᠔ᠡ堣頠ᠥᠥᠠ᠖堕\ud815᠗",-453901025>(
                                 1<"JNT",-173142346,"\u07bcࠬ","ₒ•₪","堒頒堛\ud823頡堥᠔頣頢\ud823頡ᠡ\ud824頠\ud821堥᠔ᠡ堣頠ᠥᠥᠠ᠕頔堔᠗",-453901050>(this)
                              )
                           ),
                           var3
                        )
                     );
                     class_4174 var5 = (class_4174)0<"JNT",1363456409,"빋㹋⹌湋\ude4b⹋\ude4a㹈湈么繈⹈","ᑅ鑉푍㑌鑎瑅㑍둌푍㑌\uf44b呎둋푌鑎瑅\uf44b鑍둋\uf44d\uf44d瑋둆\uf445\uf445둅\uf446둄鑉呍둋푎둋瑅鑍둋푍瑌瑅瑉呌呍㑌\uf44b鑎\uf446","ﮆ臘ᜧͧﰦ益ﮆ臘ﯦᛧﮦѧᜧͧﯦﱆﮦ罹罹﹦\u0087Ǉ＆Ǉ",-1570663045>(
                        0<"JNT",919125442,"빋㹋⹌湋\ude4b⹋\ude4a㹈幈Ṉ⹈幈","ᑅ둄鑉푍㑌鑎瑅㑍둌푍㑌\uf44b呎둋푌鑎瑅\uf44b鑍둋\uf44d\uf44d瑋둆\uf445呆\uf445\uf446","ﮆ臘ᜧͧﰦ益ﮆ臘ﯦᛧﮦѧᜧͧﯦﱆﮦ罹罹﹦Ƈｇ\u0087＆",-1570663039>(
                           var4
                        ),
                        1<"JNT",-1099472603,"ތ݄ߤ\u07bc\u07fcܴɤȜȜɴɤ","\u2062‚ₒ㹪⁚›\u2062‚ ₂。•ₒ㹪 ⁒。₊₊㿲㻂㺒㺒㺚","堒頒堛\ud823頡堥᠔頣頢\ud823頡ᠡ\ud824頠\ud821堥᠔ᠡ堣頠ᠥᠥᠠ頖᠕᠕頔᠗",-453901036>()
                     );
                     if (var5 != null) {
                        int var6 = 0<"JNT",919125442,"ṋ\ude4b빋\uee4b\ude4a่⹈繈﹇","ᑅ둄둈","ﮆ臘ᜧͧﰦ益ﮆ臘ﯦᛧﮦѧᜧͧﯦﱆﮦ罹罹﹦ｆƇｇｆ",-1570663046>(var5);
                        if (var6 > var2) {
                           var1 = var3;
                           var2 = var6;
                        }
                     }

                     var3++;
                     continue label29;
                  }

                  var7 = -1374326705;
                  break;
               case -131827156:
               default:
                  return var1;
            }
         }
      }
   }

   public void quuw() {
      1<"JNT",42702088,"\u07bcࠔ߬","ₒ•₪","堒頒頚",-453900941>(
         this,
         0<"JNT",919125442,"빋㹋⹌湋\ude4b⹋\ude4a么幈㹈Ṉ่","ᑅ둄둈","ﮆ臘ᜧͧﰦ益ﮆ臘ﯦᛧﮦѧᜧͧﯦﱆﮦ罹罹﹦ƇɧɧƇ",-1570663050>(
            0<"JNT",919125442,"빋㹋⹌湋\ude4b⹋\ude4aṈ﹇㹈⹈湈","ᑅ둄鑉푍㑌鑎瑅㑍둌푍㑌\uf44b呎둋푌鑎瑅\uf44b鑍둋\uf44d\uf44d瑋둅푆푆둅\uf446","ﮆ臘ᜧͧﰦ益ﮆ臘ﯦᛧﮦѧᜧͧﯦﱆﮦ罹罹﹦ｇｆɧ",-1570663049>(
               1<"JNT",-173142346,"ތ݄ߤ\u07bc\u07fcܴȄɴȬɼ","\u2062‚ₒ㹪⁚›\u2062‚ ₂。•ₒ㹪 ⁒。₊₊㿲㺒㺂㹺","堒頒堛\ud823頡堥᠔頣頢\ud823頡ᠡ\ud824頠\ud821堥᠔ᠡ堣頠ᠥᠥᠠ᠖堕\ud815᠗",-453901040>(
                  1<"JNT",-173142346,"\u07bcࠬ","ₒ•₪","堒頒堛\ud823頡堥᠔頣頢\ud823頡ᠡ\ud824頠\ud821堥᠔ᠡ堣頠ᠥᠥᠠ᠕頔堔᠗",-453901033>(this)
               )
            )
         )
      );
      1<"JNT",42702088,"ࡴ\u074cބ","ₒ•₪","堒頒頚",-453901044>(this, 0);
      0<"JNT",919125442,"์์Ṍ","ᑅ둄푊","ᜧѧᝇ",-1570662989>(this);
   }

   // $VF: renamed from: rrs () void
   public void method_1609() {
      0<"JNT",919125442,"⹌湌繋","ᑅ둈둄푊","ᜧѧᝇ",-1570662988>(this, 1<"JNT",-173142346,"\u07fcࡼݔ","ₒ•₪","堒頒頚",-453901009>(this));
      0<"JNT",919125442,"๋Ṍ⹋Ṍ","ᑅ呋둄푊","ᜧѧᝇ",-1570662993>(this, true);
      if (!0<"JNT",919125442,"빋㹋⹌湋\ude4b⹋\ude4a么﹇﹇㹈","ᑅ둄呋","ﮆ臘ᜧͧﰦ益ﮆ臘ﯦᛧﮦѧᜧͧﯦﱆﮦ罹罹﹦ｇｆɧ",-1570662992>(
         1<"JNT",-173142346,"ތ݄ߤ\u07bc\u07fcܴȄɴȬɼ","\u2062‚ₒ㹪⁚›\u2062‚ ₂。•ₒ㹪 ⁒。₊₊㿲㺒㺂㹺","堒頒堛\ud823頡堥᠔頣頢\ud823頡ᠡ\ud824頠\ud821堥᠔ᠡ堣頠ᠥᠥᠠ᠖堕\ud815᠗",-453901717>(
            1<"JNT",-173142346,"\u07bcࠬ","ₒ•₪","堒頒堛\ud823頡堥᠔頣頢\ud823頡ᠡ\ud824頠\ud821堥᠔ᠡ堣頠ᠥᠥᠠ᠕頔堔᠗",-453901054>(this)
         )
      )) {
         0<"JNT",1363456409,"繋칋乌\ude4b鹋㹋⹉\ude4b繉⹌㹋빋㹊Ṍ㹋","ᑅ둄푊","牢臘惘ͧ\ufae6ᛧ\uf8a6阮ᜧﱦﮆͧﰦ益\uf8c6益ﮆͧ\u0007益ﮆ臘ﯦᛧﮦѧᜧￇﱆ益臘ﮆᜧﾇﯦﯦ臘罹罹ﱦᛧ",-1570662998>(
            (MinecraftClientAccessor)1<"JNT",-173142346,"\u07bcࠬ","ₒ•₪","堒頒堛\ud823頡堥᠔頣頢\ud823頡ᠡ\ud824頠\ud821堥᠔ᠡ堣頠ᠥᠥᠠ᠕頔堔᠗",-453901011>(this)
         );
      }

      1<"JNT",42702088,"ࠔݬ߄","ₒ•₪","堒頒\ud81e",-453901034>(this, true);
   }

   // $VF: renamed from: kvg () void
   public void method_1610() {
      0<"JNT",919125442,"⹌湌繋","ᑅ둈둄푊","ᜧѧᝇ",-1570662996>(this, 1<"JNT",-173142346,"\u07bcࠔ߬","ₒ•₪","堒頒頚",-453901017>(this));
      0<"JNT",919125442,"๋Ṍ⹋Ṍ","ᑅ呋둄푊","ᜧѧᝇ",-1570663001>(this, false);
      1<"JNT",42702088,"ࠔݬ߄","ₒ•₪","堒頒\ud81e",-453901030>(this, false);
      1<"JNT",42702088,"ࡴ\u074cބ","ₒ•₪","堒頒頚",-453901053>(this, 0);
   }

   public void bsds(boolean var1) {
      0<"JNT",919125442,"빋㹋⹌湋\ude4b⹋\ude4a่Ṉ⹈湈﹇","ᑅ呋둄푊","ﮆ臘ᜧͧﰦ益ﮆ臘ﯦᛧﮦѧᜧͧﯦﱆﮦ罹罹﹦ǇƧｆ",-1570662955>(
         1<"JNT",-173142346,"ތ݄ߤ\u07bc\u07fcܴȄǄȜɼ","\u2062‚ₒ㹪⁚›\u2062‚ ₂。•ₒ㹪 ⁒。₊₊㿲㺒㺂㺢","堒頒堛\ud823頡堥᠔頣頢\ud823頡ᠡ\ud824頠\ud821堥᠔ᠡ堣頠ᠥᠥᠠ᠕堔堕᠗",-453901722>(
            1<"JNT",-173142346,"ތ݄ߤ\u07bc\u07fcܴȄȌǄȜ","\u2062‚ₒ㹪⁚›\u2062‚ ₂。•ₒ㹪 ⁒。₊₊㿲㺒㺂㹺","堒頒堛\ud823頡堥᠔頣頢\ud823頡ᠡ\ud824頠\ud821堥᠔ᠡ堣頠ᠥᠥᠠ᠕頔頕᠗",-453901723>(
               1<"JNT",-173142346,"\u07bcࠬ","ₒ•₪","堒頒堛\ud823頡堥᠔頣頢\ud823頡ᠡ\ud824頠\ud821堥᠔ᠡ堣頠ᠥᠥᠠ᠕頔堔᠗",-453901028>(this)
            )
         ),
         var1
      );
   }

   // $VF: renamed from: txi (int) void
   public void method_1611(int var1) {
      0<"JNT",-370394910,"乌⹌蹋","ᑅ둈둄푊","陼",-1570662940>(var1);
      1<"JNT",42702088,"\u07fcࡼݔ","ₒ•₪","堒頒頚",-453901727>(this, var1);
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1413(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 + 622949435 ^ 291124047 ^ 2078902881 ^ 2100936409) + 209076275 ^ 1792602017) + 53661887 + 1304961779 + 859372892;
      MethodHandle var10000 = field_1831[((var10 + 622949435 ^ 291124047 ^ 2078902881 ^ 2100936409) + 209076275 ^ 1792602017)
            + 53661887
            + 1304961779
            + 859372892
         ^ 987468459];
      if (field_1831[var10001 ^ 987468459] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = (-1164024946 - -1164024946 | 0) & -1606954049; var23 < var13.length(); var23 += -688618436 ^ 181401582 ^ -600083501) {
            int var42 = var13.charAt(var23) + 'F' + 174 - 236 + 179;
            char var45 = (char)(
               (((((var42 & 65534) >> 1 | var42 << 15) & 65408) >> 7 | ((var42 & 65534) >> 1 | var42 << 15) << 9) + 193 - 15 - 161 & 65520) >> 4
                  | ((((var42 & 65534) >> 1 | var42 << 15) & 65408) >> 7 | ((var42 & 65534) >> 1 | var42 << 15) << 9) + 193 - 15 - 161 << 12
            );
            var13.setCharAt(
               var23,
               (char)(
                  (((((var42 & 65534) >> 1 | var42 << 15) & 65408) >> 7 | ((var42 & 65534) >> 1 | var42 << 15) << 9) + 193 - 15 - 161 & 65520) >> 4
                     | ((((var42 & 65534) >> 1 | var42 << 15) & 65408) >> 7 | ((var42 & 65534) >> 1 | var42 << 15) << 9) + 193 - 15 - 161 << 12
               )
            );
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = (-1693463381 ^ 1365648339 | 0) & 562299010; var29 < var16.length(); var29 += 1026216715 << 1026216715 ^ 1452824577) {
            int var50 = var16.charAt(var29);
            int var81 = (var50 & 65472) >> 6;
            int var51 = (((var50 & 65472) >> 6 | var50 << 10) + 67 + 191 - 121 ^ 247) + 165 ^ 210;
            int var82 = (((((var50 & 65472) >> 6 | var50 << 10) + 67 + 191 - 121 ^ 247) + 165 ^ 210) & 65520) >> 4;
            var50 = ((((var81 | var50 << 10) + 67 + 191 - 121 ^ 247) + 165 ^ 210) & 65520) >> 4
               | ((((var50 & 65472) >> 6 | var50 << 10) + 67 + 191 - 121 ^ 247) + 165 ^ 210) << 12;
            var81 = ((var82 | var51 << 12) & 65535) >> 0;
            int var53 = ((var82 | var51 << 12) & 65535) >> 0 | var50 << 16;
            int var84 = ((((var82 | var51 << 12) & 65535) >> 0 | var50 << 16) & 65528) >> 3;
            char var54 = (char)(((var81 | var50 << 16) & 65528) >> 3 | (((var82 | var51 << 12) & 65535) >> 0 | var50 << 16) << 13);
            var16.setCharAt(var29, (char)(var84 | var53 << 13));
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_316.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = 430332887 - 969942481 ^ -539609594; var35 < var19.length(); var35 += (1062146728 << -1224657764 | 1) & 1344850021) {
            int var59 = var19.charAt(var35) + 185;
            int var85 = (var59 & 65532) >> 2;
            int var60 = (var59 & 65532) >> 2 | var59 << 14;
            int var86 = (((var59 & 65532) >> 2 | var59 << 14) & 65528) >> 3;
            char var61 = (char)((((((var85 | var59 << 14) & 65528) >> 3 | ((var59 & 65532) >> 2 | var59 << 14) << 13) - 201 ^ 116) + 188 ^ 47) + 65 ^ 188 ^ 154);
            var19.setCharAt(var35, (char)((((var86 | var60 << 13) - 201 ^ 116) + 188 ^ 47) + 65 ^ 188 ^ 154));
         }

         Class var7 = Class.forName(var19.toString(), false, Class_316.class.getClassLoader());
         switch ((((var4 ^ 251186228) + 1992925557 ^ 1353695099) + 1949343047 ^ 733339183 ^ 1499485271) - 353512551 + 309631390 + 1800950361 + 320597320) {
            case 73819312:
            case 2083155975:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 1611967888:
               var10000 = var0.findConstructor(var7, var6);
               break;
            case 1782576030:
               var10000 = var0.findSpecial(var7, var5, var6, Class_316.class);
               break;
            case 1867184359:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_1831[((var10 + 622949435 ^ 291124047 ^ 2078902881 ^ 2100936409) + 209076275 ^ 1792602017) + 53661887 + 1304961779 + 859372892 ^ 987468459] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1414(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = ((((var10 ^ 29673779) - 1378557710 + 91622532 ^ 1868887559) - 780863939 ^ 1451097979) - 1571476594 ^ 669043477) - 723405694;
      MethodHandle var10000 = field_1831[((((var10 ^ 29673779) - 1378557710 + 91622532 ^ 1868887559) - 780863939 ^ 1451097979) - 1571476594 ^ 669043477)
            - 723405694
         ^ 998105590];
      if (field_1831[var10001 ^ 998105590] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = (-703713943 >> -1533022063 | 0) & 5344; var24 < var14.length(); var24 += (-300801070 | -300801070 | 1) & 277206025) {
            int var43 = var14.charAt(var24) + 216 - 176;
            int var10004 = (var43 & 65532) >> 2;
            int var44 = (((var43 & 65532) >> 2 | var43 << 14) + 162 + 32 - 253 ^ 141) - 103;
            int var92 = ((((var43 & 65532) >> 2 | var43 << 14) + 162 + 32 - 253 ^ 141) - 103 & 65534) >> 1;
            char var45 = (char)(
               (
                     (((var10004 | var43 << 14) + 162 + 32 - 253 ^ 141) - 103 & 65534) >> 1
                        | (((var43 & 65532) >> 2 | var43 << 14) + 162 + 32 - 253 ^ 141) - 103 << 15
                  )
                  ^ 10
            );
            var14.setCharAt(var24, (char)((var92 | var44 << 15) ^ 10));
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = -1353145440 >>> (1439803819 | 1032196704) ^ 1436436; var30 < var17.length(); var30 += (1084323928 | 1014708588) ^ 2096855421) {
            char var50 = var17.charAt(var30);
            char var57 = (char)(
               (
                     (
                              (
                                    (
                                             (
                                                   (
                                                            (
                                                                     (
                                                                              (
                                                                                    (
                                                                                             (
                                                                                                   (
                                                                                                         (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488)
                                                                                                               >> 11
                                                                                                            | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                                      )
                                                                                                      ^ 17
                                                                                                )
                                                                                                & 65408
                                                                                          )
                                                                                          >> 7
                                                                                       | (
                                                                                             (
                                                                                                   (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                                      | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                                )
                                                                                                ^ 17
                                                                                          )
                                                                                          << 9
                                                                                 )
                                                                                 & 65024
                                                                           )
                                                                           >> 9
                                                                        | (
                                                                              (
                                                                                       (
                                                                                             (
                                                                                                   (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                                      | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                                )
                                                                                                ^ 17
                                                                                          )
                                                                                          & 65408
                                                                                    )
                                                                                    >> 7
                                                                                 | (
                                                                                       (
                                                                                             (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                                | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                          )
                                                                                          ^ 17
                                                                                    )
                                                                                    << 9
                                                                           )
                                                                           << 7
                                                                  )
                                                                  - 51
                                                               & 0
                                                         )
                                                         >> 16
                                                      | (
                                                               (
                                                                        (
                                                                              (
                                                                                       (
                                                                                             (
                                                                                                   (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                                      | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                                )
                                                                                                ^ 17
                                                                                          )
                                                                                          & 65408
                                                                                    )
                                                                                    >> 7
                                                                                 | (
                                                                                       (
                                                                                             (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                                | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                          )
                                                                                          ^ 17
                                                                                    )
                                                                                    << 9
                                                                           )
                                                                           & 65024
                                                                     )
                                                                     >> 9
                                                                  | (
                                                                        (
                                                                                 (
                                                                                       (
                                                                                             (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                                | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                          )
                                                                                          ^ 17
                                                                                    )
                                                                                    & 65408
                                                                              )
                                                                              >> 7
                                                                           | (
                                                                                 (
                                                                                       (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                          | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                    )
                                                                                    ^ 17
                                                                              )
                                                                              << 9
                                                                     )
                                                                     << 7
                                                            )
                                                            - 51
                                                         << 0
                                                )
                                                & 65520
                                          )
                                          >> 4
                                       | (
                                             (
                                                      (
                                                               (
                                                                        (
                                                                              (
                                                                                       (
                                                                                             (
                                                                                                   (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                                      | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                                )
                                                                                                ^ 17
                                                                                          )
                                                                                          & 65408
                                                                                    )
                                                                                    >> 7
                                                                                 | (
                                                                                       (
                                                                                             (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                                | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                          )
                                                                                          ^ 17
                                                                                    )
                                                                                    << 9
                                                                           )
                                                                           & 65024
                                                                     )
                                                                     >> 9
                                                                  | (
                                                                        (
                                                                                 (
                                                                                       (
                                                                                             (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                                | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                          )
                                                                                          ^ 17
                                                                                    )
                                                                                    & 65408
                                                                              )
                                                                              >> 7
                                                                           | (
                                                                                 (
                                                                                       (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                          | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                    )
                                                                                    ^ 17
                                                                              )
                                                                              << 9
                                                                     )
                                                                     << 7
                                                            )
                                                            - 51
                                                         & 0
                                                   )
                                                   >> 16
                                                | (
                                                         (
                                                                  (
                                                                        (
                                                                                 (
                                                                                       (
                                                                                             (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                                | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                          )
                                                                                          ^ 17
                                                                                    )
                                                                                    & 65408
                                                                              )
                                                                              >> 7
                                                                           | (
                                                                                 (
                                                                                       (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                          | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                    )
                                                                                    ^ 17
                                                                              )
                                                                              << 9
                                                                     )
                                                                     & 65024
                                                               )
                                                               >> 9
                                                            | (
                                                                  (
                                                                           (
                                                                                 (
                                                                                       (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                          | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                    )
                                                                                    ^ 17
                                                                              )
                                                                              & 65408
                                                                        )
                                                                        >> 7
                                                                     | (
                                                                           (
                                                                                 (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                    | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                              )
                                                                              ^ 17
                                                                        )
                                                                        << 9
                                                               )
                                                               << 7
                                                      )
                                                      - 51
                                                   << 0
                                          )
                                          << 12
                                 )
                                 & 65528
                           )
                           >> 3
                        | (
                              (
                                       (
                                             (
                                                      (
                                                               (
                                                                        (
                                                                              (
                                                                                       (
                                                                                             (
                                                                                                   (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                                      | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                                )
                                                                                                ^ 17
                                                                                          )
                                                                                          & 65408
                                                                                    )
                                                                                    >> 7
                                                                                 | (
                                                                                       (
                                                                                             (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                                | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                          )
                                                                                          ^ 17
                                                                                    )
                                                                                    << 9
                                                                           )
                                                                           & 65024
                                                                     )
                                                                     >> 9
                                                                  | (
                                                                        (
                                                                                 (
                                                                                       (
                                                                                             (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                                | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                          )
                                                                                          ^ 17
                                                                                    )
                                                                                    & 65408
                                                                              )
                                                                              >> 7
                                                                           | (
                                                                                 (
                                                                                       (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                          | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                    )
                                                                                    ^ 17
                                                                              )
                                                                              << 9
                                                                     )
                                                                     << 7
                                                            )
                                                            - 51
                                                         & 0
                                                   )
                                                   >> 16
                                                | (
                                                         (
                                                                  (
                                                                        (
                                                                                 (
                                                                                       (
                                                                                             (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                                | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                          )
                                                                                          ^ 17
                                                                                    )
                                                                                    & 65408
                                                                              )
                                                                              >> 7
                                                                           | (
                                                                                 (
                                                                                       (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                          | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                    )
                                                                                    ^ 17
                                                                              )
                                                                              << 9
                                                                     )
                                                                     & 65024
                                                               )
                                                               >> 9
                                                            | (
                                                                  (
                                                                           (
                                                                                 (
                                                                                       (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                          | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                    )
                                                                                    ^ 17
                                                                              )
                                                                              & 65408
                                                                        )
                                                                        >> 7
                                                                     | (
                                                                           (
                                                                                 (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                    | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                              )
                                                                              ^ 17
                                                                        )
                                                                        << 9
                                                               )
                                                               << 7
                                                      )
                                                      - 51
                                                   << 0
                                          )
                                          & 65520
                                    )
                                    >> 4
                                 | (
                                       (
                                                (
                                                         (
                                                                  (
                                                                        (
                                                                                 (
                                                                                       (
                                                                                             (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                                | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                          )
                                                                                          ^ 17
                                                                                    )
                                                                                    & 65408
                                                                              )
                                                                              >> 7
                                                                           | (
                                                                                 (
                                                                                       (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                          | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                    )
                                                                                    ^ 17
                                                                              )
                                                                              << 9
                                                                     )
                                                                     & 65024
                                                               )
                                                               >> 9
                                                            | (
                                                                  (
                                                                           (
                                                                                 (
                                                                                       (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                          | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                    )
                                                                                    ^ 17
                                                                              )
                                                                              & 65408
                                                                        )
                                                                        >> 7
                                                                     | (
                                                                           (
                                                                                 (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                    | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                              )
                                                                              ^ 17
                                                                        )
                                                                        << 9
                                                               )
                                                               << 7
                                                      )
                                                      - 51
                                                   & 0
                                             )
                                             >> 16
                                          | (
                                                   (
                                                            (
                                                                  (
                                                                           (
                                                                                 (
                                                                                       (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                          | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                    )
                                                                                    ^ 17
                                                                              )
                                                                              & 65408
                                                                        )
                                                                        >> 7
                                                                     | (
                                                                           (
                                                                                 (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                    | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                              )
                                                                              ^ 17
                                                                        )
                                                                        << 9
                                                               )
                                                               & 65024
                                                         )
                                                         >> 9
                                                      | (
                                                            (
                                                                     (
                                                                           (
                                                                                 (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                    | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                              )
                                                                              ^ 17
                                                                        )
                                                                        & 65408
                                                                  )
                                                                  >> 7
                                                               | (
                                                                     (
                                                                           (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                              | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                        )
                                                                        ^ 17
                                                                  )
                                                                  << 9
                                                         )
                                                         << 7
                                                )
                                                - 51
                                             << 0
                                    )
                                    << 12
                           )
                           << 13
                  )
                  + 98
            );
            var17.setCharAt(
               var30,
               (char)(
                  (
                        (
                                 (
                                       (
                                                (
                                                      (
                                                               (
                                                                        (
                                                                                 (
                                                                                       (
                                                                                                (
                                                                                                      (
                                                                                                            (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488)
                                                                                                                  >> 11
                                                                                                               | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                                         )
                                                                                                         ^ 17
                                                                                                   )
                                                                                                   & 65408
                                                                                             )
                                                                                             >> 7
                                                                                          | (
                                                                                                (
                                                                                                      (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                                         | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                                   )
                                                                                                   ^ 17
                                                                                             )
                                                                                             << 9
                                                                                    )
                                                                                    & 65024
                                                                              )
                                                                              >> 9
                                                                           | (
                                                                                 (
                                                                                          (
                                                                                                (
                                                                                                      (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                                         | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                                   )
                                                                                                   ^ 17
                                                                                             )
                                                                                             & 65408
                                                                                       )
                                                                                       >> 7
                                                                                    | (
                                                                                          (
                                                                                                (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                                   | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                             )
                                                                                             ^ 17
                                                                                       )
                                                                                       << 9
                                                                              )
                                                                              << 7
                                                                     )
                                                                     - 51
                                                                  & 0
                                                            )
                                                            >> 16
                                                         | (
                                                                  (
                                                                           (
                                                                                 (
                                                                                          (
                                                                                                (
                                                                                                      (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                                         | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                                   )
                                                                                                   ^ 17
                                                                                             )
                                                                                             & 65408
                                                                                       )
                                                                                       >> 7
                                                                                    | (
                                                                                          (
                                                                                                (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                                   | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                             )
                                                                                             ^ 17
                                                                                       )
                                                                                       << 9
                                                                              )
                                                                              & 65024
                                                                        )
                                                                        >> 9
                                                                     | (
                                                                           (
                                                                                    (
                                                                                          (
                                                                                                (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                                   | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                             )
                                                                                             ^ 17
                                                                                       )
                                                                                       & 65408
                                                                                 )
                                                                                 >> 7
                                                                              | (
                                                                                    (
                                                                                          (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                             | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                       )
                                                                                       ^ 17
                                                                                 )
                                                                                 << 9
                                                                        )
                                                                        << 7
                                                               )
                                                               - 51
                                                            << 0
                                                   )
                                                   & 65520
                                             )
                                             >> 4
                                          | (
                                                (
                                                         (
                                                                  (
                                                                           (
                                                                                 (
                                                                                          (
                                                                                                (
                                                                                                      (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                                         | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                                   )
                                                                                                   ^ 17
                                                                                             )
                                                                                             & 65408
                                                                                       )
                                                                                       >> 7
                                                                                    | (
                                                                                          (
                                                                                                (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                                   | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                             )
                                                                                             ^ 17
                                                                                       )
                                                                                       << 9
                                                                              )
                                                                              & 65024
                                                                        )
                                                                        >> 9
                                                                     | (
                                                                           (
                                                                                    (
                                                                                          (
                                                                                                (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                                   | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                             )
                                                                                             ^ 17
                                                                                       )
                                                                                       & 65408
                                                                                 )
                                                                                 >> 7
                                                                              | (
                                                                                    (
                                                                                          (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                             | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                       )
                                                                                       ^ 17
                                                                                 )
                                                                                 << 9
                                                                        )
                                                                        << 7
                                                               )
                                                               - 51
                                                            & 0
                                                      )
                                                      >> 16
                                                   | (
                                                            (
                                                                     (
                                                                           (
                                                                                    (
                                                                                          (
                                                                                                (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                                   | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                             )
                                                                                             ^ 17
                                                                                       )
                                                                                       & 65408
                                                                                 )
                                                                                 >> 7
                                                                              | (
                                                                                    (
                                                                                          (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                             | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                       )
                                                                                       ^ 17
                                                                                 )
                                                                                 << 9
                                                                        )
                                                                        & 65024
                                                                  )
                                                                  >> 9
                                                               | (
                                                                     (
                                                                              (
                                                                                    (
                                                                                          (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                             | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                       )
                                                                                       ^ 17
                                                                                 )
                                                                                 & 65408
                                                                           )
                                                                           >> 7
                                                                        | (
                                                                              (
                                                                                    (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                       | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                 )
                                                                                 ^ 17
                                                                           )
                                                                           << 9
                                                                  )
                                                                  << 7
                                                         )
                                                         - 51
                                                      << 0
                                             )
                                             << 12
                                    )
                                    & 65528
                              )
                              >> 3
                           | (
                                 (
                                          (
                                                (
                                                         (
                                                                  (
                                                                           (
                                                                                 (
                                                                                          (
                                                                                                (
                                                                                                      (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                                         | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                                   )
                                                                                                   ^ 17
                                                                                             )
                                                                                             & 65408
                                                                                       )
                                                                                       >> 7
                                                                                    | (
                                                                                          (
                                                                                                (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                                   | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                             )
                                                                                             ^ 17
                                                                                       )
                                                                                       << 9
                                                                              )
                                                                              & 65024
                                                                        )
                                                                        >> 9
                                                                     | (
                                                                           (
                                                                                    (
                                                                                          (
                                                                                                (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                                   | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                             )
                                                                                             ^ 17
                                                                                       )
                                                                                       & 65408
                                                                                 )
                                                                                 >> 7
                                                                              | (
                                                                                    (
                                                                                          (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                             | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                       )
                                                                                       ^ 17
                                                                                 )
                                                                                 << 9
                                                                        )
                                                                        << 7
                                                               )
                                                               - 51
                                                            & 0
                                                      )
                                                      >> 16
                                                   | (
                                                            (
                                                                     (
                                                                           (
                                                                                    (
                                                                                          (
                                                                                                (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                                   | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                             )
                                                                                             ^ 17
                                                                                       )
                                                                                       & 65408
                                                                                 )
                                                                                 >> 7
                                                                              | (
                                                                                    (
                                                                                          (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                             | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                       )
                                                                                       ^ 17
                                                                                 )
                                                                                 << 9
                                                                        )
                                                                        & 65024
                                                                  )
                                                                  >> 9
                                                               | (
                                                                     (
                                                                              (
                                                                                    (
                                                                                          (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                             | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                       )
                                                                                       ^ 17
                                                                                 )
                                                                                 & 65408
                                                                           )
                                                                           >> 7
                                                                        | (
                                                                              (
                                                                                    (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                       | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                 )
                                                                                 ^ 17
                                                                           )
                                                                           << 9
                                                                  )
                                                                  << 7
                                                         )
                                                         - 51
                                                      << 0
                                             )
                                             & 65520
                                       )
                                       >> 4
                                    | (
                                          (
                                                   (
                                                            (
                                                                     (
                                                                           (
                                                                                    (
                                                                                          (
                                                                                                (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                                   | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                             )
                                                                                             ^ 17
                                                                                       )
                                                                                       & 65408
                                                                                 )
                                                                                 >> 7
                                                                              | (
                                                                                    (
                                                                                          (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                             | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                       )
                                                                                       ^ 17
                                                                                 )
                                                                                 << 9
                                                                        )
                                                                        & 65024
                                                                  )
                                                                  >> 9
                                                               | (
                                                                     (
                                                                              (
                                                                                    (
                                                                                          (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                             | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                       )
                                                                                       ^ 17
                                                                                 )
                                                                                 & 65408
                                                                           )
                                                                           >> 7
                                                                        | (
                                                                              (
                                                                                    (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                       | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                 )
                                                                                 ^ 17
                                                                           )
                                                                           << 9
                                                                  )
                                                                  << 7
                                                         )
                                                         - 51
                                                      & 0
                                                )
                                                >> 16
                                             | (
                                                      (
                                                               (
                                                                     (
                                                                              (
                                                                                    (
                                                                                          (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                             | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                       )
                                                                                       ^ 17
                                                                                 )
                                                                                 & 65408
                                                                           )
                                                                           >> 7
                                                                        | (
                                                                              (
                                                                                    (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                       | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                 )
                                                                                 ^ 17
                                                                           )
                                                                           << 9
                                                                  )
                                                                  & 65024
                                                            )
                                                            >> 9
                                                         | (
                                                               (
                                                                        (
                                                                              (
                                                                                    (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                       | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                                 )
                                                                                 ^ 17
                                                                           )
                                                                           & 65408
                                                                     )
                                                                     >> 7
                                                                  | (
                                                                        (
                                                                              (((var50 & '\ufffe') >> 1 | var50 << 15) & 63488) >> 11
                                                                                 | ((var50 & '\ufffe') >> 1 | var50 << 15) << 5
                                                                           )
                                                                           ^ 17
                                                                     )
                                                                     << 9
                                                            )
                                                            << 7
                                                   )
                                                   - 51
                                                << 0
                                       )
                                       << 12
                              )
                              << 13
                     )
                     + 98
               )
            );
         }

         Class var6 = Class.forName(var17.toString(), false, Class_316.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = 448038490 - -864958706 ^ 1312997196; var36 < var20.length(); var36 += -52325451 & -1467998231 ^ -1468001376) {
            int var62 = var20.charAt(var36);
            int var100 = (var62 & 49152) >> 14;
            int var63 = (var62 & 49152) >> 14 | var62 << 2;
            int var101 = (((var62 & 49152) >> 14 | var62 << 2) & 32768) >> 15;
            var62 = ((var100 | var62 << 2) & 32768) >> 15 | ((var62 & 49152) >> 14 | var62 << 2) << 1;
            var100 = ((var101 | var63 << 1) & 32768) >> 15;
            int var65 = (((var101 | var63 << 1) & 32768) >> 15 | var62 << 1) - 105;
            int var103 = ((((var101 | var63 << 1) & 32768) >> 15 | var62 << 1) - 105 & 57344) >> 13;
            var62 = ((var100 | var62 << 1) - 105 & 57344) >> 13 | (((var101 | var63 << 1) & 32768) >> 15 | var62 << 1) - 105 << 3;
            var100 = ((var103 | var65 << 3) & 65534) >> 1;
            int var67 = (((var103 | var65 << 3) & 65534) >> 1 | var62 << 15) - 232 + 175 - 57;
            int var105 = ((((var103 | var65 << 3) & 65534) >> 1 | var62 << 15) - 232 + 175 - 57 & 65520) >> 4;
            char var68 = (char)(
               ((var100 | var62 << 15) - 232 + 175 - 57 & 65520) >> 4 | (((var103 | var65 << 3) & 65534) >> 1 | var62 << 15) - 232 + 175 - 57 << 12
            );
            var20.setCharAt(var36, (char)(var105 | var67 << 12));
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_316.class.getClassLoader()).returnType();
         switch ((var4 + 1519186340 - 1006619297 ^ 1056788519 ^ 2067428295 ^ 374200361) + 1513397035 - 1023841893 - 1083063354 ^ 450290126 ^ 1538366874) {
            case 240479258:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            case 709443641:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            case 1185395526:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            case 1698097832:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_1831[((((var10 ^ 29673779) - 1378557710 + 91622532 ^ 1868887559) - 780863939 ^ 1451097979) - 1571476594 ^ 669043477) - 723405694 ^ 998105590] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
