import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;
import net.minecraft.class_11908;
import net.minecraft.class_11909;

public class Class_264 extends Class_375 {
   // $VF: renamed from: trx Class_262
   public static Class_262 field_1288 = (Class_262)0<"JNT",-778270432,"뾳ﾠ㾟ﾠ뾥㾳","\ue724\ue735\ue735\ue735\ue715\ue752","ӛӔ",138728592>(255, 255, 255);
   // $VF: renamed from: sqg Class_262
   public static Class_262 field_1289 = (Class_262)0<"JNT",-778270432,"뾳ﾠ㾟ﾠ뾥㾳","\ue724\ue735\ue735\ue735\ue715\ue752","ӛӔ",138728593>(60, 60, 65);
   // $VF: renamed from: mzw Class_262
   public static Class_262 field_1290 = (Class_262)0<"JNT",-778270432,"뾳ﾠ㾟ﾠ뾥㾳","\ue724\ue735\ue735\ue735\ue715\ue752","ӛӔ",138728262>(80, 80, 85);
   // $VF: renamed from: yvw float
   public static float field_1291 = 4.0F;
   // $VF: renamed from: gob float
   public static float field_1292 = 0.35F;
   // $VF: renamed from: fej int
   public static int field_1293 = 80;
   // $VF: renamed from: ead int
   public static int field_1294 = 16;
   // $VF: renamed from: kzs Class_115
   public Class_115 field_1295;
   // $VF: renamed from: eft float
   public float field_1296 = 0.0F;
   // $VF: renamed from: mes java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_1297 = new MethodHandle[140];

   public Class_264(Class_199 var1, Class_271 var2, int var3) {
      super(var1, var2, var3);
      this.field_1295 = (Class_115)var2;
   }

   // $VF: renamed from: vk (RenderEngine_216, int, int, float) void
   @Override
   public void method_1268(RenderEngine_216 var1, int var2, int var3, float var4) {
      float var5 = var4 * 0.05F;
      float var6 = 0<"JNT",-841552281,"ﾥ羢뾥","\ue724\ue715\ue746","ԳӚ",138730299>(1<"JNT",953613773,"\uf66c\uf75c\uf6ec","小\udc10","ґ蒑ѣѱ葵蒚",-321669664>(this))
         ? 1.0F
         : 0.0F;
      1<"JNT",1279819415,"\uf60c\uf61c\uf6fc","小\udc10","ґ蒑Ѡ",-321669643>(
         this,
         (float)0<"JNT",1687432218,"羥㾥羠","\ue724\ue740\ue740\ue740\ue740\ue715\ue740","ӚԬԨ",138730264>(
            (double)1<"JNT",953613773,"\uf60c\uf61c\uf6fc","小\udc10","ґ蒑Ѡ",-321669633>(this), (double)var6, 0.35F, (double)var5
         )
      );
      0<"JNT",-841552281,"羡뾠","\ue724\ue738\ue656\ue65d\ue672\ue65d\ue71b\ue658\ue65d\ue65a\ue663\ue71b\ue74f\ue670\ue66e\ue655\ue65a\ue663\ue727\ue740\ue740\ue738\ue65c\ue673\ue727\ue715\ue740","Ԧӕ",138730257>(
         var1,
         0<"JNT",-841552281,"㾡뾡ﾤ","\ue724\ue715\ue738\ue656\ue65d\ue672\ue65d\ue71b\ue658\ue65d\ue65a\ue663\ue71b\ue74f\ue670\ue66e\ue655\ue65a\ue663\ue727","ӚԞԞ",138730255>(
            1<"JNT",953613773,"\uf6ec\uf71c\uf67c","小\udc10","ґ蒑ѣ葵葯葯蒚",-321669644>(this)
         ),
         (double)(0<"JNT",-841552281,"뾤뾦뾤","\ue724\ue715\ue735","ӛԢ",138730268>(this) + 5),
         (double)(
            0<"JNT",-841552281,"ﾦ㾦㾟","\ue724\ue715\ue735","ӛԢ",138730269>(this)
               + 0<"JNT",-841552281,"ﾟﾟ㾡","\ue724\ue715\ue735","ӛԢ",138730258>(this)
               + 1<"JNT",953613773,"\uf66c\uf6dc\uf6ec","小\udc10","ґ蒑葡",-321669641>(this)
               + 9
         ),
         1<"JNT",748271968,"\uf66c\uf5cc","小\udc10","ґ蒑ѣѵ葸蒚",-321669642>()
      );
      String var21;
      if (0<"JNT",-841552281,"ﾥ羢뾥","\ue724\ue715\ue746","ԳӚ",138730439>(1<"JNT",953613773,"\uf66c\uf75c\uf6ec","小\udc10","ґ蒑ѣѱ葵蒚",-321669684>(this))) {
         int var10000 = 0;

         StringBuilder var10001;
         for (var10001 = (StringBuilder)0<"JNT",-778270432,"뾳ﾠ㾟ﾠ뾥㾳","\ue724\ue738\ue656\ue65d\ue672\ue65d\ue71b\ue658\ue65d\ue65a\ue663\ue71b\ue74f\ue670\ue66e\ue655\ue65a\ue663\ue727\ue715\ue752","ԩԪӕԪ६ԧԪԭԤ६ӰӏӑԲԭԤӁӎԲԧԟԞӑ",138730452>(
               "貁ᲃ벃಄\udc82沃ᲃ沃ﲂ汿汿汿"
            );
            var10000 < ((1203021675 | 4) & 671090716);
            var10000 += 1165206685 >> (-1945301263 ^ 1165206685) ^ 284475
         ) {
            char var23 = 0<"JNT",-841552281,"羢뾠ﾢ㾦ﾚ뾥","\ue724\ue735\ue715\ue73f","ԩԪӕԪ६ԧԪԭԤ६ӰӏӑԲԭԤӁӎԲԧԟԞӑ",138730453>(var10001, var10000);
            char var26 = (char)(
               (((((var23 & '\ufff0') >> 4 | var23 << '\f') - 202 & 64512) >> 10 | ((var23 & '\ufff0') >> 4 | var23 << '\f') - 202 << 6) + 142 & 49152) >> 14
                  | ((((var23 & '\ufff0') >> 4 | var23 << '\f') - 202 & 64512) >> 10 | ((var23 & '\ufff0') >> 4 | var23 << '\f') - 202 << 6) + 142 << 2
            );
            0<"JNT",-841552281,"羦ﾡ뾥羚뾠ﾢ㾦ﾚ뾥","\ue724\ue735\ue73f\ue715\ue752","ԩԪӕԪ६ԧԪԭԤ६ӰӏӑԲԭԤӁӎԲԧԟԞӑ",138730442>(
               var10001,
               var10000,
               (char)(
                  (((((var23 & '\ufff0') >> 4 | var23 << '\f') - 202 & 64512) >> 10 | ((var23 & '\ufff0') >> 4 | var23 << '\f') - 202 << 6) + 142 & 49152)
                        >> 14
                     | ((((var23 & '\ufff0') >> 4 | var23 << '\f') - 202 & 64512) >> 10 | ((var23 & '\ufff0') >> 4 | var23 << '\f') - 202 << 6) + 142 << 2
               )
            );
         }

         var21 = 0<"JNT",-841552281,"뾥羟羞뾥㾦ﾠ㾟羡","\ue724\ue715\ue738\ue656\ue65d\ue672\ue65d\ue71b\ue658\ue65d\ue65a\ue663\ue71b\ue74f\ue670\ue66e\ue655\ue65a\ue663\ue727","ԩԪӕԪ६ԧԪԭԤ६ӰӏӑԲԭԤӁӎԲԧԟԞӑ",138730296>(
            var10001
         );
      } else {
         var21 = 0<"JNT",1687432218,"㾤㾢羡","\ue724\ue735\ue715\ue738\ue656\ue65d\ue672\ue65d\ue71b\ue658\ue65d\ue65a\ue663\ue71b\ue74f\ue670\ue66e\ue655\ue65a\ue663\ue727","ԧԡ",138730287>(
            0<"JNT",-841552281,"㾡뾠","\ue724\ue715\ue735","ԳӚ",138730286>(1<"JNT",953613773,"\uf66c\uf75c\uf6ec","小\udc10","ґ蒑ѣѱ葵蒚",-321669675>(this))
         );
      }

      String var7 = var21;
      double var8 = 0<"JNT",-841552281,"ﾤﾥ㾠","\ue724\ue738\ue656\ue65d\ue672\ue65d\ue71b\ue658\ue65d\ue65a\ue663\ue71b\ue74f\ue670\ue66e\ue655\ue65a\ue663\ue727\ue715\ue740","Ԧӕ",138730443>(
         var1, var7
      );
      byte var10 = 20;
      int var11 = (int)0<"JNT",1687432218,"ﾟﾢ뾤","\ue724\ue740\ue740\ue715\ue740","ԩԪӕԪ६ԧԪԭԤ६ӆԪӏԳ",138730440>(80.0, var8 + 16.0);
      int var12 = 0<"JNT",-841552281,"뾤뾦뾤","\ue724\ue715\ue735","ӛԢ",138730441>(this)
         + 0<"JNT",-841552281,"㾠뾠","\ue724\ue715\ue735","ӛԢ",138730494>(this)
         - var11
         - 5;
      int var13 = 0<"JNT",-841552281,"ﾦ㾦㾟","\ue724\ue715\ue735","ӛԢ",138730495>(this)
         + 0<"JNT",-841552281,"ﾟﾟ㾡","\ue724\ue715\ue735","ӛԢ",138730444>(this)
         + 1<"JNT",953613773,"\uf66c\uf6dc\uf6ec","小\udc10","ґ蒑葡",-321669687>(this)
         + (0<"JNT",-841552281,"羟ﾦ","\ue724\ue715\ue735","ӛԢ",138730498>(this) - var10) / 2;
      Class_262 var14 = 0<"JNT",1687432218,"㾠ﾤﾦ","\ue724\ue738\ue65c\ue673\ue727\ue738\ue65c\ue673\ue727\ue742\ue715\ue738\ue65c\ue673\ue727","ԡԠ",138730294>(
         1<"JNT",748271968,"\uf6ec\uf6cc\uf62c","小\udc10","ґ蒑ѣѵ葸蒚",-321669689>(),
         1<"JNT",748271968,"\uf68c\uf75c\uf72c","小\udc10","ґ蒑ѣѵ葸蒚",-321669690>(),
         1<"JNT",953613773,"\uf60c\uf61c\uf6fc","小\udc10","ґ蒑Ѡ",-321669667>(this)
      );
      0<"JNT",-841552281,"㾟羢뾡","\ue724\ue738\ue65c\ue673\ue727\ue740\ue740\ue740\ue740\ue740\ue740\ue740\ue740\ue715\ue752","Ԧӕ",138730295>(
         var1, var14, (double)var12, (double)var13, (double)(var12 + var11), (double)(var13 + var10), 4.0, 4.0, 4.0, 4.0
      );
      float var15 = 0<"JNT",1687432218,"ﾟﾢ뾤","\ue724\ue742\ue742\ue715\ue742","ԩԪӕԪ६ԧԪԭԤ६ӆԪӏԳ",138730272>(
         1<"JNT",953613773,"\uf60c\uf61c\uf6fc","小\udc10","ґ蒑Ѡ",-321669670>(this) * 0.7F,
         0<"JNT",-841552281,"뾠ﾥ羟","\ue724\ue740\ue740\ue735\ue735\ue735\ue735\ue715\ue746","ӛԢ",138730309>(
               this, (double)var2, (double)var3, var12, var13, var11, var10
            )
            ? 0.2F
            : 0.0F
      );
      if (var15 > 0.0F) {
         Class_262 var16 = (Class_262)0<"JNT",-778270432,"뾳ﾠ㾟ﾠ뾥㾳","\ue724\ue735\ue735\ue735\ue735\ue715\ue752","ӛӔ",138730457>(
            0<"JNT",-841552281,"㾠뾥㾦","\ue724\ue715\ue735","ӛӔ",138730454>(1<"JNT",953613773,"\uf66c\uf71c\uf66c","小\udc10","ґ蒑ѣѵ葸蒚",-321669699>(this)),
            0<"JNT",-841552281,"羠㾠","\ue724\ue715\ue735","ӛӔ",138730468>(1<"JNT",953613773,"\uf66c\uf71c\uf66c","小\udc10","ґ蒑ѣѵ葸蒚",-321669701>(this)),
            0<"JNT",-841552281,"뾟羡㾥","\ue724\ue715\ue735","ӛӔ",138730458>(1<"JNT",953613773,"\uf66c\uf71c\uf66c","小\udc10","ґ蒑ѣѵ葸蒚",-321669695>(this)),
            (int)(
               (float)0<"JNT",-841552281,"뾟ﾤ","\ue724\ue715\ue735","ӛӔ",138730456>(1<"JNT",953613773,"\uf66c\uf71c\uf66c","小\udc10","ґ蒑ѣѵ葸蒚",-321669697>(this))
                  * var15
            )
         );
         0<"JNT",-841552281,"㾟羢뾡","\ue724\ue738\ue65c\ue673\ue727\ue740\ue740\ue740\ue740\ue740\ue740\ue740\ue740\ue715\ue752","Ԧӕ",138730446>(
            var1, var16, (double)var12, (double)var13, (double)(var12 + var11), (double)(var13 + var10), 4.0, 4.0, 4.0, 4.0
         );
      }

      Class_262 var19 = 0<"JNT",1687432218,"㾠ﾤﾦ","\ue724\ue738\ue65c\ue673\ue727\ue738\ue65c\ue673\ue727\ue742\ue715\ue738\ue65c\ue673\ue727","ԡԠ",138730291>(
         1<"JNT",748271968,"\uf66c\uf5cc","小\udc10","ґ蒑ѣѵ葸蒚",-321669678>(),
         1<"JNT",748271968,"\uf6fc\uf6dc\uf73c","小\udc10","ґ蒑ѣѵ葸蒚",-321669671>(),
         1<"JNT",953613773,"\uf60c\uf61c\uf6fc","小\udc10","ґ蒑Ѡ",-321669672>(this)
      );
      0<"JNT",-841552281,"羡뾠","\ue724\ue738\ue656\ue65d\ue672\ue65d\ue71b\ue658\ue65d\ue65a\ue663\ue71b\ue74f\ue670\ue66e\ue655\ue65a\ue663\ue727\ue740\ue740\ue738\ue65c\ue673\ue727\ue715\ue740","Ԧӕ",138730288>(
         var1, var7, (double)var12 + ((double)var11 - var8) / 2.0, (double)(var13 + (var10 - 8) / 2 - 3), var19
      );
      if (0<"JNT",-841552281,"ﾥ羢뾥","\ue724\ue715\ue746","ԳӚ",138730342>(1<"JNT",953613773,"\uf66c\uf75c\uf6ec","小\udc10","ґ蒑ѣѱ葵蒚",-321669715>(this))) {
         float var17 = (float)0<"JNT",1687432218,"ﾢ㾢羦","\ue724\ue740\ue715\ue740","ԩԪӕԪ६ԧԪԭԤ६ӆԪӏԳ",138730357>(
               0<"JNT",1687432218,"羦ﾠ㾟","\ue724\ue740\ue715\ue740","ԩԪӕԪ६ԧԪԭԤ६ӆԪӏԳ",138730356>(
                  (double)0<"JNT",1687432218,"羢ﾥ㾦㾦ﾡ㾟뾥뾝ﾠﾟﾡ뾗ﾠ뾟뾟ﾠ羦","\ue724\ue715\ue736","ԩԪӕԪ६ԧԪԭԤ६ӰԢӐӏԞԦ",138730343>() / 500.0
               )
            )
            * 0.3F;
         Class_262 var18 = (Class_262)0<"JNT",-778270432,"뾳ﾠ㾟ﾠ뾥㾳","\ue724\ue735\ue735\ue735\ue735\ue715\ue752","ӛӔ",138730274>(
            0<"JNT",-841552281,"㾠뾥㾦","\ue724\ue715\ue735","ӛӔ",138730347>(1<"JNT",953613773,"\uf66c\uf71c\uf66c","小\udc10","ґ蒑ѣѵ葸蒚",-321669712>(this)),
            0<"JNT",-841552281,"羠㾠","\ue724\ue715\ue735","ӛӔ",138730345>(1<"JNT",953613773,"\uf66c\uf71c\uf66c","小\udc10","ґ蒑ѣѵ葸蒚",-321669714>(this)),
            0<"JNT",-841552281,"뾟羡㾥","\ue724\ue715\ue735","ӛӔ",138730271>(1<"JNT",953613773,"\uf66c\uf71c\uf66c","小\udc10","ґ蒑ѣѵ葸蒚",-321669724>(this)),
            (int)(
               (float)0<"JNT",-841552281,"뾟ﾤ","\ue724\ue715\ue735","ӛӔ",138730349>(1<"JNT",953613773,"\uf66c\uf71c\uf66c","小\udc10","ґ蒑ѣѵ葸蒚",-321669726>(this))
                  * var17
            )
         );
         0<"JNT",-841552281,"㾟羢뾡","\ue724\ue738\ue65c\ue673\ue727\ue740\ue740\ue740\ue740\ue740\ue740\ue740\ue740\ue715\ue752","Ԧӕ",138730275>(
            var1, var18, (double)var12, (double)var13, (double)(var12 + var11), (double)(var13 + var10), 4.0, 4.0, 4.0, 4.0
         );
      }
   }

   // $VF: renamed from: huo (double, double, int, int, int, int) boolean
   public boolean method_1303(double var1, double var3, int var5, int var6, int var7, int var8) {
      return var1 >= (double)var5 && var1 <= (double)(var5 + var7) && var3 >= (double)var6 && var3 <= (double)(var6 + var8);
   }

   // $VF: renamed from: yr (net.minecraft.class_11909, boolean) void
   // $VF: Irreducible bytecode was duplicated to produce valid code
   @Override
   public void method_1272(class_11909 var1, boolean var2) {
      int var10 = -1667133742;
      String var13;
      if (0<"JNT",-841552281,"ﾥ羢뾥","\ue724\ue715\ue746","ԳӚ",138730460>(1<"JNT",953613773,"\uf66c\uf75c\uf6ec","小\udc10","ґ蒑ѣѱ葵蒚",-321669709>(this))) {
         int var10000 = 0;

         StringBuilder var10001;
         for (var10001 = (StringBuilder)0<"JNT",-778270432,"뾳ﾠ㾟ﾠ뾥㾳","\ue724\ue738\ue656\ue65d\ue672\ue65d\ue71b\ue658\ue65d\ue65a\ue663\ue71b\ue74f\ue670\ue66e\ue655\ue65a\ue663\ue727\ue715\ue752","ԩԪӕԪ६ԧԪԭԤ६ӰӏӑԲԭԤӁӎԲԧԟԞӑ",138730461>(
               "ňŭŧŠűŪŭŪųĪĪĪ"
            );
            var10000 < (570433548 & -1001154385);
            var10000 += 1035824450 * (1579668896 | 1579668896) ^ 324678465
         ) {
            char var15 = 0<"JNT",-841552281,"羢뾠ﾢ㾦ﾚ뾥","\ue724\ue735\ue715\ue73f","ԩԪӕԪ६ԧԪԭԤ६ӰӏӑԲԭԤӁӎԲԧԟԞӑ",138730374>(var10001, var10000);
            int var10004 = (var15 & '\uffff') >> 0;
            int var16 = (var15 & '\uffff') >> 0 | var15 << 16;
            int var20 = (((var15 & '\uffff') >> 0 | var15 << 16) & 0) >> 16;
            var15 = (char)((((var10004 | var15 << 16) & 0) >> 16 | ((var15 & '\uffff') >> 0 | var15 << 16) << 0) - 248 ^ 79 ^ 83);
            0<"JNT",-841552281,"羦ﾡ뾥羚뾠ﾢ㾦ﾚ뾥","\ue724\ue735\ue73f\ue715\ue752","ԩԪӕԪ६ԧԪԭԤ६ӰӏӑԲԭԤӁӎԲԧԟԞӑ",138730375>(
               var10001, var10000, (char)((var20 | var16 << 0) - 248 ^ 79 ^ 83)
            );
         }

         var13 = 0<"JNT",-841552281,"뾥羟羞뾥㾦ﾠ㾟羡","\ue724\ue715\ue738\ue656\ue65d\ue672\ue65d\ue71b\ue658\ue65d\ue65a\ue663\ue71b\ue74f\ue670\ue66e\ue655\ue65a\ue663\ue727","ԩԪӕԪ६ԧԪԭԤ६ӰӏӑԲԭԤӁӎԲԧԟԞӑ",138730435>(
            var10001
         );
      } else {
         var13 = 0<"JNT",1687432218,"㾤㾢羡","\ue724\ue735\ue715\ue738\ue656\ue65d\ue672\ue65d\ue71b\ue658\ue65d\ue65a\ue663\ue71b\ue74f\ue670\ue66e\ue655\ue65a\ue663\ue727","ԧԡ",138730449>(
            0<"JNT",-841552281,"㾡뾠","\ue724\ue715\ue735","ԳӚ",138730448>(1<"JNT",953613773,"\uf66c\uf75c\uf6ec","小\udc10","ґ蒑ѣѱ葵蒚",-321669705>(this))
         );
      }

      label41: {
         String var3 = var13;
         double var4 = 0<"JNT",1722681443,"㾥㾤㾡","\ue724\ue738\ue656\ue65d\ue672\ue65d\ue71b\ue658\ue65d\ue65a\ue663\ue71b\ue74f\ue670\ue66e\ue655\ue65a\ue663\ue727\ue715\ue740","Ԡӎ",138730497>(
            0<"JNT",1687432218,"㾟羠ﾦ","\ue724\ue715\ue738\ue65f\ue671\ue727","Ԡӎ",138730432>(), var3
         );
         byte var6 = 20;
         int var7 = (int)0<"JNT",1687432218,"ﾟﾢ뾤","\ue724\ue740\ue740\ue715\ue740","ԩԪӕԪ६ԧԪԭԤ६ӆԪӏԳ",138730486>(80.0, var4 + 16.0);
         int var8 = 0<"JNT",-841552281,"뾤뾦뾤","\ue724\ue715\ue735","ӛԢ",138730487>(this)
            + 0<"JNT",-841552281,"㾠뾠","\ue724\ue715\ue735","ӛԢ",138730500>(this)
            - var7
            - 5;
         int var9 = 0<"JNT",-841552281,"ﾦ㾦㾟","\ue724\ue715\ue735","ӛԢ",138730501>(this)
            + 0<"JNT",-841552281,"ﾟﾟ㾡","\ue724\ue715\ue735","ӛԢ",138730490>(this)
            + 1<"JNT",953613773,"\uf66c\uf6dc\uf6ec","小\udc10","ґ蒑葡",-321669729>(this)
            + (0<"JNT",-841552281,"羟ﾦ","\ue724\ue715\ue735","ӛԢ",138730488>(this) - var6) / 2;
         if (0<"JNT",-841552281,"뾠ﾥ羟","\ue724\ue740\ue740\ue735\ue735\ue735\ue735\ue715\ue746","ӛԢ",138730479>(
            this,
            0<"JNT",-841552281,"羢羟ﾟ뾦羛뾵羵ﾴ뾴","\ue724\ue715\ue740","ԭԞӏ६ԦԲԭԞԠӑԪԥӏ६ԠԧԪӐӐӼԚԚ॥ԛ॥",138730489>(var1),
            0<"JNT",-841552281,"羢羟ﾟ뾦羛뾵羵ﾴﾴ","\ue724\ue715\ue740","ԭԞӏ६ԦԲԭԞԠӑԪԥӏ६ԠԧԪӐӐӼԚԚ॥ԛ॥",138730478>(var1),
            var8,
            var9,
            var7,
            var6
         )) {
            if (0<"JNT",-841552281,"ﾥ羢뾥","\ue724\ue715\ue746","ԳӚ",138730493>(1<"JNT",953613773,"\uf66c\uf75c\uf6ec","小\udc10","ґ蒑ѣѱ葵蒚",-321669742>(this))) {
               var10 = 1560075349 >> 1560075349 ^ 1012218072;
               break label41;
            }

            if (0<"JNT",-841552281,"ﾟﾡ뾥뾠羟뾡羛羵뾵㾶뾵ﾵ","\ue724\ue715\ue735","ԭԞӏ६ԦԲԭԞԠӑԪԥӏ६ԠԧԪӐӐӼԚԚ॥ԛ॥",138730482>(var1) == 0) {
               0<"JNT",-841552281,"뾥羠㾢","\ue724\ue715\ue752","ԳӚ",138730480>(1<"JNT",953613773,"\uf66c\uf75c\uf6ec","小\udc10","ґ蒑ѣѱ葵蒚",-321669737>(this));
               0<"JNT",-841552281,"㾡ﾠ㾟","\ue724\ue746\ue715\ue752","ԳӚ",138730534>(
                  1<"JNT",953613773,"\uf66c\uf75c\uf6ec","小\udc10","ґ蒑ѣѱ葵蒚",-321669523>(this), true
               );
            }
         }

         var10 = 1084896497 << 1233767545 ^ 253105496;
      }

      while (true) {
         switch (((var10 + 1859498046 + 1198382885 ^ 1707674607) - 1546219016 ^ 1733774674) + 718210222) {
            case -2024923707:
               if (0<"JNT",-841552281,"羟羡","\ue724\ue715\ue746","ԳӚ",138730389>(1<"JNT",953613773,"\uf66c\uf75c\uf6ec","小\udc10","ґ蒑ѣѱ葵蒚",-321669750>(this))) {
                  0<"JNT",-841552281,"ﾟ羥","\ue724\ue735\ue715\ue752","ӎӐԥ",138730377>(
                     1<"JNT",953613773,"\uf5dc\uf6fc\uf68c","\udc1a尖","ґ蒑ѣ葷葶Ѱ蒚",-321669745>(
                        1<"JNT",953613773,"\uf67c\uf70c\uf70c","小\udc10","ґ蒑ѣ葳Ѯ蒚",-321669744>(this)
                     ),
                     0<"JNT",-841552281,"ﾟﾡ뾥뾠羟뾡羛羵뾵㾶뾵ﾵ","\ue724\ue715\ue735","ԭԞӏ६ԦԲԭԞԠӑԪԥӏ६ԠԧԪӐӐӼԚԚ॥ԛ॥",138730376>(var1)
                  );
               }

               var10 = (1019927452 << 1798511538 | 1159570177) & -838994097;
               break;
            case -1722250369:
            default:
               0<"JNT",-841552281,"㾤㾤ﾥ","\ue724\ue735\ue715\ue752","ԳӚ",138730380>(
                  1<"JNT",953613773,"\uf66c\uf75c\uf6ec","小\udc10","ґ蒑ѣѱ葵蒚",-321669756>(this),
                  0<"JNT",-841552281,"ﾟﾡ뾥뾠羟뾡羛羵뾵㾶뾵ﾵ","\ue724\ue715\ue735","ԭԞӏ६ԦԲԭԞԠӑԪԥӏ६ԠԧԪӐӐӼԚԚ॥ԛ॥",138730431>(var1)
               );
               0<"JNT",-841552281,"㾡ﾠ㾟","\ue724\ue746\ue715\ue752","ԳӚ",138730434>(
                  1<"JNT",953613773,"\uf66c\uf75c\uf6ec","小\udc10","ґ蒑ѣѱ葵蒚",-321669751>(this), false
               );
               var10 = 1084896497 << 1233767545 ^ 253105496;
               break;
            case 939462860:
               0<"JNT",-894980920,"ﾤ㾦","\ue724\ue738\ue65a\ue661\ue670\ue71b\ue659\ue655\ue65a\ue661\ue65f\ue66e\ue65d\ue662\ue670\ue71b\ue65f\ue658\ue65d\ue66f\ue66f\ue74b\ue72d\ue72d\ue725\ue71c\ue725\ue727\ue746\ue715\ue752","Ӕԩ",138730450>(
                  this, var1, var2
               );
               return;
         }
      }
   }

   // $VF: renamed from: yz (net.minecraft.class_11908) void
   // $VF: Irreducible bytecode was duplicated to produce valid code
   @Override
   public void method_1271(class_11908 var1) {
      int var2 = 773206807;
      if (0<"JNT",-841552281,"ﾥ羢뾥","\ue724\ue715\ue746","ԳӚ",138728612>(1<"JNT",953613773,"\uf66c\uf75c\uf6ec","小\udc10","ґ蒑ѣѱ葵蒚",-321669509>(this))) {
         if (0<"JNT",-841552281,"ﾟﾡ뾥뾠羟뾡羛羵뾵㾶㾶뾴","\ue724\ue715\ue735","ԭԞӏ६ԦԲԭԞԠӑԪԥӏ६ԠԧԪӐӐӼԚԚ॥ԛॢ",138728613>(var1) == 256) {
            0<"JNT",-841552281,"㾡ﾠ㾟","\ue724\ue746\ue715\ue752","ԳӚ",138728603>(
               1<"JNT",953613773,"\uf66c\uf75c\uf6ec","小\udc10","ґ蒑ѣѱ葵蒚",-321669504>(this), false
            );
            var2 = -354627089;
         } else {
            var2 = (-1172103414 + (-996751596 << -1172103414) | 1614975590) & 1668806399;
         }
      } else {
         var2 = -354627089;
      }

      while (true) {
         switch ((var2 ^ 377851324) - 1159862668 - 408979314 - 1695226358 - 904729112 + 1201006802) {
            case -955410536:
               if (0<"JNT",-841552281,"ﾟﾡ뾥뾠羟뾡羛羵뾵㾶㾶뾴","\ue724\ue715\ue735","ԭԞӏ६ԦԲԭԞԠӑԪԥӏ६ԠԧԪӐӐӼԚԚ॥ԛॢ",138730548>(var1) == 259) {
                  if (0<"JNT",-841552281,"羟羡","\ue724\ue715\ue746","ԳӚ",138730538>(1<"JNT",953613773,"\uf66c\uf75c\uf6ec","小\udc10","ґ蒑ѣѱ葵蒚",-321669519>(this))
                     )
                   {
                     0<"JNT",-841552281,"ﾟ羥","\ue724\ue735\ue715\ue752","ӎӐԥ",138730537>(
                        1<"JNT",953613773,"\uf5dc\uf6fc\uf68c","\udc1a尖","ґ蒑ѣ葷葶Ѱ蒚",-321669522>(
                           1<"JNT",953613773,"\uf67c\uf70c\uf70c","小\udc10","ґ蒑ѣ葳Ѯ蒚",-321669521>(this)
                        ),
                        -1
                     );
                  }

                  var2 = -4464641 & -838964751;
               } else {
                  var2 = (1031753574 & 1031753574 | 784393264) & -1076302280;
               }
               continue;
            case 710598675:
            default:
               0<"JNT",-841552281,"㾤㾤ﾥ","\ue724\ue735\ue715\ue752","ԳӚ",138730464>(
                  1<"JNT",953613773,"\uf66c\uf75c\uf6ec","小\udc10","ґ蒑ѣѱ葵蒚",-321669529>(this), -1
               );
               0<"JNT",-841552281,"㾡ﾠ㾟","\ue724\ue746\ue715\ue752","ԳӚ",138728598>(
                  1<"JNT",953613773,"\uf66c\uf75c\uf6ec","小\udc10","ґ蒑ѣѱ葵蒚",-321669507>(this), false
               );
               var2 = -354627089;
               continue;
            case 1265924121:
               0<"JNT",-894980920,"ﾤ㾤","\ue724\ue738\ue65a\ue661\ue670\ue71b\ue659\ue655\ue65a\ue661\ue65f\ue66e\ue65d\ue662\ue670\ue71b\ue65f\ue658\ue65d\ue66f\ue66f\ue74b\ue72d\ue72d\ue725\ue71c\ue734\ue727\ue715\ue752","Ӕԩ",138730535>(
                  this, var1
               );
               return;
            case 1750907664:
               0<"JNT",-841552281,"㾤㾤ﾥ","\ue724\ue735\ue715\ue752","ԳӚ",138730540>(
                  1<"JNT",953613773,"\uf66c\uf75c\uf6ec","小\udc10","ґ蒑ѣѱ葵蒚",-321669532>(this),
                  0<"JNT",-841552281,"ﾟﾡ뾥뾠羟뾡羛羵뾵㾶㾶뾴","\ue724\ue715\ue735","ԭԞӏ६ԦԲԭԞԠӑԪԥӏ६ԠԧԪӐӐӼԚԚ॥ԛॢ",138730463>(var1)
               );
               0<"JNT",-841552281,"㾡ﾠ㾟","\ue724\ue746\ue715\ue752","ԳӚ",138730466>(
                  1<"JNT",953613773,"\uf66c\uf75c\uf6ec","小\udc10","ґ蒑ѣѱ葵蒚",-321669527>(this), false
               );
               var2 = -354627089;
               continue;
            case 2021162834:
         }

         if (0<"JNT",-841552281,"羟羡","\ue724\ue715\ue746","ԳӚ",138728601>(1<"JNT",953613773,"\uf66c\uf75c\uf6ec","小\udc10","ґ蒑ѣѱ葵蒚",-321669506>(this))) {
            0<"JNT",-841552281,"ﾟ羥","\ue724\ue735\ue715\ue752","ӎӐԥ",138728605>(
               1<"JNT",953613773,"\uf5dc\uf6fc\uf68c","\udc1a尖","ґ蒑ѣ葷葶Ѱ蒚",-321669517>(
                  1<"JNT",953613773,"\uf67c\uf70c\uf70c","小\udc10","ґ蒑ѣ葳Ѯ蒚",-321669516>(this)
               ),
               0<"JNT",-841552281,"ﾟﾡ뾥뾠羟뾡羛羵뾵㾶㾶뾴","\ue724\ue715\ue735","ԭԞӏ६ԦԲԭԞԠӑԪԥӏ६ԠԧԪӐӐӼԚԚ॥ԛॢ",138728604>(var1)
            );
         }

         var2 = -1390068202 - -1390068202 ^ 264508150;
      }
   }

   // $VF: renamed from: zxs () void
   @Override
   public void method_1270() {
      0<"JNT",-894980920,"㾤뾤羦","\ue724\ue715\ue752","Ӕԩ",138728594>(this);
      1<"JNT",1279819415,"\uf60c\uf61c\uf6fc","小\udc10","ґ蒑Ѡ",-321669513>(this, 0.0F);
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1293(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 - 850334278 ^ 1792373799) - 609219274 ^ 673867938) + 2129729035 - 552632015 + 577755667 ^ 556174165 ^ 147554058;
      MethodHandle var10000 = field_1297[(
            ((var10 - 850334278 ^ 1792373799) - 609219274 ^ 673867938) + 2129729035 - 552632015 + 577755667 ^ 556174165 ^ 147554058
         )
         - 447145862];
      if (field_1297[var10001 - 447145862] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = -1262078937 & 1894826952 ^ 817889280; var23 < var13.length(); var23 += (2018716146 + -730527135 | 0) & -1842181879) {
            int var42 = var13.charAt(var23);
            int var10004 = (var42 & 49152) >> 14;
            int var43 = (var42 & 49152) >> 14 | var42 << 2;
            int var85 = (((var42 & 49152) >> 14 | var42 << 2) & 65528) >> 3;
            var42 = ((var10004 | var42 << 2) & 65528) >> 3 | ((var42 & 49152) >> 14 | var42 << 2) << 13;
            var10004 = ((var85 | var43 << 13) & 49152) >> 14;
            int var45 = (((var85 | var43 << 13) & 49152) >> 14 | var42 << 2) + 204;
            int var87 = ((((var85 | var43 << 13) & 49152) >> 14 | var42 << 2) + 204 & 32768) >> 15;
            char var46 = (char)(
               (((var10004 | var42 << 2) + 204 & 32768) >> 15 | (((var85 | var43 << 13) & 49152) >> 14 | var42 << 2) + 204 << 1) + 83 - 247 + 176 ^ 135 ^ 200
            );
            var13.setCharAt(var23, (char)((var87 | var45 << 1) + 83 - 247 + 176 ^ 135 ^ 200));
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = (-170216742 | 1657299489 | 0) & 134548484; var29 < var16.length(); var29 += (-405004142 | -978658072) ^ -402719493) {
            int var51 = var16.charAt(var29) + 3;
            char var56 = (char)(
               (
                        (
                              (
                                       (
                                             (
                                                      (
                                                               ((((var51 & 65532) >> 2 | var51 << 14) - 214 ^ 226) & 65528) >> 3
                                                                  | (((var51 & 65532) >> 2 | var51 << 14) - 214 ^ 226) << 13
                                                            )
                                                            + 103
                                                            + 152
                                                         & 65504
                                                   )
                                                   >> 5
                                                | (
                                                         ((((var51 & 65532) >> 2 | var51 << 14) - 214 ^ 226) & 65528) >> 3
                                                            | (((var51 & 65532) >> 2 | var51 << 14) - 214 ^ 226) << 13
                                                      )
                                                      + 103
                                                      + 152
                                                   << 11
                                          )
                                          & 61440
                                    )
                                    >> 12
                                 | (
                                       (
                                                (
                                                         ((((var51 & 65532) >> 2 | var51 << 14) - 214 ^ 226) & 65528) >> 3
                                                            | (((var51 & 65532) >> 2 | var51 << 14) - 214 ^ 226) << 13
                                                      )
                                                      + 103
                                                      + 152
                                                   & 65504
                                             )
                                             >> 5
                                          | (
                                                   ((((var51 & 65532) >> 2 | var51 << 14) - 214 ^ 226) & 65528) >> 3
                                                      | (((var51 & 65532) >> 2 | var51 << 14) - 214 ^ 226) << 13
                                                )
                                                + 103
                                                + 152
                                             << 11
                                    )
                                    << 4
                           )
                           & 64512
                     )
                     >> 10
                  | (
                        (
                                 (
                                       (
                                                (
                                                         ((((var51 & 65532) >> 2 | var51 << 14) - 214 ^ 226) & 65528) >> 3
                                                            | (((var51 & 65532) >> 2 | var51 << 14) - 214 ^ 226) << 13
                                                      )
                                                      + 103
                                                      + 152
                                                   & 65504
                                             )
                                             >> 5
                                          | (
                                                   ((((var51 & 65532) >> 2 | var51 << 14) - 214 ^ 226) & 65528) >> 3
                                                      | (((var51 & 65532) >> 2 | var51 << 14) - 214 ^ 226) << 13
                                                )
                                                + 103
                                                + 152
                                             << 11
                                    )
                                    & 61440
                              )
                              >> 12
                           | (
                                 (
                                          (
                                                   ((((var51 & 65532) >> 2 | var51 << 14) - 214 ^ 226) & 65528) >> 3
                                                      | (((var51 & 65532) >> 2 | var51 << 14) - 214 ^ 226) << 13
                                                )
                                                + 103
                                                + 152
                                             & 65504
                                       )
                                       >> 5
                                    | (
                                             ((((var51 & 65532) >> 2 | var51 << 14) - 214 ^ 226) & 65528) >> 3
                                                | (((var51 & 65532) >> 2 | var51 << 14) - 214 ^ 226) << 13
                                          )
                                          + 103
                                          + 152
                                       << 11
                              )
                              << 4
                     )
                     << 6
            );
            var16.setCharAt(
               var29,
               (char)(
                  (
                           (
                                 (
                                          (
                                                (
                                                         (
                                                                  ((((var51 & 65532) >> 2 | var51 << 14) - 214 ^ 226) & 65528) >> 3
                                                                     | (((var51 & 65532) >> 2 | var51 << 14) - 214 ^ 226) << 13
                                                               )
                                                               + 103
                                                               + 152
                                                            & 65504
                                                      )
                                                      >> 5
                                                   | (
                                                            ((((var51 & 65532) >> 2 | var51 << 14) - 214 ^ 226) & 65528) >> 3
                                                               | (((var51 & 65532) >> 2 | var51 << 14) - 214 ^ 226) << 13
                                                         )
                                                         + 103
                                                         + 152
                                                      << 11
                                             )
                                             & 61440
                                       )
                                       >> 12
                                    | (
                                          (
                                                   (
                                                            ((((var51 & 65532) >> 2 | var51 << 14) - 214 ^ 226) & 65528) >> 3
                                                               | (((var51 & 65532) >> 2 | var51 << 14) - 214 ^ 226) << 13
                                                         )
                                                         + 103
                                                         + 152
                                                      & 65504
                                                )
                                                >> 5
                                             | (
                                                      ((((var51 & 65532) >> 2 | var51 << 14) - 214 ^ 226) & 65528) >> 3
                                                         | (((var51 & 65532) >> 2 | var51 << 14) - 214 ^ 226) << 13
                                                   )
                                                   + 103
                                                   + 152
                                                << 11
                                       )
                                       << 4
                              )
                              & 64512
                        )
                        >> 10
                     | (
                           (
                                    (
                                          (
                                                   (
                                                            ((((var51 & 65532) >> 2 | var51 << 14) - 214 ^ 226) & 65528) >> 3
                                                               | (((var51 & 65532) >> 2 | var51 << 14) - 214 ^ 226) << 13
                                                         )
                                                         + 103
                                                         + 152
                                                      & 65504
                                                )
                                                >> 5
                                             | (
                                                      ((((var51 & 65532) >> 2 | var51 << 14) - 214 ^ 226) & 65528) >> 3
                                                         | (((var51 & 65532) >> 2 | var51 << 14) - 214 ^ 226) << 13
                                                   )
                                                   + 103
                                                   + 152
                                                << 11
                                       )
                                       & 61440
                                 )
                                 >> 12
                              | (
                                    (
                                             (
                                                      ((((var51 & 65532) >> 2 | var51 << 14) - 214 ^ 226) & 65528) >> 3
                                                         | (((var51 & 65532) >> 2 | var51 << 14) - 214 ^ 226) << 13
                                                   )
                                                   + 103
                                                   + 152
                                                & 65504
                                          )
                                          >> 5
                                       | (
                                                ((((var51 & 65532) >> 2 | var51 << 14) - 214 ^ 226) & 65528) >> 3
                                                   | (((var51 & 65532) >> 2 | var51 << 14) - 214 ^ 226) << 13
                                             )
                                             + 103
                                             + 152
                                          << 11
                                 )
                                 << 4
                        )
                        << 6
               )
            );
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_264.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = (-46420291 >>> (-46420291 ^ -46420291) | 0) & 4460608;
            var35 < var19.length();
            var35 += (-174594503 * (1930058731 ^ 1514695788) | 0) & 76617873
         ) {
            int var61 = var19.charAt(var35) - '1';
            char var64 = (char)(
               (
                        (
                                 (
                                       ((((var61 & 65408) >> 7 | var61 << 9) - 113 + 91 & 63488) >> 11 | ((var61 & 65408) >> 7 | var61 << 9) - 113 + 91 << 5)
                                             + 253
                                          ^ 137
                                    )
                                    & 49152
                              )
                              >> 14
                           | (
                                 ((((var61 & 65408) >> 7 | var61 << 9) - 113 + 91 & 63488) >> 11 | ((var61 & 65408) >> 7 | var61 << 9) - 113 + 91 << 5) + 253
                                    ^ 137
                              )
                              << 2
                     )
                     + 238
                  ^ 215
            );
            var19.setCharAt(
               var35,
               (char)(
                  (
                           (
                                    (
                                          ((((var61 & 65408) >> 7 | var61 << 9) - 113 + 91 & 63488) >> 11 | ((var61 & 65408) >> 7 | var61 << 9) - 113 + 91 << 5)
                                                + 253
                                             ^ 137
                                       )
                                       & 49152
                                 )
                                 >> 14
                              | (
                                    ((((var61 & 65408) >> 7 | var61 << 9) - 113 + 91 & 63488) >> 11 | ((var61 & 65408) >> 7 | var61 << 9) - 113 + 91 << 5)
                                          + 253
                                       ^ 137
                                 )
                                 << 2
                        )
                        + 238
                     ^ 215
               )
            );
         }

         Class var7 = Class.forName(var19.toString(), false, Class_264.class.getClassLoader());
         switch (((var4 - 822096551 - 1190361691 - 149422810 ^ 2127287469) + 1073043434 + 1833813505 - 1205223921 ^ 1181846925 ^ 1206514308) + 1938020182) {
            case 108228160:
               var10000 = var0.findConstructor(var7, var6);
               break;
            case 160010367:
            case 1956769411:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 293163656:
               var10000 = var0.findSpecial(var7, var5, var6, Class_264.class);
               break;
            case 1996280538:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_1297[(((var10 - 850334278 ^ 1792373799) - 609219274 ^ 673867938) + 2129729035 - 552632015 + 577755667 ^ 556174165 ^ 147554058) - 447145862] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1294(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = (var10 - 154674197 - 744654399 - 1734564203 - 451634371 ^ 505871467) - 629278163 - 1114647133 - 363222118 - 1853014919;
      MethodHandle var10000 = field_1297[(var10 - 154674197 - 744654399 - 1734564203 - 451634371 ^ 505871467)
         - 629278163
         - 1114647133
         - 363222118
         - 1853014919
         - 1052862713];
      if (field_1297[var10001 - 1052862713] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = -1378846312 << 1741949080 ^ -1744830464; var24 < var14.length(); var24 += -348360212 >> -348360212 ^ -85050) {
            char var43 = var14.charAt(var24);
            char var48 = (char)(
               (
                     (
                              (
                                    (
                                             (
                                                   (
                                                            (
                                                                     (((var43 & '\uffff') >> 0 | var43 << 16) + 150 + 38 + 149 & 32768) >> 15
                                                                        | ((var43 & '\uffff') >> 0 | var43 << 16) + 150 + 38 + 149 << 1
                                                                  )
                                                                  - 188
                                                               & 64512
                                                         )
                                                         >> 10
                                                      | (
                                                               (((var43 & '\uffff') >> 0 | var43 << 16) + 150 + 38 + 149 & 32768) >> 15
                                                                  | ((var43 & '\uffff') >> 0 | var43 << 16) + 150 + 38 + 149 << 1
                                                            )
                                                            - 188
                                                         << 6
                                                )
                                                & 61440
                                          )
                                          >> 12
                                       | (
                                             (
                                                      (
                                                               (((var43 & '\uffff') >> 0 | var43 << 16) + 150 + 38 + 149 & 32768) >> 15
                                                                  | ((var43 & '\uffff') >> 0 | var43 << 16) + 150 + 38 + 149 << 1
                                                            )
                                                            - 188
                                                         & 64512
                                                   )
                                                   >> 10
                                                | (
                                                         (((var43 & '\uffff') >> 0 | var43 << 16) + 150 + 38 + 149 & 32768) >> 15
                                                            | ((var43 & '\uffff') >> 0 | var43 << 16) + 150 + 38 + 149 << 1
                                                      )
                                                      - 188
                                                   << 6
                                          )
                                          << 4
                                 )
                                 & 32768
                           )
                           >> 15
                        | (
                              (
                                       (
                                             (
                                                      (
                                                               (((var43 & '\uffff') >> 0 | var43 << 16) + 150 + 38 + 149 & 32768) >> 15
                                                                  | ((var43 & '\uffff') >> 0 | var43 << 16) + 150 + 38 + 149 << 1
                                                            )
                                                            - 188
                                                         & 64512
                                                   )
                                                   >> 10
                                                | (
                                                         (((var43 & '\uffff') >> 0 | var43 << 16) + 150 + 38 + 149 & 32768) >> 15
                                                            | ((var43 & '\uffff') >> 0 | var43 << 16) + 150 + 38 + 149 << 1
                                                      )
                                                      - 188
                                                   << 6
                                          )
                                          & 61440
                                    )
                                    >> 12
                                 | (
                                       (
                                                (
                                                         (((var43 & '\uffff') >> 0 | var43 << 16) + 150 + 38 + 149 & 32768) >> 15
                                                            | ((var43 & '\uffff') >> 0 | var43 << 16) + 150 + 38 + 149 << 1
                                                      )
                                                      - 188
                                                   & 64512
                                             )
                                             >> 10
                                          | (
                                                   (((var43 & '\uffff') >> 0 | var43 << 16) + 150 + 38 + 149 & 32768) >> 15
                                                      | ((var43 & '\uffff') >> 0 | var43 << 16) + 150 + 38 + 149 << 1
                                                )
                                                - 188
                                             << 6
                                    )
                                    << 4
                           )
                           << 1
                  )
                  + 246
            );
            var14.setCharAt(
               var24,
               (char)(
                  (
                        (
                                 (
                                       (
                                                (
                                                      (
                                                               (
                                                                        (((var43 & '\uffff') >> 0 | var43 << 16) + 150 + 38 + 149 & 32768) >> 15
                                                                           | ((var43 & '\uffff') >> 0 | var43 << 16) + 150 + 38 + 149 << 1
                                                                     )
                                                                     - 188
                                                                  & 64512
                                                            )
                                                            >> 10
                                                         | (
                                                                  (((var43 & '\uffff') >> 0 | var43 << 16) + 150 + 38 + 149 & 32768) >> 15
                                                                     | ((var43 & '\uffff') >> 0 | var43 << 16) + 150 + 38 + 149 << 1
                                                               )
                                                               - 188
                                                            << 6
                                                   )
                                                   & 61440
                                             )
                                             >> 12
                                          | (
                                                (
                                                         (
                                                                  (((var43 & '\uffff') >> 0 | var43 << 16) + 150 + 38 + 149 & 32768) >> 15
                                                                     | ((var43 & '\uffff') >> 0 | var43 << 16) + 150 + 38 + 149 << 1
                                                               )
                                                               - 188
                                                            & 64512
                                                      )
                                                      >> 10
                                                   | (
                                                            (((var43 & '\uffff') >> 0 | var43 << 16) + 150 + 38 + 149 & 32768) >> 15
                                                               | ((var43 & '\uffff') >> 0 | var43 << 16) + 150 + 38 + 149 << 1
                                                         )
                                                         - 188
                                                      << 6
                                             )
                                             << 4
                                    )
                                    & 32768
                              )
                              >> 15
                           | (
                                 (
                                          (
                                                (
                                                         (
                                                                  (((var43 & '\uffff') >> 0 | var43 << 16) + 150 + 38 + 149 & 32768) >> 15
                                                                     | ((var43 & '\uffff') >> 0 | var43 << 16) + 150 + 38 + 149 << 1
                                                               )
                                                               - 188
                                                            & 64512
                                                      )
                                                      >> 10
                                                   | (
                                                            (((var43 & '\uffff') >> 0 | var43 << 16) + 150 + 38 + 149 & 32768) >> 15
                                                               | ((var43 & '\uffff') >> 0 | var43 << 16) + 150 + 38 + 149 << 1
                                                         )
                                                         - 188
                                                      << 6
                                             )
                                             & 61440
                                       )
                                       >> 12
                                    | (
                                          (
                                                   (
                                                            (((var43 & '\uffff') >> 0 | var43 << 16) + 150 + 38 + 149 & 32768) >> 15
                                                               | ((var43 & '\uffff') >> 0 | var43 << 16) + 150 + 38 + 149 << 1
                                                         )
                                                         - 188
                                                      & 64512
                                                )
                                                >> 10
                                             | (
                                                      (((var43 & '\uffff') >> 0 | var43 << 16) + 150 + 38 + 149 & 32768) >> 15
                                                         | ((var43 & '\uffff') >> 0 | var43 << 16) + 150 + 38 + 149 << 1
                                                   )
                                                   - 188
                                                << 6
                                       )
                                       << 4
                              )
                              << 1
                     )
                     + 246
               )
            );
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = (-78931971 & 766103720 | 0) & 1141245010; var30 < var17.length(); var30 += (-1088128015 | -1373804985) ^ -1086488586) {
            int var53 = var17.charAt(var30);
            int var90 = (var53 & 64512) >> 10;
            int var54 = (((var53 & 64512) >> 10 | var53 << 6) ^ 64) - 193 + 235 - 48 + 143;
            int var91 = ((((var53 & 64512) >> 10 | var53 << 6) ^ 64) - 193 + 235 - 48 + 143 & 64512) >> 10;
            var53 = (((var90 | var53 << 6) ^ 64) - 193 + 235 - 48 + 143 & 64512) >> 10
               | (((var53 & 64512) >> 10 | var53 << 6) ^ 64) - 193 + 235 - 48 + 143 << 6;
            var90 = ((var91 | var54 << 6) & 65504) >> 5;
            int var56 = ((var91 | var54 << 6) & 65504) >> 5 | var53 << 11;
            int var93 = ((((var91 | var54 << 6) & 65504) >> 5 | var53 << 11) & 65472) >> 6;
            char var57 = (char)((((var90 | var53 << 11) & 65472) >> 6 | (((var91 | var54 << 6) & 65504) >> 5 | var53 << 11) << 10) ^ 81);
            var17.setCharAt(var30, (char)((var93 | var56 << 10) ^ 81));
         }

         Class var6 = Class.forName(var17.toString(), false, Class_264.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = (1146259953 << -1485960787 | 0) & -2076175282; var36 < var20.length(); var36 += 596519798 >>> -1029258843 ^ 18641242) {
            char var62 = var20.charAt(var36);
            char var65 = (char)(
               (
                        (
                                 (
                                          ((((var62 & 'ﰀ') >> 10 | var62 << 6) ^ 232 ^ 83 ^ 169) + 170 & 63488) >> 11
                                             | (((var62 & 'ﰀ') >> 10 | var62 << 6) ^ 232 ^ 83 ^ 169) + 170 << 5
                                       )
                                       + 7
                                    ^ 53
                              )
                              + 98
                           & 64512
                     )
                     >> 10
                  | (
                           (
                                    ((((var62 & 'ﰀ') >> 10 | var62 << 6) ^ 232 ^ 83 ^ 169) + 170 & 63488) >> 11
                                       | (((var62 & 'ﰀ') >> 10 | var62 << 6) ^ 232 ^ 83 ^ 169) + 170 << 5
                                 )
                                 + 7
                              ^ 53
                        )
                        + 98
                     << 6
            );
            var20.setCharAt(
               var36,
               (char)(
                  (
                           (
                                    (
                                             ((((var62 & 'ﰀ') >> 10 | var62 << 6) ^ 232 ^ 83 ^ 169) + 170 & 63488) >> 11
                                                | (((var62 & 'ﰀ') >> 10 | var62 << 6) ^ 232 ^ 83 ^ 169) + 170 << 5
                                          )
                                          + 7
                                       ^ 53
                                 )
                                 + 98
                              & 64512
                        )
                        >> 10
                     | (
                              (
                                       ((((var62 & 'ﰀ') >> 10 | var62 << 6) ^ 232 ^ 83 ^ 169) + 170 & 63488) >> 11
                                          | (((var62 & 'ﰀ') >> 10 | var62 << 6) ^ 232 ^ 83 ^ 169) + 170 << 5
                                    )
                                    + 7
                                 ^ 53
                           )
                           + 98
                        << 6
               )
            );
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_264.class.getClassLoader()).returnType();
         switch (((var4 + 2077814872 ^ 233566741) + 91511482 ^ 1756753039) - 1557943889 - 2095555118 - 676048884 - 1748064684 - 1673460377 + 1750233333) {
            case 1037930360:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            case 1577766693:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            case 1885343394:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            case 2127034780:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_1297[(var10 - 154674197 - 744654399 - 1734564203 - 451634371 ^ 505871467) - 629278163 - 1114647133 - 363222118 - 1853014919 - 1052862713] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
