import dev.krypton.native.Loader;
import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;

public enum Class_329 {
   // $VF: renamed from: js Class_329
   field_1047,
   // $VF: renamed from: nva Class_329
   field_1048,
   // $VF: renamed from: vfm Class_329
   field_1049;

   public static final MethodHandle[] ntsa = new MethodHandle[(567005049 * 567005049 | 20) & 410064983];

   // $VF: Failed to inline enum fields
   // Please report this to the Vineflower issue tracker, at https://github.com/Vineflower/vineflower/issues with a copy of the class file (if you have the rights to distribute it!)
   static {
      Loader.init(Class_329.class);
      int var10000 = 0;

      StringBuilder var10001;
      for (var10001 = (StringBuilder)0<"JNT",844011038,"퐨햐\uda78햐\uda68퓸","\uf392\uf364\uf373獯\uf379獯玖\uf374獯\uf375獲玖獨\uf378\uf377獳\uf375獲玜玓\uf369","佮뽮\u0f6f뽮ꃛ꽯뽮软彮ꃛ⽑⽯콯㽮软彮\udf50ｯ㽮꽯⽮ｮ콯",-437466457>(
            "к〺尺к携䰺簺尺к〺ⰺ"
         );
         var10000 < (-1870421282 << -1870421282 ^ -2147483637);
         var10000 += 284927 ^ 284926
      ) {
         int var10 = (0<"JNT",414209421,"헠했헐\uda18퓐\uda68","\uf392獣玓獠","佮뽮\u0f6f뽮ꃛ꽯뽮软彮ꃛ⽑⽯콯㽮软彮\udf50ｯ㽮꽯⽮ｮ콯",-437466462>(var10001, var10000) - '3' ^ 156 ^ 146)
            - 8;
         char var11 = (char)((var10 & 64512) >> 10 | var10 << 6);
         0<"JNT",414209421,"\uda60헰\uda68퓠했헐\uda18퓐\uda68","\uf392獣獠玓\uf369","佮뽮\u0f6f뽮ꃛ꽯뽮软彮ꃛ⽑⽯콯㽮软彮\udf50ｯ㽮꽯⽮ｮ콯",-437466463>(
            var10001, var10000, (char)((var10 & 64512) >> 10 | var10 << 6)
         );
      }

      field_1047 = (Class_329)0<"JNT",844011038,"퐨햐\uda78햐\uda68퓸","\uf392\uf364\uf373獯\uf379獯玖\uf374獯\uf375獲玖獨\uf378\uf377獳\uf375獲玜獣玓\uf369","ｯ",-437466444>(
         0<"JNT",414209421,"\uda68\uda40할\uda68\uda18햐\uda78햀","\uf392玓\uf364\uf373獯\uf379獯玖\uf374獯\uf375獲玖獨\uf378\uf377獳\uf375獲玜","佮뽮\u0f6f뽮ꃛ꽯뽮软彮ꃛ⽑⽯콯㽮软彮\udf50ｯ㽮꽯⽮ｮ콯",-437466439>(
            var10001
         ),
         0
      );
      var10000 = (-1191007495 | 1593162269 >>> 1593162269 | 0) & 104616196;

      for (var10001 = (StringBuilder)0<"JNT",844011038,"퐨햐\uda78햐\uda68퓸","\uf392\uf364\uf373獯\uf379獯玖\uf374獯\uf375獲玖獨\uf378\uf377獳\uf375獲玜玓\uf369","佮뽮\u0f6f뽮ꃛ꽯뽮软彮ꃛ⽑⽯콯㽮软彮\udf50ｯ㽮꽯⽮ｮ콯",-437466437>(
            "εϕϕυ͕΅ενυέ̵έενϵ̵͕ͭε͍"
         );
         var10000 < (617710008 + (-1416480011 ^ -2062631590) ^ 1399720307);
         var10000 += (643001992 >>> 643001992 | 1) & 295210113
      ) {
         int var14 = (0<"JNT",414209421,"헠했헐\uda18퓐\uda68","\uf392獣玓獠","佮뽮\u0f6f뽮ꃛ꽯뽮软彮ꃛ⽑⽯콯㽮软彮\udf50ｯ㽮꽯⽮ｮ콯",-437466468>(var10001, var10000) ^ 202) - 231;
         int var22 = (var14 & 49152) >> 14;
         int var15 = (var14 & 49152) >> 14 | var14 << 2;
         int var23 = (((var14 & 49152) >> 14 | var14 << 2) & 65504) >> 5;
         char var16 = (char)((((var22 | var14 << 2) & 65504) >> 5 | ((var14 & 49152) >> 14 | var14 << 2) << 11) - 4);
         0<"JNT",414209421,"\uda60헰\uda68퓠했헐\uda18퓐\uda68","\uf392獣獠玓\uf369","佮뽮\u0f6f뽮ꃛ꽯뽮软彮ꃛ⽑⽯콯㽮软彮\udf50ｯ㽮꽯⽮ｮ콯",-437466461>(
            var10001, var10000, (char)((var23 | var15 << 11) - 4)
         );
      }

      field_1048 = (Class_329)0<"JNT",844011038,"퐨햐\uda78햐\uda68퓸","\uf392\uf364\uf373獯\uf379獯玖\uf374獯\uf375獲玖獨\uf378\uf377獳\uf375獲玜獣玓\uf369","ｯ",-437466433>(
         0<"JNT",414209421,"\uda68\uda40할\uda68\uda18햐\uda78햀","\uf392玓\uf364\uf373獯\uf379獯玖\uf374獯\uf375獲玖獨\uf378\uf377獳\uf375獲玜","佮뽮\u0f6f뽮ꃛ꽯뽮软彮ꃛ⽑⽯콯㽮软彮\udf50ｯ㽮꽯⽮ｮ콯",-437466440>(
            var10001
         ),
         1
      );
      var10000 = 0;

      for (var10001 = (StringBuilder)0<"JNT",844011038,"퐨햐\uda78햐\uda68퓸","\uf392\uf364\uf373獯\uf379獯玖\uf374獯\uf375獲玖獨\uf378\uf377獳\uf375獲玜玓\uf369","佮뽮\u0f6f뽮ꃛ꽯뽮软彮ꃛ⽑⽯콯㽮软彮\udf50ｯ㽮꽯⽮ｮ콯",-437466438>(
            "９８Ｒ＝Ｔ５９ＲＲ＝８ＲＫＷＲ；Ｖ"
         );
         var10000 < ((1130415529 & -134496912 * (1130415529 + -134496912) | 17) & -1565705637);
         var10000 += -202422739 << (-758562790 | 1501504776) ^ -1275068415
      ) {
         0<"JNT",414209421,"\uda60헰\uda68퓠했헐\uda18퓐\uda68","\uf392獣獠玓\uf369","佮뽮\u0f6f뽮ꃛ꽯뽮软彮ꃛ⽑⽯콯㽮软彮\udf50ｯ㽮꽯⽮ｮ콯",-437466467>(
            var10001,
            var10000,
            (char)(
               (0<"JNT",414209421,"헠했헐\uda18퓐\uda68","\uf392獣玓獠","佮뽮\u0f6f뽮ꃛ꽯뽮软彮ꃛ⽑⽯콯㽮软彮\udf50ｯ㽮꽯⽮ｮ콯",-437466466>(var10001, var10000) ^ 189) + 9 + 102 + 168
                  ^ 242
            )
         );
      }

      field_1049 = (Class_329)0<"JNT",844011038,"퐨햐\uda78햐\uda68퓸","\uf392\uf364\uf373獯\uf379獯玖\uf374獯\uf375獲玖獨\uf378\uf377獳\uf375獲玜獣玓\uf369","ｯ",-437466443>(
         0<"JNT",414209421,"\uda68\uda40할\uda68\uda18햐\uda78햀","\uf392玓\uf364\uf373獯\uf379獯玖\uf374獯\uf375獲玖獨\uf378\uf377獳\uf375獲玜","佮뽮\u0f6f뽮ꃛ꽯뽮软彮ꃛ⽑⽯콯㽮软彮\udf50ｯ㽮꽯⽮ｮ콯",-437466442>(
            var10001
         ),
         2
      );
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1161(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = (var10 - 831768024 + 1571766395 + 217501476 + 140241245 ^ 529382277 ^ 1475311327 ^ 339940454) - 354493983 ^ 1141920553;
      MethodHandle var10000 = ntsa[((var10 - 831768024 + 1571766395 + 217501476 + 140241245 ^ 529382277 ^ 1475311327 ^ 339940454) - 354493983 ^ 1141920553)
         - 575253987];
      if (ntsa[var10001 - 575253987] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = (32527429 + 495861764 | 0) & -1073738986; var23 < var13.length(); var23 += (597592870 * -652167114 | 1) & 67786161) {
            int var42 = var13.charAt(var23) ^ 'g';
            int var10004 = (var42 & 65408) >> 7;
            int var43 = ((var42 & 65408) >> 7 | var42 << 9) - 46 + 134;
            int var85 = (((var42 & 65408) >> 7 | var42 << 9) - 46 + 134 & 65408) >> 7;
            var42 = ((var10004 | var42 << 9) - 46 + 134 & 65408) >> 7 | ((var42 & 65408) >> 7 | var42 << 9) - 46 + 134 << 9;
            var10004 = ((var85 | var43 << 9) & 63488) >> 11;
            int var45 = ((var85 | var43 << 9) & 63488) >> 11 | var42 << 5;
            int var87 = ((((var85 | var43 << 9) & 63488) >> 11 | var42 << 5) & 64512) >> 10;
            char var46 = (char)(((((var10004 | var42 << 5) & 64512) >> 10 | (((var85 | var43 << 9) & 63488) >> 11 | var42 << 5) << 6) ^ 221 ^ 153) - 18);
            var13.setCharAt(var23, (char)(((var87 | var45 << 6) ^ 221 ^ 153) - 18));
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = (419946506 ^ 886351211 | 0) & 1378662928; var29 < var16.length(); var29 += -138680872 & -138680872 ^ -138680871) {
            int var51 = var16.charAt(var29) - '?';
            char var56 = (char)(
               (
                        (
                              (
                                       (
                                                (
                                                      (
                                                               (
                                                                     ((((var51 & 65408) >> 7 | var51 << 9) - 114 ^ 140) & 61440) >> 12
                                                                        | (((var51 & 65408) >> 7 | var51 << 9) - 114 ^ 140) << 4
                                                                  )
                                                                  & 65532
                                                            )
                                                            >> 2
                                                         | (
                                                               ((((var51 & 65408) >> 7 | var51 << 9) - 114 ^ 140) & 61440) >> 12
                                                                  | (((var51 & 65408) >> 7 | var51 << 9) - 114 ^ 140) << 4
                                                            )
                                                            << 14
                                                   )
                                                   ^ 99
                                             )
                                             + 127
                                          & 64512
                                    )
                                    >> 10
                                 | (
                                          (
                                                (
                                                         (
                                                               ((((var51 & 65408) >> 7 | var51 << 9) - 114 ^ 140) & 61440) >> 12
                                                                  | (((var51 & 65408) >> 7 | var51 << 9) - 114 ^ 140) << 4
                                                            )
                                                            & 65532
                                                      )
                                                      >> 2
                                                   | (
                                                         ((((var51 & 65408) >> 7 | var51 << 9) - 114 ^ 140) & 61440) >> 12
                                                            | (((var51 & 65408) >> 7 | var51 << 9) - 114 ^ 140) << 4
                                                      )
                                                      << 14
                                             )
                                             ^ 99
                                       )
                                       + 127
                                    << 6
                           )
                           & 65535
                     )
                     >> 0
                  | (
                        (
                                 (
                                          (
                                                (
                                                         (
                                                               ((((var51 & 65408) >> 7 | var51 << 9) - 114 ^ 140) & 61440) >> 12
                                                                  | (((var51 & 65408) >> 7 | var51 << 9) - 114 ^ 140) << 4
                                                            )
                                                            & 65532
                                                      )
                                                      >> 2
                                                   | (
                                                         ((((var51 & 65408) >> 7 | var51 << 9) - 114 ^ 140) & 61440) >> 12
                                                            | (((var51 & 65408) >> 7 | var51 << 9) - 114 ^ 140) << 4
                                                      )
                                                      << 14
                                             )
                                             ^ 99
                                       )
                                       + 127
                                    & 64512
                              )
                              >> 10
                           | (
                                    (
                                          (
                                                   (
                                                         ((((var51 & 65408) >> 7 | var51 << 9) - 114 ^ 140) & 61440) >> 12
                                                            | (((var51 & 65408) >> 7 | var51 << 9) - 114 ^ 140) << 4
                                                      )
                                                      & 65532
                                                )
                                                >> 2
                                             | (
                                                   ((((var51 & 65408) >> 7 | var51 << 9) - 114 ^ 140) & 61440) >> 12
                                                      | (((var51 & 65408) >> 7 | var51 << 9) - 114 ^ 140) << 4
                                                )
                                                << 14
                                       )
                                       ^ 99
                                 )
                                 + 127
                              << 6
                     )
                     << 16
            );
            var16.setCharAt(
               var29,
               (char)(
                  (
                           (
                                 (
                                          (
                                                   (
                                                         (
                                                                  (
                                                                        ((((var51 & 65408) >> 7 | var51 << 9) - 114 ^ 140) & 61440) >> 12
                                                                           | (((var51 & 65408) >> 7 | var51 << 9) - 114 ^ 140) << 4
                                                                     )
                                                                     & 65532
                                                               )
                                                               >> 2
                                                            | (
                                                                  ((((var51 & 65408) >> 7 | var51 << 9) - 114 ^ 140) & 61440) >> 12
                                                                     | (((var51 & 65408) >> 7 | var51 << 9) - 114 ^ 140) << 4
                                                               )
                                                               << 14
                                                      )
                                                      ^ 99
                                                )
                                                + 127
                                             & 64512
                                       )
                                       >> 10
                                    | (
                                             (
                                                   (
                                                            (
                                                                  ((((var51 & 65408) >> 7 | var51 << 9) - 114 ^ 140) & 61440) >> 12
                                                                     | (((var51 & 65408) >> 7 | var51 << 9) - 114 ^ 140) << 4
                                                               )
                                                               & 65532
                                                         )
                                                         >> 2
                                                      | (
                                                            ((((var51 & 65408) >> 7 | var51 << 9) - 114 ^ 140) & 61440) >> 12
                                                               | (((var51 & 65408) >> 7 | var51 << 9) - 114 ^ 140) << 4
                                                         )
                                                         << 14
                                                )
                                                ^ 99
                                          )
                                          + 127
                                       << 6
                              )
                              & 65535
                        )
                        >> 0
                     | (
                           (
                                    (
                                             (
                                                   (
                                                            (
                                                                  ((((var51 & 65408) >> 7 | var51 << 9) - 114 ^ 140) & 61440) >> 12
                                                                     | (((var51 & 65408) >> 7 | var51 << 9) - 114 ^ 140) << 4
                                                               )
                                                               & 65532
                                                         )
                                                         >> 2
                                                      | (
                                                            ((((var51 & 65408) >> 7 | var51 << 9) - 114 ^ 140) & 61440) >> 12
                                                               | (((var51 & 65408) >> 7 | var51 << 9) - 114 ^ 140) << 4
                                                         )
                                                         << 14
                                                )
                                                ^ 99
                                          )
                                          + 127
                                       & 64512
                                 )
                                 >> 10
                              | (
                                       (
                                             (
                                                      (
                                                            ((((var51 & 65408) >> 7 | var51 << 9) - 114 ^ 140) & 61440) >> 12
                                                               | (((var51 & 65408) >> 7 | var51 << 9) - 114 ^ 140) << 4
                                                         )
                                                         & 65532
                                                   )
                                                   >> 2
                                                | (
                                                      ((((var51 & 65408) >> 7 | var51 << 9) - 114 ^ 140) & 61440) >> 12
                                                         | (((var51 & 65408) >> 7 | var51 << 9) - 114 ^ 140) << 4
                                                   )
                                                   << 14
                                          )
                                          ^ 99
                                    )
                                    + 127
                                 << 6
                        )
                        << 16
               )
            );
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_329.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = (-968089910 | -968089910 | 0) & 16998673; var35 < var19.length(); var35 += 1650405143 >>> 1650405143 ^ 197) {
            int var61 = ((var19.charAt(var35) - 244 ^ 228) + 226 ^ 91) + 50;
            char var64 = (char)(
               (
                     ((((((var61 & 57344) >> 13 | var61 << 3) ^ 109) & 61440) >> 12 | (((var61 & 57344) >> 13 | var61 << 3) ^ 109) << 4) & 65528) >> 3
                        | (((((var61 & 57344) >> 13 | var61 << 3) ^ 109) & 61440) >> 12 | (((var61 & 57344) >> 13 | var61 << 3) ^ 109) << 4) << 13
                  )
                  + 91
            );
            var19.setCharAt(
               var35,
               (char)(
                  (
                        ((((((var61 & 57344) >> 13 | var61 << 3) ^ 109) & 61440) >> 12 | (((var61 & 57344) >> 13 | var61 << 3) ^ 109) << 4) & 65528) >> 3
                           | (((((var61 & 57344) >> 13 | var61 << 3) ^ 109) & 61440) >> 12 | (((var61 & 57344) >> 13 | var61 << 3) ^ 109) << 4) << 13
                     )
                     + 91
               )
            );
         }

         Class var7 = Class.forName(var19.toString(), false, Class_329.class.getClassLoader());
         switch (((var4 - 1754480358 - 1132120233 ^ 1791585187) + 2016416350 + 1477337623 + 1210469080 ^ 1267256077) + 753497356 - 1798283868 + 666012705) {
            case 953339461:
               var10000 = var0.findConstructor(var7, var6);
               break;
            case 1051954552:
            case 2113614208:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 1330713733:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            case 1758105083:
               var10000 = var0.findSpecial(var7, var5, var6, Class_329.class);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      ntsa[((var10 - 831768024 + 1571766395 + 217501476 + 140241245 ^ 529382277 ^ 1475311327 ^ 339940454) - 354493983 ^ 1141920553) - 575253987] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1162(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = (var10 - 372513568 + 898365888 - 1984956754 + 1741944509 ^ 83791192) - 2000363803 - 1754065487 + 2099669406 ^ 2139237960;
      MethodHandle var10000 = ntsa[((var10 - 372513568 + 898365888 - 1984956754 + 1741944509 ^ 83791192) - 2000363803 - 1754065487 + 2099669406 ^ 2139237960)
         - 1448251453];
      if (ntsa[var10001 - 1448251453] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = 2037952240 & 2037952240 << 1159746560 ^ 2037952240; var24 < var14.length(); var24 += -1575819240 >> 232669244 ^ -5) {
            char var43 = var14.charAt(var24);
            char var48 = (char)(
               (
                     (
                              (
                                    (
                                             (
                                                      (
                                                               (
                                                                     ((((var43 & '￼') >> 2 | var43 << 14) + 228 ^ 136) & 57344) >> 13
                                                                        | (((var43 & '￼') >> 2 | var43 << 14) + 228 ^ 136) << 3
                                                                  )
                                                                  & 32768
                                                            )
                                                            >> 15
                                                         | (
                                                               ((((var43 & '￼') >> 2 | var43 << 14) + 228 ^ 136) & 57344) >> 13
                                                                  | (((var43 & '￼') >> 2 | var43 << 14) + 228 ^ 136) << 3
                                                            )
                                                            << 1
                                                   )
                                                   - 47
                                                & 65520
                                          )
                                          >> 4
                                       | (
                                                (
                                                         (
                                                               ((((var43 & '￼') >> 2 | var43 << 14) + 228 ^ 136) & 57344) >> 13
                                                                  | (((var43 & '￼') >> 2 | var43 << 14) + 228 ^ 136) << 3
                                                            )
                                                            & 32768
                                                      )
                                                      >> 15
                                                   | (
                                                         ((((var43 & '￼') >> 2 | var43 << 14) + 228 ^ 136) & 57344) >> 13
                                                            | (((var43 & '￼') >> 2 | var43 << 14) + 228 ^ 136) << 3
                                                      )
                                                      << 1
                                             )
                                             - 47
                                          << 12
                                 )
                                 & 65504
                           )
                           >> 5
                        | (
                              (
                                       (
                                                (
                                                         (
                                                               ((((var43 & '￼') >> 2 | var43 << 14) + 228 ^ 136) & 57344) >> 13
                                                                  | (((var43 & '￼') >> 2 | var43 << 14) + 228 ^ 136) << 3
                                                            )
                                                            & 32768
                                                      )
                                                      >> 15
                                                   | (
                                                         ((((var43 & '￼') >> 2 | var43 << 14) + 228 ^ 136) & 57344) >> 13
                                                            | (((var43 & '￼') >> 2 | var43 << 14) + 228 ^ 136) << 3
                                                      )
                                                      << 1
                                             )
                                             - 47
                                          & 65520
                                    )
                                    >> 4
                                 | (
                                          (
                                                   (
                                                         ((((var43 & '￼') >> 2 | var43 << 14) + 228 ^ 136) & 57344) >> 13
                                                            | (((var43 & '￼') >> 2 | var43 << 14) + 228 ^ 136) << 3
                                                      )
                                                      & 32768
                                                )
                                                >> 15
                                             | (
                                                   ((((var43 & '￼') >> 2 | var43 << 14) + 228 ^ 136) & 57344) >> 13
                                                      | (((var43 & '￼') >> 2 | var43 << 14) + 228 ^ 136) << 3
                                                )
                                                << 1
                                       )
                                       - 47
                                    << 12
                           )
                           << 11
                  )
                  ^ 127
                  ^ 36
            );
            var14.setCharAt(
               var24,
               (char)(
                  (
                        (
                                 (
                                       (
                                                (
                                                         (
                                                                  (
                                                                        ((((var43 & '￼') >> 2 | var43 << 14) + 228 ^ 136) & 57344) >> 13
                                                                           | (((var43 & '￼') >> 2 | var43 << 14) + 228 ^ 136) << 3
                                                                     )
                                                                     & 32768
                                                               )
                                                               >> 15
                                                            | (
                                                                  ((((var43 & '￼') >> 2 | var43 << 14) + 228 ^ 136) & 57344) >> 13
                                                                     | (((var43 & '￼') >> 2 | var43 << 14) + 228 ^ 136) << 3
                                                               )
                                                               << 1
                                                      )
                                                      - 47
                                                   & 65520
                                             )
                                             >> 4
                                          | (
                                                   (
                                                            (
                                                                  ((((var43 & '￼') >> 2 | var43 << 14) + 228 ^ 136) & 57344) >> 13
                                                                     | (((var43 & '￼') >> 2 | var43 << 14) + 228 ^ 136) << 3
                                                               )
                                                               & 32768
                                                         )
                                                         >> 15
                                                      | (
                                                            ((((var43 & '￼') >> 2 | var43 << 14) + 228 ^ 136) & 57344) >> 13
                                                               | (((var43 & '￼') >> 2 | var43 << 14) + 228 ^ 136) << 3
                                                         )
                                                         << 1
                                                )
                                                - 47
                                             << 12
                                    )
                                    & 65504
                              )
                              >> 5
                           | (
                                 (
                                          (
                                                   (
                                                            (
                                                                  ((((var43 & '￼') >> 2 | var43 << 14) + 228 ^ 136) & 57344) >> 13
                                                                     | (((var43 & '￼') >> 2 | var43 << 14) + 228 ^ 136) << 3
                                                               )
                                                               & 32768
                                                         )
                                                         >> 15
                                                      | (
                                                            ((((var43 & '￼') >> 2 | var43 << 14) + 228 ^ 136) & 57344) >> 13
                                                               | (((var43 & '￼') >> 2 | var43 << 14) + 228 ^ 136) << 3
                                                         )
                                                         << 1
                                                )
                                                - 47
                                             & 65520
                                       )
                                       >> 4
                                    | (
                                             (
                                                      (
                                                            ((((var43 & '￼') >> 2 | var43 << 14) + 228 ^ 136) & 57344) >> 13
                                                               | (((var43 & '￼') >> 2 | var43 << 14) + 228 ^ 136) << 3
                                                         )
                                                         & 32768
                                                   )
                                                   >> 15
                                                | (
                                                      ((((var43 & '￼') >> 2 | var43 << 14) + 228 ^ 136) & 57344) >> 13
                                                         | (((var43 & '￼') >> 2 | var43 << 14) + 228 ^ 136) << 3
                                                   )
                                                   << 1
                                          )
                                          - 47
                                       << 12
                              )
                              << 11
                     )
                     ^ 127
                     ^ 36
               )
            );
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = -601668252 * (-601668252 >>> (-601668252 >> -601668252)) ^ -1187084352;
            var30 < var17.length();
            var30 += -816689198 * 1619183632 ^ -1943728863
         ) {
            int var53 = var17.charAt(var30) - 'l' + 211;
            int var94 = (var53 & 49152) >> 14;
            int var54 = ((var53 & 49152) >> 14 | var53 << 2) + 232;
            int var95 = (((var53 & 49152) >> 14 | var53 << 2) + 232 & 63488) >> 11;
            var53 = ((((var94 | var53 << 2) + 232 & 63488) >> 11 | ((var53 & 49152) >> 14 | var53 << 2) + 232 << 5) ^ 237) - 9 - 62;
            var94 = (((var95 | var54 << 5) ^ 237) - 9 - 62 & 65472) >> 6;
            int var56 = (((var95 | var54 << 5) ^ 237) - 9 - 62 & 65472) >> 6 | var53 << 10;
            int var97 = (((((var95 | var54 << 5) ^ 237) - 9 - 62 & 65472) >> 6 | var53 << 10) & 63488) >> 11;
            char var57 = (char)(((var94 | var53 << 10) & 63488) >> 11 | ((((var95 | var54 << 5) ^ 237) - 9 - 62 & 65472) >> 6 | var53 << 10) << 5);
            var17.setCharAt(var30, (char)(var97 | var56 << 5));
         }

         Class var6 = Class.forName(var17.toString(), false, Class_329.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = (2116816089 << -548953676 | 0) & 543174831; var36 < var20.length(); var36 += (-1812350008 ^ -391843265 | 1) & -2071821815) {
            int var62 = (var20.charAt(var36) ^ '%' ^ 33) + 203;
            char var67 = (char)(
               (
                        (
                                 (
                                       (
                                                (
                                                      (
                                                               (
                                                                     (((var62 & 32768) >> 15 | var62 << 1) & 65472) >> 6
                                                                        | ((var62 & 32768) >> 15 | var62 << 1) << 10
                                                                  )
                                                                  & 63488
                                                            )
                                                            >> 11
                                                         | ((((var62 & 32768) >> 15 | var62 << 1) & 65472) >> 6 | ((var62 & 32768) >> 15 | var62 << 1) << 10)
                                                            << 5
                                                   )
                                                   & 61440
                                             )
                                             >> 12
                                          | (
                                                (((((var62 & 32768) >> 15 | var62 << 1) & 65472) >> 6 | ((var62 & 32768) >> 15 | var62 << 1) << 10) & 63488)
                                                      >> 11
                                                   | ((((var62 & 32768) >> 15 | var62 << 1) & 65472) >> 6 | ((var62 & 32768) >> 15 | var62 << 1) << 10) << 5
                                             )
                                             << 4
                                    )
                                    & 49152
                              )
                              >> 14
                           | (
                                 (
                                          (
                                                (((((var62 & 32768) >> 15 | var62 << 1) & 65472) >> 6 | ((var62 & 32768) >> 15 | var62 << 1) << 10) & 63488)
                                                      >> 11
                                                   | ((((var62 & 32768) >> 15 | var62 << 1) & 65472) >> 6 | ((var62 & 32768) >> 15 | var62 << 1) << 10) << 5
                                             )
                                             & 61440
                                       )
                                       >> 12
                                    | (
                                          (((((var62 & 32768) >> 15 | var62 << 1) & 65472) >> 6 | ((var62 & 32768) >> 15 | var62 << 1) << 10) & 63488) >> 11
                                             | ((((var62 & 32768) >> 15 | var62 << 1) & 65472) >> 6 | ((var62 & 32768) >> 15 | var62 << 1) << 10) << 5
                                       )
                                       << 4
                              )
                              << 2
                     )
                     - 219
                  ^ 67
            );
            var20.setCharAt(
               var36,
               (char)(
                  (
                           (
                                    (
                                          (
                                                   (
                                                         (
                                                                  (
                                                                        (((var62 & 32768) >> 15 | var62 << 1) & 65472) >> 6
                                                                           | ((var62 & 32768) >> 15 | var62 << 1) << 10
                                                                     )
                                                                     & 63488
                                                               )
                                                               >> 11
                                                            | ((((var62 & 32768) >> 15 | var62 << 1) & 65472) >> 6 | ((var62 & 32768) >> 15 | var62 << 1) << 10)
                                                               << 5
                                                      )
                                                      & 61440
                                                )
                                                >> 12
                                             | (
                                                   (((((var62 & 32768) >> 15 | var62 << 1) & 65472) >> 6 | ((var62 & 32768) >> 15 | var62 << 1) << 10) & 63488)
                                                         >> 11
                                                      | ((((var62 & 32768) >> 15 | var62 << 1) & 65472) >> 6 | ((var62 & 32768) >> 15 | var62 << 1) << 10) << 5
                                                )
                                                << 4
                                       )
                                       & 49152
                                 )
                                 >> 14
                              | (
                                    (
                                             (
                                                   (((((var62 & 32768) >> 15 | var62 << 1) & 65472) >> 6 | ((var62 & 32768) >> 15 | var62 << 1) << 10) & 63488)
                                                         >> 11
                                                      | ((((var62 & 32768) >> 15 | var62 << 1) & 65472) >> 6 | ((var62 & 32768) >> 15 | var62 << 1) << 10) << 5
                                                )
                                                & 61440
                                          )
                                          >> 12
                                       | (
                                             (((((var62 & 32768) >> 15 | var62 << 1) & 65472) >> 6 | ((var62 & 32768) >> 15 | var62 << 1) << 10) & 63488) >> 11
                                                | ((((var62 & 32768) >> 15 | var62 << 1) & 65472) >> 6 | ((var62 & 32768) >> 15 | var62 << 1) << 10) << 5
                                          )
                                          << 4
                                 )
                                 << 2
                        )
                        - 219
                     ^ 67
               )
            );
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_329.class.getClassLoader()).returnType();
         switch ((var4 ^ 645590190) + 1459457081 - 648451639 + 1281338443 - 1397508472 + 553765877 - 1706586001 + 508733604 + 1699244435 ^ 1692236702) {
            case 59693581:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            case 637211401:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            case 737555142:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            case 1650372971:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         ntsa[((var10 - 372513568 + 898365888 - 1984956754 + 1741944509 ^ 83791192) - 2000363803 - 1754065487 + 2099669406 ^ 2139237960) - 1448251453] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }

   public static native void guard();
}
