import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;
import net.minecraft.class_1799;

public enum Class_119 {
   // $VF: renamed from: txk Class_119
   field_1147,
   // $VF: renamed from: ypa Class_119
   field_1148,
   // $VF: renamed from: eez Class_119
   field_1149;

   // $VF: renamed from: dqv java.lang.String
   public String field_1150;
   // $VF: renamed from: uyr java.lang.String
   public String field_1151;
   // $VF: renamed from: jbp net.minecraft.class_1799
   public class_1799 field_1152;
   // $VF: renamed from: eoq Class_262
   public Class_262 field_1153;
   // $VF: renamed from: zmm java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_1155 = new MethodHandle[54];

   public Class_119(String var3, String var4, class_1799 var5, Class_262 var6) {
      this.field_1150 = var3;
      this.field_1151 = var4;
      this.field_1152 = var5;
      this.field_1153 = var6;
   }

   // $VF: Failed to inline enum fields
   // Please report this to the Vineflower issue tracker, at https://github.com/Vineflower/vineflower/issues with a copy of the class file (if you have the rights to distribute it!)
   static {
      int var10000 = (540287373 >>> 540287373 * 540287373 | 0) & -1204910742;

      StringBuilder var10001;
      for (var10001 = (StringBuilder)0<"JNT",-441179692,"沶樜樒樜樦沲","S聐䁌⁋쁍⁋\ue054职⁋쁌\ue04b\ue054恑聍䁍⁌쁌\ue04b恖⁔쁑","ꄟ궟ꜟ궟茟ꈟ궟ꌟꂟ茟隟ꘟꔟꆟꌟꂟ鴟ꞟꆟꈟ긟꾟ꔟ",683180256>("\ue5a3疤֤얣햤");
         var10000 < (1735114650 * (-647812296 | 1735114650 ^ -647812296) ^ 60496865);
         var10000 += (449967770 | 449967770 | 1) & 1159727361
      ) {
         char var13 = 0<"JNT",-403693351,"樈樞樌横泌樦","S⁐⁔恏","ꄟ궟ꜟ궟茟ꈟ궟ꌟꂟ茟隟ꘟꔟꆟꌟꂟ鴟ꞟꆟꈟ긟꾟ꔟ",683180551>(var10001, var10000);
         int var10004 = (var13 & '￠') >> 5;
         int var14 = ((var13 & '￠') >> 5 | var13 << 11) + 245 + 120 + 230;
         int var49 = (((var13 & '￠') >> 5 | var13 << 11) + 245 + 120 + 230 & 65408) >> 7;
         var13 = (char)(((var10004 | var13 << 11) + 245 + 120 + 230 & 65408) >> 7 | ((var13 & '￠') >> 5 | var13 << 11) + 245 + 120 + 230 << 9);
         0<"JNT",-403693351,"樨樄樦泈樞樌横泌樦","S⁐恏⁔쁑","ꄟ궟ꜟ궟茟ꈟ궟ꌟꂟ茟隟ꘟꔟꆟꌟꂟ鴟ꞟꆟꈟ긟꾟ꔟ",683180554>(var10001, var10000, (char)(var49 | var14 << 9));
      }

      String var1 = 0<"JNT",-403693351,"樦樐注樦横樜樒樀","S⁔聐䁌⁋쁍⁋\ue054职⁋쁌\ue04b\ue054恑聍䁍⁌쁌\ue04b恖","ꄟ궟ꜟ궟茟ꈟ궟ꌟꂟ茟隟ꘟꔟꆟꌟꂟ鴟ꞟꆟꈟ긟꾟ꔟ",683180261>(var10001);
      int var17 = -1960309002 >>> 1248316030 ^ 2;

      StringBuilder var35;
      for (var35 = (StringBuilder)0<"JNT",-441179692,"沶樜樒樜樦沲","S聐䁌⁋쁍⁋\ue054职⁋쁌\ue04b\ue054恑聍䁍⁌쁌\ue04b恖⁔쁑","ꄟ궟ꜟ궟茟ꈟ궟ꌟꂟ茟隟ꘟꔟꆟꌟꂟ鴟ꞟꆟꈟ긟꾟ꔟ",683180272>(
            "\u1775潴❴ݴ齴ྲྀ靵坴䝴❴靴"
         );
         var17 < ((-2059033964 >> -2059033964 | 11) & 1963);
         var17 += 654975254 ^ 1714264743 >> 1714264743 ^ 667318818
      ) {
         char var51 = 0<"JNT",-403693351,"樈樞樌横泌樦","S⁐⁔恏","ꄟ궟ꜟ궟茟ꈟ궟ꌟꂟ茟隟ꘟꔟꆟꌟꂟ鴟ꞟꆟꈟ긟꾟ꔟ",683180541>(var35, var17);
         char var54 = (char)(
            (((((((var51 & '\ufff0') >> 4 | var51 << '\f') ^ 243) & 61440) >> 12 | (((var51 & '\ufff0') >> 4 | var51 << '\f') ^ 243) << 4) ^ 71) & 63488) >> 11
               | ((((((var51 & '\ufff0') >> 4 | var51 << '\f') ^ 243) & 61440) >> 12 | (((var51 & '\ufff0') >> 4 | var51 << '\f') ^ 243) << 4) ^ 71) << 5
         );
         0<"JNT",-403693351,"樨樄樦泈樞樌横泌樦","S⁐恏⁔쁑","ꄟ궟ꜟ궟茟ꈟ궟ꌟꂟ茟隟ꘟꔟꆟꌟꂟ鴟ꞟꆟꈟ긟꾟ꔟ",683180264>(
            var35,
            var17,
            (char)(
               (((((((var51 & '\ufff0') >> 4 | var51 << '\f') ^ 243) & 61440) >> 12 | (((var51 & '\ufff0') >> 4 | var51 << '\f') ^ 243) << 4) ^ 71) & 63488)
                     >> 11
                  | ((((((var51 & '\ufff0') >> 4 | var51 << '\f') ^ 243) & 61440) >> 12 | (((var51 & '\ufff0') >> 4 | var51 << '\f') ^ 243) << 4) ^ 71) << 5
            )
         );
      }

      String var19 = 0<"JNT",-403693351,"樦樐注樦横樜樒樀","S⁔聐䁌⁋쁍⁋\ue054职⁋쁌\ue04b\ue054恑聍䁍⁌쁌\ue04b恖","ꄟ궟ꜟ궟茟ꈟ궟ꌟꂟ茟隟ꘟꔟꆟꌟꂟ鴟ꞟꆟꈟ긟꾟ꔟ",683180271>(var35);
      int var37 = (1312773791 << 1456422433 | 0) & 1107361921;

      StringBuilder var56;
      for (var56 = (StringBuilder)0<"JNT",-441179692,"沶樜樒樜樦沲","S聐䁌⁋쁍⁋\ue054职⁋쁌\ue04b\ue054恑聍䁍⁌쁌\ue04b恖⁔쁑","ꄟ궟ꜟ궟茟ꈟ궟ꌟꂟ茟隟ꘟꔟꆟꌟꂟ鴟ꞟꆟꈟ긟꾟ꔟ",683180274>(
            "֞ڎ\u070eݞɾޮ\u07beݮݾݾێھ"
         );
         var37 < ((-824872295 | -1213332826 * -1825794649 | 4) & 287311148);
         var37 += (126381589 * -570509660 | 1) & -729806845
      ) {
         int var78 = 0<"JNT",-403693351,"樈樞樌横泌樦","S⁐⁔恏","ꄟ궟ꜟ궟茟ꈟ궟ꌟꂟ茟隟ꘟꔟꆟꌟꂟ鴟ꞟꆟꈟ긟꾟ꔟ",683180255>(var56, var37) - 'B' - 199 + 59;
         char var79 = (char)(((var78 & 65520) >> 4 | var78 << 12) + 5);
         0<"JNT",-403693351,"樨樄樦泈樞樌横泌樦","S⁐恏⁔쁑","ꄟ궟ꜟ궟茟ꈟ궟ꌟꂟ茟隟ꘟꔟꆟꌟꂟ鴟ꞟꆟꈟ긟꾟ꔟ",683180258>(var56, var37, (char)(((var78 & 65520) >> 4 | var78 << 12) + 5));
      }

      field_1147 = (Class_119)0<"JNT",-441179692,"沶樜樒樜樦沲","S聐䁌⁋쁍⁋\ue054职⁋쁌\ue04b\ue054恑聍䁍⁌쁌\ue04b恖⁐聐䁌⁋쁍⁋\ue054职⁋쁌\ue04b\ue054恑聍䁍⁌쁌\ue04b恖聐䁌⁋쁍⁋\ue054职⁋쁌\ue04b\ue054恑聍䁍⁌쁌\ue04b恖聐쁌ꁋ聍\ue054ꁌ⁌쁌ꁋ恋䁍⁋쁋聍\ue054恋职⁋恍恍\ue052⁕\ue055⁖⁖恖聐L\ue04d恖⁔쁑","ꀟ릟",683180269>(
         var1,
         0,
         var19,
         0<"JNT",-403693351,"樦樐注樦横樜樒樀","S⁔聐䁌⁋쁍⁋\ue054职⁋쁌\ue04b\ue054恑聍䁍⁌쁌\ue04b恖","ꄟ궟ꜟ궟茟ꈟ궟ꌟꂟ茟隟ꘟꔟꆟꌟꂟ鴟ꞟꆟꈟ긟꾟ꔟ",683180273>(var56),
         (class_1799)0<"JNT",-441179692,"沶樜樒樜樦沲","S聐쁌ꁋ聍\ue054ꁌ⁌쁌ꁋ恋䁍⁋쁋聍\ue054恋职⁋恍恍\ue052⁕⁖恕ꁕ恖⁔쁑","ꌟ꾟ꘟ茟ꎟꆟꌟ꾟꺟ꔟ궟꼟ꘟ茟꺟ꈟ궟ꚟꚟ겟薟颟馟馟",683180267>(
            1<"JNT",1807188650,"⪮ꪯꪭ⪱⪭ꪪ\uaad3\uaad6\uaad5⫔\uaad5","욏蚍䚑왿蚏蚎욏蚍ڍ욐蚌욍䚑왿ڍ䚏蚌ڑڑڌ蚀䚂䚀욀","㥅㕅쥅䅆╆\ue946㵅䕆㕆䅆╆െ텆ᕆⅆ\ue946㵅െ䥆ᕆ쵆쵆絆핅\udd45\uf545텅\ued45",-1964976370>()
         ),
         (Class_262)0<"JNT",-441179692,"沶樜樒樜樦沲","S⁐⁐⁐⁐⁔쁑","ꐟ뢟",683180270>(255, 200, 60, 255)
      );
      var10000 = (855429944 * 1052835636 | 0) & 268439556;

      for (var10001 = (StringBuilder)0<"JNT",-441179692,"沶樜樒樜樦沲","S聐䁌⁋쁍⁋\ue054职⁋쁌\ue04b\ue054恑聍䁍⁌쁌\ue04b恖⁔쁑","ꄟ궟ꜟ궟茟ꈟ궟ꌟꂟ茟隟ꘟꔟꆟꌟꂟ鴟ꞟꆟꈟ긟꾟ꔟ",683180248>("﵋ﲣﵣﵫ");
         var10000 < ((1675347088 | -636654944) ^ -69210444);
         var10000 += (452223845 << -717797149 | 1) & 5530769
      ) {
         var17 = (0<"JNT",-403693351,"樈樞樌横泌樦","S⁐⁔恏","ꄟ궟ꜟ궟茟ꈟ궟ꌟꂟ茟隟ꘟꔟꆟꌟꂟ鴟ꞟꆟꈟ긟꾟ꔟ",683180547>(var10001, var10000) ^ 'a') + 117;
         char var22 = (char)(((var17 & 65528) >> 3 | var17 << 13) + 125 ^ 98);
         0<"JNT",-403693351,"樨樄樦泈樞樌横泌樦","S⁐恏⁔쁑","ꄟ궟ꜟ궟茟ꈟ궟ꌟꂟ茟隟ꘟꔟꆟꌟꂟ鴟ꞟꆟꈟ긟꾟ꔟ",683180550>(
            var10001, var10000, (char)(((var17 & 65528) >> 3 | var17 << 13) + 125 ^ 98)
         );
      }

      String var4 = 0<"JNT",-403693351,"樦樐注樦横樜樒樀","S⁔聐䁌⁋쁍⁋\ue054职⁋쁌\ue04b\ue054恑聍䁍⁌쁌\ue04b恖","ꄟ궟ꜟ궟茟ꈟ궟ꌟꂟ茟隟ꘟꔟꆟꌟꂟ鴟ꞟꆟꈟ긟꾟ꔟ",683180533>(var10001);
      var17 = (2124112988 ^ 2069336530 + (2124112988 ^ 2069336530) | 0) & 6146;

      for (var35 = (StringBuilder)0<"JNT",-441179692,"沶樜樒樜樦沲","S聐䁌⁋쁍⁋\ue054职⁋쁌\ue04b\ue054恑聍䁍⁌쁌\ue04b恖⁔쁑","ꄟ궟ꜟ궟茟ꈟ궟ꌟꂟ茟隟ꘟꔟꆟꌟꂟ鴟ꞟꆟꈟ긟꾟ꔟ",683180544>("⧩ど㑩㟩");
         var17 < (-18125178 - -1556481024 ^ 1538355842);
         var17 += (591369526 & 2087564089 | 1) & 1586506381
      ) {
         int var60 = 0<"JNT",-403693351,"樈樞樌横泌樦","S⁐⁔恏","ꄟ궟ꜟ궟茟ꈟ궟ꌟꂟ茟隟ꘟꔟꆟꌟꂟ鴟ꞟꆟꈟ긟꾟ꔟ",683180531>(var35, var17) - 226 + 205 ^ 212;
         int var99 = (var60 & 65024) >> 9;
         int var61 = (var60 & 65024) >> 9 | var60 << 7;
         int var100 = (((var60 & 65024) >> 9 | var60 << 7) & 49152) >> 14;
         char var62 = (char)(((var99 | var60 << 7) & 49152) >> 14 | ((var60 & 65024) >> 9 | var60 << 7) << 2);
         0<"JNT",-403693351,"樨樄樦泈樞樌横泌樦","S⁐恏⁔쁑","ꄟ궟ꜟ궟茟ꈟ궟ꌟꂟ茟隟ꘟꔟꆟꌟꂟ鴟ꞟꆟꈟ긟꾟ꔟ",683180534>(var35, var17, (char)(var100 | var61 << 2));
      }

      String var26 = 0<"JNT",-403693351,"樦樐注樦横樜樒樀","S⁔聐䁌⁋쁍⁋\ue054职⁋쁌\ue04b\ue054恑聍䁍⁌쁌\ue04b恖","ꄟ궟ꜟ궟茟ꈟ궟ꌟꂟ茟隟ꘟꔟꆟꌟꂟ鴟ꞟꆟꈟ긟꾟ꔟ",683180263>(var35);
      int var42 = (1637315070 * 1637315070 | 0) & -703035552;

      for (var56 = (StringBuilder)0<"JNT",-441179692,"沶樜樒樜樦沲","S聐䁌⁋쁍⁋\ue054职⁋쁌\ue04b\ue054恑聍䁍⁌쁌\ue04b恖⁔쁑","ꄟ궟ꜟ궟茟ꈟ궟ꌟꂟ茟隟ꘟꔟꆟꌟꂟ鴟ꞟꆟꈟ긟꾟ꔟ",683180266>(
            "\uf48f\uf69f\uf5af\uf6bf\uf69f\uf5ef\uf59f\uf05f\uf6bf\uf5af\uf52f\uf57f\uf52f\uf57f\uf5cf"
         );
         var42 < ((-1041015816 ^ -1041015816 | 15) & 1403867727);
         var42 += (369813007 | -778588386) ^ -677384418
      ) {
         char var84 = 0<"JNT",-403693351,"樈樞樌横泌樦","S⁐⁔恏","ꄟ궟ꜟ궟茟ꈟ궟ꌟꂟ茟隟ꘟꔟꆟꌟꂟ鴟ꞟꆟꈟ긟꾟ꔟ",683180553>(var56, var42);
         int var108 = (var84 & '︀') >> 9;
         int var85 = (var84 & '︀') >> 9 | var84 << 7;
         int var109 = (((var84 & '︀') >> 9 | var84 << 7) & 63488) >> 11;
         var84 = (char)(((((var108 | var84 << 7) & 63488) >> 11 | ((var84 & '︀') >> 9 | var84 << 7) << 5) ^ 138) - 28 + 173);
         0<"JNT",-403693351,"樨樄樦泈樞樌横泌樦","S⁐恏⁔쁑","ꄟ궟ꜟ궟茟ꈟ궟ꌟꂟ茟隟ꘟꔟꆟꌟꂟ鴟ꞟꆟꈟ긟꾟ꔟ",683180548>(var56, var42, (char)(((var109 | var85 << 5) ^ 138) - 28 + 173));
      }

      field_1148 = (Class_119)0<"JNT",-441179692,"沶樜樒樜樦沲","S聐䁌⁋쁍⁋\ue054职⁋쁌\ue04b\ue054恑聍䁍⁌쁌\ue04b恖⁐聐䁌⁋쁍⁋\ue054职⁋쁌\ue04b\ue054恑聍䁍⁌쁌\ue04b恖聐䁌⁋쁍⁋\ue054职⁋쁌\ue04b\ue054恑聍䁍⁌쁌\ue04b恖聐쁌ꁋ聍\ue054ꁌ⁌쁌ꁋ恋䁍⁋쁋聍\ue054恋职⁋恍恍\ue052⁕\ue055⁖⁖恖聐L\ue04d恖⁔쁑","ꀟ릟",683180539>(
         var4,
         1,
         var26,
         0<"JNT",-403693351,"樦樐注樦横樜樒樀","S⁔聐䁌⁋쁍⁋\ue054职⁋쁌\ue04b\ue054恑聍䁍⁌쁌\ue04b恖","ꄟ궟ꜟ궟茟ꈟ궟ꌟꂟ茟隟ꘟꔟꆟꌟꂟ鴟ꞟꆟꈟ긟꾟ꔟ",683180543>(var56),
         (class_1799)0<"JNT",-441179692,"沶樜樒樜樦沲","S聐쁌ꁋ聍\ue054ꁌ⁌쁌ꁋ恋䁍⁋쁋聍\ue054恋职⁋恍恍\ue052⁕⁖恕ꁕ恖⁔쁑","ꌟ꾟ꘟ茟ꎟꆟꌟ꾟꺟ꔟ궟꼟ꘟ茟꺟ꈟ궟ꚟꚟ겟薟颟馟馟",683180545>(
            1<"JNT",1807188650,"⪮ꪯꪭ⪱⪭ꪪ⫗\uaad6⫓\uaad5","욏蚍䚑왿蚏蚎욏蚍ڍ욐蚌욍䚑왿ڍ䚏蚌ڑڑڌ蚀䚂䚀욀","㥅㕅쥅䅆╆\ue946㵅䕆㕆䅆╆െ텆ᕆⅆ\ue946㵅െ䥆ᕆ쵆쵆絆핅\udd45\uf545텅\ued45",-1964976372>()
         ),
         (Class_262)0<"JNT",-441179692,"沶樜樒樜樦沲","S⁐⁐⁐⁐⁔쁑","ꐟ뢟",683180540>(80, 150, 230, 255)
      );
      var10000 = 4166819 * -1486939953 ^ -1495959603;

      for (var10001 = (StringBuilder)0<"JNT",-441179692,"沶樜樒樜樦沲","S聐䁌⁋쁍⁋\ue054职⁋쁌\ue04b\ue054恑聍䁍⁌쁌\ue04b恖⁔쁑","ꄟ궟ꜟ궟茟ꈟ궟ꌟꂟ茟隟ꘟꔟꆟꌟꂟ鴟ꞟꆟꈟ긟꾟ꔟ",683180542>("ﾡﾛ羢ﾞﾙ羚ﾠ");
         var10000 < (-332407334 & -332407334 >>> -1394348153 ^ 548253);
         var10000 += -306190860 * -306190860 ^ -1197051759
      ) {
         char var28 = 0<"JNT",-403693351,"樈樞樌横泌樦","S⁐⁔恏","ꄟ궟ꜟ궟茟ꈟ궟ꌟꂟ茟隟ꘟꔟꆟꌟꂟ鴟ꞟꆟꈟ긟꾟ꔟ",683180537>(var10001, var10000);
         char var29 = (char)(((var28 & '耀') >> 15 | var28 << 1) + 83 + 80 - 125 + 235);
         0<"JNT",-403693351,"樨樄樦泈樞樌横泌樦","S⁐恏⁔쁑","ꄟ궟ꜟ궟茟ꈟ궟ꌟꂟ茟隟ꘟꔟꆟꌟꂟ鴟ꞟꆟꈟ긟꾟ꔟ",683180532>(
            var10001, var10000, (char)(((var28 & '耀') >> 15 | var28 << 1) + 83 + 80 - 125 + 235)
         );
      }

      String var7 = 0<"JNT",-403693351,"樦樐注樦横樜樒樀","S⁔聐䁌⁋쁍⁋\ue054职⁋쁌\ue04b\ue054恑聍䁍⁌쁌\ue04b恖","ꄟ궟ꜟ궟茟ꈟ궟ꌟꂟ茟隟ꘟꔟꆟꌟꂟ鴟ꞟꆟꈟ긟꾟ꔟ",683180259>(var10001);
      var17 = (-1180205234 & -1180205234 | 0) & 1112047744;

      for (var35 = (StringBuilder)0<"JNT",-441179692,"沶樜樒樜樦沲","S聐䁌⁋쁍⁋\ue054职⁋쁌\ue04b\ue054恑聍䁍⁌쁌\ue04b恖⁔쁑","ꄟ궟ꜟ궟茟ꈟ궟ꌟꂟ茟隟ꘟꔟꆟꌟꂟ鴟ꞟꆟꈟ긟꾟ꔟ",683180262>("陾飾骞馾顾颞騾驞驾駞騾馞");
         var17 < (-113109982 + 1537115217 ^ 1424005247);
         var17 += (1975435788 << 1975435788 | 1) & 324219709
      ) {
         char var68 = 0<"JNT",-403693351,"樈樞樌横泌樦","S⁐⁔恏","ꄟ궟ꜟ궟茟ꈟ궟ꌟꂟ茟隟ꘟꔟꆟꌟꂟ鴟ꞟꆟꈟ긟꾟ꔟ",683180535>(var35, var17);
         char var71 = (char)(
            (((((var68 & '︀') >> 9 | var68 << 7) + 230 - 44 & 65528) >> 3 | ((var68 & '︀') >> 9 | var68 << 7) + 230 - 44 << 13) & 65024) >> 9
               | ((((var68 & '︀') >> 9 | var68 << 7) + 230 - 44 & 65528) >> 3 | ((var68 & '︀') >> 9 | var68 << 7) + 230 - 44 << 13) << 7
         );
         0<"JNT",-403693351,"樨樄樦泈樞樌横泌樦","S⁐恏⁔쁑","ꄟ궟ꜟ궟茟ꈟ궟ꌟꂟ茟隟ꘟꔟꆟꌟꂟ鴟ꞟꆟꈟ긟꾟ꔟ",683180538>(
            var35,
            var17,
            (char)(
               (((((var68 & '︀') >> 9 | var68 << 7) + 230 - 44 & 65528) >> 3 | ((var68 & '︀') >> 9 | var68 << 7) + 230 - 44 << 13) & 65024) >> 9
                  | ((((var68 & '︀') >> 9 | var68 << 7) + 230 - 44 & 65528) >> 3 | ((var68 & '︀') >> 9 | var68 << 7) + 230 - 44 << 13) << 7
            )
         );
      }

      String var33 = 0<"JNT",-403693351,"樦樐注樦横樜樒樀","S⁔聐䁌⁋쁍⁋\ue054职⁋쁌\ue04b\ue054恑聍䁍⁌쁌\ue04b恖","ꄟ궟ꜟ궟茟ꈟ궟ꌟꂟ茟隟ꘟꔟꆟꌟꂟ鴟ꞟꆟꈟ긟꾟ꔟ",683180246>(var35);
      int var47 = 0;

      for (var56 = (StringBuilder)0<"JNT",-441179692,"沶樜樒樜樦沲","S聐䁌⁋쁍⁋\ue054职⁋쁌\ue04b\ue054恑聍䁍⁌쁌\ue04b恖⁔쁑","ꄟ궟ꜟ궟茟ꈟ궟ꌟꂟ茟隟ꘟꔟꆟꌟꂟ鴟ꞟꆟꈟ긟꾟ꔟ",683180245>(
            "ʗѯַׇֿ֧֟̏ԗַׇֿ֧\u05f7"
         );
         var47 < ((-1544781826 | 981698853) ^ -1141899279);
         var47 += (-466832080 & -466832080 | 1) & 198378115
      ) {
         int var92 = 0<"JNT",-403693351,"樈樞樌横泌樦","S⁐⁔恏","ꄟ궟ꜟ궟茟ꈟ궟ꌟꂟ茟隟ꘟꔟꆟꌟꂟ鴟ꞟꆟꈟ긟꾟ꔟ",683180265>(var56, var47) ^ 167;
         int var110 = (var92 & 32768) >> 15;
         int var93 = (var92 & 32768) >> 15 | var92 << 1;
         int var111 = (((var92 & 32768) >> 15 | var92 << 1) & 65520) >> 4;
         char var94 = (char)(((((var110 | var92 << 1) & 65520) >> 4 | ((var92 & 32768) >> 15 | var92 << 1) << 12) ^ 57) - 44);
         0<"JNT",-403693351,"樨樄樦泈樞樌横泌樦","S⁐恏⁔쁑","ꄟ궟ꜟ궟茟ꈟ궟ꌟꂟ茟隟ꘟꔟꆟꌟꂟ鴟ꞟꆟꈟ긟꾟ꔟ",683180260>(var56, var47, (char)(((var111 | var93 << 12) ^ 57) - 44));
      }

      field_1149 = (Class_119)0<"JNT",-441179692,"沶樜樒樜樦沲","S聐䁌⁋쁍⁋\ue054职⁋쁌\ue04b\ue054恑聍䁍⁌쁌\ue04b恖⁐聐䁌⁋쁍⁋\ue054职⁋쁌\ue04b\ue054恑聍䁍⁌쁌\ue04b恖聐䁌⁋쁍⁋\ue054职⁋쁌\ue04b\ue054恑聍䁍⁌쁌\ue04b恖聐쁌ꁋ聍\ue054ꁌ⁌쁌ꁋ恋䁍⁋쁋聍\ue054恋职⁋恍恍\ue052⁕\ue055⁖⁖恖聐L\ue04d恖⁔쁑","ꀟ릟",683180253>(
         var7,
         2,
         var33,
         0<"JNT",-403693351,"樦樐注樦横樜樒樀","S⁔聐䁌⁋쁍⁋\ue054职⁋쁌\ue04b\ue054恑聍䁍⁌쁌\ue04b恖","ꄟ궟ꜟ궟茟ꈟ궟ꌟꂟ茟隟ꘟꔟꆟꌟꂟ鴟ꞟꆟꈟ긟꾟ꔟ",683180257>(var56),
         (class_1799)0<"JNT",-441179692,"沶樜樒樜樦沲","S聐쁌ꁋ聍\ue054ꁌ⁌쁌ꁋ恋䁍⁋쁋聍\ue054恋职⁋恍恍\ue052⁕⁖恕ꁕ恖⁔쁑","ꌟ꾟ꘟ茟ꎟꆟꌟ꾟꺟ꔟ궟꼟ꘟ茟꺟ꈟ궟ꚟꚟ겟薟颟馟馟",683180251>(
            1<"JNT",1807188650,"⪮ꪯꪭ⪱⪭ꪪ⫔\uaad6⫓\uaad5\uaad3","욏蚍䚑왿蚏蚎욏蚍ڍ욐蚌욍䚑왿ڍ䚏蚌ڑڑڌ蚀䚂䚀욀","㥅㕅쥅䅆╆\ue946㵅䕆㕆䅆╆െ텆ᕆⅆ\ue946㵅െ䥆ᕆ쵆쵆絆핅\udd45\uf545텅\ued45",-1964976354>()
         ),
         (Class_262)0<"JNT",-441179692,"沶樜樒樜樦沲","S⁐⁐⁐⁐⁔쁑","ꐟ뢟",683180254>(220, 80, 80, 255)
      );
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1221(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = (var10 - 595554880 - 219646713 + 239046342 ^ 682503245 ^ 320664775) - 528921313 + 1482691010 ^ 946326113 ^ 1647445758;
      MethodHandle var10000 = field_1155[(var10 - 595554880 - 219646713 + 239046342 ^ 682503245 ^ 320664775) - 528921313 + 1482691010
         ^ 946326113
         ^ 1647445758
         ^ 754509136];
      if (field_1155[var10001 ^ 754509136] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = -1799486227 * -1799486227 ^ 1474577257; var23 < var13.length(); var23 += (682184508 - 75206735 | 1) & 29360401) {
            int var42 = var13.charAt(var23);
            int var10004 = (var42 & 65472) >> 6;
            int var43 = (((var42 & 65472) >> 6 | var42 << 10) - 254 + 8 ^ 154) + 111;
            int var85 = ((((var42 & 65472) >> 6 | var42 << 10) - 254 + 8 ^ 154) + 111 & 0) >> 16;
            var42 = ((((var10004 | var42 << 10) - 254 + 8 ^ 154) + 111 & 0) >> 16 | (((var42 & 65472) >> 6 | var42 << 10) - 254 + 8 ^ 154) + 111 << 0) + 236;
            var10004 = ((var85 | var43 << 0) + 236 & 65408) >> 7;
            int var45 = (((var85 | var43 << 0) + 236 & 65408) >> 7 | var42 << 9) ^ 115;
            int var87 = (((((var85 | var43 << 0) + 236 & 65408) >> 7 | var42 << 9) ^ 115) & 65520) >> 4;
            char var46 = (char)((((var10004 | var42 << 9) ^ 115) & 65520) >> 4 | ((((var85 | var43 << 0) + 236 & 65408) >> 7 | var42 << 9) ^ 115) << 12);
            var13.setCharAt(var23, (char)(var87 | var45 << 12));
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = 921160079 ^ 1717808640 + 921160079 ^ -1414742528; var29 < var16.length(); var29 += 808536881 * 85950679 ^ 787326502) {
            int var51 = var16.charAt(var29);
            int var88 = (var51 & 65532) >> 2;
            int var52 = (var51 & 65532) >> 2 | var51 << 14;
            int var89 = (((var51 & 65532) >> 2 | var51 << 14) & 49152) >> 14;
            var51 = (((var88 | var51 << 14) & 49152) >> 14 | ((var51 & 65532) >> 2 | var51 << 14) << 2) - 219;
            var88 = ((var89 | var52 << 2) - 219 & 65532) >> 2;
            int var54 = (((var89 | var52 << 2) - 219 & 65532) >> 2 | var51 << 14) - 18 - 19 + 201 ^ 157 ^ 30;
            int var91 = (((((var89 | var52 << 2) - 219 & 65532) >> 2 | var51 << 14) - 18 - 19 + 201 ^ 157 ^ 30) & 63488) >> 11;
            char var55 = (char)(
               (((var88 | var51 << 14) - 18 - 19 + 201 ^ 157 ^ 30) & 63488) >> 11
                  | ((((var89 | var52 << 2) - 219 & 65532) >> 2 | var51 << 14) - 18 - 19 + 201 ^ 157 ^ 30) << 5
            );
            var16.setCharAt(var29, (char)(var91 | var54 << 5));
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_119.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = (1634017328 << -2052559040 | 0) & 276844614; var35 < var19.length(); var35 += (613385217 & 2025033678 - -1950168948 | 1) & -651740999) {
            int var60 = var19.charAt(var35);
            int var92 = (var60 & 65408) >> 7;
            int var61 = (((var60 & 65408) >> 7 | var60 << 9) ^ 17) - 160 + 239;
            int var93 = ((((var60 & 65408) >> 7 | var60 << 9) ^ 17) - 160 + 239 & 0) >> 16;
            var60 = ((((var92 | var60 << 9) ^ 17) - 160 + 239 & 0) >> 16 | (((var60 & 65408) >> 7 | var60 << 9) ^ 17) - 160 + 239 << 0) + 39;
            var92 = ((var93 | var61 << 0) + 39 & 63488) >> 11;
            int var63 = (((var93 | var61 << 0) + 39 & 63488) >> 11 | var60 << 5) - 40;
            int var95 = ((((var93 | var61 << 0) + 39 & 63488) >> 11 | var60 << 5) - 40 & 65504) >> 5;
            char var64 = (char)((((var92 | var60 << 5) - 40 & 65504) >> 5 | (((var93 | var61 << 0) + 39 & 63488) >> 11 | var60 << 5) - 40 << 11) + 163);
            var19.setCharAt(var35, (char)((var95 | var63 << 11) + 163));
         }

         Class var7 = Class.forName(var19.toString(), false, Class_119.class.getClassLoader());
         switch ((((var4 - 1752748597 ^ 1344573824) - 2094651575 + 394305897 ^ 1856487410) - 1659881238 - 338012075 - 1279970597 ^ 1442567971) + 1442844248) {
            case 167450742:
               var10000 = var0.findConstructor(var7, var6);
               break;
            case 201791861:
            case 401117069:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 1351306707:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            case 1614058757:
               var10000 = var0.findSpecial(var7, var5, var6, Class_119.class);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_1155[(var10 - 595554880 - 219646713 + 239046342 ^ 682503245 ^ 320664775) - 528921313 + 1482691010 ^ 946326113 ^ 1647445758 ^ 754509136] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1222(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = (var10 - 175184507 - 607364652 + 783164346 + 408551171 - 1288405524 ^ 1052845860) - 1312742024 - 506262612 ^ 1498112532;
      MethodHandle var10000 = field_1155[(
            (var10 - 175184507 - 607364652 + 783164346 + 408551171 - 1288405524 ^ 1052845860) - 1312742024 - 506262612 ^ 1498112532
         )
         + 1526291663];
      if (field_1155[var10001 + 1526291663] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = -586942683 ^ -1770658622 ^ 1266029543; var24 < var14.length(); var24 += (-91630658 | 1851366912 - 2040482822 | 1) & 20973569) {
            int var43 = var14.charAt(var24) ^ 224;
            int var10004 = (var43 & 65532) >> 2;
            int var44 = (var43 & 65532) >> 2 | var43 << 14;
            int var82 = (((var43 & 65532) >> 2 | var43 << 14) & 65534) >> 1;
            var43 = (((var10004 | var43 << 14) & 65534) >> 1 | ((var43 & 65532) >> 2 | var43 << 14) << 15) + 60;
            var10004 = ((var82 | var44 << 15) + 60 & 65472) >> 6;
            int var46 = ((((var82 | var44 << 15) + 60 & 65472) >> 6 | var43 << 10) ^ 147 ^ 190) - 251;
            int var84 = (((((var82 | var44 << 15) + 60 & 65472) >> 6 | var43 << 10) ^ 147 ^ 190) - 251 & 65472) >> 6;
            char var47 = (char)(
               (
                     (((var10004 | var43 << 10) ^ 147 ^ 190) - 251 & 65472) >> 6
                        | ((((var82 | var44 << 15) + 60 & 65472) >> 6 | var43 << 10) ^ 147 ^ 190) - 251 << 10
                  )
                  + 13
            );
            var14.setCharAt(var24, (char)((var84 | var46 << 10) + 13));
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = -1616392776 + (566972416 >>> -1095986738) ^ -1616358171; var30 < var17.length(); var30 += (-1754089534 | -693182634) ^ -671154217) {
            int var52 = var17.charAt(var30) - 149;
            char var55 = (char)(
               (
                     (((((var52 & 65528) >> 3 | var52 << 13) & 65532) >> 2 | ((var52 & 65528) >> 3 | var52 << 13) << 14) - 52 & 65024) >> 9
                        | ((((var52 & 65528) >> 3 | var52 << 13) & 65532) >> 2 | ((var52 & 65528) >> 3 | var52 << 13) << 14) - 52 << 7
                  )
                  + 111
                  + 234
                  + 249
                  - 185
                  + 235
            );
            var17.setCharAt(
               var30,
               (char)(
                  (
                        (((((var52 & 65528) >> 3 | var52 << 13) & 65532) >> 2 | ((var52 & 65528) >> 3 | var52 << 13) << 14) - 52 & 65024) >> 9
                           | ((((var52 & 65528) >> 3 | var52 << 13) & 65532) >> 2 | ((var52 & 65528) >> 3 | var52 << 13) << 14) - 52 << 7
                     )
                     + 111
                     + 234
                     + 249
                     - 185
                     + 235
               )
            );
         }

         Class var6 = Class.forName(var17.toString(), false, Class_119.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = (-1483129333 >>> (2143917594 << 1210834947) | 0) & 1336823812;
            var36 < var20.length();
            var36 += (1677162359 >>> 1677162359 | 1) & -1701441487
         ) {
            int var60 = var20.charAt(var36) ^ 225;
            char var63 = (char)(
               (
                     (
                           (
                                    (
                                          (
                                                   (((var60 & 65520) >> 4 | var60 << 12) + 120 + 174 & 65408) >> 7
                                                      | ((var60 & 65520) >> 4 | var60 << 12) + 120 + 174 << 9
                                                )
                                                - 68
                                             ^ 121
                                       )
                                       & 32768
                                 )
                                 >> 15
                              | (
                                    ((((var60 & 65520) >> 4 | var60 << 12) + 120 + 174 & 65408) >> 7 | ((var60 & 65520) >> 4 | var60 << 12) + 120 + 174 << 9)
                                          - 68
                                       ^ 121
                                 )
                                 << 1
                        )
                        ^ 161
                  )
                  - 176
            );
            var20.setCharAt(
               var36,
               (char)(
                  (
                        (
                              (
                                       (
                                             (
                                                      (((var60 & 65520) >> 4 | var60 << 12) + 120 + 174 & 65408) >> 7
                                                         | ((var60 & 65520) >> 4 | var60 << 12) + 120 + 174 << 9
                                                   )
                                                   - 68
                                                ^ 121
                                          )
                                          & 32768
                                    )
                                    >> 15
                                 | (
                                       ((((var60 & 65520) >> 4 | var60 << 12) + 120 + 174 & 65408) >> 7 | ((var60 & 65520) >> 4 | var60 << 12) + 120 + 174 << 9)
                                             - 68
                                          ^ 121
                                    )
                                    << 1
                           )
                           ^ 161
                     )
                     - 176
               )
            );
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_119.class.getClassLoader()).returnType();
         switch (var4 + 1748903266 - 2128940476 + 884231024 + 644784535 - 715248081 + 885129452 - 1654854654 - 1534842508 + 1840604480 ^ 424084918) {
            case 520379018:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            case 1890399390:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            case 1993505264:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            case 2020672879:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_1155[((var10 - 175184507 - 607364652 + 783164346 + 408551171 - 1288405524 ^ 1052845860) - 1312742024 - 506262612 ^ 1498112532) + 1526291663] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
