import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;
import net.minecraft.class_1661;

public class Class_300 extends Class_342 {
   // $VF: renamed from: tsx Class_105
   public Class_105 field_1852;
   // $VF: renamed from: puj Class_105
   public Class_105 field_1853;
   // $VF: renamed from: wpx Class_105
   public Class_105 field_1854;
   // $VF: renamed from: wwi Class_49
   public Class_49 field_1855;
   // $VF: renamed from: mkw boolean
   public boolean field_1856;
   public boolean chhn;
   // $VF: renamed from: mrw java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_1857 = new MethodHandle[104];

   public Class_300() {
      int var1 = -1506830246;
      int var10001 = (1673440336 << 1831281214 | 0) & 690996526;

      StringBuilder var10002;
      for (var10002 = (StringBuilder)0<"JNT",-576851523,"䅷\uf577ॸ\uf577ⅸ䥷","躮횭મﲭ⊮ﲭ邮ᚮﲭኮ®邮\ud8ad⚮\u1aaeಮኮ®ꢮ貮\ue2ad","ڋ⪋\uf68a⪋ᚌ\u0e8b⪋ᚋ䊋ᚌ犋\uee8a\ue68aઋᚋ䊋ꚋ慠ઋ\u0e8b⺋㪋\ue68a",-2058582967>(
            "廀毀殀橀嚀往橀毀最榀柀嚀悀曀樀枀"
         );
         var10001 < ((-1756498117 >>> 1342656023 | 16) & -1293997999);
         var10001 += -711904771 << -711904771 ^ -1610612735
      ) {
         char var33 = 0<"JNT",-1191297688,"\udd77\uf177핷\u1978啷ⅸ","躮청貮뢭","ڋ⪋\uf68a⪋ᚌ\u0e8b⪋ᚋ䊋ᚌ犋\uee8a\ue68aઋᚋ䊋ꚋ慠ઋ\u0e8b⺋㪋\ue68a",-2058582928>(
            var10002, var10001
         );
         char var34 = (char)(((var33 & '\uffc0') >> 6 | var33 << '\n') - 239 + 100 - 10 - 165);
         0<"JNT",-1191297688,"ᵸ\ue577ⅸ嵷\uf177핷\u1978啷ⅸ","躮청뢭貮\ue2ad","ڋ⪋\uf68a⪋ᚌ\u0e8b⪋ᚋ䊋ᚌ犋\uee8a\ue68aઋᚋ䊋ꚋ慠ઋ\u0e8b⺋㪋\ue68a",-2058582927>(
            var10002, var10001, (char)(((var33 & '\uffc0') >> 6 | var33 << '\n') - 239 + 100 - 10 - 165)
         );
      }

      String var6 = 0<"JNT",-1191297688,"ⅸ൸鵷ⅸ\u1978\uf577ॸ\ued77","躮貮횭મﲭ⊮ﲭ邮ᚮﲭኮ®邮\ud8ad⚮\u1aaeಮኮ®ꢮ","ڋ⪋\uf68a⪋ᚌ\u0e8b⪋ᚋ䊋ᚌ犋\uee8a\ue68aઋᚋ䊋ꚋ慠ઋ\u0e8b⺋㪋\ue68a",-2058582965>(
         var10002
      );
      int var19 = -1479649200 << -1242765793 ^ 0;

      StringBuilder var36;
      for (var36 = (StringBuilder)0<"JNT",-576851523,"䅷\uf577ॸ\uf577ⅸ䥷","躮횭મﲭ⊮ﲭ邮ᚮﲭኮ®邮\ud8ad⚮\u1aaeಮኮ®ꢮ貮\ue2ad","ڋ⪋\uf68a⪋ᚌ\u0e8b⪋ᚋ䊋ᚌ犋\uee8a\ue68aઋᚋ䊋ꚋ慠ઋ\u0e8b⺋㪋\ue68a",-2058582944>(
            "\ue88d뢎뒎ꂎ颎梎뒎袎炎梎钎钎좎撍颎梎鲎梎肎碎낎撍뒎ꂎ뒎碎颎낎撍袎鲎撍ꂎ粎粎蒎梎鲎璎"
         );
         var19 < (2087388830 - 2087388830 ^ 39);
         var19 += (75156984 >>> 2065337463 | 1) & 890766531
      ) {
         int var63 = 0<"JNT",-1191297688,"\udd77\uf177핷\u1978啷ⅸ","躮청貮뢭","ڋ⪋\uf68a⪋ᚌ\u0e8b⪋ᚋ䊋ᚌ犋\uee8a\ue68aઋᚋ䊋ꚋ慠ઋ\u0e8b⺋㪋\ue68a",-2058582943>(var36, var19)
            - 145;
         int var10006 = (var63 & 57344) >> 13;
         int var64 = (var63 & 57344) >> 13 | var63 << 3;
         int var106 = (((var63 & 57344) >> 13 | var63 << 3) & 57344) >> 13;
         char var65 = (char)((((var10006 | var63 << 3) & 57344) >> 13 | ((var63 & 57344) >> 13 | var63 << 3) << 3) + 155 + 109);
         0<"JNT",-1191297688,"ᵸ\ue577ⅸ嵷\uf177핷\u1978啷ⅸ","躮청뢭貮\ue2ad","ڋ⪋\uf68a⪋ᚌ\u0e8b⪋ᚋ䊋ᚌ犋\uee8a\ue68aઋᚋ䊋ꚋ慠ઋ\u0e8b⺋㪋\ue68a",-2058582946>(
            var36, var19, (char)((var106 | var64 << 3) + 155 + 109)
         );
      }

      super(
         var6,
         0<"JNT",-1191297688,"ⅸ൸鵷ⅸ\u1978\uf577ॸ\ued77","躮貮횭મﲭ⊮ﲭ邮ᚮﲭኮ®邮\ud8ad⚮\u1aaeಮኮ®ꢮ","ڋ⪋\uf68a⪋ᚌ\u0e8b⪋ᚋ䊋ᚌ犋\uee8a\ue68aઋᚋ䊋ꚋ慠ઋ\u0e8b⺋㪋\ue68a",-2058583139>(
            var36
         ),
         -1,
         1<"JNT",-632112356,"痩疵","Â胅","飾鳾⣿\udcff胿\ue4fe",-759041793>()
      );
      Class_300 var10000 = this;
      var10001 = 1954368645 + (1633826180 << 1056230728) ^ -692924283;

      for (var10002 = (StringBuilder)0<"JNT",-576851523,"䅷\uf577ॸ\uf577ⅸ䥷","躮횭મﲭ⊮ﲭ邮ᚮﲭኮ®邮\ud8ad⚮\u1aaeಮኮ®ꢮ貮\ue2ad","ڋ⪋\uf68a⪋ᚌ\u0e8b⪋ᚋ䊋ᚌ犋\uee8a\ue68aઋᚋ䊋ꚋ慠ઋ\u0e8b⺋㪋\ue68a",-2058583141>(
            "耺쁃C聂聄쀱耾쁃DC쁄쁂"
         );
         var10001 < ((-1775059827 * -367721078 | 12) & -1872756579);
         var10001 += 328417304 * 388553279 ^ 1636906473
      ) {
         char var39 = 0<"JNT",-1191297688,"\udd77\uf177핷\u1978啷ⅸ","躮청貮뢭","ڋ⪋\uf68a⪋ᚌ\u0e8b⪋ᚋ䊋ᚌ犋\uee8a\ue68aઋᚋ䊋ꚋ慠ઋ\u0e8b⺋㪋\ue68a",-2058582923>(
            var10002, var10001
         );
         int var93 = (var39 & 0) >> 16;
         int var40 = ((var39 & 0) >> 16 | var39 << 0) + 177 - 186;
         int var94 = (((var39 & 0) >> 16 | var39 << 0) + 177 - 186 & 49152) >> 14;
         char var41 = (char)((((var93 | var39 << 0) + 177 - 186 & 49152) >> 14 | ((var39 & 0) >> 16 | var39 << 0) + 177 - 186 << 2) - 131);
         0<"JNT",-1191297688,"ᵸ\ue577ⅸ嵷\uf177핷\u1978啷ⅸ","躮청뢭貮\ue2ad","ڋ⪋\uf68a⪋ᚌ\u0e8b⪋ᚋ䊋ᚌ犋\uee8a\ue68aઋᚋ䊋ꚋ慠ઋ\u0e8b⺋㪋\ue68a",-2058582926>(
            var10002, var10001, (char)((var94 | var40 << 2) - 131)
         );
      }

      Class_105 var9 = (Class_105)0<"JNT",-576851523,"䅷\uf577ॸ\uf577ⅸ䥷","躮횭મﲭ⊮ﲭ邮ᚮﲭኮ®邮\ud8ad⚮\u1aaeಮኮ®ꢮ\ueaad貮\ue2ad","䊋\ue68a",-2058582969>(
         0<"JNT",-1191297688,"ⅸ൸鵷ⅸ\u1978\uf577ॸ\ued77","躮貮횭મﲭ⊮ﲭ邮ᚮﲭኮ®邮\ud8ad⚮\u1aaeಮኮ®ꢮ","ڋ⪋\uf68a⪋ᚌ\u0e8b⪋ᚋ䊋ᚌ犋\uee8a\ue68aઋᚋ䊋ꚋ慠ઋ\u0e8b⺋㪋\ue68a",-2058582970>(
            var10002
         ),
         false
      );
      int var23 = (810644655 >> 2016004620 | 0) & 1369209472;
      var36 = (StringBuilder)0<"JNT",-576851523,"䅷\uf577ॸ\uf577ⅸ䥷","躮횭મﲭ⊮ﲭ邮ᚮﲭኮ®邮\ud8ad⚮\u1aaeಮኮ®ꢮ貮\ue2ad","ڋ⪋\uf68a⪋ᚌ\u0e8b⪋ᚋ䊋ᚌ犋\uee8a\ue68aઋᚋ䊋ꚋ慠ઋ\u0e8b⺋㪋\ue68a",-2058582964>(
         "〻퀷瀷〷〰〱퀾\uf037逷퀾\uf031뀰瀱뀿ေ瀷퀾့倰뀰〷〰\uf037逰뀷퀾뀱\uf037倱퀷퀾\uf036퀾〱퀷\uf037瀷倰倷"
      );

      label87:
      while (true) {
         var1 = (788414282 | -225268515 >>> (788414282 << -225268515)) ^ -1835015313;

         while (true) {
            label83:
            while (true) {
               label109: {
                  switch ((var1 ^ 495155011 ^ 1426507903 ^ 160569346) - 328774883 - 2053459212 ^ 237805746) {
                     case -1856743123:
                     default:
                        var10002 = var36;
                        if (var23 < ((934168254 ^ 934168254 + 934168254 | 39) & -1542651857)) {
                           int var87 = 0<"JNT",-1191297688,"\udd77\uf177핷\u1978啷ⅸ","躮청貮뢭","ڋ⪋\uf68a⪋ᚌ\u0e8b⪋ᚋ䊋ᚌ犋\uee8a\ue68aઋᚋ䊋ꚋ慠ઋ\u0e8b⺋㪋\ue68a",-2058582963>(
                                 var36, var23
                              )
                              ^ '<';
                           int var112 = (var87 & 61440) >> 12;
                           int var88 = ((var87 & 61440) >> 12 | var87 << 4) + 167;
                           int var113 = (((var87 & 61440) >> 12 | var87 << 4) + 167 & 65534) >> 1;
                           char var89 = (char)((((var112 | var87 << 4) + 167 & 65534) >> 1 | ((var87 & 61440) >> 12 | var87 << 4) + 167 << 15) - 74);
                           0<"JNT",-1191297688,"ᵸ\ue577ⅸ嵷\uf177핷\u1978啷ⅸ","躮청뢭貮\ue2ad","ڋ⪋\uf68a⪋ᚌ\u0e8b⪋ᚋ䊋ᚌ犋\uee8a\ue68aઋᚋ䊋ꚋ慠ઋ\u0e8b⺋㪋\ue68a",-2058582966>(
                              var36, var23, (char)((var113 | var88 << 15) - 74)
                           );
                           var23 += (1803321563 << -1365069850 | 1) & 919829;
                           continue label87;
                        }

                        var1 = 536434783 + -558124237 * -2038107349 ^ -2111662519;
                        break;
                     case -1518428495:
                        var10002 = var36;
                        if (var23 < 30) {
                           0<"JNT",-1191297688,"ᵸ\ue577ⅸ嵷\uf177핷\u1978啷ⅸ","躮청뢭貮\ue2ad","ڋ⪋\uf68a⪋ᚌ\u0e8b⪋ᚋ䊋ᚌ犋\uee8a\ue68aઋᚋ䊋ꚋ慠ઋ\u0e8b⺋㪋\ue68a",-2058582890>(
                              var36,
                              var23,
                              (char)(
                                 (
                                          0<"JNT",-1191297688,"\udd77\uf177핷\u1978啷ⅸ","躮청貮뢭","ڋ⪋\uf68a⪋ᚌ\u0e8b⪋ᚋ䊋ᚌ犋\uee8a\ue68aઋᚋ䊋ꚋ慠ઋ\u0e8b⺋㪋\ue68a",-2058582887>(
                                                   var36, var23
                                                )
                                                - 200
                                             ^ 240
                                       )
                                       - 27
                                       - 7
                                    ^ 105
                              )
                           );
                           var23 += 1;
                           break label83;
                        }

                        var1 = -142082956 >>> (-142082956 >> -142082956) ^ 204099553;
                        break;
                     case -648680068:
                        var10002 = var36;
                        if (var23 < (417903039 + 1033357271 ^ 1451260340)) {
                           int var70 = 0<"JNT",-1191297688,"\udd77\uf177핷\u1978啷ⅸ","躮청貮뢭","ڋ⪋\uf68a⪋ᚌ\u0e8b⪋ᚋ䊋ᚌ犋\uee8a\ue68aઋᚋ䊋ꚋ慠ઋ\u0e8b⺋㪋\ue68a",-2058582925>(
                                 var36, var23
                              )
                              - 'A';
                           int var107 = (var70 & 65024) >> 9;
                           int var71 = (var70 & 65024) >> 9 | var70 << 7;
                           int var108 = (((var70 & 65024) >> 9 | var70 << 7) & 32768) >> 15;
                           char var72 = (char)(((((var107 | var70 << 7) & 32768) >> 15 | ((var70 & 65024) >> 9 | var70 << 7) << 1) ^ 143) + 27);
                           0<"JNT",-1191297688,"ᵸ\ue577ⅸ嵷\uf177핷\u1978啷ⅸ","躮청뢭貮\ue2ad","ڋ⪋\uf68a⪋ᚌ\u0e8b⪋ᚋ䊋ᚌ犋\uee8a\ue68aઋᚋ䊋ꚋ慠ઋ\u0e8b⺋㪋\ue68a",-2058582936>(
                              var36, var23, (char)(((var108 | var71 << 1) ^ 143) + 27)
                           );
                           var23 += -1316131064 << -1310874478 ^ -1138753535;
                           break label109;
                        }

                        var1 = (-1810891509 & -1810891509 | -2096331644) & -1419991315;
                  }

                  switch (((var1 ^ 1441872079) - 119111903 ^ 1907697098 ^ 57362649 ^ 1932401399) + 1582198245) {
                     case -1317015805:
                        var10000.field_1853 = 0<"JNT",-1191297688,"핷╸\ue177","躮횭મﲭ⊮ﲭ邮ᚮﲭኮ®邮\ud8ad⚮\u1aaeಮኮ®ꢮ貮횭®\u1aaeꢮ","䊋\ue68a",-2058582955>(
                           var9,
                           0<"JNT",-1191297688,"ⅸ൸鵷ⅸ\u1978\uf577ॸ\ued77","躮貮횭મﲭ⊮ﲭ邮ᚮﲭኮ®邮\ud8ad⚮\u1aaeಮኮ®ꢮ","ڋ⪋\uf68a⪋ᚌ\u0e8b⪋ᚋ䊋ᚌ犋\uee8a\ue68aઋᚋ䊋ꚋ慠ઋ\u0e8b⺋㪋\ue68a",-2058582956>(
                              var10002
                           )
                        );
                        var10000 = this;
                        var10001 = (-1804832769 & -1621712815 | 0) & 557520264;

                        for (var10002 = (StringBuilder)0<"JNT",-576851523,"䅷\uf577ॸ\uf577ⅸ䥷","躮횭મﲭ⊮ﲭ邮ᚮﲭኮ®邮\ud8ad⚮\u1aaeಮኮ®ꢮ貮\ue2ad","ڋ⪋\uf68a⪋ᚌ\u0e8b⪋ᚋ䊋ᚌ犋\uee8a\ue68aઋᚋ䊋ꚋ慠ઋ\u0e8b⺋㪋\ue68a",-2058582958>(
                              "鮋ឌྋ꾋Όᎌᾌ뾋⾌"
                           );
                           var10001 < ((-204317076 & 1223858085 | 9) & 355248395);
                           var10001 += 1900097395 >>> -455555654 ^ 29
                        ) {
                           int var59 = 0<"JNT",-1191297688,"\udd77\uf177핷\u1978啷ⅸ","躮청貮뢭","ڋ⪋\uf68a⪋ᚌ\u0e8b⪋ᚋ䊋ᚌ犋\uee8a\ue68aઋᚋ䊋ꚋ慠ઋ\u0e8b⺋㪋\ue68a",-2058582889>(
                                 var10002, var10001
                              )
                              + 'z';
                           char var60 = (char)(((var59 & 64512) >> 10 | var59 << 6) - 99 - 171 ^ 22);
                           0<"JNT",-1191297688,"ᵸ\ue577ⅸ嵷\uf177핷\u1978啷ⅸ","躮청뢭貮\ue2ad","ڋ⪋\uf68a⪋ᚌ\u0e8b⪋ᚋ䊋ᚌ犋\uee8a\ue68aઋᚋ䊋ꚋ慠ઋ\u0e8b⺋㪋\ue68a",-2058583140>(
                              var10002, var10001, (char)(((var59 & 64512) >> 10 | var59 << 6) - 99 - 171 ^ 22)
                           );
                        }

                        var9 = (Class_105)0<"JNT",-576851523,"䅷\uf577ॸ\uf577ⅸ䥷","躮횭મﲭ⊮ﲭ邮ᚮﲭኮ®邮\ud8ad⚮\u1aaeಮኮ®ꢮ\ueaad貮\ue2ad","䊋\ue68a",-2058582962>(
                           0<"JNT",-1191297688,"ⅸ൸鵷ⅸ\u1978\uf577ॸ\ued77","躮貮횭મﲭ⊮ﲭ邮ᚮﲭኮ®邮\ud8ad⚮\u1aaeಮኮ®ꢮ","ڋ⪋\uf68a⪋ᚌ\u0e8b⪋ᚋ䊋ᚌ犋\uee8a\ue68aઋᚋ䊋ꚋ慠ઋ\u0e8b⺋㪋\ue68a",-2058582959>(
                              var10002
                           ),
                           false
                        );
                        var23 = 1810900784 >> (1380047025 >> 1810900784) ^ 905450392;
                        var36 = (StringBuilder)0<"JNT",-576851523,"䅷\uf577ॸ\uf577ⅸ䥷","躮횭મﲭ⊮ﲭ邮ᚮﲭኮ®邮\ud8ad⚮\u1aaeಮኮ®ꢮ貮\ue2ad","ڋ⪋\uf68a⪋ᚌ\u0e8b⪋ᚋ䊋ᚌ犋\uee8a\ue68aઋᚋ䊋ꚋ慠ઋ\u0e8b⺋㪋\ue68a",-2058582961>(
                           "띁퍁셁홁읁쉁앁흁詁홁\udb41詁홁\udb41홁앁\udd41詁셁쑁詁\ude41\udb41퍁詁\udb41\udc41詁쉁앁쥁\ude41홁쉁"
                        );
                        break;
                     case 744675948:
                     default:
                        var10000.field_1854 = 0<"JNT",-1191297688,"핷╸\ue177","躮횭મﲭ⊮ﲭ邮ᚮﲭኮ®邮\ud8ad⚮\u1aaeಮኮ®ꢮ貮횭®\u1aaeꢮ","䊋\ue68a",-2058582929>(
                           var9,
                           0<"JNT",-1191297688,"ⅸ൸鵷ⅸ\u1978\uf577ॸ\ued77","躮貮횭મﲭ⊮ﲭ邮ᚮﲭኮ®邮\ud8ad⚮\u1aaeಮኮ®ꢮ","ڋ⪋\uf68a⪋ᚌ\u0e8b⪋ᚋ䊋ᚌ犋\uee8a\ue68aઋᚋ䊋ꚋ慠ઋ\u0e8b⺋㪋\ue68a",-2058582930>(
                              var10002
                           )
                        );
                        var10001 = (-1492596160 >>> 1433188390 | 0) & -865872684;

                        for (var10002 = (StringBuilder)0<"JNT",-576851523,"䅷\uf577ॸ\uf577ⅸ䥷","躮횭મﲭ⊮ﲭ邮ᚮﲭኮ®邮\ud8ad⚮\u1aaeಮኮ®ꢮ貮\ue2ad","ڋ⪋\uf68a⪋ᚌ\u0e8b⪋ᚋ䊋ᚌ犋\uee8a\ue68aઋᚋ䊋ꚋ慠ઋ\u0e8b⺋㪋\ue68a",-2058582924>(
                              "\ue147뭇덇ꥇ饇ꅇ"
                           );
                           var10001 < (271529212 << 1686187647 * 271529212 ^ 49500102);
                           var10001 += (-1949612822 * -1619601792 | 1) & 69528687
                        ) {
                           int var53 = 0<"JNT",-1191297688,"\udd77\uf177핷\u1978啷ⅸ","躮청貮뢭","ڋ⪋\uf68a⪋ᚌ\u0e8b⪋ᚋ䊋ᚌ犋\uee8a\ue68aઋᚋ䊋ꚋ慠ઋ\u0e8b⺋㪋\ue68a",-2058582916>(
                                 var10002, var10001
                              )
                              - '`'
                              - 230;
                           char var54 = (char)((((var53 & 65024) >> 9 | var53 << 7) ^ 248) + 64);
                           0<"JNT",-1191297688,"ᵸ\ue577ⅸ嵷\uf177핷\u1978啷ⅸ","躮청뢭貮\ue2ad","ڋ⪋\uf68a⪋ᚌ\u0e8b⪋ᚋ䊋ᚌ犋\uee8a\ue68aઋᚋ䊋ꚋ慠ઋ\u0e8b⺋㪋\ue68a",-2058582915>(
                              var10002, var10001, (char)((((var53 & 65024) >> 9 | var53 << 7) ^ 248) + 64)
                           );
                        }

                        Class_49 var14 = (Class_49)0<"JNT",-576851523,"䅷\uf577ॸ\uf577ⅸ䥷","躮횭મﲭ⊮ﲭ邮ᚮﲭኮ®邮\ud8ad⚮\u1aaeಮኮ®ꢮ욭욭욭욭貮\ue2ad","⺋㊋",-2058582938>(
                           0<"JNT",-1191297688,"ⅸ൸鵷ⅸ\u1978\uf577ॸ\ued77","躮貮횭મﲭ⊮ﲭ邮ᚮﲭኮ®邮\ud8ad⚮\u1aaeಮኮ®ꢮ","ڋ⪋\uf68a⪋ᚌ\u0e8b⪋ᚋ䊋ᚌ犋\uee8a\ue68aઋᚋ䊋ꚋ慠ઋ\u0e8b⺋㪋\ue68a",-2058582935>(
                              var10002
                           ),
                           1.0,
                           20.0,
                           2.0,
                           1.0
                        );
                        int var29 = (-1973674358 & -323130161 | 0) & 585364069;

                        for (var36 = (StringBuilder)0<"JNT",-576851523,"䅷\uf577ॸ\uf577ⅸ䥷","躮횭મﲭ⊮ﲭ邮ᚮﲭኮ®邮\ud8ad⚮\u1aaeಮኮ®ꢮ貮\ue2ad","ڋ⪋\uf68a⪋ᚌ\u0e8b⪋ᚋ䊋ᚌ犋\uee8a\ue68aઋᚋ䊋ꚋ慠ઋ\u0e8b⺋㪋\ue68a",-2058582937>(
                              "䝋摋恋歋獋杋Ὃ獋湋Ὃ獋煋桋晋晋摋煋Ὃ恋獋"
                           );
                           var29 < (-797434245 * 1294625893 ^ -345118061);
                           var29 += -987674273 ^ 1318327444 ^ -1951048246
                        ) {
                           int var81 = 0<"JNT",-1191297688,"\udd77\uf177핷\u1978啷ⅸ","躮청貮뢭","ڋ⪋\uf68a⪋ᚌ\u0e8b⪋ᚋ䊋ᚌ犋\uee8a\ue68aઋᚋ䊋ꚋ慠ઋ\u0e8b⺋㪋\ue68a",-2058582922>(
                                 var36, var29
                              )
                              ^ 't';
                           char var84 = (char)(
                              (((((var81 & 65535) >> 0 | var81 << 16) + 193 & 63488) >> 11 | ((var81 & 65535) >> 0 | var81 << 16) + 193 << 5) & 57344) >> 13
                                 | ((((var81 & 65535) >> 0 | var81 << 16) + 193 & 63488) >> 11 | ((var81 & 65535) >> 0 | var81 << 16) + 193 << 5) << 3
                           );
                           0<"JNT",-1191297688,"ᵸ\ue577ⅸ嵷\uf177핷\u1978啷ⅸ","躮청뢭貮\ue2ad","ڋ⪋\uf68a⪋ᚌ\u0e8b⪋ᚋ䊋ᚌ犋\uee8a\ue68aઋᚋ䊋ꚋ慠ઋ\u0e8b⺋㪋\ue68a",-2058582921>(
                              var36,
                              var29,
                              (char)(
                                 (((((var81 & 65535) >> 0 | var81 << 16) + 193 & 63488) >> 11 | ((var81 & 65535) >> 0 | var81 << 16) + 193 << 5) & 57344) >> 13
                                    | ((((var81 & 65535) >> 0 | var81 << 16) + 193 & 63488) >> 11 | ((var81 & 65535) >> 0 | var81 << 16) + 193 << 5) << 3
                              )
                           );
                        }

                        this.field_1855 = 0<"JNT",-1191297688,"൸\uf577\uf177","躮횭મﲭ⊮ﲭ邮ᚮﲭኮ®邮\ud8ad⚮\u1aaeಮኮ®ꢮ貮횭ڮ\uf8adꢮ","⺋㊋",-2058582931>(
                           var14,
                           0<"JNT",-1191297688,"ⅸ൸鵷ⅸ\u1978\uf577ॸ\ued77","躮貮횭મﲭ⊮ﲭ邮ᚮﲭኮ®邮\ud8ad⚮\u1aaeಮኮ®ꢮ","ڋ⪋\uf68a⪋ᚌ\u0e8b⪋ᚋ䊋ᚌ犋\uee8a\ue68aઋᚋ䊋ꚋ慠ઋ\u0e8b⺋㪋\ue68a",-2058582932>(
                              var36
                           )
                        );
                        Class_49 var4 = 1<"JNT",-1010374953,"痑痑疩","Ã胋","飾鳾⣿裿蓿\ue4fe",-759041777>(this);
                        Class_105 var15 = 1<"JNT",-1010374953,"痑痍痭","Ã胋","飾鳾⣿铿샿\ue4fe",-759041774>(this);
                        0<"JNT",1774184014,"\u1978\ue577ᕸ╸\uf577\u1978\ue577襷൸ॸ襷╸ŸŸ","躮횭મﲭ⊮ﲭ邮ᚮﲭኮ®邮킭節મҮ\uf8ad⚮ꢮ貮횭મﲭ⊮ﲭ邮ᚮﲭኮ®邮킭節મҮ\uf8ad⚮ꢮ","ڋ⪋\uf68a⪋ᚌ慠\uee8aઋ\u0e8bᚌꊋ⚋ڋ㪋㊋\uee8a\uf28a",-2058582912>(
                           var15
                        );
                        0<"JNT",-1191297688,"ॸ㥸ᵸ","躮횭મﲭ⊮ﲭ邮⒮⚮ಮᚮ邮ʮ⒮ኮ\uf8ad⚮ಮႮኮ邮\ud8ad⒮ẮẮᚮಮҮ\u1aaeꢮ貮횭ᲮҮҮꢮ","⺋㊋",-2058582911>(var4, var15::ax);
                        0<"JNT",-1191297688,"ᕸ╸","躮\ue8ad횭ᲮҮҮꢮ貮\ue2ad","\uf28a㚋",-2058582910>(
                           this,
                           new Class_271[]{
                              1<"JNT",-1010374953,"痝痁痭","Ã胋","飾鳾⣿铿샿\ue4fe",-759041765>(this),
                              1<"JNT",-1010374953,"痍痙疥","Ã胋","飾鳾⣿铿샿\ue4fe",-759041762>(this),
                              1<"JNT",-1010374953,"痑痍痭","Ã胋","飾鳾⣿铿샿\ue4fe",-759041767>(this),
                              1<"JNT",-1010374953,"痑痑疩","Ã胋","飾鳾⣿裿蓿\ue4fe",-759041764>(this)
                           }
                        );
                        this.field_1856 = false;
                        this.chhn = false;
                        return;
                     case 1950020184:
                        var10000.field_1852 = 0<"JNT",-1191297688,"핷╸\ue177","躮횭મﲭ⊮ﲭ邮ᚮﲭኮ®邮\ud8ad⚮\u1aaeಮኮ®ꢮ貮횭®\u1aaeꢮ","䊋\ue68a",-2058582917>(
                           var9,
                           0<"JNT",-1191297688,"ⅸ൸鵷ⅸ\u1978\uf577ॸ\ued77","躮貮횭મﲭ⊮ﲭ邮ᚮﲭኮ®邮\ud8ad⚮\u1aaeಮኮ®ꢮ","ڋ⪋\uf68a⪋ᚌ\u0e8b⪋ᚋ䊋ᚌ犋\uee8a\ue68aઋᚋ䊋ꚋ慠ઋ\u0e8b⺋㪋\ue68a",-2058582918>(
                              var10002
                           )
                        );
                        var10000 = this;
                        var10001 = (-91247356 >> -91247356 | 0) & 1508608;

                        for (var10002 = (StringBuilder)0<"JNT",-576851523,"䅷\uf577ॸ\uf577ⅸ䥷","躮횭મﲭ⊮ﲭ邮ᚮﲭኮ®邮\ud8ad⚮\u1aaeಮኮ®ꢮ貮\ue2ad","ڋ⪋\uf68a⪋ᚌ\u0e8b⪋ᚋ䊋ᚌ犋\uee8a\ue68aઋᚋ䊋ꚋ慠ઋ\u0e8b⺋㪋\ue68a",-2058582960>(
                              "¶øŴÔöĔ"
                           );
                           var10001 < (1818160580 << 1818160580 ^ -974201786);
                           var10001 += (94999961 >>> 1250065603 | 1) & -16613107
                        ) {
                           int var48 = 0<"JNT",-1191297688,"\udd77\uf177핷\u1978啷ⅸ","躮청貮뢭","ڋ⪋\uf68a⪋ᚌ\u0e8b⪋ᚋ䊋ᚌ犋\uee8a\ue68aઋᚋ䊋ꚋ慠ઋ\u0e8b⺋㪋\ue68a",-2058582957>(
                                 var10002, var10001
                              )
                              + 'a'
                              - 7;
                           int var97 = (var48 & 63488) >> 11;
                           int var49 = (var48 & 63488) >> 11 | var48 << 5;
                           int var98 = (((var48 & 63488) >> 11 | var48 << 5) & 65472) >> 6;
                           char var50 = (char)((((var97 | var48 << 5) & 65472) >> 6 | ((var48 & 63488) >> 11 | var48 << 5) << 10) ^ 199);
                           0<"JNT",-1191297688,"ᵸ\ue577ⅸ嵷\uf177핷\u1978啷ⅸ","躮청뢭貮\ue2ad","ڋ⪋\uf68a⪋ᚌ\u0e8b⪋ᚋ䊋ᚌ犋\uee8a\ue68aઋᚋ䊋ꚋ慠ઋ\u0e8b⺋㪋\ue68a",-2058582968>(
                              var10002, var10001, (char)((var98 | var49 << 10) ^ 199)
                           );
                        }

                        var9 = (Class_105)0<"JNT",-576851523,"䅷\uf577ॸ\uf577ⅸ䥷","躮횭મﲭ⊮ﲭ邮ᚮﲭኮ®邮\ud8ad⚮\u1aaeಮኮ®ꢮ\ueaad貮\ue2ad","䊋\ue68a",-2058582920>(
                           0<"JNT",-1191297688,"ⅸ൸鵷ⅸ\u1978\uf577ॸ\ued77","躮貮횭મﲭ⊮ﲭ邮ᚮﲭኮ®邮\ud8ad⚮\u1aaeಮኮ®ꢮ","ڋ⪋\uf68a⪋ᚌ\u0e8b⪋ᚋ䊋ᚌ犋\uee8a\ue68aઋᚋ䊋ꚋ慠ઋ\u0e8b⺋㪋\ue68a",-2058582909>(
                              var10002
                           ),
                           false
                        );
                        var23 = 375075860 + 1350317903 ^ 1725393763;
                        var36 = (StringBuilder)0<"JNT",-576851523,"䅷\uf577ॸ\uf577ⅸ䥷","躮횭મﲭ⊮ﲭ邮ᚮﲭኮ®邮\ud8ad⚮\u1aaeಮኮ®ꢮ貮\ue2ad","ڋ⪋\uf68a⪋ᚌ\u0e8b⪋ᚋ䊋ᚌ犋\uee8a\ue68aઋᚋ䊋ꚋ慠ઋ\u0e8b⺋㪋\ue68a",-2058582919>(
                           "ŴŸƚƗƤƛƦƔţƗƠţƢţƗƠƗƦƞţƚƉţƊƠƖţƓƠƓ"
                        );
                        break label83;
                  }
               }

               var1 = (-20381830 - (-20381830 << -479908167) | 610306177) & -193599357;
            }

            var1 = (771077240 << 252691789 | 1212651724) & 2019033052;
         }
      }
   }

   // $VF: renamed from: mg () void
   @Override
   public void method_1407() {
      0<"JNT",-1213867538,"ո\ued77","躮貮\ue2ad","慠\uf28a㚋",-2058582945>(this);
   }

   // $VF: renamed from: q () void
   @Override
   public void method_1408() {
      0<"JNT",-1213867538,"ᕸ","躮貮\ue2ad","慠\uf28a㚋",-2058582940>(this);
   }

   // $VF: renamed from: pb (Class_387) void
   @Class_21
   public void method_1633(Class_387 var1) {
      int var3 = -2012591925;
      if (1<"JNT",-1010374953,"疕疩疙疽疝畱ૉ\u0ad1ૅ\u0add","肿Ì胂肟ÀÊ肿ÌË肽Æ胋胂肟Ë肾ÆÃÃÅ£\u009e肜","飾鳾⣿냿賿죿듾곿鳿냿賿蓿샿糿郿죿듾蓿ꣿ糿쓿쓿瓿퓾죾탾\ue4fe",-759036835>(
            1<"JNT",-1010374953,"疽病","Ã胋","飾鳾⣿냿賿죿듾곿鳿냿賿蓿샿糿郿죿듾蓿ꣿ糿쓿쓿瓿쓾볾룾\ue4fe",-759036830>(this)
         )
         != null) {
         class_1661 var2 = 0<"JNT",-1191297688,"ո\ue577ⅸ\uf177൸\ue177쵷ᵷᕷ╷ⅷㅷ","躮貮횭ኮҮ⚮邮ᒮಮኮҮ\uf8ad\u1aaeﲭʮ⚮邮\uf8adᚮﲭ\u18ae\u18ae\uf0ad鲮ꊮꊮ鲮ꢮ","ᚋ㪋\uee8aᚌ\u1a8bઋᚋ㪋㊋\ue68a⪋㚋\uee8aᚌ㊋\u0e8b⪋\uf28a\uf28a抋ʌ\uee8b\uf68b",-2058582738>(
            1<"JNT",-1010374953,"疕疩疙疽疝畱ૉ\u0ad1ૅ\u0add","肿Ì胂肟ÀÊ肿ÌË肽Æ胋胂肟Ë肾ÆÃÃÅ£\u009e肜","飾鳾⣿냿賿죿듾곿鳿냿賿蓿샿糿郿죿듾蓿ꣿ糿쓿쓿瓿퓾죾탾\ue4fe",-759041728>(
               1<"JNT",-1010374953,"疽病","Ã胋","飾鳾⣿냿賿죿듾곿鳿냿賿蓿샿糿郿죿듾蓿ꣿ糿쓿쓿瓿쓾볾룾\ue4fe",-759041731>(this)
            )
         );
         if (!0<"JNT",-1191297688,"핷ㅸ","躮貮\ueaad","䊋\ue68a",-2058582732>(1<"JNT",-1010374953,"痝痁痭","Ã胋","飾鳾⣿铿샿\ue4fe",-759041714>(this))
            || !0<"JNT",-1191297688,"ո\ue577ⅸ\uf177൸\ue177쵷⥷ᅷᵷ㕷","躮貮\ueaad","ᚋ㪋\uee8aᚌ\u1a8bઋᚋ㪋㊋\ue68a⪋㚋\uee8aᚌ㊋\u0e8b⪋\uf28a\uf28a抋ʌ\uee8b\uf68b",-2058582733>(
               1<"JNT",-1010374953,"疕疩疙疽疝畱ૉ\u0ad1ૅ\u0add","肿Ì胂肟ÀÊ肿ÌË肽Æ胋胂肟Ë肾ÆÃÃÅ£\u009e肜","飾鳾⣿냿賿죿듾곿鳿냿賿蓿샿糿郿죿듾蓿ꣿ糿쓿쓿瓿퓾죾탾\ue4fe",-759041721>(
                  1<"JNT",-1010374953,"疽病","Ã胋","飾鳾⣿냿賿죿듾곿鳿냿賿蓿샿糿郿죿듾蓿ꣿ糿쓿쓿瓿쓾볾룾\ue4fe",-759041716>(this)
               )
            )) {
            var3 = -2073229801 & -2073229801 ^ -1858273249;

            while (true) {
               switch ((var3 + 1051732950 + 975367332 - 726372951 + 1381341855 ^ 286832164) - 657563068) {
                  case -320752858:
                     if ((double)0<"JNT",-1191297688,"ո\ue577ⅸ\uf177൸\ue177쵷⥷ᅷᵷ\u1977","躮貮슭","ᚋ㪋\uee8aᚌ\u1a8bઋᚋ㪋㊋\ue68a⪋㚋\uee8aᚌ㊋\u0e8b⪋\uf28a\uf28a抋ʌ\uee8b\uf68b",-2058582715>(
                           1<"JNT",-1010374953,"疕疩疙疽疝畱ૉ\u0ad1ૅ\u0add","肿Ì胂肟ÀÊ肿ÌË肽Æ胋胂肟Ë肾ÆÃÃÅ£\u009e肜","飾鳾⣿냿賿죿듾곿鳿냿賿蓿샿糿郿죿듾蓿ꣿ糿쓿쓿瓿퓾죾탾\ue4fe",-759036839>(
                              1<"JNT",-1010374953,"疽病","Ã胋","飾鳾⣿냿賿죿듾곿鳿냿賿蓿샿糿郿죿듾蓿ꣿ糿쓿쓿瓿쓾볾룾\ue4fe",-759036834>(this)
                           )
                        )
                        > 0<"JNT",-1191297688,"핷ᅸॸ","躮貮욭","⺋㊋",-2058582717>(1<"JNT",-1010374953,"痑痑疩","Ã胋","飾鳾⣿裿蓿\ue4fe",-759036841>(this))) {
                        1<"JNT",-1492901560,"疹疡痑","Ã胋","飾鳾惿",-759036811>(this, false);
                     }

                     var3 = -916397649 >>> -916397649 ^ -261697890;
                     break;
                  case 866205311:
                     if ((double)0<"JNT",-1191297688,"ո\ue577ⅸ\uf177൸\ue177쵷⥷ᅷᵷ\u1977","躮貮슭","ᚋ㪋\uee8aᚌ\u1a8bઋᚋ㪋㊋\ue68a⪋㚋\uee8aᚌ㊋\u0e8b⪋\uf28a\uf28a抋ʌ\uee8b\uf68b",-2058582746>(
                              1<"JNT",-1010374953,"疕疩疙疽疝畱ૉ\u0ad1ૅ\u0add","肿Ì胂肟ÀÊ肿ÌË肽Æ胋胂肟Ë肾ÆÃÃÅ£\u009e肜","飾鳾⣿냿賿죿듾곿鳿냿賿蓿샿糿郿죿듾蓿ꣿ糿쓿쓿瓿퓾죾탾\ue4fe",-759041720>(
                                 1<"JNT",-1010374953,"疽病","Ã胋","飾鳾⣿냿賿죿듾곿鳿냿賿蓿샿糿郿죿듾蓿ꣿ糿쓿쓿瓿쓾볾룾\ue4fe",-759041755>(this)
                              )
                           )
                           <= 0<"JNT",-1191297688,"핷ᅸॸ","躮貮욭","⺋㊋",-2058582740>(1<"JNT",-1010374953,"痑痑疩","Ã胋","飾鳾⣿裿蓿\ue4fe",-759041706>(this))
                        && 0<"JNT",-1191297688,"핷ㅸ","躮貮\ueaad","䊋\ue68a",-2058582742>(1<"JNT",-1010374953,"痑痍痭","Ã胋","飾鳾⣿铿샿\ue4fe",-759041708>(this))
                        && !1<"JNT",-1010374953,"疹疡痑","Ã胋","飾鳾惿",-759041710>(this)) {
                        1<"JNT",-1492901560,"疹疡痑","Ã胋","飾鳾惿",-759041715>(this, true);
                        0<"JNT",1774184014,"⥸㥸\ud977","躮횭ኮҮ⚮邮ᒮಮኮҮ\uf8ad\u1aaeﲭʮ⚮邮\uf8adᚮﲭ\u18ae\u18ae\uf0ad鲮ꂮ겮骮ꢮ貮\ueaad","ẋ",-2058582722>(
                           1<"JNT",-632112356,"疕疩疙疽疝畱૭ૅ૭૭","肿Ì胂肟ÀÊ肿ÌË肽Æ胋胂肟Ë肾ÆÃÃÅ\u009e肠肜肝","飾鳾⣿냿賿죿듾곿鳿냿賿蓿샿糿郿죿듾蓿ꣿ糿쓿쓿瓿볾퓾\udcfe샾\ue4fe",-759041712>()
                        );
                     }

                     var3 = (-524468874 - -524468874 | 1697564164) & 1740555996;
                     break;
                  case 1192410456:
                     if (0<"JNT",-1191297688,"ո\ue577ⅸ\uf177൸\ue177쵷\u2d77㕷ᅷ㕷","躮貮횭ኮҮ⚮邮ᒮಮኮҮ\uf8ad\u1aaeﲭʮ⚮邮\uf8adᚮﲭ\u18ae\u18ae\uf0ad鲮ꂮ겮骮ꢮ","ᚋ㪋\uee8aᚌ\u1a8bઋᚋ㪋㊋\ue68a⪋㚋\uee8aᚌ㊋\u0e8b⪋\uf28a\uf28a抋\uea8bʌ쪋쪋",-2058582724>(
                           0<"JNT",-1191297688,"ո\ue577ⅸ\uf177൸\ue177쵷⥷ᅷ\u2d77㕷","躮貮횭ኮҮ⚮邮ᒮಮኮҮ\uf8ad\u1aaeﲭʮ⚮邮\uf8adᚮﲭ\u18ae\u18ae\uf0ad鲮ꂮ겮겮ꢮ","ᚋ㪋\uee8aᚌ\u1a8bઋᚋ㪋㊋\ue68a⪋㚋\uee8aᚌ㊋\u0e8b⪋\uf28a\uf28a抋ʌ\uee8b\uf68b",-2058582729>(
                              1<"JNT",-1010374953,"疕疩疙疽疝畱ૉ\u0ad1ૅ\u0add","肿Ì胂肟ÀÊ肿ÌË肽Æ胋胂肟Ë肾ÆÃÃÅ£\u009e肜","飾鳾⣿냿賿죿듾곿鳿냿賿蓿샿糿郿죿듾蓿ꣿ糿쓿쓿瓿퓾죾탾\ue4fe",-759036829>(
                                 1<"JNT",-1010374953,"疽病","Ã胋","飾鳾⣿냿賿죿듾곿鳿냿賿蓿샿糿郿죿듾蓿ꣿ糿쓿쓿瓿쓾볾룾\ue4fe",-759036840>(this)
                              )
                           )
                        )
                        == 1<"JNT",-632112356,"疕疩疙疽疝畱૭ૅ૭૭","肿Ì胂肟ÀÊ肿ÌË肽Æ胋胂肟Ë肾ÆÃÃÅ\u009e肠肜肝","飾鳾⣿냿賿죿듾곿鳿냿賿蓿샿糿郿죿듾蓿ꣿ糿쓿쓿瓿볾퓾\udcfe샾\ue4fe",-759036828>()) {
                        1<"JNT",-1492901560,"疁疭疭疵","Ã胋","飾鳾惿",-759036833>(this, false);
                     }

                     var3 = -17345601 ^ 1427774178;
                     break;
                  case 1512779081:
                  default:
                     return;
                  case 2097410866:
                     if (0<"JNT",-1191297688,"ո\ue577ⅸ\uf177൸\ue177쵷\u2d77㕷ᅷ㕷","躮貮횭ኮҮ⚮邮ᒮಮኮҮ\uf8ad\u1aaeﲭʮ⚮邮\uf8adᚮﲭ\u18ae\u18ae\uf0ad鲮ꂮ겮骮ꢮ","ᚋ㪋\uee8aᚌ\u1a8bઋᚋ㪋㊋\ue68a⪋㚋\uee8aᚌ㊋\u0e8b⪋\uf28a\uf28a抋\uea8bʌ쪋쪋",-2058582952>(
                              0<"JNT",-1191297688,"ո\ue577ⅸ\uf177൸\ue177쵷⥷ᅷ\u2d77㕷","躮貮횭ኮҮ⚮邮ᒮಮኮҮ\uf8ad\u1aaeﲭʮ⚮邮\uf8adᚮﲭ\u18ae\u18ae\uf0ad鲮ꂮ겮겮ꢮ","ᚋ㪋\uee8aᚌ\u1a8bઋᚋ㪋㊋\ue68a⪋㚋\uee8aᚌ㊋\u0e8b⪋\uf28a\uf28a抋ʌ\uee8b\uf68b",-2058582941>(
                                 1<"JNT",-1010374953,"疕疩疙疽疝畱ૉ\u0ad1ૅ\u0add","肿Ì胂肟ÀÊ肿ÌË肽Æ胋胂肟Ë肾ÆÃÃÅ£\u009e肜","飾鳾⣿냿賿죿듾곿鳿냿賿蓿샿糿郿죿듾蓿ꣿ糿쓿쓿瓿퓾죾탾\ue4fe",-759041737>(
                                    1<"JNT",-1010374953,"疽病","Ã胋","飾鳾⣿냿賿죿듾곿鳿냿賿蓿샿糿郿죿듾蓿ꣿ糿쓿쓿瓿쓾볾룾\ue4fe",-759041732>(this)
                                 )
                              )
                           )
                           != 1<"JNT",-632112356,"疕疩疙疽疝畱૭ૅ૭૭","肿Ì胂肟ÀÊ肿ÌË肽Æ胋胂肟Ë肾ÆÃÃÅ\u009e肠肜肝","飾鳾⣿냿賿죿듾곿鳿냿賿蓿샿糿郿죿듾蓿ꣿ糿쓿쓿瓿볾퓾\udcfe샾\ue4fe",-759041736>()
                        && 0<"JNT",-1191297688,"핷ㅸ","躮貮\ueaad","䊋\ue68a",-2058582953>(1<"JNT",-1010374953,"痍痙疥","Ã胋","飾鳾⣿铿샿\ue4fe",-759041725>(this))
                        && !1<"JNT",-1010374953,"疁疭疭疵","Ã胋","飾鳾惿",-759041727>(this)) {
                        1<"JNT",-1492901560,"疁疭疭疵","Ã胋","飾鳾惿",-759041724>(this, true);
                        0<"JNT",1774184014,"⥸㥸\ud977","躮횭ኮҮ⚮邮ᒮಮኮҮ\uf8ad\u1aaeﲭʮ⚮邮\uf8adᚮﲭ\u18ae\u18ae\uf0ad鲮ꂮ겮骮ꢮ貮\ueaad","ẋ",-2058582949>(
                           1<"JNT",-632112356,"疕疩疙疽疝畱૭ૅ૭૭","肿Ì胂肟ÀÊ肿ÌË肽Æ胋胂肟Ë肾ÆÃÃÅ\u009e肠肜肝","飾鳾⣿냿賿죿듾곿鳿냿賿蓿샿糿郿죿듾蓿ꣿ糿쓿쓿瓿볾퓾\udcfe샾\ue4fe",-759041729>()
                        );
                     }

                     var3 = -545272722;
               }
            }
         }
      }
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1413(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = (var10 + 17360562 + 769039919 + 1935018628 ^ 641074180 ^ 695592560 ^ 1120597259) + 35504939 ^ 2044883648 ^ 360975445;
      MethodHandle var10000 = field_1857[((var10 + 17360562 + 769039919 + 1935018628 ^ 641074180 ^ 695592560 ^ 1120597259) + 35504939 ^ 2044883648 ^ 360975445)
         - 5159225];
      if (field_1857[var10001 - 5159225] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = (-1459298724 >> 846840576 | 0) & 1186472192; var23 < var13.length(); var23 += -1256539852 ^ 788204828 ^ -1679707095) {
            int var42 = var13.charAt(var23) - 177;
            char var49 = (char)(
               (
                        (
                              (
                                       (
                                                (
                                                         (
                                                               (
                                                                        (
                                                                              (
                                                                                    (
                                                                                             (
                                                                                                   (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                                      | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                                                )
                                                                                                & 61440
                                                                                          )
                                                                                          >> 12
                                                                                       | (
                                                                                             (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                                | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                                          )
                                                                                          << 4
                                                                                 )
                                                                                 ^ 49
                                                                           )
                                                                           & 61440
                                                                     )
                                                                     >> 12
                                                                  | (
                                                                        (
                                                                              (
                                                                                       (
                                                                                             (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                                | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                                          )
                                                                                          & 61440
                                                                                    )
                                                                                    >> 12
                                                                                 | (
                                                                                       (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                          | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                                    )
                                                                                    << 4
                                                                           )
                                                                           ^ 49
                                                                     )
                                                                     << 4
                                                            )
                                                            & 63488
                                                      )
                                                      >> 11
                                                   | (
                                                         (
                                                                  (
                                                                        (
                                                                              (
                                                                                       (
                                                                                             (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                                | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                                          )
                                                                                          & 61440
                                                                                    )
                                                                                    >> 12
                                                                                 | (
                                                                                       (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                          | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                                    )
                                                                                    << 4
                                                                           )
                                                                           ^ 49
                                                                     )
                                                                     & 61440
                                                               )
                                                               >> 12
                                                            | (
                                                                  (
                                                                        (
                                                                                 (
                                                                                       (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                          | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                                    )
                                                                                    & 61440
                                                                              )
                                                                              >> 12
                                                                           | (
                                                                                 (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                    | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                              )
                                                                              << 4
                                                                     )
                                                                     ^ 49
                                                               )
                                                               << 4
                                                      )
                                                      << 5
                                             )
                                             - 168
                                          & 64512
                                    )
                                    >> 10
                                 | (
                                          (
                                                   (
                                                         (
                                                                  (
                                                                        (
                                                                              (
                                                                                       (
                                                                                             (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                                | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                                          )
                                                                                          & 61440
                                                                                    )
                                                                                    >> 12
                                                                                 | (
                                                                                       (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                          | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                                    )
                                                                                    << 4
                                                                           )
                                                                           ^ 49
                                                                     )
                                                                     & 61440
                                                               )
                                                               >> 12
                                                            | (
                                                                  (
                                                                        (
                                                                                 (
                                                                                       (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                          | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                                    )
                                                                                    & 61440
                                                                              )
                                                                              >> 12
                                                                           | (
                                                                                 (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                    | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                              )
                                                                              << 4
                                                                     )
                                                                     ^ 49
                                                               )
                                                               << 4
                                                      )
                                                      & 63488
                                                )
                                                >> 11
                                             | (
                                                   (
                                                            (
                                                                  (
                                                                        (
                                                                                 (
                                                                                       (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                          | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                                    )
                                                                                    & 61440
                                                                              )
                                                                              >> 12
                                                                           | (
                                                                                 (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                    | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                              )
                                                                              << 4
                                                                     )
                                                                     ^ 49
                                                               )
                                                               & 61440
                                                         )
                                                         >> 12
                                                      | (
                                                            (
                                                                  (
                                                                           (
                                                                                 (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                    | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                              )
                                                                              & 61440
                                                                        )
                                                                        >> 12
                                                                     | (
                                                                           (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                              | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                        )
                                                                        << 4
                                                               )
                                                               ^ 49
                                                         )
                                                         << 4
                                                )
                                                << 5
                                       )
                                       - 168
                                    << 6
                           )
                           & 65408
                     )
                     >> 7
                  | (
                        (
                                 (
                                          (
                                                   (
                                                         (
                                                                  (
                                                                        (
                                                                              (
                                                                                       (
                                                                                             (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                                | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                                          )
                                                                                          & 61440
                                                                                    )
                                                                                    >> 12
                                                                                 | (
                                                                                       (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                          | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                                    )
                                                                                    << 4
                                                                           )
                                                                           ^ 49
                                                                     )
                                                                     & 61440
                                                               )
                                                               >> 12
                                                            | (
                                                                  (
                                                                        (
                                                                                 (
                                                                                       (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                          | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                                    )
                                                                                    & 61440
                                                                              )
                                                                              >> 12
                                                                           | (
                                                                                 (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                    | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                              )
                                                                              << 4
                                                                     )
                                                                     ^ 49
                                                               )
                                                               << 4
                                                      )
                                                      & 63488
                                                )
                                                >> 11
                                             | (
                                                   (
                                                            (
                                                                  (
                                                                        (
                                                                                 (
                                                                                       (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                          | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                                    )
                                                                                    & 61440
                                                                              )
                                                                              >> 12
                                                                           | (
                                                                                 (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                    | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                              )
                                                                              << 4
                                                                     )
                                                                     ^ 49
                                                               )
                                                               & 61440
                                                         )
                                                         >> 12
                                                      | (
                                                            (
                                                                  (
                                                                           (
                                                                                 (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                    | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                              )
                                                                              & 61440
                                                                        )
                                                                        >> 12
                                                                     | (
                                                                           (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                              | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                        )
                                                                        << 4
                                                               )
                                                               ^ 49
                                                         )
                                                         << 4
                                                )
                                                << 5
                                       )
                                       - 168
                                    & 64512
                              )
                              >> 10
                           | (
                                    (
                                             (
                                                   (
                                                            (
                                                                  (
                                                                        (
                                                                                 (
                                                                                       (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                          | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                                    )
                                                                                    & 61440
                                                                              )
                                                                              >> 12
                                                                           | (
                                                                                 (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                    | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                              )
                                                                              << 4
                                                                     )
                                                                     ^ 49
                                                               )
                                                               & 61440
                                                         )
                                                         >> 12
                                                      | (
                                                            (
                                                                  (
                                                                           (
                                                                                 (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                    | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                              )
                                                                              & 61440
                                                                        )
                                                                        >> 12
                                                                     | (
                                                                           (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                              | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                        )
                                                                        << 4
                                                               )
                                                               ^ 49
                                                         )
                                                         << 4
                                                )
                                                & 63488
                                          )
                                          >> 11
                                       | (
                                             (
                                                      (
                                                            (
                                                                  (
                                                                           (
                                                                                 (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                    | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                              )
                                                                              & 61440
                                                                        )
                                                                        >> 12
                                                                     | (
                                                                           (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                              | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                        )
                                                                        << 4
                                                               )
                                                               ^ 49
                                                         )
                                                         & 61440
                                                   )
                                                   >> 12
                                                | (
                                                      (
                                                            (
                                                                     (
                                                                           (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                              | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                        )
                                                                        & 61440
                                                                  )
                                                                  >> 12
                                                               | (
                                                                     (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                        | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                  )
                                                                  << 4
                                                         )
                                                         ^ 49
                                                   )
                                                   << 4
                                          )
                                          << 5
                                 )
                                 - 168
                              << 6
                     )
                     << 9
            );
            var13.setCharAt(
               var23,
               (char)(
                  (
                           (
                                 (
                                          (
                                                   (
                                                            (
                                                                  (
                                                                           (
                                                                                 (
                                                                                       (
                                                                                                (
                                                                                                      (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                                         | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                                                   )
                                                                                                   & 61440
                                                                                             )
                                                                                             >> 12
                                                                                          | (
                                                                                                (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                                   | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                                             )
                                                                                             << 4
                                                                                    )
                                                                                    ^ 49
                                                                              )
                                                                              & 61440
                                                                        )
                                                                        >> 12
                                                                     | (
                                                                           (
                                                                                 (
                                                                                          (
                                                                                                (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                                   | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                                             )
                                                                                             & 61440
                                                                                       )
                                                                                       >> 12
                                                                                    | (
                                                                                          (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                             | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                                       )
                                                                                       << 4
                                                                              )
                                                                              ^ 49
                                                                        )
                                                                        << 4
                                                               )
                                                               & 63488
                                                         )
                                                         >> 11
                                                      | (
                                                            (
                                                                     (
                                                                           (
                                                                                 (
                                                                                          (
                                                                                                (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                                   | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                                             )
                                                                                             & 61440
                                                                                       )
                                                                                       >> 12
                                                                                    | (
                                                                                          (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                             | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                                       )
                                                                                       << 4
                                                                              )
                                                                              ^ 49
                                                                        )
                                                                        & 61440
                                                                  )
                                                                  >> 12
                                                               | (
                                                                     (
                                                                           (
                                                                                    (
                                                                                          (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                             | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                                       )
                                                                                       & 61440
                                                                                 )
                                                                                 >> 12
                                                                              | (
                                                                                    (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                       | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                                 )
                                                                                 << 4
                                                                        )
                                                                        ^ 49
                                                                  )
                                                                  << 4
                                                         )
                                                         << 5
                                                )
                                                - 168
                                             & 64512
                                       )
                                       >> 10
                                    | (
                                             (
                                                      (
                                                            (
                                                                     (
                                                                           (
                                                                                 (
                                                                                          (
                                                                                                (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                                   | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                                             )
                                                                                             & 61440
                                                                                       )
                                                                                       >> 12
                                                                                    | (
                                                                                          (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                             | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                                       )
                                                                                       << 4
                                                                              )
                                                                              ^ 49
                                                                        )
                                                                        & 61440
                                                                  )
                                                                  >> 12
                                                               | (
                                                                     (
                                                                           (
                                                                                    (
                                                                                          (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                             | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                                       )
                                                                                       & 61440
                                                                                 )
                                                                                 >> 12
                                                                              | (
                                                                                    (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                       | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                                 )
                                                                                 << 4
                                                                        )
                                                                        ^ 49
                                                                  )
                                                                  << 4
                                                         )
                                                         & 63488
                                                   )
                                                   >> 11
                                                | (
                                                      (
                                                               (
                                                                     (
                                                                           (
                                                                                    (
                                                                                          (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                             | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                                       )
                                                                                       & 61440
                                                                                 )
                                                                                 >> 12
                                                                              | (
                                                                                    (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                       | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                                 )
                                                                                 << 4
                                                                        )
                                                                        ^ 49
                                                                  )
                                                                  & 61440
                                                            )
                                                            >> 12
                                                         | (
                                                               (
                                                                     (
                                                                              (
                                                                                    (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                       | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                                 )
                                                                                 & 61440
                                                                           )
                                                                           >> 12
                                                                        | (
                                                                              (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                 | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                           )
                                                                           << 4
                                                                  )
                                                                  ^ 49
                                                            )
                                                            << 4
                                                   )
                                                   << 5
                                          )
                                          - 168
                                       << 6
                              )
                              & 65408
                        )
                        >> 7
                     | (
                           (
                                    (
                                             (
                                                      (
                                                            (
                                                                     (
                                                                           (
                                                                                 (
                                                                                          (
                                                                                                (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                                   | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                                             )
                                                                                             & 61440
                                                                                       )
                                                                                       >> 12
                                                                                    | (
                                                                                          (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                             | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                                       )
                                                                                       << 4
                                                                              )
                                                                              ^ 49
                                                                        )
                                                                        & 61440
                                                                  )
                                                                  >> 12
                                                               | (
                                                                     (
                                                                           (
                                                                                    (
                                                                                          (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                             | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                                       )
                                                                                       & 61440
                                                                                 )
                                                                                 >> 12
                                                                              | (
                                                                                    (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                       | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                                 )
                                                                                 << 4
                                                                        )
                                                                        ^ 49
                                                                  )
                                                                  << 4
                                                         )
                                                         & 63488
                                                   )
                                                   >> 11
                                                | (
                                                      (
                                                               (
                                                                     (
                                                                           (
                                                                                    (
                                                                                          (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                             | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                                       )
                                                                                       & 61440
                                                                                 )
                                                                                 >> 12
                                                                              | (
                                                                                    (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                       | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                                 )
                                                                                 << 4
                                                                        )
                                                                        ^ 49
                                                                  )
                                                                  & 61440
                                                            )
                                                            >> 12
                                                         | (
                                                               (
                                                                     (
                                                                              (
                                                                                    (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                       | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                                 )
                                                                                 & 61440
                                                                           )
                                                                           >> 12
                                                                        | (
                                                                              (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                 | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                           )
                                                                           << 4
                                                                  )
                                                                  ^ 49
                                                            )
                                                            << 4
                                                   )
                                                   << 5
                                          )
                                          - 168
                                       & 64512
                                 )
                                 >> 10
                              | (
                                       (
                                                (
                                                      (
                                                               (
                                                                     (
                                                                           (
                                                                                    (
                                                                                          (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                             | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                                       )
                                                                                       & 61440
                                                                                 )
                                                                                 >> 12
                                                                              | (
                                                                                    (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                       | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                                 )
                                                                                 << 4
                                                                        )
                                                                        ^ 49
                                                                  )
                                                                  & 61440
                                                            )
                                                            >> 12
                                                         | (
                                                               (
                                                                     (
                                                                              (
                                                                                    (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                       | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                                 )
                                                                                 & 61440
                                                                           )
                                                                           >> 12
                                                                        | (
                                                                              (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                 | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                           )
                                                                           << 4
                                                                  )
                                                                  ^ 49
                                                            )
                                                            << 4
                                                   )
                                                   & 63488
                                             )
                                             >> 11
                                          | (
                                                (
                                                         (
                                                               (
                                                                     (
                                                                              (
                                                                                    (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                       | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                                 )
                                                                                 & 61440
                                                                           )
                                                                           >> 12
                                                                        | (
                                                                              (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                 | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                           )
                                                                           << 4
                                                                  )
                                                                  ^ 49
                                                            )
                                                            & 61440
                                                      )
                                                      >> 12
                                                   | (
                                                         (
                                                               (
                                                                        (
                                                                              (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                                 | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                           )
                                                                           & 61440
                                                                     )
                                                                     >> 12
                                                                  | (
                                                                        (((var42 & 61440) >> 12 | var42 << 4) & 64512) >> 10
                                                                           | ((var42 & 61440) >> 12 | var42 << 4) << 6
                                                                     )
                                                                     << 4
                                                            )
                                                            ^ 49
                                                      )
                                                      << 4
                                             )
                                             << 5
                                    )
                                    - 168
                                 << 6
                        )
                        << 9
               )
            );
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = (-687377426 | 857605815) ^ -148932609; var29 < var16.length(); var29 += 848863242 - 34712 ^ 848828531) {
            int var54 = var16.charAt(var29) + 214 + 106 - 88;
            int var95 = (var54 & 65528) >> 3;
            int var55 = ((var54 & 65528) >> 3 | var54 << 13) ^ 205;
            int var96 = ((((var54 & 65528) >> 3 | var54 << 13) ^ 205) & 65408) >> 7;
            var54 = ((((var95 | var54 << 13) ^ 205) & 65408) >> 7 | (((var54 & 65528) >> 3 | var54 << 13) ^ 205) << 9) + 210;
            var95 = ((var96 | var55 << 9) + 210 & 57344) >> 13;
            int var57 = ((var96 | var55 << 9) + 210 & 57344) >> 13 | var54 << 3;
            int var98 = ((((var96 | var55 << 9) + 210 & 57344) >> 13 | var54 << 3) & 65532) >> 2;
            char var58 = (char)((((var95 | var54 << 3) & 65532) >> 2 | (((var96 | var55 << 9) + 210 & 57344) >> 13 | var54 << 3) << 14) ^ 193);
            var16.setCharAt(var29, (char)((var98 | var57 << 14) ^ 193));
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_300.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = (1384623454 + -749833313 | 0) & 268471552; var35 < var19.length(); var35 += 85165157 - 85165157 ^ 1) {
            char var63 = var19.charAt(var35);
            char var66 = (char)(
               (
                        (
                              (
                                       ((((var63 & '\ufff8') >> 3 | var63 << '\r') - 147 ^ 195) & 64512) >> 10
                                          | (((var63 & '\ufff8') >> 3 | var63 << '\r') - 147 ^ 195) << 6
                                    )
                                    + 224
                                    - 82
                                    + 192
                                    + 12
                                 ^ 191
                           )
                           & 57344
                     )
                     >> 13
                  | (
                        (((((var63 & '\ufff8') >> 3 | var63 << '\r') - 147 ^ 195) & 64512) >> 10 | (((var63 & '\ufff8') >> 3 | var63 << '\r') - 147 ^ 195) << 6)
                              + 224
                              - 82
                              + 192
                              + 12
                           ^ 191
                     )
                     << 3
            );
            var19.setCharAt(
               var35,
               (char)(
                  (
                           (
                                 (
                                          ((((var63 & '\ufff8') >> 3 | var63 << '\r') - 147 ^ 195) & 64512) >> 10
                                             | (((var63 & '\ufff8') >> 3 | var63 << '\r') - 147 ^ 195) << 6
                                       )
                                       + 224
                                       - 82
                                       + 192
                                       + 12
                                    ^ 191
                              )
                              & 57344
                        )
                        >> 13
                     | (
                           (
                                    ((((var63 & '\ufff8') >> 3 | var63 << '\r') - 147 ^ 195) & 64512) >> 10
                                       | (((var63 & '\ufff8') >> 3 | var63 << '\r') - 147 ^ 195) << 6
                                 )
                                 + 224
                                 - 82
                                 + 192
                                 + 12
                              ^ 191
                        )
                        << 3
               )
            );
         }

         Class var7 = Class.forName(var19.toString(), false, Class_300.class.getClassLoader());
         switch (((((var4 + 495649323 ^ 998418383) + 1739647220 ^ 80307741) + 310011548 ^ 646633393) - 1263748403 - 1933558565 ^ 2044359767) + 809671682) {
            case 193293624:
            case 746619481:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 755260991:
               var10000 = var0.findSpecial(var7, var5, var6, Class_300.class);
               break;
            case 1399592430:
               var10000 = var0.findConstructor(var7, var6);
               break;
            case 1595546335:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_1857[((var10 + 17360562 + 769039919 + 1935018628 ^ 641074180 ^ 695592560 ^ 1120597259) + 35504939 ^ 2044883648 ^ 360975445) - 5159225] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1414(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = (var10 + 785644345 - 689610423 + 1064743738 - 2131438131 ^ 1396717073) - 1494008503 + 839956953 + 529124607 ^ 1200551318;
      MethodHandle var10000 = field_1857[(
            (var10 + 785644345 - 689610423 + 1064743738 - 2131438131 ^ 1396717073) - 1494008503 + 839956953 + 529124607 ^ 1200551318
         )
         + 2084941529];
      if (field_1857[var10001 + 2084941529] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = (-926804858 | -926804858) ^ -926804858; var24 < var14.length(); var24 += (1649059030 + -1246616010 | 1) & -939391983) {
            int var43 = var14.charAt(var24);
            int var10004 = (var43 & 65472) >> 6;
            int var44 = (var43 & 65472) >> 6 | var43 << 10;
            int var90 = (((var43 & 65472) >> 6 | var43 << 10) & 65535) >> 0;
            var43 = ((((var10004 | var43 << 10) & 65535) >> 0 | ((var43 & 65472) >> 6 | var43 << 10) << 16) ^ 214) + 172 ^ 234;
            var10004 = ((((var90 | var44 << 16) ^ 214) + 172 ^ 234) & 65472) >> 6;
            int var46 = (((((var90 | var44 << 16) ^ 214) + 172 ^ 234) & 65472) >> 6 | var43 << 10) ^ 213;
            int var92 = (((((((var90 | var44 << 16) ^ 214) + 172 ^ 234) & 65472) >> 6 | var43 << 10) ^ 213) & 61440) >> 12;
            var43 = (((var10004 | var43 << 10) ^ 213) & 61440) >> 12 | ((((((var90 | var44 << 16) ^ 214) + 172 ^ 234) & 65472) >> 6 | var43 << 10) ^ 213) << 4;
            var10004 = ((var92 | var46 << 4) & 65472) >> 6;
            int var48 = ((var92 | var46 << 4) & 65472) >> 6 | var43 << 10;
            int var94 = ((((var92 | var46 << 4) & 65472) >> 6 | var43 << 10) & 65520) >> 4;
            char var49 = (char)(((var10004 | var43 << 10) & 65520) >> 4 | (((var92 | var46 << 4) & 65472) >> 6 | var43 << 10) << 12);
            var14.setCharAt(var24, (char)(var94 | var48 << 12));
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = -2070219555 - (340715643 - -1685045352) ^ 198986746; var30 < var17.length(); var30 += (-365835924 >> -365835924 | 1) & 3107) {
            char var54 = var17.charAt(var30);
            char var57 = (char)(
               (
                     (
                              (((((var54 & '￼') >> 2 | var54 << 14) & 61440) >> 12 | ((var54 & '￼') >> 2 | var54 << 14) << 4) & 65534) >> 1
                                 | ((((var54 & '￼') >> 2 | var54 << 14) & 61440) >> 12 | ((var54 & '￼') >> 2 | var54 << 14) << 4) << 15
                           )
                           - 126
                           - 187
                        ^ 103
                        ^ 242
                  )
                  + 141
                  - 105
                  - 137
            );
            var17.setCharAt(
               var30,
               (char)(
                  (
                        (
                                 (((((var54 & '￼') >> 2 | var54 << 14) & 61440) >> 12 | ((var54 & '￼') >> 2 | var54 << 14) << 4) & 65534) >> 1
                                    | ((((var54 & '￼') >> 2 | var54 << 14) & 61440) >> 12 | ((var54 & '￼') >> 2 | var54 << 14) << 4) << 15
                              )
                              - 126
                              - 187
                           ^ 103
                           ^ 242
                     )
                     + 141
                     - 105
                     - 137
               )
            );
         }

         Class var6 = Class.forName(var17.toString(), false, Class_300.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = (-428472496 * 475512865 | 0) & -1994848223; var36 < var20.length(); var36 += (-1988690894 + -1988690894 | 1) & -318766823) {
            char var62 = var20.charAt(var36);
            char var67 = (char)(
               (
                        (
                              (
                                       (
                                                (
                                                      (
                                                               (
                                                                        (
                                                                                 (((var62 & '\uffc0') >> 6 | var62 << '\n') & 61440) >> 12
                                                                                    | ((var62 & '\uffc0') >> 6 | var62 << '\n') << 4
                                                                              )
                                                                              + 194
                                                                           ^ 107
                                                                     )
                                                                     + 199
                                                                  & 57344
                                                            )
                                                            >> 13
                                                         | (
                                                                  (
                                                                           (((var62 & '\uffc0') >> 6 | var62 << '\n') & 61440) >> 12
                                                                              | ((var62 & '\uffc0') >> 6 | var62 << '\n') << 4
                                                                        )
                                                                        + 194
                                                                     ^ 107
                                                               )
                                                               + 199
                                                            << 3
                                                   )
                                                   & 0
                                             )
                                             >> 16
                                          | (
                                                (
                                                         (
                                                                  (
                                                                           (((var62 & '\uffc0') >> 6 | var62 << '\n') & 61440) >> 12
                                                                              | ((var62 & '\uffc0') >> 6 | var62 << '\n') << 4
                                                                        )
                                                                        + 194
                                                                     ^ 107
                                                               )
                                                               + 199
                                                            & 57344
                                                      )
                                                      >> 13
                                                   | (
                                                            (
                                                                     (((var62 & '\uffc0') >> 6 | var62 << '\n') & 61440) >> 12
                                                                        | ((var62 & '\uffc0') >> 6 | var62 << '\n') << 4
                                                                  )
                                                                  + 194
                                                               ^ 107
                                                         )
                                                         + 199
                                                      << 3
                                             )
                                             << 0
                                    )
                                    - 232
                                 ^ 164
                           )
                           & 63488
                     )
                     >> 11
                  | (
                        (
                                 (
                                          (
                                                (
                                                         (
                                                                  (
                                                                           (((var62 & '\uffc0') >> 6 | var62 << '\n') & 61440) >> 12
                                                                              | ((var62 & '\uffc0') >> 6 | var62 << '\n') << 4
                                                                        )
                                                                        + 194
                                                                     ^ 107
                                                               )
                                                               + 199
                                                            & 57344
                                                      )
                                                      >> 13
                                                   | (
                                                            (
                                                                     (((var62 & '\uffc0') >> 6 | var62 << '\n') & 61440) >> 12
                                                                        | ((var62 & '\uffc0') >> 6 | var62 << '\n') << 4
                                                                  )
                                                                  + 194
                                                               ^ 107
                                                         )
                                                         + 199
                                                      << 3
                                             )
                                             & 0
                                       )
                                       >> 16
                                    | (
                                          (
                                                   (
                                                            (
                                                                     (((var62 & '\uffc0') >> 6 | var62 << '\n') & 61440) >> 12
                                                                        | ((var62 & '\uffc0') >> 6 | var62 << '\n') << 4
                                                                  )
                                                                  + 194
                                                               ^ 107
                                                         )
                                                         + 199
                                                      & 57344
                                                )
                                                >> 13
                                             | (
                                                      (
                                                               (((var62 & '\uffc0') >> 6 | var62 << '\n') & 61440) >> 12
                                                                  | ((var62 & '\uffc0') >> 6 | var62 << '\n') << 4
                                                            )
                                                            + 194
                                                         ^ 107
                                                   )
                                                   + 199
                                                << 3
                                       )
                                       << 0
                              )
                              - 232
                           ^ 164
                     )
                     << 5
            );
            var20.setCharAt(
               var36,
               (char)(
                  (
                           (
                                 (
                                          (
                                                   (
                                                         (
                                                                  (
                                                                           (
                                                                                    (((var62 & '\uffc0') >> 6 | var62 << '\n') & 61440) >> 12
                                                                                       | ((var62 & '\uffc0') >> 6 | var62 << '\n') << 4
                                                                                 )
                                                                                 + 194
                                                                              ^ 107
                                                                        )
                                                                        + 199
                                                                     & 57344
                                                               )
                                                               >> 13
                                                            | (
                                                                     (
                                                                              (((var62 & '\uffc0') >> 6 | var62 << '\n') & 61440) >> 12
                                                                                 | ((var62 & '\uffc0') >> 6 | var62 << '\n') << 4
                                                                           )
                                                                           + 194
                                                                        ^ 107
                                                                  )
                                                                  + 199
                                                               << 3
                                                      )
                                                      & 0
                                                )
                                                >> 16
                                             | (
                                                   (
                                                            (
                                                                     (
                                                                              (((var62 & '\uffc0') >> 6 | var62 << '\n') & 61440) >> 12
                                                                                 | ((var62 & '\uffc0') >> 6 | var62 << '\n') << 4
                                                                           )
                                                                           + 194
                                                                        ^ 107
                                                                  )
                                                                  + 199
                                                               & 57344
                                                         )
                                                         >> 13
                                                      | (
                                                               (
                                                                        (((var62 & '\uffc0') >> 6 | var62 << '\n') & 61440) >> 12
                                                                           | ((var62 & '\uffc0') >> 6 | var62 << '\n') << 4
                                                                     )
                                                                     + 194
                                                                  ^ 107
                                                            )
                                                            + 199
                                                         << 3
                                                )
                                                << 0
                                       )
                                       - 232
                                    ^ 164
                              )
                              & 63488
                        )
                        >> 11
                     | (
                           (
                                    (
                                             (
                                                   (
                                                            (
                                                                     (
                                                                              (((var62 & '\uffc0') >> 6 | var62 << '\n') & 61440) >> 12
                                                                                 | ((var62 & '\uffc0') >> 6 | var62 << '\n') << 4
                                                                           )
                                                                           + 194
                                                                        ^ 107
                                                                  )
                                                                  + 199
                                                               & 57344
                                                         )
                                                         >> 13
                                                      | (
                                                               (
                                                                        (((var62 & '\uffc0') >> 6 | var62 << '\n') & 61440) >> 12
                                                                           | ((var62 & '\uffc0') >> 6 | var62 << '\n') << 4
                                                                     )
                                                                     + 194
                                                                  ^ 107
                                                            )
                                                            + 199
                                                         << 3
                                                )
                                                & 0
                                          )
                                          >> 16
                                       | (
                                             (
                                                      (
                                                               (
                                                                        (((var62 & '\uffc0') >> 6 | var62 << '\n') & 61440) >> 12
                                                                           | ((var62 & '\uffc0') >> 6 | var62 << '\n') << 4
                                                                     )
                                                                     + 194
                                                                  ^ 107
                                                            )
                                                            + 199
                                                         & 57344
                                                   )
                                                   >> 13
                                                | (
                                                         (
                                                                  (((var62 & '\uffc0') >> 6 | var62 << '\n') & 61440) >> 12
                                                                     | ((var62 & '\uffc0') >> 6 | var62 << '\n') << 4
                                                               )
                                                               + 194
                                                            ^ 107
                                                      )
                                                      + 199
                                                   << 3
                                          )
                                          << 0
                                 )
                                 - 232
                              ^ 164
                        )
                        << 5
               )
            );
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_300.class.getClassLoader()).returnType();
         switch ((((var4 - 1689040115 - 409482919 ^ 154533625) + 2142454396 ^ 1400184067) - 1506210526 + 763764584 + 670035896 ^ 151392015) - 1915241018) {
            case 55788031:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            case 654288061:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            case 751778896:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            case 1954799587:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_1857[((var10 + 785644345 - 689610423 + 1064743738 - 2131438131 ^ 1396717073) - 1494008503 + 839956953 + 529124607 ^ 1200551318) + 2084941529] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
