import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;

public enum Class_402 {
   // $VF: renamed from: bo Class_402
   field_1003,
   // $VF: renamed from: fi Class_402
   field_1004,
   // $VF: renamed from: jtx Class_402
   field_1005,
   // $VF: renamed from: xcp Class_402
   field_1006,
   // $VF: renamed from: xi Class_402
   field_1007;

   // $VF: renamed from: aw int
   public int field_1008;
   public static final MethodHandle[] vkoq = new MethodHandle[34];

   public Class_402(int var3) {
      this.field_1008 = var3;
   }

   // $VF: renamed from: wwo () int
   public int method_1139() {
      return 1<"JNT",1457372354,"퇩쟩","\uec71뱰","⌷⌿㰿",-486935828>(this);
   }

   // $VF: Failed to inline enum fields
   // Please report this to the Vineflower issue tracker, at https://github.com/Vineflower/vineflower/issues with a copy of the class file (if you have the rights to distribute it!)
   static {
      int var10000 = (1364445353 >> -1768104663 | 0) & -1203289591;

      StringBuilder var10001;
      for (var10001 = (StringBuilder)0<"JNT",15752473,"Ӛ\u0a7aચ\u0a7a\u0bdaҚ","騄ꌄꪄꡄ궄ꡄ鯄ꬄꡄꮄ꧄鯄꓄괄겄ꩄꮄ꧄黄驄ꖄ","Ⴕྕἵྕᘵṵྕḵვᘵፕήᶵ႕ḵვᎵἕ႕ṵᅵᄕᶵ",-1924016624>("䇩䧩㧩䇩⧩駩ꇩ");
         var10000 < ((1242092824 & -1479867888 | 7) & 1489134671);
         var10000 += (-783817360 - 1668006576 | 1) & 33704989
      ) {
         int var18 = 0<"JNT",411655749,"ऺਗ਼ॺଚպ\u0bda","騄ꉄ驄ꃄ","Ⴕྕἵྕᘵṵྕḵვᘵፕήᶵ႕ḵვᎵἕ႕ṵᅵᄕᶵ",-1924016634>(var10001, var10000) - 245 - 252;
         char var19 = (char)(((var18 & 63488) >> 11 | var18 << 5) + 88 + 233);
         0<"JNT",411655749,"\u0b3a৺\u0bdaԺਗ਼ॺଚպ\u0bda","騄ꉄꃄ驄ꖄ","Ⴕྕἵྕᘵṵྕḵვᘵፕήᶵ႕ḵვᎵἕ႕ṵᅵᄕᶵ",-1924016711>(
            var10001, var10000, (char)(((var18 & 63488) >> 11 | var18 << 5) + 88 + 233)
         );
      }

      field_1003 = (Class_402)0<"JNT",15752473,"Ӛ\u0a7aચ\u0a7a\u0bdaҚ","騄ꌄꪄꡄ궄ꡄ鯄ꬄꡄꮄ꧄鯄꓄괄겄ꩄꮄ꧄黄ꉄꉄ驄ꖄ","ẕᄵ",-1924016614>(
         0<"JNT",411655749,"\u0bda\u0abaܺ\u0bdaଚ\u0a7aચ\u09ba","騄驄ꌄꪄꡄ궄ꡄ鯄ꬄꡄꮄ꧄鯄꓄괄겄ꩄꮄ꧄黄","Ⴕྕἵྕᘵṵྕḵვᘵፕήᶵ႕ḵვᎵἕ႕ṵᅵᄕᶵ",-1924016613>(var10001), 0, 0
      );
      var10000 = -1089592081 ^ -1089592081 ^ 0;

      for (var10001 = (StringBuilder)0<"JNT",15752473,"Ӛ\u0a7aચ\u0a7a\u0bdaҚ","騄ꌄꪄꡄ궄ꡄ鯄ꬄꡄꮄ꧄鯄꓄괄겄ꩄꮄ꧄黄驄ꖄ","Ⴕྕἵྕᘵṵྕḵვᘵፕήᶵ႕ḵვᎵἕ႕ṵᅵᄕᶵ",-1924016611>("Ͻ䏽쏼Ͻ");
         var10000 < 4;
         var10000 += (32178393 >> 32178393 | 1) & -1056289403
      ) {
         int var22 = 0<"JNT",411655749,"ऺਗ਼ॺଚպ\u0bda","騄ꉄ驄ꃄ","Ⴕྕἵྕᘵṵྕḵვᘵፕήᶵ႕ḵვᎵἕ႕ṵᅵᄕᶵ",-1924016658>(var10001, var10000) - 2 + 151;
         int var48 = (var22 & 65504) >> 5;
         int var23 = ((var22 & 65504) >> 5 | var22 << 11) - 36;
         int var49 = (((var22 & 65504) >> 5 | var22 << 11) - 36 & 65024) >> 9;
         char var24 = (char)(((var48 | var22 << 11) - 36 & 65024) >> 9 | ((var22 & 65504) >> 5 | var22 << 11) - 36 << 7);
         0<"JNT",411655749,"\u0b3a৺\u0bdaԺਗ਼ॺଚպ\u0bda","騄ꉄꃄ驄ꖄ","Ⴕྕἵྕᘵṵྕḵვᘵፕήᶵ႕ḵვᎵἕ႕ṵᅵᄕᶵ",-1924016671>(var10001, var10000, (char)(var49 | var23 << 7));
      }

      field_1004 = (Class_402)0<"JNT",15752473,"Ӛ\u0a7aચ\u0a7a\u0bdaҚ","騄ꌄꪄꡄ궄ꡄ鯄ꬄꡄꮄ꧄鯄꓄괄겄ꩄꮄ꧄黄ꉄꉄ驄ꖄ","ẕᄵ",-1924016617>(
         0<"JNT",411655749,"\u0bda\u0abaܺ\u0bdaଚ\u0a7aચ\u09ba","騄驄ꌄꪄꡄ궄ꡄ鯄ꬄꡄꮄ꧄鯄꓄괄겄ꩄꮄ꧄黄","Ⴕྕἵྕᘵṵྕḵვᘵፕήᶵ႕ḵვᎵἕ႕ṵᅵᄕᶵ",-1924016620>(var10001), 1, 1
      );
      var10000 = (1603474514 | -2073194271 | 0) & 536870924;

      for (var10001 = (StringBuilder)0<"JNT",15752473,"Ӛ\u0a7aચ\u0a7a\u0bdaҚ","騄ꌄꪄꡄ궄ꡄ鯄ꬄꡄꮄ꧄鯄꓄괄겄ꩄꮄ꧄黄驄ꖄ","Ⴕྕἵྕᘵṵྕḵვᘵፕήᶵ႕ḵვᎵἕ႕ṵᅵᄕᶵ",-1924016618>("顺驺ꁺ険繺鑺");
         var10000 < (-384080616 + -384080616 ^ -768161226);
         var10000 += (224045111 + (1055474445 >> -1907358300) | 1) & 1814331521
      ) {
         char var27 = 0<"JNT",411655749,"ऺਗ਼ॺଚպ\u0bda","騄ꉄ驄ꃄ","Ⴕྕἵྕᘵṵྕḵვᘵፕήᶵ႕ḵვᎵἕ႕ṵᅵᄕᶵ",-1924016612>(var10001, var10000);
         char var30 = (char)(
            (
                  (((((var27 & '￠') >> 5 | var27 << 11) & 49152) >> 14 | ((var27 & '￠') >> 5 | var27 << 11) << 2) - 79 & 65472) >> 6
                     | ((((var27 & '￠') >> 5 | var27 << 11) & 49152) >> 14 | ((var27 & '￠') >> 5 | var27 << 11) << 2) - 79 << 10
               )
               - 253
         );
         0<"JNT",411655749,"\u0b3a৺\u0bdaԺਗ਼ॺଚպ\u0bda","騄ꉄꃄ驄ꖄ","Ⴕྕἵྕᘵṵྕḵვᘵፕήᶵ႕ḵვᎵἕ႕ṵᅵᄕᶵ",-1924016609>(
            var10001,
            var10000,
            (char)(
               (
                     (((((var27 & '￠') >> 5 | var27 << 11) & 49152) >> 14 | ((var27 & '￠') >> 5 | var27 << 11) << 2) - 79 & 65472) >> 6
                        | ((((var27 & '￠') >> 5 | var27 << 11) & 49152) >> 14 | ((var27 & '￠') >> 5 | var27 << 11) << 2) - 79 << 10
                  )
                  - 253
            )
         );
      }

      field_1005 = (Class_402)0<"JNT",15752473,"Ӛ\u0a7aચ\u0a7a\u0bdaҚ","騄ꌄꪄꡄ궄ꡄ鯄ꬄꡄꮄ꧄鯄꓄괄겄ꩄꮄ꧄黄ꉄꉄ驄ꖄ","ẕᄵ",-1924016623>(
         0<"JNT",411655749,"\u0bda\u0abaܺ\u0bdaଚ\u0a7aચ\u09ba","騄驄ꌄꪄꡄ궄ꡄ鯄ꬄꡄꮄ꧄鯄꓄괄겄ꩄꮄ꧄黄","Ⴕྕἵྕᘵṵྕḵვᘵፕήᶵ႕ḵვᎵἕ႕ṵᅵᄕᶵ",-1924016610>(var10001), 2, 2
      );
      var10000 = (621094692 >> -1260620593 | 0) & -1617645451;

      for (var10001 = (StringBuilder)0<"JNT",15752473,"Ӛ\u0a7aચ\u0a7a\u0bdaҚ","騄ꌄꪄꡄ궄ꡄ鯄ꬄꡄꮄ꧄鯄꓄괄겄ꩄꮄ꧄黄驄ꖄ","Ⴕྕἵྕᘵṵྕḵვᘵፕήᶵ႕ḵვᎵἕ႕ṵᅵᄕᶵ",-1924016640>("쀮.0");
         var10000 < ((975037041 << 975037041 | 3) & 822721167);
         var10000 += -1837124404 ^ -1175779463 ^ 731165620
      ) {
         char var33 = 0<"JNT",411655749,"ऺਗ਼ॺଚպ\u0bda","騄ꉄ驄ꃄ","Ⴕྕἵྕᘵṵྕḵვᘵፕήᶵ႕ḵვᎵἕ႕ṵᅵᄕᶵ",-1924016636>(var10001, var10000);
         char var36 = (char)(
            (
                     (((((var33 & 'ﾀ') >> 7 | var33 << '\t') & 64512) >> 10 | ((var33 & 'ﾀ') >> 7 | var33 << '\t') << 6) & 57344) >> 13
                        | ((((var33 & 'ﾀ') >> 7 | var33 << '\t') & 64512) >> 10 | ((var33 & 'ﾀ') >> 7 | var33 << '\t') << 6) << 3
                  )
                  - 16
               ^ 231
         );
         0<"JNT",411655749,"\u0b3a৺\u0bdaԺਗ਼ॺଚպ\u0bda","騄ꉄꃄ驄ꖄ","Ⴕྕἵྕᘵṵྕḵვᘵፕήᶵ႕ḵვᎵἕ႕ṵᅵᄕᶵ",-1924016633>(
            var10001,
            var10000,
            (char)(
               (
                        (((((var33 & 'ﾀ') >> 7 | var33 << '\t') & 64512) >> 10 | ((var33 & 'ﾀ') >> 7 | var33 << '\t') << 6) & 57344) >> 13
                           | ((((var33 & 'ﾀ') >> 7 | var33 << '\t') & 64512) >> 10 | ((var33 & 'ﾀ') >> 7 | var33 << '\t') << 6) << 3
                     )
                     - 16
                  ^ 231
            )
         );
      }

      field_1006 = (Class_402)0<"JNT",15752473,"Ӛ\u0a7aચ\u0a7a\u0bdaҚ","騄ꌄꪄꡄ궄ꡄ鯄ꬄꡄꮄ꧄鯄꓄괄겄ꩄꮄ꧄黄ꉄꉄ驄ꖄ","ẕᄵ",-1924016638>(
         0<"JNT",411655749,"\u0bda\u0abaܺ\u0bdaଚ\u0a7aચ\u09ba","騄驄ꌄꪄꡄ궄ꡄ鯄ꬄꡄꮄ꧄鯄꓄괄겄ꩄꮄ꧄黄","Ⴕྕἵྕᘵṵྕḵვᘵፕήᶵ႕ḵვᎵἕ႕ṵᅵᄕᶵ",-1924016637>(var10001), 3, 3
      );
      var10000 = (-672889059 | -458483557) ^ -135487585;

      for (var10001 = (StringBuilder)0<"JNT",15752473,"Ӛ\u0a7aચ\u0a7a\u0bdaҚ","騄ꌄꪄꡄ궄ꡄ鯄ꬄꡄꮄ꧄鯄꓄괄겄ꩄꮄ꧄黄驄ꖄ","Ⴕྕἵྕᘵṵྕḵვᘵፕήᶵ႕ḵვᎵἕ႕ṵᅵᄕᶵ",-1924016635>("¾¹¡·¥¦");
         var10000 < (-1104755295 >> 62915173 ^ -34523605);
         var10000 += (846099653 | 846099653 | 0) & -1988034271
      ) {
         0<"JNT",411655749,"\u0b3a৺\u0bdaԺਗ਼ॺଚպ\u0bda","騄ꉄꃄ驄ꖄ","Ⴕྕἵྕᘵṵྕḵვᘵፕήᶵ႕ḵვᎵἕ႕ṵᅵᄕᶵ",-1924016616>(
            var10001,
            var10000,
            (char)((0<"JNT",411655749,"ऺਗ਼ॺଚպ\u0bda","騄ꉄ驄ꃄ","Ⴕྕἵྕᘵṵྕḵვᘵፕήᶵ႕ḵვᎵἕ႕ṵᅵᄕᶵ",-1924016631>(var10001, var10000) ^ 'W' ^ 227) + 37 + 25 + 4)
         );
      }

      field_1007 = (Class_402)0<"JNT",15752473,"Ӛ\u0a7aચ\u0a7a\u0bdaҚ","騄ꌄꪄꡄ궄ꡄ鯄ꬄꡄꮄ꧄鯄꓄괄겄ꩄꮄ꧄黄ꉄꉄ驄ꖄ","ẕᄵ",-1924016622>(
         0<"JNT",411655749,"\u0bda\u0abaܺ\u0bdaଚ\u0a7aચ\u09ba","騄驄ꌄꪄꡄ궄ꡄ鯄ꬄꡄꮄ꧄鯄꓄괄겄ꩄꮄ꧄黄","Ⴕྕἵྕᘵṵྕḵვᘵፕήᶵ႕ḵვᎵἕ႕ṵᅵᄕᶵ",-1924016621>(var10001), 4, 4
      );
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1141(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = (var10 + 2122134514 + 500150558 - 492083862 - 694952046 + 1669998932 ^ 1482175045 ^ 967980899) + 2058983025 ^ 2114577783;
      MethodHandle var10000 = vkoq[((var10 + 2122134514 + 500150558 - 492083862 - 694952046 + 1669998932 ^ 1482175045 ^ 967980899) + 2058983025 ^ 2114577783)
         + 600692826];
      if (vkoq[var10001 + 600692826] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = (-891567469 >>> -1844618576 | 0) & -1040112384; var23 < var13.length(); var23 += -606628275 << 2012401673 ^ -1356031487) {
            int var42 = (var13.charAt(var23) ^ 'I') - 103 - 172 - 160;
            char var45 = (char)(
               (((((var42 & 65504) >> 5 | var42 << 11) + 8 - 78 + 107 & 32768) >> 15 | ((var42 & 65504) >> 5 | var42 << 11) + 8 - 78 + 107 << 1) & 65534) >> 1
                  | ((((var42 & 65504) >> 5 | var42 << 11) + 8 - 78 + 107 & 32768) >> 15 | ((var42 & 65504) >> 5 | var42 << 11) + 8 - 78 + 107 << 1) << 15
            );
            var13.setCharAt(
               var23,
               (char)(
                  (((((var42 & 65504) >> 5 | var42 << 11) + 8 - 78 + 107 & 32768) >> 15 | ((var42 & 65504) >> 5 | var42 << 11) + 8 - 78 + 107 << 1) & 65534)
                        >> 1
                     | ((((var42 & 65504) >> 5 | var42 << 11) + 8 - 78 + 107 & 32768) >> 15 | ((var42 & 65504) >> 5 | var42 << 11) + 8 - 78 + 107 << 1) << 15
               )
            );
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = -816551519 - -816551519 ^ 0; var29 < var16.length(); var29 += (671849689 + 177390936 | 0) & 1159762251) {
            char var50 = var16.charAt(var29);
            char var57 = (char)(
               (
                        (
                              (
                                       (
                                             (
                                                      (
                                                            (
                                                                     (
                                                                           (
                                                                                    (
                                                                                             (((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10
                                                                                                | ((var50 & '￼') >> 2 | var50 << 14) << 6
                                                                                          )
                                                                                          + 196
                                                                                          - 44
                                                                                          - 225
                                                                                       & 63488
                                                                                 )
                                                                                 >> 11
                                                                              | (
                                                                                       (((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10
                                                                                          | ((var50 & '￼') >> 2 | var50 << 14) << 6
                                                                                    )
                                                                                    + 196
                                                                                    - 44
                                                                                    - 225
                                                                                 << 5
                                                                        )
                                                                        & 65504
                                                                  )
                                                                  >> 5
                                                               | (
                                                                     (
                                                                              (
                                                                                       (((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10
                                                                                          | ((var50 & '￼') >> 2 | var50 << 14) << 6
                                                                                    )
                                                                                    + 196
                                                                                    - 44
                                                                                    - 225
                                                                                 & 63488
                                                                           )
                                                                           >> 11
                                                                        | (
                                                                                 (((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10
                                                                                    | ((var50 & '￼') >> 2 | var50 << 14) << 6
                                                                              )
                                                                              + 196
                                                                              - 44
                                                                              - 225
                                                                           << 5
                                                                  )
                                                                  << 11
                                                         )
                                                         & 61440
                                                   )
                                                   >> 12
                                                | (
                                                      (
                                                               (
                                                                     (
                                                                              (
                                                                                       (((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10
                                                                                          | ((var50 & '￼') >> 2 | var50 << 14) << 6
                                                                                    )
                                                                                    + 196
                                                                                    - 44
                                                                                    - 225
                                                                                 & 63488
                                                                           )
                                                                           >> 11
                                                                        | (
                                                                                 (((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10
                                                                                    | ((var50 & '￼') >> 2 | var50 << 14) << 6
                                                                              )
                                                                              + 196
                                                                              - 44
                                                                              - 225
                                                                           << 5
                                                                  )
                                                                  & 65504
                                                            )
                                                            >> 5
                                                         | (
                                                               (
                                                                        (
                                                                                 (((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10
                                                                                    | ((var50 & '￼') >> 2 | var50 << 14) << 6
                                                                              )
                                                                              + 196
                                                                              - 44
                                                                              - 225
                                                                           & 63488
                                                                     )
                                                                     >> 11
                                                                  | (
                                                                           (((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10
                                                                              | ((var50 & '￼') >> 2 | var50 << 14) << 6
                                                                        )
                                                                        + 196
                                                                        - 44
                                                                        - 225
                                                                     << 5
                                                            )
                                                            << 11
                                                   )
                                                   << 4
                                          )
                                          & 65520
                                    )
                                    >> 4
                                 | (
                                       (
                                                (
                                                      (
                                                               (
                                                                     (
                                                                              (
                                                                                       (((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10
                                                                                          | ((var50 & '￼') >> 2 | var50 << 14) << 6
                                                                                    )
                                                                                    + 196
                                                                                    - 44
                                                                                    - 225
                                                                                 & 63488
                                                                           )
                                                                           >> 11
                                                                        | (
                                                                                 (((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10
                                                                                    | ((var50 & '￼') >> 2 | var50 << 14) << 6
                                                                              )
                                                                              + 196
                                                                              - 44
                                                                              - 225
                                                                           << 5
                                                                  )
                                                                  & 65504
                                                            )
                                                            >> 5
                                                         | (
                                                               (
                                                                        (
                                                                                 (((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10
                                                                                    | ((var50 & '￼') >> 2 | var50 << 14) << 6
                                                                              )
                                                                              + 196
                                                                              - 44
                                                                              - 225
                                                                           & 63488
                                                                     )
                                                                     >> 11
                                                                  | (
                                                                           (((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10
                                                                              | ((var50 & '￼') >> 2 | var50 << 14) << 6
                                                                        )
                                                                        + 196
                                                                        - 44
                                                                        - 225
                                                                     << 5
                                                            )
                                                            << 11
                                                   )
                                                   & 61440
                                             )
                                             >> 12
                                          | (
                                                (
                                                         (
                                                               (
                                                                        (
                                                                                 (((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10
                                                                                    | ((var50 & '￼') >> 2 | var50 << 14) << 6
                                                                              )
                                                                              + 196
                                                                              - 44
                                                                              - 225
                                                                           & 63488
                                                                     )
                                                                     >> 11
                                                                  | (
                                                                           (((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10
                                                                              | ((var50 & '￼') >> 2 | var50 << 14) << 6
                                                                        )
                                                                        + 196
                                                                        - 44
                                                                        - 225
                                                                     << 5
                                                            )
                                                            & 65504
                                                      )
                                                      >> 5
                                                   | (
                                                         (
                                                                  ((((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10 | ((var50 & '￼') >> 2 | var50 << 14) << 6)
                                                                        + 196
                                                                        - 44
                                                                        - 225
                                                                     & 63488
                                                               )
                                                               >> 11
                                                            | ((((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10 | ((var50 & '￼') >> 2 | var50 << 14) << 6)
                                                                  + 196
                                                                  - 44
                                                                  - 225
                                                               << 5
                                                      )
                                                      << 11
                                             )
                                             << 4
                                    )
                                    << 12
                           )
                           & 64512
                     )
                     >> 10
                  | (
                        (
                                 (
                                       (
                                                (
                                                      (
                                                               (
                                                                     (
                                                                              (
                                                                                       (((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10
                                                                                          | ((var50 & '￼') >> 2 | var50 << 14) << 6
                                                                                    )
                                                                                    + 196
                                                                                    - 44
                                                                                    - 225
                                                                                 & 63488
                                                                           )
                                                                           >> 11
                                                                        | (
                                                                                 (((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10
                                                                                    | ((var50 & '￼') >> 2 | var50 << 14) << 6
                                                                              )
                                                                              + 196
                                                                              - 44
                                                                              - 225
                                                                           << 5
                                                                  )
                                                                  & 65504
                                                            )
                                                            >> 5
                                                         | (
                                                               (
                                                                        (
                                                                                 (((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10
                                                                                    | ((var50 & '￼') >> 2 | var50 << 14) << 6
                                                                              )
                                                                              + 196
                                                                              - 44
                                                                              - 225
                                                                           & 63488
                                                                     )
                                                                     >> 11
                                                                  | (
                                                                           (((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10
                                                                              | ((var50 & '￼') >> 2 | var50 << 14) << 6
                                                                        )
                                                                        + 196
                                                                        - 44
                                                                        - 225
                                                                     << 5
                                                            )
                                                            << 11
                                                   )
                                                   & 61440
                                             )
                                             >> 12
                                          | (
                                                (
                                                         (
                                                               (
                                                                        (
                                                                                 (((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10
                                                                                    | ((var50 & '￼') >> 2 | var50 << 14) << 6
                                                                              )
                                                                              + 196
                                                                              - 44
                                                                              - 225
                                                                           & 63488
                                                                     )
                                                                     >> 11
                                                                  | (
                                                                           (((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10
                                                                              | ((var50 & '￼') >> 2 | var50 << 14) << 6
                                                                        )
                                                                        + 196
                                                                        - 44
                                                                        - 225
                                                                     << 5
                                                            )
                                                            & 65504
                                                      )
                                                      >> 5
                                                   | (
                                                         (
                                                                  ((((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10 | ((var50 & '￼') >> 2 | var50 << 14) << 6)
                                                                        + 196
                                                                        - 44
                                                                        - 225
                                                                     & 63488
                                                               )
                                                               >> 11
                                                            | ((((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10 | ((var50 & '￼') >> 2 | var50 << 14) << 6)
                                                                  + 196
                                                                  - 44
                                                                  - 225
                                                               << 5
                                                      )
                                                      << 11
                                             )
                                             << 4
                                    )
                                    & 65520
                              )
                              >> 4
                           | (
                                 (
                                          (
                                                (
                                                         (
                                                               (
                                                                        (
                                                                                 (((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10
                                                                                    | ((var50 & '￼') >> 2 | var50 << 14) << 6
                                                                              )
                                                                              + 196
                                                                              - 44
                                                                              - 225
                                                                           & 63488
                                                                     )
                                                                     >> 11
                                                                  | (
                                                                           (((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10
                                                                              | ((var50 & '￼') >> 2 | var50 << 14) << 6
                                                                        )
                                                                        + 196
                                                                        - 44
                                                                        - 225
                                                                     << 5
                                                            )
                                                            & 65504
                                                      )
                                                      >> 5
                                                   | (
                                                         (
                                                                  ((((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10 | ((var50 & '￼') >> 2 | var50 << 14) << 6)
                                                                        + 196
                                                                        - 44
                                                                        - 225
                                                                     & 63488
                                                               )
                                                               >> 11
                                                            | ((((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10 | ((var50 & '￼') >> 2 | var50 << 14) << 6)
                                                                  + 196
                                                                  - 44
                                                                  - 225
                                                               << 5
                                                      )
                                                      << 11
                                             )
                                             & 61440
                                       )
                                       >> 12
                                    | (
                                          (
                                                   (
                                                         (
                                                                  ((((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10 | ((var50 & '￼') >> 2 | var50 << 14) << 6)
                                                                        + 196
                                                                        - 44
                                                                        - 225
                                                                     & 63488
                                                               )
                                                               >> 11
                                                            | ((((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10 | ((var50 & '￼') >> 2 | var50 << 14) << 6)
                                                                  + 196
                                                                  - 44
                                                                  - 225
                                                               << 5
                                                      )
                                                      & 65504
                                                )
                                                >> 5
                                             | (
                                                   (
                                                            ((((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10 | ((var50 & '￼') >> 2 | var50 << 14) << 6)
                                                                  + 196
                                                                  - 44
                                                                  - 225
                                                               & 63488
                                                         )
                                                         >> 11
                                                      | ((((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10 | ((var50 & '￼') >> 2 | var50 << 14) << 6)
                                                            + 196
                                                            - 44
                                                            - 225
                                                         << 5
                                                )
                                                << 11
                                       )
                                       << 4
                              )
                              << 12
                     )
                     << 6
            );
            var16.setCharAt(
               var29,
               (char)(
                  (
                           (
                                 (
                                          (
                                                (
                                                         (
                                                               (
                                                                        (
                                                                              (
                                                                                       (
                                                                                                (((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10
                                                                                                   | ((var50 & '￼') >> 2 | var50 << 14) << 6
                                                                                             )
                                                                                             + 196
                                                                                             - 44
                                                                                             - 225
                                                                                          & 63488
                                                                                    )
                                                                                    >> 11
                                                                                 | (
                                                                                          (((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10
                                                                                             | ((var50 & '￼') >> 2 | var50 << 14) << 6
                                                                                       )
                                                                                       + 196
                                                                                       - 44
                                                                                       - 225
                                                                                    << 5
                                                                           )
                                                                           & 65504
                                                                     )
                                                                     >> 5
                                                                  | (
                                                                        (
                                                                                 (
                                                                                          (((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10
                                                                                             | ((var50 & '￼') >> 2 | var50 << 14) << 6
                                                                                       )
                                                                                       + 196
                                                                                       - 44
                                                                                       - 225
                                                                                    & 63488
                                                                              )
                                                                              >> 11
                                                                           | (
                                                                                    (((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10
                                                                                       | ((var50 & '￼') >> 2 | var50 << 14) << 6
                                                                                 )
                                                                                 + 196
                                                                                 - 44
                                                                                 - 225
                                                                              << 5
                                                                     )
                                                                     << 11
                                                            )
                                                            & 61440
                                                      )
                                                      >> 12
                                                   | (
                                                         (
                                                                  (
                                                                        (
                                                                                 (
                                                                                          (((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10
                                                                                             | ((var50 & '￼') >> 2 | var50 << 14) << 6
                                                                                       )
                                                                                       + 196
                                                                                       - 44
                                                                                       - 225
                                                                                    & 63488
                                                                              )
                                                                              >> 11
                                                                           | (
                                                                                    (((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10
                                                                                       | ((var50 & '￼') >> 2 | var50 << 14) << 6
                                                                                 )
                                                                                 + 196
                                                                                 - 44
                                                                                 - 225
                                                                              << 5
                                                                     )
                                                                     & 65504
                                                               )
                                                               >> 5
                                                            | (
                                                                  (
                                                                           (
                                                                                    (((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10
                                                                                       | ((var50 & '￼') >> 2 | var50 << 14) << 6
                                                                                 )
                                                                                 + 196
                                                                                 - 44
                                                                                 - 225
                                                                              & 63488
                                                                        )
                                                                        >> 11
                                                                     | (
                                                                              (((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10
                                                                                 | ((var50 & '￼') >> 2 | var50 << 14) << 6
                                                                           )
                                                                           + 196
                                                                           - 44
                                                                           - 225
                                                                        << 5
                                                               )
                                                               << 11
                                                      )
                                                      << 4
                                             )
                                             & 65520
                                       )
                                       >> 4
                                    | (
                                          (
                                                   (
                                                         (
                                                                  (
                                                                        (
                                                                                 (
                                                                                          (((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10
                                                                                             | ((var50 & '￼') >> 2 | var50 << 14) << 6
                                                                                       )
                                                                                       + 196
                                                                                       - 44
                                                                                       - 225
                                                                                    & 63488
                                                                              )
                                                                              >> 11
                                                                           | (
                                                                                    (((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10
                                                                                       | ((var50 & '￼') >> 2 | var50 << 14) << 6
                                                                                 )
                                                                                 + 196
                                                                                 - 44
                                                                                 - 225
                                                                              << 5
                                                                     )
                                                                     & 65504
                                                               )
                                                               >> 5
                                                            | (
                                                                  (
                                                                           (
                                                                                    (((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10
                                                                                       | ((var50 & '￼') >> 2 | var50 << 14) << 6
                                                                                 )
                                                                                 + 196
                                                                                 - 44
                                                                                 - 225
                                                                              & 63488
                                                                        )
                                                                        >> 11
                                                                     | (
                                                                              (((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10
                                                                                 | ((var50 & '￼') >> 2 | var50 << 14) << 6
                                                                           )
                                                                           + 196
                                                                           - 44
                                                                           - 225
                                                                        << 5
                                                               )
                                                               << 11
                                                      )
                                                      & 61440
                                                )
                                                >> 12
                                             | (
                                                   (
                                                            (
                                                                  (
                                                                           (
                                                                                    (((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10
                                                                                       | ((var50 & '￼') >> 2 | var50 << 14) << 6
                                                                                 )
                                                                                 + 196
                                                                                 - 44
                                                                                 - 225
                                                                              & 63488
                                                                        )
                                                                        >> 11
                                                                     | (
                                                                              (((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10
                                                                                 | ((var50 & '￼') >> 2 | var50 << 14) << 6
                                                                           )
                                                                           + 196
                                                                           - 44
                                                                           - 225
                                                                        << 5
                                                               )
                                                               & 65504
                                                         )
                                                         >> 5
                                                      | (
                                                            (
                                                                     (
                                                                              (((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10
                                                                                 | ((var50 & '￼') >> 2 | var50 << 14) << 6
                                                                           )
                                                                           + 196
                                                                           - 44
                                                                           - 225
                                                                        & 63488
                                                                  )
                                                                  >> 11
                                                               | ((((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10 | ((var50 & '￼') >> 2 | var50 << 14) << 6)
                                                                     + 196
                                                                     - 44
                                                                     - 225
                                                                  << 5
                                                         )
                                                         << 11
                                                )
                                                << 4
                                       )
                                       << 12
                              )
                              & 64512
                        )
                        >> 10
                     | (
                           (
                                    (
                                          (
                                                   (
                                                         (
                                                                  (
                                                                        (
                                                                                 (
                                                                                          (((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10
                                                                                             | ((var50 & '￼') >> 2 | var50 << 14) << 6
                                                                                       )
                                                                                       + 196
                                                                                       - 44
                                                                                       - 225
                                                                                    & 63488
                                                                              )
                                                                              >> 11
                                                                           | (
                                                                                    (((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10
                                                                                       | ((var50 & '￼') >> 2 | var50 << 14) << 6
                                                                                 )
                                                                                 + 196
                                                                                 - 44
                                                                                 - 225
                                                                              << 5
                                                                     )
                                                                     & 65504
                                                               )
                                                               >> 5
                                                            | (
                                                                  (
                                                                           (
                                                                                    (((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10
                                                                                       | ((var50 & '￼') >> 2 | var50 << 14) << 6
                                                                                 )
                                                                                 + 196
                                                                                 - 44
                                                                                 - 225
                                                                              & 63488
                                                                        )
                                                                        >> 11
                                                                     | (
                                                                              (((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10
                                                                                 | ((var50 & '￼') >> 2 | var50 << 14) << 6
                                                                           )
                                                                           + 196
                                                                           - 44
                                                                           - 225
                                                                        << 5
                                                               )
                                                               << 11
                                                      )
                                                      & 61440
                                                )
                                                >> 12
                                             | (
                                                   (
                                                            (
                                                                  (
                                                                           (
                                                                                    (((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10
                                                                                       | ((var50 & '￼') >> 2 | var50 << 14) << 6
                                                                                 )
                                                                                 + 196
                                                                                 - 44
                                                                                 - 225
                                                                              & 63488
                                                                        )
                                                                        >> 11
                                                                     | (
                                                                              (((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10
                                                                                 | ((var50 & '￼') >> 2 | var50 << 14) << 6
                                                                           )
                                                                           + 196
                                                                           - 44
                                                                           - 225
                                                                        << 5
                                                               )
                                                               & 65504
                                                         )
                                                         >> 5
                                                      | (
                                                            (
                                                                     (
                                                                              (((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10
                                                                                 | ((var50 & '￼') >> 2 | var50 << 14) << 6
                                                                           )
                                                                           + 196
                                                                           - 44
                                                                           - 225
                                                                        & 63488
                                                                  )
                                                                  >> 11
                                                               | ((((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10 | ((var50 & '￼') >> 2 | var50 << 14) << 6)
                                                                     + 196
                                                                     - 44
                                                                     - 225
                                                                  << 5
                                                         )
                                                         << 11
                                                )
                                                << 4
                                       )
                                       & 65520
                                 )
                                 >> 4
                              | (
                                    (
                                             (
                                                   (
                                                            (
                                                                  (
                                                                           (
                                                                                    (((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10
                                                                                       | ((var50 & '￼') >> 2 | var50 << 14) << 6
                                                                                 )
                                                                                 + 196
                                                                                 - 44
                                                                                 - 225
                                                                              & 63488
                                                                        )
                                                                        >> 11
                                                                     | (
                                                                              (((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10
                                                                                 | ((var50 & '￼') >> 2 | var50 << 14) << 6
                                                                           )
                                                                           + 196
                                                                           - 44
                                                                           - 225
                                                                        << 5
                                                               )
                                                               & 65504
                                                         )
                                                         >> 5
                                                      | (
                                                            (
                                                                     (
                                                                              (((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10
                                                                                 | ((var50 & '￼') >> 2 | var50 << 14) << 6
                                                                           )
                                                                           + 196
                                                                           - 44
                                                                           - 225
                                                                        & 63488
                                                                  )
                                                                  >> 11
                                                               | ((((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10 | ((var50 & '￼') >> 2 | var50 << 14) << 6)
                                                                     + 196
                                                                     - 44
                                                                     - 225
                                                                  << 5
                                                         )
                                                         << 11
                                                )
                                                & 61440
                                          )
                                          >> 12
                                       | (
                                             (
                                                      (
                                                            (
                                                                     (
                                                                              (((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10
                                                                                 | ((var50 & '￼') >> 2 | var50 << 14) << 6
                                                                           )
                                                                           + 196
                                                                           - 44
                                                                           - 225
                                                                        & 63488
                                                                  )
                                                                  >> 11
                                                               | ((((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10 | ((var50 & '￼') >> 2 | var50 << 14) << 6)
                                                                     + 196
                                                                     - 44
                                                                     - 225
                                                                  << 5
                                                         )
                                                         & 65504
                                                   )
                                                   >> 5
                                                | (
                                                      (
                                                               ((((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10 | ((var50 & '￼') >> 2 | var50 << 14) << 6)
                                                                     + 196
                                                                     - 44
                                                                     - 225
                                                                  & 63488
                                                            )
                                                            >> 11
                                                         | ((((var50 & '￼') >> 2 | var50 << 14) & 64512) >> 10 | ((var50 & '￼') >> 2 | var50 << 14) << 6)
                                                               + 196
                                                               - 44
                                                               - 225
                                                            << 5
                                                   )
                                                   << 11
                                          )
                                          << 4
                                 )
                                 << 12
                        )
                        << 6
               )
            );
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_402.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = (-1391812482 & -1464350352 | 0) & 1379475086; var35 < var19.length(); var35 += 1220382545 * -1351225005 ^ -395986878) {
            int var62 = var19.charAt(var35) + 'I' - 222;
            char var65 = (char)(
               (
                     (
                              (((((var62 & 65520) >> 4 | var62 << 12) & 65528) >> 3 | ((var62 & 65520) >> 4 | var62 << 12) << 13) & 49152) >> 14
                                 | ((((var62 & 65520) >> 4 | var62 << 12) & 65528) >> 3 | ((var62 & 65520) >> 4 | var62 << 12) << 13) << 2
                           )
                           + 183
                           + 249
                           - 168
                        ^ 182
                  )
                  - 213
            );
            var19.setCharAt(
               var35,
               (char)(
                  (
                        (
                                 (((((var62 & 65520) >> 4 | var62 << 12) & 65528) >> 3 | ((var62 & 65520) >> 4 | var62 << 12) << 13) & 49152) >> 14
                                    | ((((var62 & 65520) >> 4 | var62 << 12) & 65528) >> 3 | ((var62 & 65520) >> 4 | var62 << 12) << 13) << 2
                              )
                              + 183
                              + 249
                              - 168
                           ^ 182
                     )
                     - 213
               )
            );
         }

         Class var7 = Class.forName(var19.toString(), false, Class_402.class.getClassLoader());
         switch (((var4 ^ 2124207684) - 70527974 - 2126779208 ^ 370454279 ^ 1238474645 ^ 310743629 ^ 435180335) + 1956570565 ^ 727731584 ^ 487266220) {
            case 302578056:
               var10000 = var0.findConstructor(var7, var6);
               break;
            case 318569893:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            case 438813892:
            case 1314711934:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 1656861105:
               var10000 = var0.findSpecial(var7, var5, var6, Class_402.class);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      vkoq[((var10 + 2122134514 + 500150558 - 492083862 - 694952046 + 1669998932 ^ 1482175045 ^ 967980899) + 2058983025 ^ 2114577783) + 600692826] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1142(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 + 467732952 - 191748289 - 734558439 ^ 697822764 ^ 1245362242 ^ 1933834031) + 1862998491 ^ 1094582042) + 936618812;
      MethodHandle var10000 = vkoq[((var10 + 467732952 - 191748289 - 734558439 ^ 697822764 ^ 1245362242 ^ 1933834031) + 1862998491 ^ 1094582042)
         + 936618812
         - 1060931164];
      if (vkoq[var10001 - 1060931164] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = (-2050676121 | -2050676121 | 0) & 1209012608; var24 < var14.length(); var24 += (-763437005 & -763437005 >> -763437005 | 1) & 16779269) {
            int var43 = (var14.charAt(var24) ^ 238) - 136;
            int var10004 = (var43 & 0) >> 16;
            int var44 = ((var43 & 0) >> 16 | var43 << 0) - 78 + 207;
            int var90 = (((var43 & 0) >> 16 | var43 << 0) - 78 + 207 & 65534) >> 1;
            var43 = ((var10004 | var43 << 0) - 78 + 207 & 65534) >> 1 | ((var43 & 0) >> 16 | var43 << 0) - 78 + 207 << 15;
            var10004 = ((var90 | var44 << 15) & 65528) >> 3;
            int var46 = ((var90 | var44 << 15) & 65528) >> 3 | var43 << 13;
            int var92 = ((((var90 | var44 << 15) & 65528) >> 3 | var43 << 13) & 65520) >> 4;
            char var47 = (char)((((var10004 | var43 << 13) & 65520) >> 4 | (((var90 | var44 << 15) & 65528) >> 3 | var43 << 13) << 12) ^ 88 ^ 232);
            var14.setCharAt(var24, (char)((var92 | var46 << 12) ^ 88 ^ 232));
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = (-1004956969 << 1802390011 | 0) & 1202277684; var30 < var17.length(); var30 += 407150994 ^ 407150994 ^ 1) {
            int var52 = (var17.charAt(var30) ^ 188) - 72;
            int var93 = (var52 & 64512) >> 10;
            int var53 = (var52 & 64512) >> 10 | var52 << 6;
            int var94 = (((var52 & 64512) >> 10 | var52 << 6) & 65024) >> 9;
            var52 = (((var93 | var52 << 6) & 65024) >> 9 | ((var52 & 64512) >> 10 | var52 << 6) << 7) - 168 - 233;
            var93 = ((var94 | var53 << 7) - 168 - 233 & 65024) >> 9;
            int var55 = ((((var94 | var53 << 7) - 168 - 233 & 65024) >> 9 | var52 << 7) ^ 0) + 156;
            int var96 = (((((var94 | var53 << 7) - 168 - 233 & 65024) >> 9 | var52 << 7) ^ 0) + 156 & 0) >> 16;
            char var56 = (char)((((var93 | var52 << 7) ^ 0) + 156 & 0) >> 16 | ((((var94 | var53 << 7) - 168 - 233 & 65024) >> 9 | var52 << 7) ^ 0) + 156 << 0);
            var17.setCharAt(var30, (char)(var96 | var55 << 0));
         }

         Class var6 = Class.forName(var17.toString(), false, Class_402.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = (-575992013 & -575992013 | 0) & 1073220; var36 < var20.length(); var36 += 1145737974 >>> -537954849 ^ 1) {
            int var61 = var20.charAt(var36);
            int var97 = (var61 & 61440) >> 12;
            int var62 = ((var61 & 61440) >> 12 | var61 << 4) + 127;
            int var98 = (((var61 & 61440) >> 12 | var61 << 4) + 127 & 65504) >> 5;
            var61 = ((var97 | var61 << 4) + 127 & 65504) >> 5 | ((var61 & 61440) >> 12 | var61 << 4) + 127 << 11;
            var97 = ((var98 | var62 << 11) & 65532) >> 2;
            int var64 = ((var98 | var62 << 11) & 65532) >> 2 | var61 << 14;
            int var100 = ((((var98 | var62 << 11) & 65532) >> 2 | var61 << 14) & 65472) >> 6;
            var61 = ((((var97 | var61 << 14) & 65472) >> 6 | (((var98 | var62 << 11) & 65532) >> 2 | var61 << 14) << 10) ^ 223 ^ 25) + 177;
            var97 = (((var100 | var64 << 10) ^ 223 ^ 25) + 177 & 64512) >> 10;
            int var66 = (((var100 | var64 << 10) ^ 223 ^ 25) + 177 & 64512) >> 10 | var61 << 6;
            int var102 = (((((var100 | var64 << 10) ^ 223 ^ 25) + 177 & 64512) >> 10 | var61 << 6) & 0) >> 16;
            char var67 = (char)(((var97 | var61 << 6) & 0) >> 16 | ((((var100 | var64 << 10) ^ 223 ^ 25) + 177 & 64512) >> 10 | var61 << 6) << 0);
            var20.setCharAt(var36, (char)(var102 | var66 << 0));
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_402.class.getClassLoader()).returnType();
         switch (((var4 - 861666028 - 1756937299 ^ 251483725 ^ 1478037881) - 2013395048 - 546384930 ^ 1700430395 ^ 596398936) + 1111953514 - 432073236) {
            case 93331145:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            case 148410094:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            case 1037235620:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            case 1358079944:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         vkoq[((var10 + 467732952 - 191748289 - 734558439 ^ 697822764 ^ 1245362242 ^ 1933834031) + 1862998491 ^ 1094582042) + 936618812 - 1060931164] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
