import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;

public class Class_39 extends Class_342 {
   // $VF: renamed from: kl Class_321
   public Class_321 field_2263;
   // $VF: renamed from: ktz java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_2264 = new MethodHandle[768510922 >>> (768510922 | 1058798450) ^ 53];

   public Class_39() {
      int var10001 = (-1041683302 - -963355216 | 0) & 8990724;

      StringBuilder var10002;
      for (var10002 = (StringBuilder)0<"JNT",-1119564262,"\ue05f䡙灙䡙ꁙ\uf05f","Ῐ꿘⟗ϗퟗϗ㯘\u2fd7ϗ㟗ᯗ㯘䯗쿗쟗⏗㟗ᯗ\uebd8⏘埗","舘凞鬒凞ﲍ墳凞揄海ﲍﶥ諾節突揄海ﴭ蝹突墳悔卑節",2094110384>(
            "\ue0de\ue41e\ue40e\ue3be\udece\ue23e\ue2de\ue38e\ue37e"
         );
         var10001 < 9;
         var10001 += 1
      ) {
         char var13 = 0<"JNT",57279171,"ᡙ䁙࡙遙ࡆꁙ","Ῐꏘ⏘诘","舘凞鬒凞ﲍ墳凞揄海ﲍﶥ諾節突揄海ﴭ蝹突墳悔卑節",2094110373>(var10002, var10001);
         char var16 = (char)(
            (
                  (((((var13 & 'ﰀ') >> 10 | var13 << 6) & 0) >> 16 | ((var13 & 'ﰀ') >> 10 | var13 << 6) << 0) + 69 & 64512) >> 10
                     | ((((var13 & 'ﰀ') >> 10 | var13 << 6) & 0) >> 16 | ((var13 & 'ﰀ') >> 10 | var13 << 6) << 0) + 69 << 6
               )
               + 244
         );
         0<"JNT",57279171,"顙⡙ꁙᡆ䁙࡙遙ࡆꁙ","Ῐꏘ诘⏘埗","舘凞鬒凞ﲍ墳凞揄海ﲍﶥ諾節突揄海ﴭ蝹突墳悔卑節",2094110374>(
            var10002,
            var10001,
            (char)(
               (
                     (((((var13 & 'ﰀ') >> 10 | var13 << 6) & 0) >> 16 | ((var13 & 'ﰀ') >> 10 | var13 << 6) << 0) + 69 & 64512) >> 10
                        | ((((var13 & 'ﰀ') >> 10 | var13 << 6) & 0) >> 16 | ((var13 & 'ﰀ') >> 10 | var13 << 6) << 0) + 69 << 6
                  )
                  + 244
            )
         );
      }

      String var2 = 0<"JNT",57279171,"ꁙ硙顆ꁙ遙䡙灙㡙","Ῐ⏘꿘⟗ϗퟗϗ㯘\u2fd7ϗ㟗ᯗ㯘䯗쿗쟗⏗㟗ᯗ\uebd8","舘凞鬒凞ﲍ墳凞揄海ﲍﶥ諾節突揄海ﴭ蝹突墳悔卑節",2094110385>(var10002);
      int var7 = (-1333458109 | 582186238 & 1955715565) ^ -1332388881;

      StringBuilder var18;
      for (var18 = (StringBuilder)0<"JNT",-1119564262,"\ue05f䡙灙䡙ꁙ\uf05f","Ῐ꿘⟗ϗퟗϗ㯘\u2fd7ϗ㟗ᯗ㯘䯗쿗쟗⏗㟗ᯗ\uebd8⏘埗","舘凞鬒凞ﲍ墳凞揄海ﲍﶥ諾節突揄海ﴭ蝹突墳悔卑節",2094110386>(
            "ⒸႸᆸસࢸҸᆸಸڸҸসসᲸ䖸ኸҸসຸᚸ䖸ಸஸ䖸Ҹ䖸ڸමસᚸ¸ஸ䖸Ƹಸី¸ڸᆸಸસஸ"
         );
         var7 < ((-1400751969 + -1400751969 + -1858678125 | 41) & 343946283);
         var7 += 963120524 - 963120524 ^ 1
      ) {
         char var31 = 0<"JNT",57279171,"ᡙ䁙࡙遙ࡆꁙ","Ῐꏘ⏘诘","舘凞鬒凞ﲍ墳凞揄海ﲍﶥ諾節突揄海ﴭ蝹突墳悔卑節",2094110391>(var18, var7);
         char var34 = (char)(
            (
                  ((((((var31 & '\ufff8') >> 3 | var31 << '\r') ^ 23) & 65408) >> 7 | (((var31 & '\ufff8') >> 3 | var31 << '\r') ^ 23) << 9) & 49152) >> 14
                     | (((((var31 & '\ufff8') >> 3 | var31 << '\r') ^ 23) & 65408) >> 7 | (((var31 & '\ufff8') >> 3 | var31 << '\r') ^ 23) << 9) << 2
               )
               ^ 101
         );
         0<"JNT",57279171,"顙⡙ꁙᡆ䁙࡙遙ࡆꁙ","Ῐꏘ诘⏘埗","舘凞鬒凞ﲍ墳凞揄海ﲍﶥ諾節突揄海ﴭ蝹突墳悔卑節",2094110392>(
            var18,
            var7,
            (char)(
               (
                     ((((((var31 & '\ufff8') >> 3 | var31 << '\r') ^ 23) & 65408) >> 7 | (((var31 & '\ufff8') >> 3 | var31 << '\r') ^ 23) << 9) & 49152) >> 14
                        | (((((var31 & '\ufff8') >> 3 | var31 << '\r') ^ 23) & 65408) >> 7 | (((var31 & '\ufff8') >> 3 | var31 << '\r') ^ 23) << 9) << 2
                  )
                  ^ 101
            )
         );
      }

      super(
         var2,
         0<"JNT",57279171,"ꁙ硙顆ꁙ遙䡙灙㡙","Ῐ⏘꿘⟗ϗퟗϗ㯘\u2fd7ϗ㟗ᯗ㯘䯗쿗쟗⏗㟗ᯗ\uebd8","舘凞鬒凞ﲍ墳凞揄海ﲍﶥ諾節突揄海ﴭ蝹突墳悔卑節",2094110375>(var18),
         -1,
         1<"JNT",-1955281273,"쪑쩷쩥","7 ","\ua7ebߩ⟥ߣ\ue7e2䟫",706193575>()
      );
      var10001 = 390987422 ^ 390987422;

      for (var10002 = (StringBuilder)0<"JNT",-1119564262,"\ue05f䡙灙䡙ꁙ\uf05f","Ῐ꿘⟗ϗퟗϗ㯘\u2fd7ϗ㟗ᯗ㯘䯗쿗쟗⏗㟗ᯗ\uebd8⏘埗","舘凞鬒凞ﲍ墳凞揄海ﲍﶥ諾節突揄海ﴭ蝹突墳悔卑節",2094110369>("簤檤朤沤澤搤檤榤椤");
         var10001 < (-1313862265 >> 1447993450 ^ -1283062);
         var10001 += -2015641098 ^ -1274619722 ^ 870127937
      ) {
         char var21 = 0<"JNT",57279171,"ᡙ䁙࡙遙ࡆꁙ","Ῐꏘ⏘诘","舘凞鬒凞ﲍ墳凞揄海ﲍﶥ諾節突揄海ﴭ蝹突墳悔卑節",2094110370>(var10002, var10001);
         char var24 = (char)(
            ((((((var21 & '︀') >> 9 | var21 << 7) ^ 15) & 65504) >> 5 | (((var21 & '︀') >> 9 | var21 << 7) ^ 15) << 11) - 145 & 65024) >> 9
               | (((((var21 & '︀') >> 9 | var21 << 7) ^ 15) & 65504) >> 5 | (((var21 & '︀') >> 9 | var21 << 7) ^ 15) << 11) - 145 << 7
         );
         0<"JNT",57279171,"顙⡙ꁙᡆ䁙࡙遙ࡆꁙ","Ῐꏘ诘⏘埗","舘凞鬒凞ﲍ墳凞揄海ﲍﶥ諾節突揄海ﴭ蝹突墳悔卑節",2094110371>(
            var10002,
            var10001,
            (char)(
               ((((((var21 & '︀') >> 9 | var21 << 7) ^ 15) & 65504) >> 5 | (((var21 & '︀') >> 9 | var21 << 7) ^ 15) << 11) - 145 & 65024) >> 9
                  | (((((var21 & '︀') >> 9 | var21 << 7) ^ 15) & 65504) >> 5 | (((var21 & '︀') >> 9 | var21 << 7) ^ 15) << 11) - 145 << 7
            )
         );
      }

      Class_321 var5 = (Class_321)0<"JNT",-1119564262,"\ue05f䡙灙䡙ꁙ\uf05f","Ῐ꿘⟗ϗퟗϗ㯘\u2fd7ϗ㟗ᯗ㯘䯗쿗쟗⏗㟗ᯗ\uebd8꿘⟗ϗퟗϗ㯘\u2fd7ϗ㟗ᯗ㯘鏘㟗폗㏗\uebd8꿘⟗ϗퟗϗ㯘\u2fd7ϗ㟗ᯗ㯘诘\u2fd7ϗ쯗쯗\uebd8⏘埗","諾徭",2094110389>(
         0<"JNT",57279171,"ꁙ硙顆ꁙ遙䡙灙㡙","Ῐ⏘꿘⟗ϗퟗϗ㯘\u2fd7ϗ㟗ᯗ㯘䯗쿗쟗⏗㟗ᯗ\uebd8","舘凞鬒凞ﲍ墳凞揄海ﲍﶥ諾節突揄海ﴭ蝹突墳悔卑節",2094110379>(var10002),
         1<"JNT",-1955281273,"쪏쪗","<\f","\ua7ebߩ⟥栞栜䟫",706193595>(),
         Class_353.class
      );
      int var11 = 1927114620 >>> 1927114620 ^ 7;

      for (var18 = (StringBuilder)0<"JNT",-1119564262,"\ue05f䡙灙䡙ꁙ\uf05f","Ῐ꿘⟗ϗퟗϗ㯘\u2fd7ϗ㟗ᯗ㯘䯗쿗쟗⏗㟗ᯗ\uebd8⏘埗","舘凞鬒凞ﲍ墳凞揄海ﲍﶥ諾節突揄海ﴭ蝹突墳悔卑節",2094110390>(
            "頁\uf807ဆ㠀᠆\uf007꠆ဆ 順\uf007쀇젇㠀順쀇㠀耆〆\ud807\ue007㠀\uf007젇"
         );
         var11 < ((-347088357 | 143718831 & -347088357 >> 143718831 | 8) & 1368);
         var11 += (-1154146289 + -1163347510 | 0) & 134217735
      ) {
         char var40 = 0<"JNT",57279171,"ᡙ䁙࡙遙ࡆꁙ","Ῐꏘ⏘诘","舘凞鬒凞ﲍ墳凞揄海ﲍﶥ諾節突揄海ﴭ蝹突墳悔卑節",2094110377>(var18, var11);
         int var56 = (var40 & '\ufff0') >> 4;
         int var41 = (var40 & '\ufff0') >> 4 | var40 << '\f';
         int var57 = (((var40 & '\ufff0') >> 4 | var40 << '\f') & 65408) >> 7;
         var40 = (char)(((((var56 | var40 << '\f') & 65408) >> 7 | ((var40 & '\ufff0') >> 4 | var40 << '\f') << 9) ^ 91) + 88 ^ 148);
         0<"JNT",57279171,"顙⡙ꁙᡆ䁙࡙遙ࡆꁙ","Ῐꏘ诘⏘埗","舘凞鬒凞ﲍ墳凞揄海ﲍﶥ諾節突揄海ﴭ蝹突墳悔卑節",2094110378>(var18, var11, (char)(((var57 | var41 << 9) ^ 91) + 88 ^ 148));
      }

      this.field_2263 = 0<"JNT",57279171,"灙쁙","Ῐ꿘⟗ϗퟗϗ㯘\u2fd7ϗ㟗ᯗ㯘䯗쿗쟗⏗㟗ᯗ\uebd8⏘꿘쿗㯗\uebd8","諾徭",2094110381>(
         var5, 0<"JNT",57279171,"ꁙ硙顆ꁙ遙䡙灙㡙","Ῐ⏘꿘⟗ϗퟗϗ㯘\u2fd7ϗ㟗ᯗ㯘䯗쿗쟗⏗㟗ᯗ\uebd8","舘凞鬒凞ﲍ墳凞揄海ﲍﶥ諾節突揄海ﴭ蝹突墳悔卑節",2094110372>(var18)
      );
      0<"JNT",57279171,"衙ꡙ","Ῐ毗꿘쏗ᏗᏗ\uebd8⏘埗","逸贈瘟",2094110383>(this, new Class_271[]{1<"JNT",-2072796534,"쪉쩽","\u001d\u0005ￍ","\ua7ebߩ⟥⠜쟢䟫",706193593>(this)});
   }

   // $VF: renamed from: q () void
   @Override
   public void method_1408() {
      0<"JNT",-135141822,"衙","Ῐ⏘埗","蝹瘟祉",2094110387>(this);
      if (1<"JNT",-2072796534,"쪏쪅쪍쩽쪋쪡쫵쫱쫷쫫","ￔ\u000bￎ\u0014ￓ\u0007ￔ\u000b\u001d\uffd0\u001f\fￎ\u0014\u001d\u0006\u001fￍￍ!\r\u000f\u0012","\ua7ebߩ⟥柣蟣⠜쟪蟢ߡ柣蟣䟢\ue81cߢ栜⠜쟪䟢⟡ߢ䠜䠜쟠쟥⟤柦䟫",706193742>(
            1<"JNT",-2072796534,"쩽쩹","\u001d\u0005ￍ","\ua7ebߩ⟥柣蟣⠜쟪蟢ߡ柣蟣䟢\ue81cߢ栜⠜쟪䟢⟡ߢ䠜䠜쟠䟤ߤ\ua7e6䟫",706193587>(this)
         )
         != null) {
         0<"JNT",57279171,"桙⡙ꁙ䁙硙⁙\uf846遟顟ꁟ쁟衟","Ῐ柗⏘埗","揄卑諾ﲍ冀突揄卑逸節凞祉諾ﲍ逸墳凞瘟瘟洞ﲥﲝﲽ",2094110393>(
            1<"JNT",-2072796534,"쪏쪅쪍쩽쪋쪡쫵쫣쫥쫫","ￔ\u000bￎ\u0014ￓ\u0007ￔ\u000b\u001d\uffd0\u001f\fￎ\u0014\u001d\u0006\u001fￍￍ!\r\u000fŻ","\ua7ebߩ⟥柣蟣⠜쟪蟢ߡ柣蟣䟢\ue81cߢ栜⠜쟪䟢⟡ߢ䠜䠜쟠䟤\ua7e6⟤䟫",706193743>(
               1<"JNT",-2072796534,"쪏쪅쪍쩽쪋쪡쫵쫯쫥쫳","ￔ\u000bￎ\u0014ￓ\u0007ￔ\u000b\u001d\uffd0\u001f\fￎ\u0014\u001d\u0006\u001fￍￍ!\r\u000f\u0012","\ua7ebߩ⟥柣蟣⠜쟪蟢ߡ柣蟣䟢\ue81cߢ栜⠜쟪䟢⟡ߢ䠜䠜쟠䟤ߤ蟥䟫",706193740>(
                  1<"JNT",-2072796534,"쩽쩹","\u001d\u0005ￍ","\ua7ebߩ⟥柣蟣⠜쟪蟢ߡ柣蟣䟢\ue81cߢ栜⠜쟪䟢⟡ߢ䠜䠜쟠䟤ߤ\ua7e6䟫",706193737>(this)
               )
            ),
            false
         );
         0<"JNT",57279171,"桙⡙ꁙ䁙硙⁙\uf846遟顟ꁟ쁟衟","Ῐ柗⏘埗","揄卑諾ﲍ冀突揄卑逸節凞祉諾ﲍ逸墳凞瘟瘟洞ﲥﲝﲽ",2094110405>(
            1<"JNT",-2072796534,"쪏쪅쪍쩽쪋쪡쫵쫣쫣쫵","ￔ\u000bￎ\u0014ￓ\u0007ￔ\u000b\u001d\uffd0\u001f\fￎ\u0014\u001d\u0006\u001fￍￍ!\r\u000fŻ","\ua7ebߩ⟥柣蟣⠜쟪蟢ߡ柣蟣䟢\ue81cߢ栜⠜쟪䟢⟡ߢ䠜䠜쟠䟤\ua7e6⟤䟫",706193739>(
               1<"JNT",-2072796534,"쪏쪅쪍쩽쪋쪡쫵쫯쫥쫳","ￔ\u000bￎ\u0014ￓ\u0007ￔ\u000b\u001d\uffd0\u001f\fￎ\u0014\u001d\u0006\u001fￍￍ!\r\u000f\u0012","\ua7ebߩ⟥柣蟣⠜쟪蟢ߡ柣蟣䟢\ue81cߢ栜⠜쟪䟢⟡ߢ䠜䠜쟠䟤ߤ蟥䟫",706193736>(
                  1<"JNT",-2072796534,"쩽쩹","\u001d\u0005ￍ","\ua7ebߩ⟥柣蟣⠜쟪蟢ߡ柣蟣䟢\ue81cߢ栜⠜쟪䟢⟡ߢ䠜䠜쟠䟤ߤ\ua7e6䟫",706193589>(this)
               )
            ),
            false
         );
         0<"JNT",57279171,"桙⡙ꁙ䁙硙⁙\uf846遟顟ꁟ쁟衟","Ῐ柗⏘埗","揄卑諾ﲍ冀突揄卑逸節凞祉諾ﲍ逸墳凞瘟瘟洞ﲥﲝﲽ",2094110401>(
            1<"JNT",-2072796534,"쪏쪅쪍쩽쪋쪡쫵쫥쫵쫹","ￔ\u000bￎ\u0014ￓ\u0007ￔ\u000b\u001d\uffd0\u001f\fￎ\u0014\u001d\u0006\u001fￍￍ!\r\u000fŻ","\ua7ebߩ⟥柣蟣⠜쟪蟢ߡ柣蟣䟢\ue81cߢ栜⠜쟪䟢⟡ߢ䠜䠜쟠䟤\ua7e6⟤䟫",706193671>(
               1<"JNT",-2072796534,"쪏쪅쪍쩽쪋쪡쫵쫯쫥쫳","ￔ\u000bￎ\u0014ￓ\u0007ￔ\u000b\u001d\uffd0\u001f\fￎ\u0014\u001d\u0006\u001fￍￍ!\r\u000f\u0012","\ua7ebߩ⟥柣蟣⠜쟪蟢ߡ柣蟣䟢\ue81cߢ栜⠜쟪䟢⟡ߢ䠜䠜쟠䟤ߤ蟥䟫",706193668>(
                  1<"JNT",-2072796534,"쩽쩹","\u001d\u0005ￍ","\ua7ebߩ⟥柣蟣⠜쟪蟢ߡ柣蟣䟢\ue81cߢ栜⠜쟪䟢⟡ߢ䠜䠜쟠䟤ߤ\ua7e6䟫",706193665>(this)
               )
            ),
            false
         );
         0<"JNT",57279171,"桙⡙ꁙ䁙硙⁙\uf846遟顟ꁟ쁟衟","Ῐ柗⏘埗","揄卑諾ﲍ冀突揄卑逸節凞祉諾ﲍ逸墳凞瘟瘟洞ﲥﲝﲽ",2094110413>(
            1<"JNT",-2072796534,"쪏쪅쪍쩽쪋쪡쫵쫣쫫쫥","ￔ\u000bￎ\u0014ￓ\u0007ￔ\u000b\u001d\uffd0\u001f\fￎ\u0014\u001d\u0006\u001fￍￍ!\r\u000fŻ","\ua7ebߩ⟥柣蟣⠜쟪蟢ߡ柣蟣䟢\ue81cߢ栜⠜쟪䟢⟡ߢ䠜䠜쟠䟤\ua7e6⟤䟫",706193667>(
               1<"JNT",-2072796534,"쪏쪅쪍쩽쪋쪡쫵쫯쫥쫳","ￔ\u000bￎ\u0014ￓ\u0007ￔ\u000b\u001d\uffd0\u001f\fￎ\u0014\u001d\u0006\u001fￍￍ!\r\u000f\u0012","\ua7ebߩ⟥柣蟣⠜쟪蟢ߡ柣蟣䟢\ue81cߢ栜⠜쟪䟢⟡ߢ䠜䠜쟠䟤ߤ蟥䟫",706193664>(
                  1<"JNT",-2072796534,"쩽쩹","\u001d\u0005ￍ","\ua7ebߩ⟥柣蟣⠜쟪蟢ߡ柣蟣䟢\ue81cߢ栜⠜쟪䟢⟡ߢ䠜䠜쟠䟤ߤ\ua7e6䟫",706193677>(this)
               )
            ),
            false
         );
      }
   }

   // $VF: renamed from: gd (Class_207) void
   @Class_21
   public void method_1900(Class_207 var1) {
      int var2 = -2016640647;
      if (1<"JNT",-2072796534,"쪏쪅쪍쩽쪋쪡쫵쫱쫷쫫","ￔ\u000bￎ\u0014ￓ\u0007ￔ\u000b\u001d\uffd0\u001f\fￎ\u0014\u001d\u0006\u001fￍￍ!\r\u000f\u0012","\ua7ebߩ⟥柣蟣⠜쟪蟢ߡ柣蟣䟢\ue81cߢ栜⠜쟪䟢⟡ߢ䠜䠜쟠쟥⟤柦䟫",706193693>(
            1<"JNT",-2072796534,"쩽쩹","\u001d\u0005ￍ","\ua7ebߩ⟥柣蟣⠜쟪蟢ߡ柣蟣䟢\ue81cߢ栜⠜쟪䟢⟡ߢ䠜䠜쟠䟤ߤ\ua7e6䟫",706193682>(this)
         )
         != null) {
         var2 = 1918511431 * -1165835150 ^ 1980554018;

         while (true) {
            switch (var2 - 378578949 + 1770942355 + 928867461 - 1895007663 + 1149980406 ^ 42319120) {
               case -1550034207:
                  0<"JNT",57279171,"桙⡙ꁙ䁙硙⁙\uf846遟顟ꁟ쁟衟","Ῐ柗⏘埗","揄卑諾ﲍ冀突揄卑逸節凞祉諾ﲍ逸墳凞瘟瘟洞ﲥﲝﲽ",2094110424>(
                     1<"JNT",-2072796534,"쪏쪅쪍쩽쪋쪡쫵쫥쫵쫹","ￔ\u000bￎ\u0014ￓ\u0007ￔ\u000b\u001d\uffd0\u001f\fￎ\u0014\u001d\u0006\u001fￍￍ!\r\u000fŻ","\ua7ebߩ⟥柣蟣⠜쟪蟢ߡ柣蟣䟢\ue81cߢ栜⠜쟪䟢⟡ߢ䠜䠜쟠䟤\ua7e6⟤䟫",706193684>(
                        1<"JNT",-2072796534,"쪏쪅쪍쩽쪋쪡쫵쫯쫥쫳","ￔ\u000bￎ\u0014ￓ\u0007ￔ\u000b\u001d\uffd0\u001f\fￎ\u0014\u001d\u0006\u001fￍￍ!\r\u000f\u0012","\ua7ebߩ⟥柣蟣⠜쟪蟢ߡ柣蟣䟢\ue81cߢ栜⠜쟪䟢⟡ߢ䠜䠜쟠䟤ߤ蟥䟫",706193681>(
                           1<"JNT",-2072796534,"쩽쩹","\u001d\u0005ￍ","\ua7ebߩ⟥柣蟣⠜쟪蟢ߡ柣蟣䟢\ue81cߢ栜⠜쟪䟢⟡ߢ䠜䠜쟠䟤ߤ\ua7e6䟫",706193686>(this)
                        )
                     ),
                     true
                  );
                  break;
               case -723135934:
                  0<"JNT",57279171,"桙⡙ꁙ䁙硙⁙\uf846遟顟ꁟ쁟衟","Ῐ柗⏘埗","揄卑諾ﲍ冀突揄卑逸節凞祉諾ﲍ逸墳凞瘟瘟洞ﲥﲝﲽ",2094110426>(
                     1<"JNT",-2072796534,"쪏쪅쪍쩽쪋쪡쫵쫣쫫쫥","ￔ\u000bￎ\u0014ￓ\u0007ￔ\u000b\u001d\uffd0\u001f\fￎ\u0014\u001d\u0006\u001fￍￍ!\r\u000fŻ","\ua7ebߩ⟥柣蟣⠜쟪蟢ߡ柣蟣䟢\ue81cߢ栜⠜쟪䟢⟡ߢ䠜䠜쟠䟤\ua7e6⟤䟫",706193578>(
                        1<"JNT",-2072796534,"쪏쪅쪍쩽쪋쪡쫵쫯쫥쫳","ￔ\u000bￎ\u0014ￓ\u0007ￔ\u000b\u001d\uffd0\u001f\fￎ\u0014\u001d\u0006\u001fￍￍ!\r\u000f\u0012","\ua7ebߩ⟥柣蟣⠜쟪蟢ߡ柣蟣䟢\ue81cߢ栜⠜쟪䟢⟡ߢ䠜䠜쟠䟤ߤ蟥䟫",706193583>(
                           1<"JNT",-2072796534,"쩽쩹","\u001d\u0005ￍ","\ua7ebߩ⟥柣蟣⠜쟪蟢ߡ柣蟣䟢\ue81cߢ栜⠜쟪䟢⟡ߢ䠜䠜쟠䟤ߤ\ua7e6䟫",706193580>(this)
                        )
                     ),
                     true
                  );
                  break;
               case 608416323:
                  0<"JNT",57279171,"桙⡙ꁙ䁙硙⁙\uf846遟顟ꁟ쁟衟","Ῐ柗⏘埗","揄卑諾ﲍ冀突揄卑逸節凞祉諾ﲍ逸墳凞瘟瘟洞ﲥﲝﲽ",2094110430>(
                     1<"JNT",-2072796534,"쪏쪅쪍쩽쪋쪡쫵쫣쫥쫫","ￔ\u000bￎ\u0014ￓ\u0007ￔ\u000b\u001d\uffd0\u001f\fￎ\u0014\u001d\u0006\u001fￍￍ!\r\u000fŻ","\ua7ebߩ⟥柣蟣⠜쟪蟢ߡ柣蟣䟢\ue81cߢ栜⠜쟪䟢⟡ߢ䠜䠜쟠䟤\ua7e6⟤䟫",706193582>(
                        1<"JNT",-2072796534,"쪏쪅쪍쩽쪋쪡쫵쫯쫥쫳","ￔ\u000bￎ\u0014ￓ\u0007ￔ\u000b\u001d\uffd0\u001f\fￎ\u0014\u001d\u0006\u001fￍￍ!\r\u000f\u0012","\ua7ebߩ⟥柣蟣⠜쟪蟢ߡ柣蟣䟢\ue81cߢ栜⠜쟪䟢⟡ߢ䠜䠜쟠䟤ߤ蟥䟫",706193683>(
                           1<"JNT",-2072796534,"쩽쩹","\u001d\u0005ￍ","\ua7ebߩ⟥柣蟣⠜쟪蟢ߡ柣蟣䟢\ue81cߢ栜⠜쟪䟢⟡ߢ䠜䠜쟠䟤ߤ\ua7e6䟫",706193680>(this)
                        )
                     ),
                     true
                  );
                  break;
               case 972685793:
                  return;
               case 1578278681:
                  0<"JNT",57279171,"桙⡙ꁙ䁙硙⁙\uf846遟顟ꁟ쁟衟","Ῐ柗⏘埗","揄卑諾ﲍ冀突揄卑逸節凞祉諾ﲍ逸墳凞瘟瘟洞ﲥﲝﲽ",2094110409>(
                     1<"JNT",-2072796534,"쪏쪅쪍쩽쪋쪡쫵쫣쫣쫵","ￔ\u000bￎ\u0014ￓ\u0007ￔ\u000b\u001d\uffd0\u001f\fￎ\u0014\u001d\u0006\u001fￍￍ!\r\u000fŻ","\ua7ebߩ⟥柣蟣⠜쟪蟢ߡ柣蟣䟢\ue81cߢ栜⠜쟪䟢⟡ߢ䠜䠜쟠䟤\ua7e6⟤䟫",706193695>(
                        1<"JNT",-2072796534,"쪏쪅쪍쩽쪋쪡쫵쫯쫥쫳","ￔ\u000bￎ\u0014ￓ\u0007ￔ\u000b\u001d\uffd0\u001f\fￎ\u0014\u001d\u0006\u001fￍￍ!\r\u000f\u0012","\ua7ebߩ⟥柣蟣⠜쟪蟢ߡ柣蟣䟢\ue81cߢ栜⠜쟪䟢⟡ߢ䠜䠜쟠䟤ߤ蟥䟫",706193692>(
                           1<"JNT",-2072796534,"쩽쩹","\u001d\u0005ￍ","\ua7ebߩ⟥柣蟣⠜쟪蟢ߡ柣蟣䟢\ue81cߢ栜⠜쟪䟢⟡ߢ䠜䠜쟠䟤ߤ\ua7e6䟫",706193689>(this)
                        )
                     ),
                     true
                  );
                  break;
               case 1697702150:
               default:
                  switch (0<"JNT",57279171,"硙遙⁙䡙灙࡙恙","Ῐ⏘ꏘ","鬒祉",2094110412>(
                        (Class_353)0<"JNT",57279171,"⡙롙","Ῐ⏘꿘⟗ϗퟗϗ㯘\u2fd7ϗ㟗ᯗ㯘鏘㟗폗㏗\uebd8","諾徭",2094110411>(
                           1<"JNT",-2072796534,"쪉쩽","\u001d\u0005ￍ","\ua7ebߩ⟥⠜쟢䟫",706193669>(this)
                        )
                     )
                     + 868036712
                     + 64579070
                     + 1067852203
                     + 822667210
                     + 1318897727
                     - 168685676) {
                     case -321620050:
                        var2 = 82156278 + (82156278 ^ 82156278) ^ -868842737;
                        continue;
                     case -321620049:
                        var2 = 1025509417 - 1025509417 ^ -22795089;
                        continue;
                     case -321620048:
                        var2 = (1145351488 | 1126355607) & 1539240599;
                        continue;
                     case -321620047:
                        var2 = 2020440568;
                        continue;
                  }
            }

            var2 = (-146525404 & -146525404 | -1987524969) & -574699561;
         }
      }
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1413(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = (var10 ^ 1308593791) + 385009936 - 1978501426 + 1678843186 - 577596712 + 1335121273 ^ 1533562041 ^ 1191912321 ^ 1517855036;
      MethodHandle var10000 = field_2264[(var10 ^ 1308593791) + 385009936 - 1978501426 + 1678843186 - 577596712 + 1335121273
         ^ 1533562041
         ^ 1191912321
         ^ 1517855036
         ^ 628133951];
      if (field_2264[var10001 ^ 628133951] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = (-955285391 << -709901184 | 0) & 408954754; var23 < var13.length(); var23 += -31774409 >> 262182153 ^ -62059) {
            int var42 = ((var13.charAt(var23) ^ ']' ^ 235) + 231 ^ 91) - 54;
            char var45 = (char)(
               ((((((var42 & 65504) >> 5 | var42 << 11) & 61440) >> 12 | ((var42 & 65504) >> 5 | var42 << 11) << 4) ^ 4) - 174 & 64512) >> 10
                  | (((((var42 & 65504) >> 5 | var42 << 11) & 61440) >> 12 | ((var42 & 65504) >> 5 | var42 << 11) << 4) ^ 4) - 174 << 6
            );
            var13.setCharAt(
               var23,
               (char)(
                  ((((((var42 & 65504) >> 5 | var42 << 11) & 61440) >> 12 | ((var42 & 65504) >> 5 | var42 << 11) << 4) ^ 4) - 174 & 64512) >> 10
                     | (((((var42 & 65504) >> 5 | var42 << 11) & 61440) >> 12 | ((var42 & 65504) >> 5 | var42 << 11) << 4) ^ 4) - 174 << 6
               )
            );
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = (-1159979132 * 1370326913 | 0) & 843121195; var29 < var16.length(); var29 += -448192947 & 537223535 ^ 536936524) {
            int var50 = var16.charAt(var29);
            int var87 = (var50 & 65504) >> 5;
            int var51 = (var50 & 65504) >> 5 | var50 << 11;
            int var88 = (((var50 & 65504) >> 5 | var50 << 11) & 65520) >> 4;
            var50 = ((var87 | var50 << 11) & 65520) >> 4 | ((var50 & 65504) >> 5 | var50 << 11) << 12;
            var87 = ((var88 | var51 << 12) & 65504) >> 5;
            int var53 = (((((var88 | var51 << 12) & 65504) >> 5 | var50 << 11) ^ 2) + 28 ^ 55) + 45 + 155;
            int var90 = ((((((var88 | var51 << 12) & 65504) >> 5 | var50 << 11) ^ 2) + 28 ^ 55) + 45 + 155 & 61440) >> 12;
            char var54 = (char)(
               (
                     ((((var87 | var50 << 11) ^ 2) + 28 ^ 55) + 45 + 155 & 61440) >> 12
                        | (((((var88 | var51 << 12) & 65504) >> 5 | var50 << 11) ^ 2) + 28 ^ 55) + 45 + 155 << 4
                  )
                  - 240
            );
            var16.setCharAt(var29, (char)((var90 | var53 << 4) - 240));
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_39.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = (-274058045 - 1487527770 | 0) & 681446016; var35 < var19.length(); var35 += -717279885 & (1950793917 ^ -49568490) ^ -2129844958) {
            char var59 = var19.charAt(var35);
            char var64 = (char)(
               (
                     (
                              (
                                       (
                                             (
                                                      (
                                                            (
                                                                     (
                                                                              (((var59 & '耀') >> 15 | var59 << 1) & 65534) >> 1
                                                                                 | ((var59 & '耀') >> 15 | var59 << 1) << 15
                                                                           )
                                                                           - 54
                                                                        & 65504
                                                                  )
                                                                  >> 5
                                                               | ((((var59 & '耀') >> 15 | var59 << 1) & 65534) >> 1 | ((var59 & '耀') >> 15 | var59 << 1) << 15)
                                                                     - 54
                                                                  << 11
                                                         )
                                                         & 65528
                                                   )
                                                   >> 3
                                                | (
                                                      (
                                                               ((((var59 & '耀') >> 15 | var59 << 1) & 65534) >> 1 | ((var59 & '耀') >> 15 | var59 << 1) << 15)
                                                                     - 54
                                                                  & 65504
                                                            )
                                                            >> 5
                                                         | ((((var59 & '耀') >> 15 | var59 << 1) & 65534) >> 1 | ((var59 & '耀') >> 15 | var59 << 1) << 15) - 54
                                                            << 11
                                                   )
                                                   << 13
                                          )
                                          & 63488
                                    )
                                    >> 11
                                 | (
                                       (
                                                (
                                                      (
                                                               ((((var59 & '耀') >> 15 | var59 << 1) & 65534) >> 1 | ((var59 & '耀') >> 15 | var59 << 1) << 15)
                                                                     - 54
                                                                  & 65504
                                                            )
                                                            >> 5
                                                         | ((((var59 & '耀') >> 15 | var59 << 1) & 65534) >> 1 | ((var59 & '耀') >> 15 | var59 << 1) << 15) - 54
                                                            << 11
                                                   )
                                                   & 65528
                                             )
                                             >> 3
                                          | (
                                                (((((var59 & '耀') >> 15 | var59 << 1) & 65534) >> 1 | ((var59 & '耀') >> 15 | var59 << 1) << 15) - 54 & 65504)
                                                      >> 5
                                                   | ((((var59 & '耀') >> 15 | var59 << 1) & 65534) >> 1 | ((var59 & '耀') >> 15 | var59 << 1) << 15) - 54 << 11
                                             )
                                             << 13
                                    )
                                    << 5
                           )
                           + 209
                        ^ 128
                        ^ 193
                  )
                  + 20
            );
            var19.setCharAt(
               var35,
               (char)(
                  (
                        (
                                 (
                                          (
                                                (
                                                         (
                                                               (
                                                                        (
                                                                                 (((var59 & '耀') >> 15 | var59 << 1) & 65534) >> 1
                                                                                    | ((var59 & '耀') >> 15 | var59 << 1) << 15
                                                                              )
                                                                              - 54
                                                                           & 65504
                                                                     )
                                                                     >> 5
                                                                  | (
                                                                           (((var59 & '耀') >> 15 | var59 << 1) & 65534) >> 1
                                                                              | ((var59 & '耀') >> 15 | var59 << 1) << 15
                                                                        )
                                                                        - 54
                                                                     << 11
                                                            )
                                                            & 65528
                                                      )
                                                      >> 3
                                                   | (
                                                         (
                                                                  ((((var59 & '耀') >> 15 | var59 << 1) & 65534) >> 1 | ((var59 & '耀') >> 15 | var59 << 1) << 15)
                                                                        - 54
                                                                     & 65504
                                                               )
                                                               >> 5
                                                            | ((((var59 & '耀') >> 15 | var59 << 1) & 65534) >> 1 | ((var59 & '耀') >> 15 | var59 << 1) << 15)
                                                                  - 54
                                                               << 11
                                                      )
                                                      << 13
                                             )
                                             & 63488
                                       )
                                       >> 11
                                    | (
                                          (
                                                   (
                                                         (
                                                                  ((((var59 & '耀') >> 15 | var59 << 1) & 65534) >> 1 | ((var59 & '耀') >> 15 | var59 << 1) << 15)
                                                                        - 54
                                                                     & 65504
                                                               )
                                                               >> 5
                                                            | ((((var59 & '耀') >> 15 | var59 << 1) & 65534) >> 1 | ((var59 & '耀') >> 15 | var59 << 1) << 15)
                                                                  - 54
                                                               << 11
                                                      )
                                                      & 65528
                                                )
                                                >> 3
                                             | (
                                                   (((((var59 & '耀') >> 15 | var59 << 1) & 65534) >> 1 | ((var59 & '耀') >> 15 | var59 << 1) << 15) - 54 & 65504)
                                                         >> 5
                                                      | ((((var59 & '耀') >> 15 | var59 << 1) & 65534) >> 1 | ((var59 & '耀') >> 15 | var59 << 1) << 15) - 54
                                                         << 11
                                                )
                                                << 13
                                       )
                                       << 5
                              )
                              + 209
                           ^ 128
                           ^ 193
                     )
                     + 20
               )
            );
         }

         Class var7 = Class.forName(var19.toString(), false, Class_39.class.getClassLoader());
         switch ((((var4 ^ 1711311806) + 543682098 ^ 1676961542) + 1061338310 - 1423585021 + 1513119443 ^ 543121445) + 1555696496 - 1157909815 ^ 1855100359) {
            case 262858005:
            case 1275448926:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 453466977:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            case 593335261:
               var10000 = var0.findSpecial(var7, var5, var6, Class_39.class);
               break;
            case 2062633541:
               var10000 = var0.findConstructor(var7, var6);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_2264[(var10 ^ 1308593791) + 385009936 - 1978501426 + 1678843186 - 577596712 + 1335121273 ^ 1533562041 ^ 1191912321 ^ 1517855036 ^ 628133951] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1414(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 ^ 1008451658) - 895812986 + 986664227 + 173736440 ^ 1751737658) - 195354904 - 1244336222 + 2123786462 ^ 1136597991;
      MethodHandle var10000 = field_2264[((var10 ^ 1008451658) - 895812986 + 986664227 + 173736440 ^ 1751737658) - 195354904 - 1244336222 + 2123786462
         ^ 1136597991
         ^ 901797112];
      if (field_2264[var10001 ^ 901797112] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = -1325398024 & -993556134 & -1325398024 ^ -2147483304; var24 < var14.length(); var24 += -387353597 & -760501631 ^ -1062658048) {
            int var43 = var14.charAt(var24) - '\n';
            char var48 = (char)(
               (
                        (
                                 (
                                          (
                                                   (
                                                         (
                                                                  (
                                                                        (((var43 & 65528) >> 3 | var43 << 13) + 177 & 65528) >> 3
                                                                           | ((var43 & 65528) >> 3 | var43 << 13) + 177 << 13
                                                                     )
                                                                     & 63488
                                                               )
                                                               >> 11
                                                            | (
                                                                  (((var43 & 65528) >> 3 | var43 << 13) + 177 & 65528) >> 3
                                                                     | ((var43 & 65528) >> 3 | var43 << 13) + 177 << 13
                                                               )
                                                               << 5
                                                      )
                                                      & 63488
                                                )
                                                >> 11
                                             | (
                                                   (
                                                            (
                                                                  (((var43 & 65528) >> 3 | var43 << 13) + 177 & 65528) >> 3
                                                                     | ((var43 & 65528) >> 3 | var43 << 13) + 177 << 13
                                                               )
                                                               & 63488
                                                         )
                                                         >> 11
                                                      | (
                                                            (((var43 & 65528) >> 3 | var43 << 13) + 177 & 65528) >> 3
                                                               | ((var43 & 65528) >> 3 | var43 << 13) + 177 << 13
                                                         )
                                                         << 5
                                                )
                                                << 5
                                       )
                                       + 35
                                    & 65504
                              )
                              >> 5
                           | (
                                    (
                                             (
                                                   (
                                                            (
                                                                  (((var43 & 65528) >> 3 | var43 << 13) + 177 & 65528) >> 3
                                                                     | ((var43 & 65528) >> 3 | var43 << 13) + 177 << 13
                                                               )
                                                               & 63488
                                                         )
                                                         >> 11
                                                      | (
                                                            (((var43 & 65528) >> 3 | var43 << 13) + 177 & 65528) >> 3
                                                               | ((var43 & 65528) >> 3 | var43 << 13) + 177 << 13
                                                         )
                                                         << 5
                                                )
                                                & 63488
                                          )
                                          >> 11
                                       | (
                                             (
                                                      (
                                                            (((var43 & 65528) >> 3 | var43 << 13) + 177 & 65528) >> 3
                                                               | ((var43 & 65528) >> 3 | var43 << 13) + 177 << 13
                                                         )
                                                         & 63488
                                                   )
                                                   >> 11
                                                | ((((var43 & 65528) >> 3 | var43 << 13) + 177 & 65528) >> 3 | ((var43 & 65528) >> 3 | var43 << 13) + 177 << 13)
                                                   << 5
                                          )
                                          << 5
                                 )
                                 + 35
                              << 11
                     )
                     + 18
                  ^ 124
            );
            var14.setCharAt(
               var24,
               (char)(
                  (
                           (
                                    (
                                             (
                                                      (
                                                            (
                                                                     (
                                                                           (((var43 & 65528) >> 3 | var43 << 13) + 177 & 65528) >> 3
                                                                              | ((var43 & 65528) >> 3 | var43 << 13) + 177 << 13
                                                                        )
                                                                        & 63488
                                                                  )
                                                                  >> 11
                                                               | (
                                                                     (((var43 & 65528) >> 3 | var43 << 13) + 177 & 65528) >> 3
                                                                        | ((var43 & 65528) >> 3 | var43 << 13) + 177 << 13
                                                                  )
                                                                  << 5
                                                         )
                                                         & 63488
                                                   )
                                                   >> 11
                                                | (
                                                      (
                                                               (
                                                                     (((var43 & 65528) >> 3 | var43 << 13) + 177 & 65528) >> 3
                                                                        | ((var43 & 65528) >> 3 | var43 << 13) + 177 << 13
                                                                  )
                                                                  & 63488
                                                            )
                                                            >> 11
                                                         | (
                                                               (((var43 & 65528) >> 3 | var43 << 13) + 177 & 65528) >> 3
                                                                  | ((var43 & 65528) >> 3 | var43 << 13) + 177 << 13
                                                            )
                                                            << 5
                                                   )
                                                   << 5
                                          )
                                          + 35
                                       & 65504
                                 )
                                 >> 5
                              | (
                                       (
                                                (
                                                      (
                                                               (
                                                                     (((var43 & 65528) >> 3 | var43 << 13) + 177 & 65528) >> 3
                                                                        | ((var43 & 65528) >> 3 | var43 << 13) + 177 << 13
                                                                  )
                                                                  & 63488
                                                            )
                                                            >> 11
                                                         | (
                                                               (((var43 & 65528) >> 3 | var43 << 13) + 177 & 65528) >> 3
                                                                  | ((var43 & 65528) >> 3 | var43 << 13) + 177 << 13
                                                            )
                                                            << 5
                                                   )
                                                   & 63488
                                             )
                                             >> 11
                                          | (
                                                (
                                                         (
                                                               (((var43 & 65528) >> 3 | var43 << 13) + 177 & 65528) >> 3
                                                                  | ((var43 & 65528) >> 3 | var43 << 13) + 177 << 13
                                                            )
                                                            & 63488
                                                      )
                                                      >> 11
                                                   | (
                                                         (((var43 & 65528) >> 3 | var43 << 13) + 177 & 65528) >> 3
                                                            | ((var43 & 65528) >> 3 | var43 << 13) + 177 << 13
                                                      )
                                                      << 5
                                             )
                                             << 5
                                    )
                                    + 35
                                 << 11
                        )
                        + 18
                     ^ 124
               )
            );
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = (-1540817989 ^ 206765045 | 0) & 117515696; var30 < var17.length(); var30 += -920909907 ^ -642742783 ^ 279740845) {
            int var53 = (var17.charAt(var30) + ';' ^ 90 ^ 236) - 171 + 113 + 91 - 185 ^ 96;
            char var54 = (char)(((var53 & 0) >> 16 | var53 << 0) + 45);
            var17.setCharAt(var30, (char)(((var53 & 0) >> 16 | var53 << 0) + 45));
         }

         Class var6 = Class.forName(var17.toString(), false, Class_39.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = -375425529 - -375425529 ^ 0; var36 < var20.length(); var36 += (-1386336089 | -2058343962) ^ -1386333722) {
            char var59 = var20.charAt(var36);
            char var62 = (char)(
               (
                        (
                                 (
                                       (
                                                (
                                                      ((((var59 & '\ue000') >> 13 | var59 << 3) ^ 227) + 215 & 61440) >> 12
                                                         | (((var59 & '\ue000') >> 13 | var59 << 3) ^ 227) + 215 << 4
                                                   )
                                                   ^ 92
                                             )
                                             - 185
                                          ^ 79
                                    )
                                    & 65520
                              )
                              >> 4
                           | (
                                 (
                                          (
                                                ((((var59 & '\ue000') >> 13 | var59 << 3) ^ 227) + 215 & 61440) >> 12
                                                   | (((var59 & '\ue000') >> 13 | var59 << 3) ^ 227) + 215 << 4
                                             )
                                             ^ 92
                                       )
                                       - 185
                                    ^ 79
                              )
                              << 12
                     )
                     + 39
                  ^ 143
            );
            var20.setCharAt(
               var36,
               (char)(
                  (
                           (
                                    (
                                          (
                                                   (
                                                         ((((var59 & '\ue000') >> 13 | var59 << 3) ^ 227) + 215 & 61440) >> 12
                                                            | (((var59 & '\ue000') >> 13 | var59 << 3) ^ 227) + 215 << 4
                                                      )
                                                      ^ 92
                                                )
                                                - 185
                                             ^ 79
                                       )
                                       & 65520
                                 )
                                 >> 4
                              | (
                                    (
                                             (
                                                   ((((var59 & '\ue000') >> 13 | var59 << 3) ^ 227) + 215 & 61440) >> 12
                                                      | (((var59 & '\ue000') >> 13 | var59 << 3) ^ 227) + 215 << 4
                                                )
                                                ^ 92
                                          )
                                          - 185
                                       ^ 79
                                 )
                                 << 12
                        )
                        + 39
                     ^ 143
               )
            );
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_39.class.getClassLoader()).returnType();
         switch (var4 + 1175635654 + 328407124 - 93385478 + 1900046274 + 537286011 + 950717469 + 830512400 - 1915650951 - 989279660 ^ 173372634) {
            case 109073443:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            case 662924040:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            case 746688271:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            case 1372315358:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_2264[((var10 ^ 1008451658) - 895812986 + 986664227 + 173736440 ^ 1751737658) - 195354904 - 1244336222 + 2123786462 ^ 1136597991 ^ 901797112] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
