import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;
import java.util.Iterator;
import net.minecraft.class_1657;
import net.minecraft.class_243;
import net.minecraft.class_3966;

public class Class_346 extends Class_342 {
   // $VF: renamed from: qs Class_105
   public Class_105 field_1735;
   // $VF: renamed from: va Class_49
   public Class_49 field_1736;
   // $VF: renamed from: me Class_105
   public Class_105 field_1737;
   // $VF: renamed from: hi Class_210
   public Class_210 field_1738;
   // $VF: renamed from: kod Class_105
   public Class_105 field_1739;
   // $VF: renamed from: nij Class_321
   public Class_321 field_1740;
   // $VF: renamed from: zqd Class_105
   public Class_105 field_1741;
   // $VF: renamed from: hnd Class_105
   public Class_105 field_1742;
   // $VF: renamed from: qbb Class_49
   public Class_49 field_1743;
   // $VF: renamed from: gov Class_49
   public Class_49 field_1744;
   // $VF: renamed from: ote Class_419
   public Class_419 field_1745;
   // $VF: renamed from: orz Class_419
   public Class_419 field_1746;
   // $VF: renamed from: mlr Class_105
   public Class_105 field_1747;
   // $VF: renamed from: fwg Class_105
   public Class_105 field_1748;
   // $VF: renamed from: chm float
   public float field_1749;
   // $VF: renamed from: om float
   public float field_1750;
   // $VF: renamed from: lkp java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_1751 = new MethodHandle[255];

   public Class_346() {
      int var1 = 1200327901;
      int var10001 = -1909234326 << (1403794191 | 1403794191) ^ -1296760832;

      StringBuilder var10002;
      for (var10002 = (StringBuilder)0<"JNT",1815454001,"꺙됹듙됹떙껙","ቋᏛፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿ\u1257ጃ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035952>("罧罻罽罗罧羀羀罻羀ﾁ");
         var10001 < (-712664412 >> 552498852 ^ -44541536);
         var10001 += -838082597 >> 1415105403 ^ -8
      ) {
         int var75 = 0<"JNT",-1828496835,"덹됙댹땙꼹떙","ቋᏗ\u1257Ꮟ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035887>(var10002, var10001) + 208 - 48;
         char var76 = (char)(((var75 & 32768) >> 15 | var75 << 1) + 106 - 56);
         0<"JNT",-1828496835,"땹뎹떙꽹됙댹땙꼹떙","ቋᏗᏏ\u1257ጃ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035886>(
            var10002, var10001, (char)(((var75 & 32768) >> 15 | var75 << 1) + 106 - 56)
         );
      }

      String var7 = 0<"JNT",-1828496835,"떙듹녹떙땙됹듙돹","ቋ\u1257Ꮫፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035905>(var10002);
      int var41 = (1699510578 & -1419518825 | 0) & -1064107420;

      StringBuilder var78;
      for (var78 = (StringBuilder)0<"JNT",1815454001,"꺙됹듙됹떙껙","ቋᏛፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿ\u1257ጃ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035904>(
            "ǡ\u0381\u0379͑́ˡ\u0379̡˱ˡ̹̹ΡÙˡ̡́ͱÙˡ\u0379Ù͙̹ˡΡ́ͩͱÙ̉͑ͩÙΡ͑\u0381"
         );
         var41 < ((-1541115214 - 1550643384 | 37) & 406863909);
         var41 += (772253632 >>> 772253632 | 1) & 20975623
      ) {
         int var155 = 0<"JNT",-1828496835,"덹됙댹땙꼹떙","ቋᏗ\u1257Ꮟ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035948>(var78, var41);
         int var10006 = (var155 & 49152) >> 14;
         int var156 = ((var155 & 49152) >> 14 | var155 << 2) + 156;
         int var254 = (((var155 & 49152) >> 14 | var155 << 2) + 156 & 61440) >> 12;
         var155 = ((var10006 | var155 << 2) + 156 & 61440) >> 12 | ((var155 & 49152) >> 14 | var155 << 2) + 156 << 4;
         var10006 = ((var254 | var156 << 4) & 65408) >> 7;
         int var158 = ((var254 | var156 << 4) & 65408) >> 7 | var155 << 9;
         int var256 = ((((var254 | var156 << 4) & 65408) >> 7 | var155 << 9) & 65532) >> 2;
         char var159 = (char)(((var10006 | var155 << 9) & 65532) >> 2 | (((var254 | var156 << 4) & 65408) >> 7 | var155 << 9) << 14);
         0<"JNT",-1828496835,"땹뎹떙꽹됙댹땙꼹떙","ቋᏗᏏ\u1257ጃ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035943>(var78, var41, (char)(var256 | var158 << 14));
      }

      super(
         var7,
         0<"JNT",-1828496835,"떙듹녹떙땙됹듙돹","ቋ\u1257Ꮫፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035978>(var78),
         -1,
         1<"JNT",-1046048650,"\ud907इ","\u0af8\u0ff0","\ueb62\ueb63\uf105\uf112\ueb3c\ueb55",-1033067977>()
      );
      Class_346 var10000 = this;
      var10001 = -827204153 & -1311950595 ^ -2139023163;

      for (var10002 = (StringBuilder)0<"JNT",1815454001,"꺙됹듙됹떙껙","ቋᏛፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿ\u1257ጃ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035980>(
            "専\ud802퀂Ѓꀁ氂퀂\udc02\uf002"
         );
         var10001 < (-722002315 << 506876418 ^ 1406958045);
         var10001 += (1468341910 + -754331730 | 1) & -1067384677
      ) {
         char var81 = 0<"JNT",-1828496835,"덹됙댹땙꼹떙","ቋᏗ\u1257Ꮟ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035868>(var10002, var10001);
         int var218 = (var81 & '\ue000') >> 13;
         int var82 = ((var81 & '\ue000') >> 13 | var81 << 3) + 75 - 13 - 71;
         int var219 = (((var81 & '\ue000') >> 13 | var81 << 3) + 75 - 13 - 71 & 57344) >> 13;
         char var83 = (char)(((var218 | var81 << 3) + 75 - 13 - 71 & 57344) >> 13 | ((var81 & '\ue000') >> 13 | var81 << 3) + 75 - 13 - 71 << 3);
         0<"JNT",-1828496835,"땹뎹떙꽹됙댹땙꼹떙","ቋᏗᏏ\u1257ጃ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035863>(var10002, var10001, (char)(var219 | var82 << 3));
      }

      Class_105 var10 = (Class_105)0<"JNT",1815454001,"꺙됹듙됹떙껙","ቋᏛፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿጓ\u1257ጃ","Ȏ舧",2114035866>(
         0<"JNT",-1828496835,"떙듹녹떙땙됹듙돹","ቋ\u1257Ꮫፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035867>(var10002), false
      );
      int var45 = (-1313599372 - -1744149181 | 0) & 67387392;
      var78 = (StringBuilder)0<"JNT",1815454001,"꺙됹듙됹떙껙","ቋᏛፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿ\u1257ጃ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035869>(
         ":胋胈Á\u0012ÎÊ胍È\u0012Î耶7胋\u0012Ì胊74É耷É4\u0012耶Ê背耵5胍\u0012Ì胈Ê背\u0012ÉÌ\u0012Ì7胈74背7耴"
      );

      label197:
      while (true) {
         var1 = 1022205342 - (-1771079745 + -1771079745) ^ -1598923297;

         while (true) {
            label193:
            while (true) {
               label191:
               while (true) {
                  label189:
                  while (true) {
                     label187: {
                        switch ((var1 ^ 924836457) + 2093174633 + 19065659 + 326276277 - 1422841681 - 937414680) {
                           case -1958892625:
                              var10002 = var78;
                              if (var45 < (706735767 ^ (898229515 | 706735767 - 898229515) ^ -545258677)) {
                                 char var210 = 0<"JNT",-1828496835,"덹됙댹땙꼹떙","ቋᏗ\u1257Ꮟ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035900>(var78, var45);
                                 int var266 = (var210 & '￼') >> 2;
                                 int var211 = ((var210 & '￼') >> 2 | var210 << 14) - 102 - 205 ^ 44;
                                 int var267 = ((((var210 & '￼') >> 2 | var210 << 14) - 102 - 205 ^ 44) & 65535) >> 0;
                                 var210 = (char)(
                                    (((var266 | var210 << 14) - 102 - 205 ^ 44) & 65535) >> 0 | (((var210 & '￼') >> 2 | var210 << 14) - 102 - 205 ^ 44) << 16
                                 );
                                 0<"JNT",-1828496835,"땹뎹떙꽹됙댹땙꼹떙","ቋᏗᏏ\u1257ጃ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035895>(var78, var45, (char)(var267 | var211 << 16));
                                 var45 += 278596401 - 278596401 ^ 1;
                                 break label193;
                              }

                              var1 = (359011416 | 1899271646) ^ -1209727287;
                              break;
                           case -1941096058:
                              var10002 = var78;
                              if (var45 < ((-364667747 | -1692667867 * 1912789622 | 45) & 335560751)) {
                                 int var177 = (0<"JNT",-1828496835,"덹됙댹땙꼹떙","ቋᏗ\u1257Ꮟ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035984>(var78, var45) ^ 'I') - 105;
                                 int var262 = (var177 & 32768) >> 15;
                                 int var178 = ((var177 & 32768) >> 15 | var177 << 1) + 59;
                                 int var263 = (((var177 & 32768) >> 15 | var177 << 1) + 59 & 0) >> 16;
                                 char var179 = (char)(((var262 | var177 << 1) + 59 & 0) >> 16 | ((var177 & 32768) >> 15 | var177 << 1) + 59 << 0);
                                 0<"JNT",-1828496835,"땹뎹떙꽹됙댹땙꼹떙","ቋᏗᏏ\u1257ጃ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035979>(var78, var45, (char)(var263 | var178 << 0));
                                 var45 += (583639335 * 583639335 | 0) & 156147713;
                                 continue label197;
                              }

                              var1 = (-1176362233 >>> -1176362233 | 1187221616) & -422856069;
                              break;
                           case -1194035739:
                              var10002 = var78;
                              if (var45 < ((-1145767253 >>> (-506854068 | -506854068) | 42) & 396623918)) {
                                 int var172 = 0<"JNT",-1828496835,"덹됙댹땙꼹떙","ቋᏗ\u1257Ꮟ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035950>(var78, var45) ^ 221;
                                 int var260 = (var172 & 63488) >> 11;
                                 int var173 = (((var172 & 63488) >> 11 | var172 << 5) ^ 24) - 192;
                                 int var261 = ((((var172 & 63488) >> 11 | var172 << 5) ^ 24) - 192 & 63488) >> 11;
                                 char var174 = (char)(
                                    (((var260 | var172 << 5) ^ 24) - 192 & 63488) >> 11 | (((var172 & 63488) >> 11 | var172 << 5) ^ 24) - 192 << 5
                                 );
                                 0<"JNT",-1828496835,"땹뎹떙꽹됙댹땙꼹떙","ቋᏗᏏ\u1257ጃ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035953>(var78, var45, (char)(var261 | var173 << 5));
                                 var45 += -1707487624 >>> (363988581 | 1072112618) ^ 78962;
                                 break label189;
                              }

                              var1 = (-1079514239 + 1493300054 | -836865688) & -283216536;
                              break;
                           case -802218798:
                           default:
                              var10002 = var78;
                              if (var45 < ((1196168351 * 1196168351 | 36) & 18924590)) {
                                 0<"JNT",-1828496835,"땹뎹떙꽹됙댹땙꼹떙","ቋᏗᏏ\u1257ጃ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035917>(
                                    var78,
                                    var45,
                                    (char)(
                                       0<"JNT",-1828496835,"덹됙댹땙꼹떙","ቋᏗ\u1257Ꮟ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035914>(var78, var45) - 135 - 79 + 35 ^ 144 ^ 56
                                    )
                                 );
                                 var45 += (-1342344926 * (-321972603 ^ 617023137) | 1) & 1343805205;
                                 break label187;
                              }

                              var1 = 608185572 << (-877873342 << -1476537477) ^ -2037525752;
                              break;
                           case 58447660:
                              var10002 = var78;
                              if (var45 < (-1507469824 - 1092664179 ^ 1694833368)) {
                                 int var164 = 0<"JNT",-1828496835,"덹됙댹땙꼹떙","ቋᏗ\u1257Ꮟ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035862>(var78, var45) - 162;
                                 char var167 = (char)(
                                    (((((var164 & 61440) >> 12 | var164 << 4) + 187 & 63488) >> 11 | ((var164 & 61440) >> 12 | var164 << 4) + 187 << 5) & 65532)
                                          >> 2
                                       | ((((var164 & 61440) >> 12 | var164 << 4) + 187 & 63488) >> 11 | ((var164 & 61440) >> 12 | var164 << 4) + 187 << 5)
                                          << 14
                                 );
                                 0<"JNT",-1828496835,"땹뎹떙꽹됙댹땙꼹떙","ቋᏗᏏ\u1257ጃ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035865>(
                                    var78,
                                    var45,
                                    (char)(
                                       (
                                                (
                                                      (((var164 & 61440) >> 12 | var164 << 4) + 187 & 63488) >> 11
                                                         | ((var164 & 61440) >> 12 | var164 << 4) + 187 << 5
                                                   )
                                                   & 65532
                                             )
                                             >> 2
                                          | ((((var164 & 61440) >> 12 | var164 << 4) + 187 & 63488) >> 11 | ((var164 & 61440) >> 12 | var164 << 4) + 187 << 5)
                                             << 14
                                    )
                                 );
                                 var45 += -517199505 << 659849868 ^ -1030295551;
                                 break label191;
                              }

                              var1 = 331319434 >>> 331319434 ^ 15015317;
                        }

                        switch (var1 + 578445828 + 622776594 + 1326196436 - 1391704892 + 1393574965 ^ 1481075068) {
                           case -2050876887:
                              var10000.field_1735 = 0<"JNT",-1828496835,"댹떹뎙","ቋᏛፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿ\u1257Ꮫ፟ᒳᏯ","Ȏ舧",2114035893>(
                                 var10, 0<"JNT",-1828496835,"떙듹녹떙땙됹듙돹","ቋ\u1257Ꮫፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035890>(var10002)
                              );
                              var10001 = (499094970 * 1954971634 | 0) & 167850025;

                              for (var10002 = (StringBuilder)0<"JNT",1815454001,"꺙됹듙됹떙껙","ቋᏛፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿ\u1257ጃ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035892>(
                                    "ﴛﶋ\ufadb\ufb0b"
                                 );
                                 var10001 < (-2054675544 << -2054675544 ^ -2010929148);
                                 var10001 += -2114086442 * -1958869145 ^ -1341014245
                              ) {
                                 char var143 = 0<"JNT",-1828496835,"덹됙댹땙꼹떙","ቋᏗ\u1257Ꮟ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035930>(var10002, var10001);
                                 int var246 = (var143 & '￼') >> 2;
                                 int var144 = ((var143 & '￼') >> 2 | var143 << 14) - 143;
                                 int var247 = (((var143 & '￼') >> 2 | var143 << 14) - 143 & 65532) >> 2;
                                 char var145 = (char)(
                                    ((((var246 | var143 << 14) - 143 & 65532) >> 2 | ((var143 & '￼') >> 2 | var143 << 14) - 143 << 14) ^ 105) + 143
                                 );
                                 0<"JNT",-1828496835,"땹뎹떙꽹됙댹땙꼹떙","ቋᏗᏏ\u1257ጃ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035933>(
                                    var10002, var10001, (char)(((var247 | var144 << 14) ^ 105) + 143)
                                 );
                              }

                              Class_49 var37 = (Class_49)0<"JNT",1815454001,"꺙됹듙됹떙껙","ቋᏛፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿᏻᏻᏻᏻ\u1257ጃ","舎Ȑ",2114035911>(
                                 0<"JNT",-1828496835,"떙듹녹떙땙됹듙돹","ቋ\u1257Ꮫፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035916>(var10002),
                                 1.0,
                                 9.0,
                                 1.0,
                                 1.0
                              );
                              int var71 = (-1820545286 | -972472811 | 0) & 256;

                              for (var78 = (StringBuilder)0<"JNT",1815454001,"꺙됹듙됹떙껙","ቋᏛፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿ\u1257ጃ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035910>(
                                    "彠㽣\udf66齤罡齦彙뽦\udf63㽣\udf66彙彜罛｛罞罜"
                                 );
                                 var71 < (-389441408 >>> 1586582375 ^ 30511904);
                                 var71 += 963770395 << -1208710222 ^ -529793023
                              ) {
                                 int var204 = 0<"JNT",-1828496835,"덹됙댹땙꼹떙","ቋᏗ\u1257Ꮟ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035942>(var78, var71) + 'w';
                                 int var264 = (var204 & 32768) >> 15;
                                 int var205 = ((var204 & 32768) >> 15 | var204 << 1) ^ 67;
                                 int var265 = ((((var204 & 32768) >> 15 | var204 << 1) ^ 67) & 49152) >> 14;
                                 char var206 = (char)(
                                    ((((var264 | var204 << 1) ^ 67) & 49152) >> 14 | (((var204 & 32768) >> 15 | var204 << 1) ^ 67) << 2) + 146
                                 );
                                 0<"JNT",-1828496835,"땹뎹떙꽹됙댹땙꼹떙","ቋᏗᏏ\u1257ጃ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035945>(
                                    var78, var71, (char)((var265 | var205 << 2) + 146)
                                 );
                              }

                              this.field_1736 = 0<"JNT",-1828496835,"듹됹됙","ቋᏛፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿ\u1257Ꮫ፻ፏᏯ","舎Ȑ",2114035925>(
                                 var37, 0<"JNT",-1828496835,"떙듹녹떙땙됹듙돹","ቋ\u1257Ꮫፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035922>(var78)
                              );
                              var10000 = this;
                              var10001 = (-54421098 ^ -54421098 | 0) & -1446180108;

                              for (var10002 = (StringBuilder)0<"JNT",1815454001,"꺙됹듙됹떙껙","ቋᏛፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿ\u1257ጃ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035924>(
                                    "♉㗉㓉㭉້⍉㣉ㅉ㕉"
                                 );
                                 var10001 < (148356310 + 1219360672 ^ 1367716991);
                                 var10001 += -560888904 - -1935492205 ^ 1374603300
                              ) {
                                 int var150 = (0<"JNT",-1828496835,"덹됙댹땙꼹떙","ቋᏗ\u1257Ꮟ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035903>(var10002, var10001) ^ 'x')
                                    + 251
                                    + 84;
                                 int var250 = (var150 & 61440) >> 12;
                                 int var151 = (var150 & 61440) >> 12 | var150 << 4;
                                 int var251 = (((var150 & 61440) >> 12 | var150 << 4) & 63488) >> 11;
                                 char var152 = (char)(((var250 | var150 << 4) & 63488) >> 11 | ((var150 & 61440) >> 12 | var150 << 4) << 5);
                                 0<"JNT",-1828496835,"땹뎹떙꽹됙댹땙꼹떙","ቋᏗᏏ\u1257ጃ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035902>(
                                    var10002, var10001, (char)(var251 | var151 << 5)
                                 );
                              }

                              var10 = (Class_105)0<"JNT",1815454001,"꺙됹듙됹떙껙","ቋᏛፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿጓ\u1257ጃ","Ȏ舧",2114035875>(
                                 0<"JNT",-1828496835,"떙듹녹떙땙됹듙돹","ቋ\u1257Ꮫፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035880>(var10002), false
                              );
                              var45 = 1928527572 ^ 1928527572 ^ 0;
                              var78 = (StringBuilder)0<"JNT",1815454001,"꺙됹듙됹떙껙","ቋᏛፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿ\u1257ጃ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035874>(
                                 "ƚŹŷƄĻƒźƍŶĻƒųƀŹĻųźŷſŴŹƂĻƎƋƀžŴƁŴžĻŴƏƀŸ"
                              );
                              break;
                           case -807093210:
                              var10000.field_1742 = 0<"JNT",-1828496835,"댹떹뎙","ቋᏛፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿ\u1257Ꮫ፟ᒳᏯ","Ȏ舧",2114035909>(
                                 var10, 0<"JNT",-1828496835,"떙듹녹떙땙됹듙돹","ቋ\u1257Ꮫፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035906>(var10002)
                              );
                              var10001 = 2067735409 ^ 1277343445 ^ 924685732;

                              for (var10002 = (StringBuilder)0<"JNT",1815454001,"꺙됹듙됹떙껙","ቋᏛፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿ\u1257ጃ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035908>(
                                    "Ꮼឬᡬ\u19acᲬᰬ"
                                 );
                                 var10001 < ((-2102194359 & -863815150 | 6) & 1495838790);
                                 var10001 += 805292982 - 805292982 ^ 1
                              ) {
                                 int var114 = 0<"JNT",-1828496835,"덹됙댹땙꼹떙","ቋᏗ\u1257Ꮟ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035878>(var10002, var10001) + 177 - 29;
                                 char var117 = (char)(
                                    (((((var114 & 49152) >> 14 | var114 << 2) & 64512) >> 10 | ((var114 & 49152) >> 14 | var114 << 2) << 6) & 49152) >> 14
                                       | ((((var114 & 49152) >> 14 | var114 << 2) & 64512) >> 10 | ((var114 & 49152) >> 14 | var114 << 2) << 6) << 2
                                 );
                                 0<"JNT",-1828496835,"땹뎹떙꽹됙댹땙꼹떙","ቋᏗᏏ\u1257ጃ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035881>(
                                    var10002,
                                    var10001,
                                    (char)(
                                       (((((var114 & 49152) >> 14 | var114 << 2) & 64512) >> 10 | ((var114 & 49152) >> 14 | var114 << 2) << 6) & 49152) >> 14
                                          | ((((var114 & 49152) >> 14 | var114 << 2) & 64512) >> 10 | ((var114 & 49152) >> 14 | var114 << 2) << 6) << 2
                                    )
                                 );
                              }

                              this.field_1743 = (Class_49)0<"JNT",1815454001,"꺙됹듙됹떙껙","ቋᏛፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿᏻᏻᏻᏻ\u1257ጃ","舎Ȑ",2114035986>(
                                 0<"JNT",-1828496835,"떙듹녹떙땙됹듙돹","ቋ\u1257Ꮫፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035987>(var10002),
                                 0.1,
                                 64.0,
                                 32.0,
                                 0.1
                              );
                              var10001 = -2041684335 & 1493172492;

                              for (var10002 = (StringBuilder)0<"JNT",1815454001,"꺙됹듙됹떙껙","ቋᏛፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿ\u1257ጃ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035989>(
                                    "\u09d9ૹ\u0bd9"
                                 );
                                 var10001 < (289951183 & 1622982432 ^ 527619);
                                 var10001 += 1686873845 - (1407399830 + 1407399830) ^ -1127925816
                              ) {
                                 int var120 = 0<"JNT",-1828496835,"덹됙댹땙꼹떙","ቋᏗ\u1257Ꮟ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035877>(var10002, var10001)
                                    - '_'
                                    - 159
                                    - 49
                                    + 22;
                                 char var121 = (char)((var120 & 65504) >> 5 | var120 << 11);
                                 0<"JNT",-1828496835,"땹뎹떙꽹됙댹땙꼹떙","ቋᏗᏏ\u1257ጃ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035876>(
                                    var10002, var10001, (char)((var120 & 65504) >> 5 | var120 << 11)
                                 );
                              }

                              this.field_1744 = (Class_49)0<"JNT",1815454001,"꺙됹듙됹떙껙","ቋᏛፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿᏻᏻᏻᏻ\u1257ጃ","舎Ȑ",2114035920>(
                                 0<"JNT",-1828496835,"떙듹녹떙땙됹듙돹","ቋ\u1257Ꮫፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035921>(var10002),
                                 5.0,
                                 360.0,
                                 180.0,
                                 1.0
                              );
                              var10001 = (-1513043918 - (261292105 >> 261292105) | 0) & 1378091021;

                              for (var10002 = (StringBuilder)0<"JNT",1815454001,"꺙됹듙됹떙껙","ቋᏛፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿ\u1257ጃ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035915>(
                                    "ꢳ₲袲颲䂲Ⴒ²墲\uf8b1邳碲₲₲ᢲ"
                                 );
                                 var10001 < ((-103759791 & 2052848567 >>> -1753681778 | 14) & -913828178);
                                 var10001 += 1054247435 - 769004709 ^ 285242727
                              ) {
                                 int var124 = 0<"JNT",-1828496835,"덹됙댹땙꼹떙","ቋᏗ\u1257Ꮟ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035871>(var10002, var10001) ^ 161;
                                 int var239 = (var124 & 65520) >> 4;
                                 int var125 = ((var124 & 65520) >> 4 | var124 << 12) + 247 - 120;
                                 int var240 = (((var124 & 65520) >> 4 | var124 << 12) + 247 - 120 & 65408) >> 7;
                                 char var126 = (char)(
                                    ((var239 | var124 << 12) + 247 - 120 & 65408) >> 7 | ((var124 & 65520) >> 4 | var124 << 12) + 247 - 120 << 9
                                 );
                                 0<"JNT",-1828496835,"땹뎹떙꽹됙댹땙꼹떙","ቋᏗᏏ\u1257ጃ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035870>(
                                    var10002, var10001, (char)(var240 | var125 << 9)
                                 );
                              }

                              this.field_1745 = (Class_419)0<"JNT",1815454001,"꺙됹듙됹떙껙","ቋᏛፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿᏻᏻᏻᏻᏻ\u1257ጃ","舫ȓ",2114035993>(
                                 0<"JNT",-1828496835,"떙듹녹떙땙됹듙돹","ቋ\u1257Ꮫፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035990>(var10002),
                                 0.0,
                                 10.0,
                                 0.1,
                                 2.0,
                                 4.0
                              );
                              var10001 = 0;

                              for (var10002 = (StringBuilder)0<"JNT",1815454001,"꺙됹듙됹떙껙","ቋᏛፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿ\u1257ጃ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035992>(
                                    "忐\u1fd5翕忔翚\u1fd5ￕ뿕翗뿔忏뿑㿕ￗￗ\udfd7"
                                 );
                                 var10001 < ((2091783328 | 1040985283) ^ 2125348083);
                                 var10001 += (-69763949 + 1945107065 | 1) & -2145877871
                              ) {
                                 int var129 = (0<"JNT",-1828496835,"덹됙댹땙꼹떙","ቋᏗ\u1257Ꮟ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035919>(var10002, var10001) ^ 226) + 202;
                                 int var241 = (var129 & 65472) >> 6;
                                 int var130 = (var129 & 65472) >> 6 | var129 << 10;
                                 int var242 = (((var129 & 65472) >> 6 | var129 << 10) & 65408) >> 7;
                                 char var131 = (char)((((var241 | var129 << 10) & 65408) >> 7 | ((var129 & 65472) >> 6 | var129 << 10) << 9) + 102);
                                 0<"JNT",-1828496835,"땹뎹떙꽹됙댹땙꼹떙","ቋᏗᏏ\u1257ጃ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035918>(
                                    var10002, var10001, (char)((var242 | var130 << 9) + 102)
                                 );
                              }

                              this.field_1746 = (Class_419)0<"JNT",1815454001,"꺙됹듙됹떙껙","ቋᏛፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿᏻᏻᏻᏻᏻ\u1257ጃ","舫ȓ",2114035934>(
                                 0<"JNT",-1828496835,"떙듹녹떙땙됹듙돹","ቋ\u1257Ꮫፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035935>(var10002),
                                 0.0,
                                 10.0,
                                 0.1,
                                 2.0,
                                 4.0
                              );
                              var10001 = (-1280159841 >>> -1076027434 | 0) & -1584308224;

                              for (var10002 = (StringBuilder)0<"JNT",1815454001,"꺙됹듙됹떙껙","ቋᏛፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿ\u1257ጃ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035937>(
                                    "ﾬ\ufffa\u0000￮\u0010\ufffa\ufff8\u0004\uffde\ufff4"
                                 );
                                 var10001 < (285835508 - -443037958 ^ 728873456);
                                 var10001 += 243525159 * -1373551622 ^ -552470761
                              ) {
                                 int var134 = 0<"JNT",-1828496835,"덹됙댹땙꼹떙","ቋᏗ\u1257Ꮟ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035941>(var10002, var10001)
                                    + 210
                                    + 143
                                    - 125;
                                 int var243 = (var134 & 65534) >> 1;
                                 int var135 = (var134 & 65534) >> 1 | var134 << 15;
                                 int var244 = (((var134 & 65534) >> 1 | var134 << 15) & 0) >> 16;
                                 char var136 = (char)(((var243 | var134 << 15) & 0) >> 16 | ((var134 & 65534) >> 1 | var134 << 15) << 0);
                                 0<"JNT",-1828496835,"땹뎹떙꽹됙댹땙꼹떙","ቋᏗᏏ\u1257ጃ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035940>(
                                    var10002, var10001, (char)(var244 | var135 << 0)
                                 );
                              }

                              this.field_1747 = (Class_105)0<"JNT",1815454001,"꺙됹듙됹떙껙","ቋᏛፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿጓ\u1257ጃ","Ȏ舧",2114035912>(
                                 0<"JNT",-1828496835,"떙듹녹떙땙됹듙돹","ቋ\u1257Ꮫፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035913>(var10002), true
                              );
                              var10001 = 1618741396 ^ 2050764107 ^ 440411615;

                              for (var10002 = (StringBuilder)0<"JNT",1815454001,"꺙됹듙됹떙껙","ቋᏛፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿ\u1257ጃ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035907>(
                                    "ǊƽƮƬƹƿƱƤ"
                                 );
                                 var10001 < ((-1599025994 | -1599025994 | 8) & 222495240);
                                 var10001 += (-1405504574 >> (-744969132 & 1581002362) | 0) & 581
                              ) {
                                 int var139 = (0<"JNT",-1828496835,"덹됙댹땙꼹떙","ቋᏗ\u1257Ꮟ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035936>(var10002, var10001) ^ 246)
                                    - 137
                                    - 73
                                    - 20;
                                 char var140 = (char)((var139 & 65535) >> 0 | var139 << 16);
                                 0<"JNT",-1828496835,"땹뎹떙꽹됙댹땙꼹떙","ቋᏗᏏ\u1257ጃ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035931>(
                                    var10002, var10001, (char)((var139 & 65535) >> 0 | var139 << 16)
                                 );
                              }

                              this.field_1748 = (Class_105)0<"JNT",1815454001,"꺙됹듙됹떙껙","ቋᏛፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿጓ\u1257ጃ","Ȏ舧",2114035974>(
                                 0<"JNT",-1828496835,"떙듹녹떙땙됹듙돹","ቋ\u1257Ꮫፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035975>(var10002), true
                              );
                              Class_49 var4 = 1<"JNT",395182897,"複夆","ၘ\u0af8","\ueb62\ueb63\uf105\ueb3e\ueb3d\ueb55",-1033067997>(this);
                              Class_105 var33 = 1<"JNT",395182897,"备㤇","ၘ\u0af8","\ueb62\ueb63\uf105\ueb21\uf0eb\ueb55",-1033067988>(this);
                              0<"JNT",-1232055882,"땙뎹딹떹됹땙뎹냙듹듙냙떹뒙뒙","ቋᏛፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጿ፳ፓፇፏᒻᏯ\u1257Ꮫፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጿ፳ፓፇፏᒻᏯ","舓ȑ舥ȑ艱ȧ舦ȕ舒艱Ȃ舏舓ȏȐ舦Ȩ",2114035971>(
                                 var33
                              );
                              0<"JNT",-1828496835,"듙뙙땹","ቋᏛፓ፷ᒃ፷Ꮏᒇᒻፗ\u135bᎿፃᒇᒣፏᒻፗᒿᒣᎿጏᒇᒫᒫ\u135bፗፇᒳᏯ\u1257ᏛᒷፇፇᏯ","舎Ȑ",2114035970>(var4, var33::ax);
                              Class_210 var5 = 1<"JNT",395182897,"\ue906\ud906","ၘ\u0af8","\ueb62\ueb63\uf105\uf0e6\uf0e8\ueb55",-1033067985>(this);
                              Class_105 var34 = 1<"JNT",395182897,"ᤇ餆","ၘ\u0af8","\ueb62\ueb63\uf105\ueb21\uf0eb\ueb55",-1033067992>(this);
                              0<"JNT",-1232055882,"땙뎹딹떹됹땙뎹냙듹듙냙떹뒙뒙","ቋᏛፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጿ፳ፓፇፏᒻᏯ\u1257Ꮫፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጿ፳ፓፇፏᒻᏯ","舓ȑ舥ȑ艱ȧ舦ȕ舒艱Ȃ舏舓ȏȐ舦Ȩ",2114035967>(
                                 var34
                              );
                              0<"JNT",-1828496835,"듙뙙땹","ቋᏛፓ፷ᒃ፷Ꮏᒇᒻፗ\u135bᎿፃᒇᒣፏᒻፗᒿᒣᎿጏᒇᒫᒫ\u135bፗፇᒳᏯ\u1257ᏛᒷፇፇᏯ","ȓȒ",2114035966>(var5, var34::ax);
                              0<"JNT",-1828496835,"딹떹","ቋ፯ᏛᒷፇፇᏯ\u1257ጃ","ȧȭ",2114035951>(
                                 this,
                                 new Class_271[]{
                                    1<"JNT",395182897,"备㤇","ၘ\u0af8","\ueb62\ueb63\uf105\ueb21\uf0eb\ueb55",-1033067973>(this),
                                    1<"JNT",395182897,"複夆","ၘ\u0af8","\ueb62\ueb63\uf105\ueb3e\ueb3d\ueb55",-1033067996>(this),
                                    1<"JNT",395182897,"ᤇ餆","ၘ\u0af8","\ueb62\ueb63\uf105\ueb21\uf0eb\ueb55",-1033067999>(this),
                                    1<"JNT",395182897,"\ue906\ud906","ၘ\u0af8","\ueb62\ueb63\uf105\uf0e6\uf0e8\ueb55",-1033067998>(this),
                                    1<"JNT",395182897,"뤆句꤆","ၘ\u0af8","\ueb62\ueb63\uf105\ueb21\uf0eb\ueb55",-1033067993>(this),
                                    1<"JNT",395182897,"इ\ud906줆","ၘ\u0af8","\ueb62\ueb63\uf105\uf0ed\uf0e8\ueb55",-1033068000>(this),
                                    1<"JNT",395182897,"줇备꤆","ၘ\u0af8","\ueb62\ueb63\uf105\ueb21\uf0eb\ueb55",-1033068003>(this),
                                    1<"JNT",395182897,"\ue906इ꤆","ၘ\u0af8","\ueb62\ueb63\uf105\ueb21\uf0eb\ueb55",-1033068002>(this),
                                    1<"JNT",395182897,"备䤆䤆","ၘ\u0af8","\ueb62\ueb63\uf105\ueb3e\ueb3d\ueb55",-1033068013>(this),
                                    1<"JNT",395182897,"礆句複","ၘ\u0af8","\ueb62\ueb63\uf105\ueb3e\ueb3d\ueb55",-1033068004>(this),
                                    1<"JNT",395182897,"句꤇餆","ၘ\u0af8","\ueb62\ueb63\uf105\uf113\uf0e6\ueb55",-1033068007>(this),
                                    1<"JNT",395182897,"句䤇줇","ၘ\u0af8","\ueb62\ueb63\uf105\uf113\uf0e6\ueb55",-1033068006>(this),
                                    1<"JNT",395182897,"ᤇ⤇䤇","ၘ\u0af8","\ueb62\ueb63\uf105\ueb21\uf0eb\ueb55",-1033068001>(this),
                                    1<"JNT",395182897,"褆礇礆","ၘ\u0af8","\ueb62\ueb63\uf105\ueb21\uf0eb\ueb55",-1033068008>(this)
                                 }
                              );
                              return;
                           case 17964166:
                              var10000.field_1741 = 0<"JNT",-1828496835,"댹떹뎙","ቋᏛፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿ\u1257Ꮫ፟ᒳᏯ","Ȏ舧",2114035939>(
                                 var10, 0<"JNT",-1828496835,"떙듹녹떙땙됹듙돹","ቋ\u1257Ꮫፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035944>(var10002)
                              );
                              var10000 = this;
                              var10001 = 2092325019 - -1396650162 ^ -805992115;

                              for (var10002 = (StringBuilder)0<"JNT",1815454001,"꺙됹듙됹떙껙","ቋᏛፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿ\u1257ጃ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035938>(
                                    "\u0c11逑ﰑ耑쀐쐑逑쀐ထ쐑蠑\udc11퐑逑쀐怑ﰑ蠑\ue411ꠑ"
                                 );
                                 var10001 < ((-159877174 >>> 1338168861 | 20) & 2141075388);
                                 var10001 += (1494647401 + 1511339479 | 1) & 1086603397
                              ) {
                                 int var108 = 0<"JNT",-1828496835,"덹됙댹땙꼹떙","ቋᏗ\u1257Ꮟ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035882>(var10002, var10001) ^ 4;
                                 char var111 = (char)(
                                    ((((((var108 & 65535) >> 0 | var108 << 16) & 57344) >> 13 | ((var108 & 65535) >> 0 | var108 << 16) << 3) ^ 162) & 57344)
                                          >> 13
                                       | (((((var108 & 65535) >> 0 | var108 << 16) & 57344) >> 13 | ((var108 & 65535) >> 0 | var108 << 16) << 3) ^ 162) << 3
                                 );
                                 0<"JNT",-1828496835,"땹뎹떙꽹됙댹땙꼹떙","ቋᏗᏏ\u1257ጃ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035885>(
                                    var10002,
                                    var10001,
                                    (char)(
                                       ((((((var108 & 65535) >> 0 | var108 << 16) & 57344) >> 13 | ((var108 & 65535) >> 0 | var108 << 16) << 3) ^ 162) & 57344)
                                             >> 13
                                          | (((((var108 & 65535) >> 0 | var108 << 16) & 57344) >> 13 | ((var108 & 65535) >> 0 | var108 << 16) << 3) ^ 162) << 3
                                    )
                                 );
                              }

                              var10 = (Class_105)0<"JNT",1815454001,"꺙됹듙됹떙껙","ቋᏛፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿጓ\u1257ጃ","Ȏ舧",2114035928>(
                                 0<"JNT",-1828496835,"떙듹녹떙땙됹듙돹","ቋ\u1257Ꮫፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035929>(var10002), false
                              );
                              var45 = -1840393289 >>> -1283710807 ^ 4794089;
                              var78 = (StringBuilder)0<"JNT",1815454001,"꺙됹듙됹떙껙","ቋᏛፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿ\u1257ጃ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035923>(
                                 "\uf696㢗⺗䂗㚗ꂖ\u3097⺗㒗⊗䒗⺗ⲗ㢗ኗ⢗⢗䊗ꂖኗ㚗㚗⊗㚗㢗⊗ⲗẗꂖ⊗Თꂖኗ⢗㒗᪗ኗᢗ䊗ꂖኗ⊗⪗⊗ⲗẗꂖኗ㢗ꂖ㢗\u3097᪗ꂖ᪗ⲗ㢗⊗㢗䊗ꢖꂖ\u3097᪗⢗䂗㚗ꂖᒗ䊗䂗ኗ㚗㚗ꂖኗⲗ㢗⊗ꪖᚗ\u3097᪗ኗ㢗"
                              );
                              break label191;
                           case 1017590071:
                              var10000.field_1739 = 0<"JNT",-1828496835,"댹떹뎙","ቋᏛፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿ\u1257Ꮫ፟ᒳᏯ","Ȏ舧",2114035888>(
                                 var10, 0<"JNT",-1828496835,"떙듹녹떙땙됹듙돹","ቋ\u1257Ꮫፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035889>(var10002)
                              );
                              var10001 = -1100562558 >>> -1904048311 ^ 6239071;

                              for (var10002 = (StringBuilder)0<"JNT",1815454001,"꺙됹듙됹떙껙","ቋᏛፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿ\u1257ጃ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035883>(
                                    "搖쐖퐖\ue017搖뀖"
                                 );
                                 var10001 < ((-743812983 * -1845935952 | 6) & 545595727);
                                 var10001 += 1946392837 * (703946475 << 703946475) ^ 845985793
                              ) {
                                 int var98 = 0<"JNT",-1828496835,"덹됙댹땙꼹떙","ቋᏗ\u1257Ꮟ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035873>(var10002, var10001) ^ 151;
                                 char var101 = (char)(
                                    ((((((var98 & 65408) >> 7 | var98 << 9) ^ 193) & 65408) >> 7 | (((var98 & 65408) >> 7 | var98 << 9) ^ 193) << 9) & 61440)
                                          >> 12
                                       | (((((var98 & 65408) >> 7 | var98 << 9) ^ 193) & 65408) >> 7 | (((var98 & 65408) >> 7 | var98 << 9) ^ 193) << 9) << 4
                                 );
                                 0<"JNT",-1828496835,"땹뎹떙꽹됙댹땙꼹떙","ቋᏗᏏ\u1257ጃ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035872>(
                                    var10002,
                                    var10001,
                                    (char)(
                                       ((((((var98 & 65408) >> 7 | var98 << 9) ^ 193) & 65408) >> 7 | (((var98 & 65408) >> 7 | var98 << 9) ^ 193) << 9) & 61440)
                                             >> 12
                                          | (((((var98 & 65408) >> 7 | var98 << 9) ^ 193) & 65408) >> 7 | (((var98 & 65408) >> 7 | var98 << 9) ^ 193) << 9)
                                             << 4
                                    )
                                 );
                              }

                              this.field_1740 = (Class_321)0<"JNT",1815454001,"꺙됹듙됹떙껙","ቋᏛፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟ᏯᏛፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟ᎿᏇᒣᒇᒧᏯᏛፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟ᎿᏏ\u135b፷ᒏᒏᏯ\u1257ጃ","舦Ȓ",2114035982>(
                                 0<"JNT",-1828496835,"떙듹녹떙땙됹듙돹","ቋ\u1257Ꮫፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035988>(var10002),
                                 1<"JNT",-1046048650,"礆\ue907餇","ဨ\u0b00ဈ","\ueb62\ueb63\uf105\uf0e4\uf111\ueb21\ueb55",-1033067979>(),
                                 Class_172.class
                              );
                              var10000 = this;
                              var10001 = (839314576 ^ 839314576 | 0) & 1925791913;

                              for (var10002 = (StringBuilder)0<"JNT",1815454001,"꺙됹듙됹떙껙","ቋᏛፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿ\u1257ጃ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035985>(
                                    "殂簂禂稂刂犂簂刂氂犂笂疂璂簂刂洂璂笂簂"
                                 );
                                 var10001 < (-1858703432 & 1134196801 ^ 17983507);
                                 var10001 += 1242625839 ^ -1042702488 & 1242625839 ^ 167796742
                              ) {
                                 int var104 = 0<"JNT",-1828496835,"덹됙댹땙꼹떙","ቋᏗ\u1257Ꮟ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035864>(var10002, var10001) + 253;
                                 char var105 = (char)(((var104 & 65408) >> 7 | var104 << 9) - 50 + 238 + 191);
                                 0<"JNT",-1828496835,"땹뎹떙꽹됙댹땙꼹떙","ቋᏗᏏ\u1257ጃ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035859>(
                                    var10002, var10001, (char)(((var104 & 65408) >> 7 | var104 << 9) - 50 + 238 + 191)
                                 );
                              }

                              var10 = (Class_105)0<"JNT",1815454001,"꺙됹듙됹떙껙","ቋᏛፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿጓ\u1257ጃ","Ȏ舧",2114035946>(
                                 0<"JNT",-1828496835,"떙듹녹떙땙됹듙돹","ቋ\u1257Ꮫፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035947>(var10002), true
                              );
                              var45 = (-966417003 ^ -1797869952 | 0) & -2142497664;
                              var78 = (StringBuilder)0<"JNT",1815454001,"꺙됹듙됹떙껙","ቋᏛፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿ\u1257ጃ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035949>(
                                 "ۈجטؼوӼشװلجנ؈\u0600\u05cc\u05ccؠӼ\u0600ووנوجנה\u05f8Ӽנ״Ӽ\u0600\u05ccلװ\u0600\u05ecؠӼ\u0600נאנה\u05f8Ӽ\u0600جӼجלװӼװהجנجؠӌӼלװ\u05ccؼوӼ\u0604ؠؼ\u0600ووӼ\u0600הجנӐ؈לװ\u0600ج"
                              );
                              break label193;
                           case 1640532915:
                           default:
                              var10000.field_1737 = 0<"JNT",-1828496835,"댹떹뎙","ቋᏛፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿ\u1257Ꮫ፟ᒳᏯ","Ȏ舧",2114035898>(
                                 var10, 0<"JNT",-1828496835,"떙듹녹떙땙됹듙돹","ቋ\u1257Ꮫፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035899>(var10002)
                              );
                              var10001 = (-827572307 << -827572307 | 0) & 155045;

                              for (var10002 = (StringBuilder)0<"JNT",1815454001,"꺙됹듙됹떙껙","ቋᏛፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿ\u1257ጃ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035901>(
                                    "గ↗ᨗḗ"
                                 );
                                 var10001 < ((2018703803 >> -1746195074 | 4) & -948852324);
                                 var10001 += (-1469884033 * 1643176527 | 1) & 67436613
                              ) {
                                 int var92 = 0<"JNT",-1828496835,"덹됙댹땙꼹떙","ቋᏗ\u1257Ꮟ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035884>(var10002, var10001) + 154 - 49;
                                 char var93 = (char)((((var92 & 65408) >> 7 | var92 << 9) ^ 2) + 46);
                                 0<"JNT",-1828496835,"땹뎹떙꽹됙댹땙꼹떙","ቋᏗᏏ\u1257ጃ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035879>(
                                    var10002, var10001, (char)((((var92 & 65408) >> 7 | var92 << 9) ^ 2) + 46)
                                 );
                              }

                              this.field_1738 = (Class_210)0<"JNT",1815454001,"꺙됹듙됹떙껙","ቋᏛፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟ᏯᏛᒣፇᒻᎿᒧፗᒣፇፏᒳ፷ፃᒻᎿፏ\u135b፷ᒏᒏ\u137fᎷ\u139f᎗ᎳᏯ\u1257ጃ","ȓȒ",2114035896>(
                                 0<"JNT",-1828496835,"떙듹녹떙땙됹듙돹","ቋ\u1257Ꮫፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035894>(var10002),
                                 1<"JNT",-1046048650,"褆\ud906餆⤇꤆串\ue903\ue903椃䤃","ၐ࿘ၠ\u0a50ဘၸၐ࿘\u0fe8ၰးတၠ\u0a50\u0fe8ဠးၨၨ࿈ಸഀೀੰ","\ueb62\ueb63\uf105\uf0e7\ueb3f\uf0ed\ueb29\uf0e6\ueb23\uf0e7\ueb3f\ueb3d\uf0eb\ueb3b\ueb20\uf0ed\ueb29\ueb3d\uf0e5\ueb3b\uf0ec\uf0ec\ueb39\ueb2b\ueb51\ueb53\ueb2c\ueb55",-1033067181>()
                              );
                              var10000 = this;
                              var10001 = (1474485415 ^ -440002075 | 0) & 1161824928;

                              for (var10002 = (StringBuilder)0<"JNT",1815454001,"꺙됹듙됹떙껙","ቋᏛፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿ\u1257ጃ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035891>(
                                    "5\u0014ￖ2\u001b\u001c\nￖ9\u0012\u000f\u0019\u0011"
                                 );
                                 var10001 < ((1137336166 * 1137336166 | 9) & -1587994097);
                                 var10001 += -1617086212 << -1617086212 ^ -1073741823
                              ) {
                                 0<"JNT",-1828496835,"땹뎹떙꽹됙댹땙꼹떙","ቋᏗᏏ\u1257ጃ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035991>(
                                    var10002,
                                    var10001,
                                    (char)(
                                       0<"JNT",-1828496835,"덹됙댹땙꼹떙","ቋᏗ\u1257Ꮟ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035996>(var10002, var10001)
                                             + 167
                                             + 185
                                             + 32
                                             - 190
                                          ^ 184
                                    )
                                 );
                              }

                              var10 = (Class_105)0<"JNT",1815454001,"꺙됹듙됹떙껙","ቋᏛፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿጓ\u1257ጃ","Ȏ舧",2114035927>(
                                 0<"JNT",-1828496835,"떙듹녹떙땙됹듙돹","ቋ\u1257Ꮫፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035932>(var10002), false
                              );
                              var45 = (7916879 - -1550237761 | 0) & -1574935964;
                              var78 = (StringBuilder)0<"JNT",1815454001,"꺙됹듙됹떙껙","ቋᏛፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጏᒻᒳፗᒣ፟Ꮿ\u1257ጃ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱Ș舦舧ȕ舑Ȏ臿ȧȕ舒舎ȏ舧",2114035926>(
                                 "팛\udb5b\udbdb\ude9b죛\ud91b\ud99b\udddb\udc1b죛\udddb\udc5b\uda9b\ud91b\ud91b\ud99b\udc5b\ud99b\ud9db죛\uda9b\ud95b죛\udadb\udb1b\udbdb\ud9db\uda9b\udb5b\ud91b죛\ud9db\udb1b\udd1b\udb5b죛\udbdb\ud99b\ud95b\udddb죛\ud81b\udbdb\uda9b\ud81b\uda1b"
                              );
                              break label189;
                        }
                     }

                     var1 = -17346320 >> -17346320 ^ 56944764;
                  }

                  var1 = 1208698354 ^ -1227618081 ^ 2112545457;
               }

               var1 = 1884272098 >>> 1027999841 ^ -236349532;
            }

            var1 = (-1565491148 & (1917038331 | -1565491148) | -1853070890) & -1110480930;
         }
      }
   }

   // $VF: renamed from: mg () void
   @Override
   public void method_1407() {
      1<"JNT",548249432,"㤆\ue906ᤇ","ၘ\u0af8","\ueb62\ueb63\ueb40",-1033067080>(
         this,
         0<"JNT",-1828496835,"댹둙","ቋ\u1257Ꮓ","舫ȓ",2114035861>(1<"JNT",395182897,"句꤇餆","ၘ\u0af8","\ueb62\ueb63\uf105\uf113\uf0e6\ueb55",-1033067078>(this))
      );
      1<"JNT",548249432,"句ᤇ","ၘ\u0af8","\ueb62\ueb63\ueb40",-1033067061>(
         this,
         0<"JNT",-1828496835,"댹둙","ቋ\u1257Ꮓ","舫ȓ",2114035854>(1<"JNT",395182897,"句䤇줇","ၘ\u0af8","\ueb62\ueb63\uf105\uf113\uf0e6\ueb55",-1033067083>(this))
      );
      0<"JNT",-1357348434,"뒹돹","ቋ\u1257ጃ","ȧȨ舍",2114035856>(this);
   }

   // $VF: renamed from: q () void
   @Override
   public void method_1408() {
      0<"JNT",-1357348434,"딹","ቋ\u1257ጃ","ȧȨ舍",2114035851>(this);
   }

   // $VF: renamed from: ysy (Class_387) void
   // $VF: Irreducible bytecode was duplicated to produce valid code
   @Class_21
   public void method_1539(Class_387 var1) {
      int var11 = -578209802;
      if (1<"JNT",395182897,"褆\ud906餆⤇꤆串夃礃䤃꤃","ၐ࿘ၠ\u0a50ဘၸၐ࿘\u0fe8ၰးတၠ\u0a50\u0fe8ဠးၨၨ࿈੨ಸೀ","\ueb62\ueb63\uf105\uf0e7\ueb3f\uf0ed\ueb29\uf0e6\ueb23\uf0e7\ueb3f\ueb3d\uf0eb\ueb3b\ueb20\uf0ed\ueb29\ueb3d\uf0e5\ueb3b\uf0ec\uf0ec\ueb39\ueb51\ueb2e\ueb50\ueb55",-1033067128>(
               1<"JNT",395182897,"⤇䤇","ၘ\u0af8","\ueb62\ueb63\uf105\uf0e7\ueb3f\uf0ed\ueb29\uf0e6\ueb23\uf0e7\ueb3f\ueb3d\uf0eb\ueb3b\ueb20\uf0ed\ueb29\ueb3d\uf0e5\ueb3b\uf0ec\uf0ec\ueb39\ueb2d\ueb2b\ueb2a\ueb55",-1033067121>(
                  this
               )
            )
            != null
         && 1<"JNT",395182897,"褆\ud906餆⤇꤆串夃礃餃餃","ၐ࿘ၠ\u0a50ဘၸၐ࿘\u0fe8ၰးတၠ\u0a50\u0fe8ဠးၨၨ࿈੨ಸೀ","\ueb62\ueb63\uf105\uf0e7\ueb3f\uf0ed\ueb29\uf0e6\ueb23\uf0e7\ueb3f\ueb3d\uf0eb\ueb3b\ueb20\uf0ed\ueb29\ueb3d\uf0e5\ueb3b\uf0ec\uf0ec\ueb39\ueb2e\ueb2d\ueb51\ueb55",-1033067130>(
               1<"JNT",395182897,"⤇䤇","ၘ\u0af8","\ueb62\ueb63\uf105\uf0e7\ueb3f\uf0ed\ueb29\uf0e6\ueb23\uf0e7\ueb3f\ueb3d\uf0eb\ueb3b\ueb20\uf0ed\ueb29\ueb3d\uf0e5\ueb3b\uf0ec\uf0ec\ueb39\ueb2d\ueb2b\ueb2a\ueb55",-1033067131>(
                  this
               )
            )
            == null) {
         var11 = (1128513214 | 990847121) ^ -1856246922;
      } else {
         var11 = 1898128012;
      }

      while (true) {
         switch ((var11 + 1116098138 ^ 1440664305 ^ 937621012) - 492555526 + 1099212985 + 1723134621) {
            case -645634282:
               if (0<"JNT",-1828496835,"댹똙","ቋ\u1257ጓ","Ȏ舧",2114035835>(
                     1<"JNT",395182897,"备㤇","ၘ\u0af8","\ueb62\ueb63\uf105\ueb21\uf0eb\ueb55",-1033067100>(this)
                  )
                  && 0<"JNT",-1828496835,"뒹뎹떙됙듹뎙당귙극궹굹굙","ቋ\u1257Ꮧ","舑ȏ舦艱ȓȕ舑ȏȐ舧ȑ舍舦艱Ȑ舒ȑȨȨȚȉ舅舅ȉ",2114035831>(
                        0<"JNT",-1828496835,"뒹뎹떙됙듹뎙당굹괹궹궙긙","ቋ\u1257ᏛᒣፇᒻᎿᒧፗᒣፇፏᒳ፷ፃᒻᎿፏ\u135b፷ᒏᒏ\u137fᎷᎃᎃᎷᏯ","舑ȏ舦艱ȓȕ舑ȏȐ舧ȑ舍舦艱Ȑ舒ȑȨȨȚȆ舆舅",2114035836>(
                           1<"JNT",395182897,"褆\ud906餆⤇꤆串夃礃䤃꤃","ၐ࿘ၠ\u0a50ဘၸၐ࿘\u0fe8ၰးတၠ\u0a50\u0fe8ဠးၨၨ࿈੨ಸೀ","\ueb62\ueb63\uf105\uf0e7\ueb3f\uf0ed\ueb29\uf0e6\ueb23\uf0e7\ueb3f\ueb3d\uf0eb\ueb3b\ueb20\uf0ed\ueb29\ueb3d\uf0e5\ueb3b\uf0ec\uf0ec\ueb39\ueb51\ueb2e\ueb50\ueb55",-1033067097>(
                              1<"JNT",395182897,"⤇䤇","ၘ\u0af8","\ueb62\ueb63\uf105\uf0e7\ueb3f\uf0ed\ueb29\uf0e6\ueb23\uf0e7\ueb3f\ueb3d\uf0eb\ueb3b\ueb20\uf0ed\ueb29\ueb3d\uf0e5\ueb3b\uf0ec\uf0ec\ueb39\ueb2d\ueb2b\ueb2a\ueb55",-1033067102>(
                                 this
                              )
                           )
                        )
                     )
                     != 0<"JNT",-1828496835,"동뙙돹","ቋ\u1257Ꮧ","舎Ȑ",2114035833>(
                           1<"JNT",395182897,"複夆","ၘ\u0af8","\ueb62\ueb63\uf105\ueb3e\ueb3d\ueb55",-1033067106>(this)
                        )
                        - 1) {
                  return;
               }

               var11 = -1017470977 & -343982804;
               break;
            case -222681677:
               if (0<"JNT",-1828496835,"댹똙","ቋ\u1257ጓ","Ȏ舧",2114035853>(
                     1<"JNT",395182897,"ᤇ餆","ၘ\u0af8","\ueb62\ueb63\uf105\ueb21\uf0eb\ueb55",-1033067086>(this)
                  )
                  && 0<"JNT",-1828496835,"뒹뎹떙됙듹뎙당극긹괙긹","ቋ\u1257ᏛᒣፇᒻᎿᒧፗᒣፇፏᒳ፷ፃᒻᎿፏ\u135b፷ᒏᒏ\u137fᎷ\u139f᎗ᎳᏯ","舑ȏ舦艱ȓȕ舑ȏȐ舧ȑ舍舦艱Ȑ舒ȑȨȨȚȉȆȍȍ",2114035849>(
                        0<"JNT",-1828496835,"뒹뎹떙됙듹뎙당귙괙궙극","ቋ\u1257ᏛᒣፇᒻᎿᒧፗᒣፇፏᒳ፷ፃᒻᎿፏ\u135b፷ᒏᒏ\u137fᎷ\u139f᎗᎗Ꮿ","舑ȏ舦艱ȓȕ舑ȏȐ舧ȑ舍舦艱Ȑ舒ȑȨȨȚȆ舆舅",2114035846>(
                           1<"JNT",395182897,"褆\ud906餆⤇꤆串夃礃䤃꤃","ၐ࿘ၠ\u0a50ဘၸၐ࿘\u0fe8ၰးတၠ\u0a50\u0fe8ဠးၨၨ࿈੨ಸೀ","\ueb62\ueb63\uf105\uf0e7\ueb3f\uf0ed\ueb29\uf0e6\ueb23\uf0e7\ueb3f\ueb3d\uf0eb\ueb3b\ueb20\uf0ed\ueb29\ueb3d\uf0e5\ueb3b\uf0ec\uf0ec\ueb39\ueb51\ueb2e\ueb50\ueb55",-1033067091>(
                              1<"JNT",395182897,"⤇䤇","ၘ\u0af8","\ueb62\ueb63\uf105\uf0e7\ueb3f\uf0ed\ueb29\uf0e6\ueb23\uf0e7\ueb3f\ueb3d\uf0eb\ueb3b\ueb20\uf0ed\ueb29\ueb3d\uf0e5\ueb3b\uf0ec\uf0ec\ueb39\ueb2d\ueb2b\ueb2a\ueb55",-1033067088>(
                                 this
                              )
                           )
                        )
                     )
                     != 0<"JNT",-1828496835,"뒙딙뗹","ቋ\u1257ᏛᒣፇᒻᎿᒧፗᒣፇፏᒳ፷ፃᒻᎿፏ\u135b፷ᒏᒏ\u137fᎷ\u139f᎗ᎳᏯ","ȓȒ",2114035843>(
                        1<"JNT",395182897,"\ue906\ud906","ၘ\u0af8","\ueb62\ueb63\uf105\uf0e6\uf0e8\ueb55",-1033067092>(this)
                     )) {
                  return;
               }

               var11 = (-1739324277 & 1134207122 | 1826791961) & 2146428861;
               break;
            case 1007979138:
            default:
               class_1657 var2 = 0<"JNT",-1828496835,"둹딹딹","ቋ\u1257ᏛᒣፇᒻᎿᒧፗᒣፇፏᒳ፷ፃᒻᎿፏ\u135b፷ᒏᒏ\u137fᎷᎃᎇ\u139fᏯ","ȧȭ",2114035832>(this);
               if (var2 == null) {
                  return;
               }

               class_243 var3 = 0<"JNT",-1828496835,"뒹뎹떙됙듹뎙당극굹괹긙긹","ቋ\u1257ᏛᒣፇᒻᎿᒧፗᒣፇፏᒳ፷ፃᒻᎿፏ\u135b፷ᒏᒏ\u137fᎳᎻᎏᏯ","舑ȏ舦艱ȓȕ舑ȏȐ舧ȑ舍舦艱Ȑ舒ȑȨȨȚȉ舅ȇȆ",2114035818>(var2);
               if (0<"JNT",-1828496835,"뎹뗹","ቋ\u1257Ꮫፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟ᎿᏇᒣᒇᒧᏯ","舦Ȓ",2114035820>(
                     1<"JNT",395182897,"इ\ud906줆","ၘ\u0af8","\ueb62\ueb63\uf105\uf0ed\uf0e8\ueb55",-1033067113>(this)
                  )
                  == 1<"JNT",-1046048650,"备㤇餇","ဨ\u0b00ဈ","\ueb62\ueb63\uf105\uf0e4\uf111\ueb21\ueb55",-1033067123>()) {
                  var3 = 0<"JNT",-1828496835,"뒹뎹떙됙듹뎙당괹괙굹괹","ቋᏻᏻᏻ\u1257ᏛᒣፇᒻᎿᒧፗᒣፇፏᒳ፷ፃᒻᎿፏ\u135b፷ᒏᒏ\u137fᎳᎻᎏᏯ","舑ȏ舦艱ȓȕ舑ȏȐ舧ȑ舍舦艱Ȑ舒ȑȨȨȚ與舆Ȉ",2114035814>(
                     var3, 0.0, 1.62, 0.0
                  );
                  var11 = (831098119 << 831098119 | -1603795914) & -1494729674;
               } else {
                  var11 = (1067644121 ^ 967669429 | 1366338896) & -68108976;
               }

               while (true) {
                  switch (((var11 ^ 1489692242) - 1961888009 ^ 2112592603) + 988012301 + 504960818 + 1094587301) {
                     case -2057509626:
                     default:
                        if (0<"JNT",-1828496835,"뎹뗹","ቋ\u1257Ꮫፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟ᎿᏇᒣᒇᒧᏯ","舦Ȓ",2114035826>(
                              1<"JNT",395182897,"इ\ud906줆","ၘ\u0af8","\ueb62\ueb63\uf105\uf0ed\uf0e8\ueb55",-1033067111>(this)
                           )
                           == 1<"JNT",-1046048650,"礆\ue907餇","ဨ\u0b00ဈ","\ueb62\ueb63\uf105\uf0e4\uf111\ueb21\ueb55",-1033067105>()) {
                           var3 = 0<"JNT",-1828496835,"뒹뎹떙됙듹뎙당괹괙굹괹","ቋᏻᏻᏻ\u1257ᏛᒣፇᒻᎿᒧፗᒣፇፏᒳ፷ፃᒻᎿፏ\u135b፷ᒏᒏ\u137fᎳᎻᎏᏯ","舑ȏ舦艱ȓȕ舑ȏȐ舧ȑ舍舦艱Ȑ舒ȑȨȨȚ與舆Ȉ",2114035828>(
                              var3, 0.0, 1.0, 0.0
                           );
                           var11 = (831098119 << 831098119 | -1603795914) & -1494729674;
                        } else {
                           var11 = 1915778196 << 1915778196 ^ 1397981418;
                        }
                        continue;
                     case -1793831580:
                        float[] var4 = 0<"JNT",-1828496835,"뒙떙돹","ቋᏛᒣፇᒻᎿᒧፗᒣፇፏᒳ፷ፃᒻᎿፏ\u135b፷ᒏᒏ\u137fᎳᎻᎏᏯ\u1257፯Ꮓ","ȧȭ",2114035788>(this, var3);
                        double var5 = 0<"JNT",-1828496835,"됙듙","ቋᏃᏃ\u1257ᏻ","ȧȭ",2114035783>(this, var4[0], var4[1]);
                        if (var5
                           > (double)0<"JNT",-1828496835,"동뙙돹","ቋ\u1257Ꮧ","舎Ȑ",2114035785>(
                                 1<"JNT",395182897,"礆句複","ၘ\u0af8","\ueb62\ueb63\uf105\ueb3e\ueb3d\ueb55",-1033067794>(this)
                              )
                              / 2.0) {
                           return;
                        }

                        float var9;
                        float var10;
                        label90: {
                           float var7 = 1<"JNT",395182897,"句ᤇ","ၘ\u0af8","\ueb62\ueb63\ueb40",-1033067109>(this) / 50.0F;
                           float var8 = 1<"JNT",395182897,"㤆\ue906ᤇ","ၘ\u0af8","\ueb62\ueb63\ueb40",-1033067132>(this) / 50.0F;
                           var9 = 0<"JNT",-1828496835,"떙똙땹","ቋᏃᏃᏃ\u1257Ꮓ","ȧȭ",2114035804>(
                              this,
                              var7,
                              0<"JNT",-1828496835,"뒹뎹떙됙듹뎙당굹귙궙궹궙","ቋ\u1257Ꮓ","舑ȏ舦艱ȓȕ舑ȏȐ舧ȑ舍舦艱Ȑ舒ȑȨȨȚȆ舆舅",2114035805>(
                                 1<"JNT",395182897,"褆\ud906餆⤇꤆串夃礃䤃꤃","ၐ࿘ၠ\u0a50ဘၸၐ࿘\u0fe8ၰးတၠ\u0a50\u0fe8ဠးၨၨ࿈੨ಸೀ","\ueb62\ueb63\uf105\uf0e7\ueb3f\uf0ed\ueb29\uf0e6\ueb23\uf0e7\ueb3f\ueb3d\uf0eb\ueb3b\ueb20\uf0ed\ueb29\ueb3d\uf0e5\ueb3b\uf0ec\uf0ec\ueb39\ueb51\ueb2e\ueb50\ueb55",-1033067134>(
                                    1<"JNT",395182897,"⤇䤇","ၘ\u0af8","\ueb62\ueb63\uf105\uf0e7\ueb3f\uf0ed\ueb29\uf0e6\ueb23\uf0e7\ueb3f\ueb3d\uf0eb\ueb3b\ueb20\uf0ed\ueb29\ueb3d\uf0e5\ueb3b\uf0ec\uf0ec\ueb39\ueb2d\ueb2b\ueb2a\ueb55",-1033067135>(
                                       this
                                    )
                                 )
                              ),
                              var4[0]
                           );
                           var10 = 0<"JNT",-1828496835,"떙똙땹","ቋᏃᏃᏃ\u1257Ꮓ","ȧȭ",2114035800>(
                              this,
                              var8,
                              0<"JNT",-1828496835,"뒹뎹떙됙듹뎙당굹귙궙궹궹","ቋ\u1257Ꮓ","舑ȏ舦艱ȓȕ舑ȏȐ舧ȑ舍舦艱Ȑ舒ȑȨȨȚȆ舆舅",2114035801>(
                                 1<"JNT",395182897,"褆\ud906餆⤇꤆串夃礃䤃꤃","ၐ࿘ၠ\u0a50ဘၸၐ࿘\u0fe8ၰးတၠ\u0a50\u0fe8ဠးၨၨ࿈੨ಸೀ","\ueb62\ueb63\uf105\uf0e7\ueb3f\uf0ed\ueb29\uf0e6\ueb23\uf0e7\ueb3f\ueb3d\uf0eb\ueb3b\ueb20\uf0ed\ueb29\ueb3d\uf0e5\ueb3b\uf0ec\uf0ec\ueb39\ueb51\ueb2e\ueb50\ueb55",-1033067778>(
                                    1<"JNT",395182897,"⤇䤇","ၘ\u0af8","\ueb62\ueb63\uf105\uf0e7\ueb3f\uf0ed\ueb29\uf0e6\ueb23\uf0e7\ueb3f\ueb3d\uf0eb\ueb3b\ueb20\uf0ed\ueb29\ueb3d\uf0e5\ueb3b\uf0ec\uf0ec\ueb39\ueb2d\ueb2b\ueb2a\ueb55",-1033067779>(
                                       this
                                    )
                                 )
                              ),
                              var4[1]
                           );
                           if (0<"JNT",-1828496835,"댹똙","ቋ\u1257ጓ","Ȏ舧",2114035794>(
                              1<"JNT",395182897,"ᤇ⤇䤇","ၘ\u0af8","\ueb62\ueb63\uf105\ueb21\uf0eb\ueb55",-1033067783>(this)
                           )) {
                              if (!0<"JNT",-1828496835,"댹똙","ቋ\u1257ጓ","Ȏ舧",2114035796>(
                                 1<"JNT",395182897,"\ue906इ꤆","ၘ\u0af8","\ueb62\ueb63\uf105\ueb21\uf0eb\ueb55",-1033067777>(this)
                              )) {
                                 var11 = 87942176 >> 1349630285 ^ 914784260;
                                 break label90;
                              }

                              if (!0<"JNT",-1828496835,"됹뙙뒙","ቋᏛᒣፇᒻᎿᒧፗᒣፇፏᒳ፷ፃᒻᎿፏ\u135b፷ᒏᒏ\u137fᎷᎃᎇ\u139fᏯ\u1257ጓ","ȧȭ",2114035791>(this, var2)) {
                                 var11 = 87942176 >> 1349630285 ^ 914784260;
                                 break label90;
                              }
                           }

                           var11 = (-255814303 - -255814303 | -212839742) & -136718390;
                        }

                        while (true) {
                           switch (((var11 ^ 1466513291) + 1998869127 + 1101734437 ^ 778194275 ^ 182190038) + 1641329308) {
                              case -2031128370:
                                 return;
                              case -1613015979:
                                 0<"JNT",-1828496835,"뒹뎹떙됙듹뎙당굹귙궙궹귙","ቋᏃ\u1257ጃ","舑ȏ舦艱ȓȕ舑ȏȐ舧ȑ舍舦艱Ȑ舒ȑȨȨȚȆ舆舅",2114035841>(
                                    1<"JNT",395182897,"褆\ud906餆⤇꤆串夃礃䤃꤃","ၐ࿘ၠ\u0a50ဘၸၐ࿘\u0fe8ၰးတၠ\u0a50\u0fe8ဠးၨၨ࿈੨ಸೀ","\ueb62\ueb63\uf105\uf0e7\ueb3f\uf0ed\ueb29\uf0e6\ueb23\uf0e7\ueb3f\ueb3d\uf0eb\ueb3b\ueb20\uf0ed\ueb29\ueb3d\uf0e5\ueb3b\uf0ec\uf0ec\ueb39\ueb51\ueb2e\ueb50\ueb55",-1033067098>(
                                       1<"JNT",395182897,"⤇䤇","ၘ\u0af8","\ueb62\ueb63\uf105\uf0e7\ueb3f\uf0ed\ueb29\uf0e6\ueb23\uf0e7\ueb3f\ueb3d\uf0eb\ueb3b\ueb20\uf0ed\ueb29\ueb3d\uf0e5\ueb3b\uf0ec\uf0ec\ueb39\ueb2d\ueb2b\ueb2a\ueb55",-1033067099>(
                                          this
                                       )
                                    ),
                                    var9
                                 );
                                 var11 = (-255814303 - -255814303 | -212839742) & -136718390;
                                 continue;
                              case -611967524:
                              default:
                                 if (0<"JNT",-1828496835,"댹똙","ቋ\u1257ጓ","Ȏ舧",2114035822>(
                                    1<"JNT",395182897,"褆礇礆","ၘ\u0af8","\ueb62\ueb63\uf105\ueb21\uf0eb\ueb55",-1033067115>(this)
                                 )) {
                                    if (0<"JNT",-1828496835,"댹똙","ቋ\u1257ጓ","Ȏ舧",2114035824>(
                                       1<"JNT",395182897,"줇备꤆","ၘ\u0af8","\ueb62\ueb63\uf105\ueb21\uf0eb\ueb55",-1033067093>(this)
                                    )) {
                                       if (!0<"JNT",-1828496835,"됹뙙뒙","ቋᏛᒣፇᒻᎿᒧፗᒣፇፏᒳ፷ፃᒻᎿፏ\u135b፷ᒏᒏ\u137fᎷᎃᎇ\u139fᏯ\u1257ጓ","ȧȭ",2114035819>(this, var2)) {
                                          var11 = 1018574136 * 1018574136 ^ 2123737714;
                                       } else {
                                          var11 = (330821491 | 1860219399) ^ 1615683367;
                                       }
                                    } else {
                                       var11 = 1018574136 * 1018574136 ^ 2123737714;
                                    }
                                 } else {
                                    var11 = (330821491 | 1860219399) ^ 1615683367;
                                 }
                                 continue;
                              case 511334252:
                           }

                           0<"JNT",-1828496835,"뒹뎹떙됙듹뎙당굹귙궙궹극","ቋᏃ\u1257ጃ","舑ȏ舦艱ȓȕ舑ȏȐ舧ȑ舍舦艱Ȑ舒ȑȨȨȚȆ舆舅",2114035844>(
                              1<"JNT",395182897,"褆\ud906餆⤇꤆串夃礃䤃꤃","ၐ࿘ၠ\u0a50ဘၸၐ࿘\u0fe8ၰးတၠ\u0a50\u0fe8ဠးၨၨ࿈੨ಸೀ","\ueb62\ueb63\uf105\uf0e7\ueb3f\uf0ed\ueb29\uf0e6\ueb23\uf0e7\ueb3f\ueb3d\uf0eb\ueb3b\ueb20\uf0ed\ueb29\ueb3d\uf0e5\ueb3b\uf0ec\uf0ec\ueb39\ueb51\ueb2e\ueb50\ueb55",-1033067089>(
                                 1<"JNT",395182897,"⤇䤇","ၘ\u0af8","\ueb62\ueb63\uf105\uf0e7\ueb3f\uf0ed\ueb29\uf0e6\ueb23\uf0e7\ueb3f\ueb3d\uf0eb\ueb3b\ueb20\uf0ed\ueb29\ueb3d\uf0e5\ueb3b\uf0ec\uf0ec\ueb39\ueb2d\ueb2b\ueb2a\ueb55",-1033067094>(
                                    this
                                 )
                              ),
                              var10
                           );
                           var11 = (330821491 | 1860219399) ^ 1615683367;
                        }
                     case 1245565272:
                  }

                  if (0<"JNT",-1828496835,"뎹뗹","ቋ\u1257Ꮫፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟ᎿᏇᒣᒇᒧᏯ","舦Ȓ",2114035816>(
                        1<"JNT",395182897,"इ\ud906줆","ၘ\u0af8","\ueb62\ueb63\uf105\uf0ed\uf0e8\ueb55",-1033067133>(this)
                     )
                     == 1<"JNT",-1046048650,"뤆꤆줆","ဨ\u0b00ဈ","\ueb62\ueb63\uf105\uf0e4\uf111\ueb21\ueb55",-1033067127>()) {
                     var3 = 0<"JNT",-1828496835,"뒹뎹떙됙듹뎙당괹괙굹괹","ቋᏻᏻᏻ\u1257ᏛᒣፇᒻᎿᒧፗᒣፇፏᒳ፷ፃᒻᎿፏ\u135b፷ᒏᒏ\u137fᎳᎻᎏᏯ","舑ȏ舦艱ȓȕ舑ȏȐ舧ȑ舍舦艱Ȑ舒ȑȨȨȚ與舆Ȉ",2114035810>(
                        var3, 0.0, 0.5, 0.0
                     );
                  }

                  var11 = (831098119 << 831098119 | -1603795914) & -1494729674;
               }
            case 1479711334:
               if (0<"JNT",-1828496835,"댹똙","ቋ\u1257ጓ","Ȏ舧",2114035793>(
                     1<"JNT",395182897,"뤆句꤆","ၘ\u0af8","\ueb62\ueb63\uf105\ueb21\uf0eb\ueb55",-1033067786>(this)
                  )
                  && 0<"JNT",-1232055882,"돹뒙동뗹꿹뎹떙낹듹떹땹뎹뽙떹떙떙듹듙","ቋᏓᏗ\u1257Ꮧ","Ȓ舧Ȏ艱舒Ȧ舓Ȏ舒艱Ȏ舒舍Ȧ艱Ǿ舂臽Ȗ",2114035789>(
                        0<"JNT",-1828496835,"뒹뎹떙됙듹뎙당궙궙긹괙","ቋ\u1257Ꮣ","舑ȏ舦艱ȓȕ舑ȏȐ舧ȑ舍舦艱Ȑ舒ȑȨȨȚȉ興舆ȉ",2114035786>(
                           0<"JNT",-1828496835,"뒹뎹떙됙듹뎙당굙굙귙긙굹","ቋ\u1257ᏛᒣፇᒻᎿᒧፗᒣፇፏᒳ፷ፃᒻᎿፏ\u135b፷ᒏᒏ\u137fᎷᎫᎻᎷᏯ","舑ȏ舦艱ȓȕ舑ȏȐ舧ȑ舍舦艱Ȑ舒ȑȨȨȚȈȉ興",2114035787>(
                              1<"JNT",395182897,"⤇䤇","ၘ\u0af8","\ueb62\ueb63\uf105\uf0e7\ueb3f\uf0ed\ueb29\uf0e6\ueb23\uf0e7\ueb3f\ueb3d\uf0eb\ueb3b\ueb20\uf0ed\ueb29\ueb3d\uf0e5\ueb3b\uf0ec\uf0ec\ueb39\ueb2d\ueb2b\ueb2a\ueb55",-1033067788>(
                                 this
                              )
                           )
                        ),
                        0
                     )
                     != 1) {
                  return;
               }

               var11 = (-636647976 - (1942630759 >>> 437925190) | 276832876) & -1803275523;
               break;
            case 1551047251:
               return;
         }
      }
   }

   // $VF: renamed from: kqq () net.minecraft.class_1657
   public class_1657 method_1540() {
      int var8 = -959514178;
      class_1657 var1 = null;
      double var2 = (double)0<"JNT",-1828496835,"댹떙됹","ቋ\u1257Ꮓ","舎Ȑ",2114035770>(
         1<"JNT",395182897,"备䤆䤆","ၘ\u0af8","\ueb62\ueb63\uf105\ueb3e\ueb3d\ueb55",-1033067807>(this)
      );
      Iterator var4 = 0<"JNT",-1870875337,"됹떙뎹땙댹떙듹땙","ቋ\u1257Ꮫፓ፷ᒃ፷Ꮏᒇᒻፗ\u135bᎿᏗᒻፇᒳ፷ᒻᒿᒳᏯ","舓ȑ舥ȑ艱ȧ舦ȕ舒艱舂ȕȨ舦",2114035766>(
         0<"JNT",-1828496835,"뒹뎹떙됙듹뎙당괹긙궙궹귙","ቋ\u1257Ꮫፓ፷ᒃ፷Ꮏᒇᒻፗ\u135bᎿᏛፗᒏᒻᏯ","舑ȏ舦艱ȓȕ舑ȏȐ舧ȑ舍舦艱Ȑ舒ȑȨȨȚ舅Ȉ舌",2114035767>(
            1<"JNT",395182897,"褆\ud906餆⤇꤆串夃褃\ue903礃","ၐ࿘ၠ\u0a50ဘၸၐ࿘\u0fe8ၰးတၠ\u0a50\u0fe8ဠးၨၨ࿈੨ಸೀ","\ueb62\ueb63\uf105\uf0e7\ueb3f\uf0ed\ueb29\uf0e6\ueb23\uf0e7\ueb3f\ueb3d\uf0eb\ueb3b\ueb20\uf0ed\ueb29\ueb3d\uf0e5\ueb3b\uf0ec\uf0ec\ueb39\ueb50\ueb2d\ueb52\ueb55",-1033067808>(
               1<"JNT",395182897,"⤇䤇","ၘ\u0af8","\ueb62\ueb63\uf105\uf0e7\ueb3f\uf0ed\ueb29\uf0e6\ueb23\uf0e7\ueb3f\ueb3d\uf0eb\ueb3b\ueb20\uf0ed\ueb29\ueb3d\uf0e5\ueb3b\uf0ec\uf0ec\ueb39\ueb2d\ueb2b\ueb2a\ueb55",-1033067801>(
                  this
               )
            )
         )
      );

      label65:
      while (true) {
         var8 = (-1366172990 >> -477450210 | 9945664) & 548921024;

         while (true) {
            switch ((var8 ^ 405960889) + 1266972835 - 1889928977 ^ 251579691 ^ 1250978430 ^ 937696613) {
               case 1626251835:
                  if (0<"JNT",-1870875337,"됙댹땹냙뎹똙떙","ቋ\u1257ጓ","舓ȑ舥ȑ艱ȧ舦ȕ舒艱ȅ舦ȏ舧ȑ舦Ȓ舧",2114035775>(var4)) {
                     class_1657 var5 = (class_1657)0<"JNT",-1870875337,"듙뎹똙떙","ቋ\u1257Ꮫፓ፷ᒃ፷Ꮏ\u135b፷ᒣ፟Ꮏጿ፳ፓፇፏᒻᏯ","舓ȑ舥ȑ艱ȧ舦ȕ舒艱ȅ舦ȏ舧ȑ舦Ȓ舧",2114035774>(var4);
                     if (var5
                        != 1<"JNT",395182897,"褆\ud906餆⤇꤆串夃礃䤃꤃","ၐ࿘ၠ\u0a50ဘၸၐ࿘\u0fe8ၰးတၠ\u0a50\u0fe8ဠးၨၨ࿈੨ಸೀ","\ueb62\ueb63\uf105\uf0e7\ueb3f\uf0ed\ueb29\uf0e6\ueb23\uf0e7\ueb3f\ueb3d\uf0eb\ueb3b\ueb20\uf0ed\ueb29\ueb3d\uf0e5\ueb3b\uf0ec\uf0ec\ueb39\ueb51\ueb2e\ueb50\ueb55",-1033067804>(
                           1<"JNT",395182897,"⤇䤇","ၘ\u0af8","\ueb62\ueb63\uf105\uf0e7\ueb3f\uf0ed\ueb29\uf0e6\ueb23\uf0e7\ueb3f\ueb3d\uf0eb\ueb3b\ueb20\uf0ed\ueb29\ueb3d\uf0e5\ueb3b\uf0ec\uf0ec\ueb39\ueb2d\ueb2b\ueb2a\ueb55",-1033067781>(
                              this
                           )
                        )) {
                        var8 = 540473680;

                        while (true) {
                           switch (var8 - 659009259 - 609708805 + 483963961 + 1278398115 + 1698283383 - 763694020) {
                              case -1071922636:
                                 double var6 = (double)0<"JNT",-1828496835,"뒹뎹떙됙듹뎙당궹극굹긹","ቋᏛᒣፇᒻᎿᒧፗᒣፇፏᒳ፷ፃᒻᎿፏ\u135b፷ᒏᒏ\u137fᎷᎳ᎗\u139fᏯ\u1257Ꮓ","舑ȏ舦艱ȓȕ舑ȏȐ舧ȑ舍舦艱Ȑ舒ȑȨȨȚȆ舆舅",2114035778>(
                                    1<"JNT",395182897,"褆\ud906餆⤇꤆串夃礃䤃꤃","ၐ࿘ၠ\u0a50ဘၸၐ࿘\u0fe8ၰးတၠ\u0a50\u0fe8ဠးၨၨ࿈੨ಸೀ","\ueb62\ueb63\uf105\uf0e7\ueb3f\uf0ed\ueb29\uf0e6\ueb23\uf0e7\ueb3f\ueb3d\uf0eb\ueb3b\ueb20\uf0ed\ueb29\ueb3d\uf0e5\ueb3b\uf0ec\uf0ec\ueb39\ueb51\ueb2e\ueb50\ueb55",-1033067799>(
                                       1<"JNT",395182897,"⤇䤇","ၘ\u0af8","\ueb62\ueb63\uf105\uf0e7\ueb3f\uf0ed\ueb29\uf0e6\ueb23\uf0e7\ueb3f\ueb3d\uf0eb\ueb3b\ueb20\uf0ed\ueb29\ueb3d\uf0e5\ueb3b\uf0ec\uf0ec\ueb39\ueb2d\ueb2b\ueb2a\ueb55",-1033067796>(
                                          this
                                       )
                                    ),
                                    var5
                                 );
                                 if (!(
                                    var6
                                       > (double)0<"JNT",-1828496835,"댹떙됹","ቋ\u1257Ꮓ","舎Ȑ",2114035780>(
                                          1<"JNT",395182897,"备䤆䤆","ၘ\u0af8","\ueb62\ueb63\uf105\ueb3e\ueb3d\ueb55",-1033067793>(this)
                                       )
                                 )) {
                                    var8 = (1252169458 - 1252169458 | -589357155) & -50339937;

                                    while (true) {
                                       switch ((var8 ^ 479216696) - 1730603022 + 513227294 + 1670525424 + 1885678152 - 1312322811) {
                                          case -1673773735:
                                             continue label65;
                                          case -42035982:
                                          default:
                                             if (var6 < var2) {
                                                var2 = var6;
                                                var1 = var5;
                                             }

                                             var8 = -1603005131 >> (1497918535 ^ -1762066849) ^ -1134379116;
                                       }
                                    }
                                 }
                                 continue label65;
                              case 1968707055:
                              default:
                                 if (0<"JNT",-1828496835,"뒹뎹떙됙듹뎙당굙긹궹괙궙","ቋ\u1257ጓ","舑ȏ舦艱ȓȕ舑ȏȐ舧ȑ舍舦艱Ȑ舒ȑȨȨȚȉ舅ȇȆ",2114035769>(var5)
                                    || 0<"JNT",-1828496835,"뒹뎹떙됙듹뎙당귙괙굹굙","ቋ\u1257Ꮓ","舑ȏ舦艱ȓȕ舑ȏȐ舧ȑ舍舦艱Ȑ舒ȑȨȨȚȉ舅ȇȆ",2114035768>(var5) <= 0.0F) {
                                    continue label65;
                                 }

                                 var8 = 1794811285;
                           }
                        }
                     }
                     continue label65;
                  }

                  var8 = -518174167 >>> 1349498935 ^ 700384245;
                  break;
               case 2145474064:
               default:
                  return var1;
            }
         }
      }
   }

   // $VF: renamed from: ltg (net.minecraft.class_243) float[]
   public float[] method_1541(class_243 var1) {
      class_243 var2 = 0<"JNT",-1828496835,"뒹뎹떙됙듹뎙당굹굹궹극괹","ቋ\u1257ᏛᒣፇᒻᎿᒧፗᒣፇፏᒳ፷ፃᒻᎿፏ\u135b፷ᒏᒏ\u137fᎳᎻᎏᏯ","舑ȏ舦艱ȓȕ舑ȏȐ舧ȑ舍舦艱Ȑ舒ȑȨȨȚȆ舆舅",2114035765>(
         1<"JNT",395182897,"褆\ud906餆⤇꤆串夃礃䤃꤃","ၐ࿘ၠ\u0a50ဘၸၐ࿘\u0fe8ၰးတၠ\u0a50\u0fe8ဠးၨၨ࿈੨ಸೀ","\ueb62\ueb63\uf105\uf0e7\ueb3f\uf0ed\ueb29\uf0e6\ueb23\uf0e7\ueb3f\ueb3d\uf0eb\ueb3b\ueb20\uf0ed\ueb29\ueb3d\uf0e5\ueb3b\uf0ec\uf0ec\ueb39\ueb51\ueb2e\ueb50\ueb55",-1033067814>(
            1<"JNT",395182897,"⤇䤇","ၘ\u0af8","\ueb62\ueb63\uf105\uf0e7\ueb3f\uf0ed\ueb29\uf0e6\ueb23\uf0e7\ueb3f\ueb3d\uf0eb\ueb3b\ueb20\uf0ed\ueb29\ueb3d\uf0e5\ueb3b\uf0ec\uf0ec\ueb39\ueb2d\ueb2b\ueb2a\ueb55",-1033067815>(
               this
            )
         )
      );
      double var3 = 1<"JNT",395182897,"褆\ud906餆⤇꤆串夃㤃餃䤃","ၐ࿘ၠ\u0a50ဘၸၐ࿘\u0fe8ၰးတၠ\u0a50\u0fe8ဠးၨၨ࿈ੰ\u0a60੨","\ueb62\ueb63\ueb5e",-1033067816>(var1)
         - 1<"JNT",395182897,"褆\ud906餆⤇꤆串夃㤃餃䤃","ၐ࿘ၠ\u0a50ဘၸၐ࿘\u0fe8ၰးတၠ\u0a50\u0fe8ဠးၨၨ࿈ੰ\u0a60੨","\ueb62\ueb63\ueb5e",-1033067819>(var2);
      double var5 = 1<"JNT",395182897,"褆\ud906餆⤇꤆串夃㤃餃夃","ၐ࿘ၠ\u0a50ဘၸၐ࿘\u0fe8ၰးတၠ\u0a50\u0fe8ဠးၨၨ࿈ੰ\u0a60੨","\ueb62\ueb63\ueb5e",-1033067818>(var1)
         - 1<"JNT",395182897,"褆\ud906餆⤇꤆串夃㤃餃夃","ၐ࿘ၠ\u0a50ဘၸၐ࿘\u0fe8ၰးတၠ\u0a50\u0fe8ဠးၨၨ࿈ੰ\u0a60੨","\ueb62\ueb63\ueb5e",-1033067797>(var2);
      double var7 = 1<"JNT",395182897,"褆\ud906餆⤇꤆串夃㤃餃椃","ၐ࿘ၠ\u0a50ဘၸၐ࿘\u0fe8ၰးတၠ\u0a50\u0fe8ဠးၨၨ࿈ੰ\u0a60੨","\ueb62\ueb63\ueb5e",-1033067820>(var1)
         - 1<"JNT",395182897,"褆\ud906餆⤇꤆串夃㤃餃椃","ၐ࿘ၠ\u0a50ဘၸၐ࿘\u0fe8ၰးတၠ\u0a50\u0fe8ဠးၨၨ࿈ੰ\u0a60੨","\ueb62\ueb63\ueb5e",-1033067823>(var2);
      double var9 = 0<"JNT",-1232055882,"땹딹땙떙","ቋᏻ\u1257ᏻ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱ȃȑ舦舔",2114035754>(var3 * var3 + var7 * var7);
      float var11 = (float)0<"JNT",-1232055882,"떙듹꾙뎹돹땙뎹뎹땹","ቋᏻ\u1257ᏻ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱ȃȑ舦舔",2114035756>(
            0<"JNT",-1232055882,"댹떙댹듙굙","ቋᏻᏻ\u1257ᏻ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱ȃȑ舦舔",2114035757>(var7, var3)
         )
         - 90.0F;
      float var12 = (float)(
         -0<"JNT",-1232055882,"떙듹꾙뎹돹땙뎹뎹땹","ቋᏻ\u1257ᏻ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱ȃȑ舦舔",2114035750>(
            0<"JNT",-1232055882,"댹떙댹듙굙","ቋᏻᏻ\u1257ᏻ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱ȃȑ舦舔",2114035751>(var5, var9)
         )
      );
      return new float[]{var11, var12};
   }

   // $VF: renamed from: hn (float, float) double
   public double method_1542(float var1, float var2) {
      float var3 = 0<"JNT",-1232055882,"뒹뎹떙됙듹뎙당괹궹굹긹굹","ቋᏃ\u1257Ꮓ","舑ȏ舦艱ȓȕ舑ȏȐ舧ȑ舍舦艱Ȑ舒ȑȨȨȚȈȇȈ與",2114035746>(
         var1
            - 0<"JNT",-1828496835,"뒹뎹떙됙듹뎙당굹귙궙궹궙","ቋ\u1257Ꮓ","舑ȏ舦艱ȓȕ舑ȏȐ舧ȑ舍舦艱Ȑ舒ȑȨȨȚȆ舆舅",2114035747>(
               1<"JNT",395182897,"褆\ud906餆⤇꤆串夃礃䤃꤃","ၐ࿘ၠ\u0a50ဘၸၐ࿘\u0fe8ၰးတၠ\u0a50\u0fe8ဠးၨၨ࿈੨ಸೀ","\ueb62\ueb63\uf105\uf0e7\ueb3f\uf0ed\ueb29\uf0e6\ueb23\uf0e7\ueb3f\ueb3d\uf0eb\ueb3b\ueb20\uf0ed\ueb29\ueb3d\uf0e5\ueb3b\uf0ec\uf0ec\ueb39\ueb51\ueb2e\ueb50\ueb55",-1033067828>(
                  1<"JNT",395182897,"⤇䤇","ၘ\u0af8","\ueb62\ueb63\uf105\uf0e7\ueb3f\uf0ed\ueb29\uf0e6\ueb23\uf0e7\ueb3f\ueb3d\uf0eb\ueb3b\ueb20\uf0ed\ueb29\ueb3d\uf0e5\ueb3b\uf0ec\uf0ec\ueb39\ueb2d\ueb2b\ueb2a\ueb55",-1033067837>(
                     this
                  )
               )
            )
      );
      float var4 = var2
         - 0<"JNT",-1828496835,"뒹뎹떙됙듹뎙당굹귙궙궹궹","ቋ\u1257Ꮓ","舑ȏ舦艱ȓȕ舑ȏȐ舧ȑ舍舦艱Ȑ舒ȑȨȨȚȆ舆舅",2114035743>(
            1<"JNT",395182897,"褆\ud906餆⤇꤆串夃礃䤃꤃","ၐ࿘ၠ\u0a50ဘၸၐ࿘\u0fe8ၰးတၠ\u0a50\u0fe8ဠးၨၨ࿈੨ಸೀ","\ueb62\ueb63\uf105\uf0e7\ueb3f\uf0ed\ueb29\uf0e6\ueb23\uf0e7\ueb3f\ueb3d\uf0eb\ueb3b\ueb20\uf0ed\ueb29\ueb3d\uf0e5\ueb3b\uf0ec\uf0ec\ueb39\ueb51\ueb2e\ueb50\ueb55",-1033067832>(
               1<"JNT",395182897,"⤇䤇","ၘ\u0af8","\ueb62\ueb63\uf105\uf0e7\ueb3f\uf0ed\ueb29\uf0e6\ueb23\uf0e7\ueb3f\ueb3d\uf0eb\ueb3b\ueb20\uf0ed\ueb29\ueb3d\uf0e5\ueb3b\uf0ec\uf0ec\ueb39\ueb2d\ueb2b\ueb2a\ueb55",-1033067825>(
                  this
               )
            )
         );
      return 0<"JNT",-1232055882,"땹딹땙떙","ቋᏻ\u1257ᏻ","舓ȑ舥ȑ艱舒ȑ舑Ȏ艱ȃȑ舦舔",2114035742>((double)(var3 * var3 + var4 * var4));
   }

   // $VF: renamed from: izl (net.minecraft.class_1657) boolean
   public boolean method_1543(class_1657 var1) {
      return 1<"JNT",395182897,"褆\ud906餆⤇꤆串夃礃褃餃","ၐ࿘ၠ\u0a50ဘၸၐ࿘\u0fe8ၰးတၠ\u0a50\u0fe8ဠးၨၨ࿈੨ಸೀ","\ueb62\ueb63\uf105\uf0e7\ueb3f\uf0ed\ueb29\uf0e6\ueb23\uf0e7\ueb3f\ueb3d\uf0eb\ueb3b\ueb20\uf0ed\ueb29\ueb3d\uf0e5\ueb3b\uf0ec\uf0ec\ueb39\ueb2c\ueb2d\ueb53\ueb55",-1033067836>(
            1<"JNT",395182897,"⤇䤇","ၘ\u0af8","\ueb62\ueb63\uf105\uf0e7\ueb3f\uf0ed\ueb29\uf0e6\ueb23\uf0e7\ueb3f\ueb3d\uf0eb\ueb3b\ueb20\uf0ed\ueb29\ueb3d\uf0e5\ueb3b\uf0ec\uf0ec\ueb39\ueb2d\ueb2b\ueb2a\ueb55",-1033067813>(
               this
            )
         ) instanceof class_3966 var2
         ? 0<"JNT",-1828496835,"뒹뎹떙됙듹뎙당괹극극긙굙","ቋ\u1257ᏛᒣፇᒻᎿᒧፗᒣፇፏᒳ፷ፃᒻᎿፏ\u135b፷ᒏᒏ\u137fᎷᎳ᎗\u139fᏯ","舑ȏ舦艱ȓȕ舑ȏȐ舧ȑ舍舦艱Ȑ舒ȑȨȨȚȈȍ舅舅",2114035739>(var2) == var1
         : false;
   }

   // $VF: renamed from: txs (float, float, float) float
   public float method_1544(float var1, float var2, float var3) {
      return var2 + 0<"JNT",-1232055882,"뒹뎹떙됙듹뎙당괹궹굹긹굹","ቋᏃ\u1257Ꮓ","舑ȏ舦艱ȓȕ舑ȏȐ舧ȑ舍舦艱Ȑ舒ȑȨȨȚȈȇȈ與",2114035738>(var3 - var2) * var1;
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1413(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = (var10 + 13705888 - 2003837022 - 83548181 - 1983860468 - 1994840391 ^ 1688705025 ^ 1389274620) - 1455975164 - 1870360297;
      MethodHandle var10000 = field_1751[(var10 + 13705888 - 2003837022 - 83548181 - 1983860468 - 1994840391 ^ 1688705025 ^ 1389274620)
         - 1455975164
         - 1870360297
         - 1558496526];
      if (field_1751[var10001 - 1558496526] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = (-351344083 >> -647231849 | 0) & 32; var23 < var13.length(); var23 += (1488895482 ^ 1488895482 | 1) & -2110486951) {
            int var42 = var13.charAt(var23) + 138;
            char var45 = (char)(
               (
                     (
                              (
                                    (
                                          (((var42 & 61440) >> 12 | var42 << 4) + 38 + 222 + 13 + 189 & 32768) >> 15
                                             | ((var42 & 61440) >> 12 | var42 << 4) + 38 + 222 + 13 + 189 << 1
                                       )
                                       ^ 16
                                 )
                                 & 64512
                           )
                           >> 10
                        | (
                              (
                                    (((var42 & 61440) >> 12 | var42 << 4) + 38 + 222 + 13 + 189 & 32768) >> 15
                                       | ((var42 & 61440) >> 12 | var42 << 4) + 38 + 222 + 13 + 189 << 1
                                 )
                                 ^ 16
                           )
                           << 6
                  )
                  - 62
            );
            var13.setCharAt(
               var23,
               (char)(
                  (
                        (
                                 (
                                       (
                                             (((var42 & 61440) >> 12 | var42 << 4) + 38 + 222 + 13 + 189 & 32768) >> 15
                                                | ((var42 & 61440) >> 12 | var42 << 4) + 38 + 222 + 13 + 189 << 1
                                          )
                                          ^ 16
                                    )
                                    & 64512
                              )
                              >> 10
                           | (
                                 (
                                       (((var42 & 61440) >> 12 | var42 << 4) + 38 + 222 + 13 + 189 & 32768) >> 15
                                          | ((var42 & 61440) >> 12 | var42 << 4) + 38 + 222 + 13 + 189 << 1
                                    )
                                    ^ 16
                              )
                              << 6
                     )
                     - 62
               )
            );
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = (1611979262 >>> 541610668 | 0) & -1762085230; var29 < var16.length(); var29 += -176789702 & -467564112 ^ -467664591) {
            int var50 = (var16.charAt(var29) ^ 175) + 60;
            char var53 = (char)(
               (
                     (
                              (
                                    (((var50 & 65520) >> 4 | var50 << 12) - 227 - 88 - 150 + 133 & 65534) >> 1
                                       | ((var50 & 65520) >> 4 | var50 << 12) - 227 - 88 - 150 + 133 << 15
                                 )
                                 & 57344
                           )
                           >> 13
                        | (
                              (((var50 & 65520) >> 4 | var50 << 12) - 227 - 88 - 150 + 133 & 65534) >> 1
                                 | ((var50 & 65520) >> 4 | var50 << 12) - 227 - 88 - 150 + 133 << 15
                           )
                           << 3
                  )
                  + 141
            );
            var16.setCharAt(
               var29,
               (char)(
                  (
                        (
                                 (
                                       (((var50 & 65520) >> 4 | var50 << 12) - 227 - 88 - 150 + 133 & 65534) >> 1
                                          | ((var50 & 65520) >> 4 | var50 << 12) - 227 - 88 - 150 + 133 << 15
                                    )
                                    & 57344
                              )
                              >> 13
                           | (
                                 (((var50 & 65520) >> 4 | var50 << 12) - 227 - 88 - 150 + 133 & 65534) >> 1
                                    | ((var50 & 65520) >> 4 | var50 << 12) - 227 - 88 - 150 + 133 << 15
                              )
                              << 3
                     )
                     + 141
               )
            );
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_346.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = -345878097 ^ 1819565752 ^ -2028597481; var35 < var19.length(); var35 += 1727032453 ^ 74009802 ^ 1654202446) {
            int var58 = var19.charAt(var35) - 137;
            int var82 = (var58 & 57344) >> 13;
            int var59 = (var58 & 57344) >> 13 | var58 << 3;
            int var83 = (((var58 & 57344) >> 13 | var58 << 3) & 65532) >> 2;
            char var60 = (char)(((((var82 | var58 << 3) & 65532) >> 2 | ((var58 & 57344) >> 13 | var58 << 3) << 14) - 138 - 95 ^ 150) - 238 - 232 - 85 - 37);
            var19.setCharAt(var35, (char)(((var83 | var59 << 14) - 138 - 95 ^ 150) - 238 - 232 - 85 - 37));
         }

         Class var7 = Class.forName(var19.toString(), false, Class_346.class.getClassLoader());
         switch (((var4 ^ 841845715 ^ 1097072565) - 1001412125 + 249509936 + 1175895966 ^ 952047204) + 262196537 + 1935920552 + 385361529 - 1258038549) {
            case 271475373:
            case 331878827:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 472128866:
               var10000 = var0.findSpecial(var7, var5, var6, Class_346.class);
               break;
            case 916287018:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            case 1333722545:
               var10000 = var0.findConstructor(var7, var6);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_1751[(var10 + 13705888 - 2003837022 - 83548181 - 1983860468 - 1994840391 ^ 1688705025 ^ 1389274620) - 1455975164 - 1870360297 - 1558496526] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1414(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 ^ 1764084351 ^ 864136028 ^ 220287016) - 344759745 ^ 1787371701) - 86677287 + 2048139497 + 952104158 + 571165650;
      MethodHandle var10000 = field_1751[((var10 ^ 1764084351 ^ 864136028 ^ 220287016) - 344759745 ^ 1787371701)
         - 86677287
         + 2048139497
         + 952104158
         + 571165650
         + 1148542927];
      if (field_1751[var10001 + 1148542927] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = -2051536392 - 1288926937 ^ 954503967; var24 < var14.length(); var24 += (1577817832 | 1581007108) ^ 1581242349) {
            int var43 = var14.charAt(var24);
            int var10004 = (var43 & 65024) >> 9;
            int var44 = ((var43 & 65024) >> 9 | var43 << 7) + 23;
            int var86 = (((var43 & 65024) >> 9 | var43 << 7) + 23 & 65535) >> 0;
            var43 = (((var10004 | var43 << 7) + 23 & 65535) >> 0 | ((var43 & 65024) >> 9 | var43 << 7) + 23 << 16) + 113;
            var10004 = ((var86 | var44 << 16) + 113 & 32768) >> 15;
            int var46 = (((var86 | var44 << 16) + 113 & 32768) >> 15 | var43 << 1) - 178 - 244 + 95 ^ 50;
            int var88 = (((((var86 | var44 << 16) + 113 & 32768) >> 15 | var43 << 1) - 178 - 244 + 95 ^ 50) & 65520) >> 4;
            char var47 = (char)(
               (((var10004 | var43 << 1) - 178 - 244 + 95 ^ 50) & 65520) >> 4
                  | ((((var86 | var44 << 16) + 113 & 32768) >> 15 | var43 << 1) - 178 - 244 + 95 ^ 50) << 12
            );
            var14.setCharAt(var24, (char)(var88 | var46 << 12));
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = (2098433531 >>> 2098433531 | 0) & -1960949984; var30 < var17.length(); var30 += -1045405903 ^ -1045405903 ^ 1) {
            int var52 = var17.charAt(var30);
            int var89 = (var52 & 65534) >> 1;
            int var53 = ((var52 & 65534) >> 1 | var52 << 15) - 204;
            int var90 = (((var52 & 65534) >> 1 | var52 << 15) - 204 & 65472) >> 6;
            var52 = ((var89 | var52 << 15) - 204 & 65472) >> 6 | ((var52 & 65534) >> 1 | var52 << 15) - 204 << 10;
            var89 = ((var90 | var53 << 10) & 64512) >> 10;
            int var55 = ((var90 | var53 << 10) & 64512) >> 10 | var52 << 6;
            int var92 = ((((var90 | var53 << 10) & 64512) >> 10 | var52 << 6) & 32768) >> 15;
            var52 = ((var89 | var52 << 6) & 32768) >> 15 | (((var90 | var53 << 10) & 64512) >> 10 | var52 << 6) << 1;
            var89 = ((var92 | var55 << 1) & 65534) >> 1;
            int var57 = ((var92 | var55 << 1) & 65534) >> 1 | var52 << 15;
            int var94 = ((((var92 | var55 << 1) & 65534) >> 1 | var52 << 15) & 65532) >> 2;
            char var58 = (char)(((((var89 | var52 << 15) & 65532) >> 2 | (((var92 | var55 << 1) & 65534) >> 1 | var52 << 15) << 14) ^ 90) - 182 ^ 185);
            var17.setCharAt(var30, (char)(((var94 | var57 << 14) ^ 90) - 182 ^ 185));
         }

         Class var6 = Class.forName(var17.toString(), false, Class_346.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = 1142665093 << -659076530 ^ -337559552; var36 < var20.length(); var36 += -976693269 >> (-657146113 | 1862696146) ^ -2) {
            char var63 = var20.charAt(var36);
            int var95 = (var63 & '￠') >> 5;
            int var64 = ((var63 & '￠') >> 5 | var63 << 11) + 143 ^ 16;
            int var96 = ((((var63 & '￠') >> 5 | var63 << 11) + 143 ^ 16) & 63488) >> 11;
            var63 = (char)(
               ((((((var95 | var63 << 11) + 143 ^ 16) & 63488) >> 11 | (((var63 & '￠') >> 5 | var63 << 11) + 143 ^ 16) << 5) ^ 167 ^ 72) + 65 + 20 ^ 31) + 11
            );
            var20.setCharAt(var36, (char)((((var96 | var64 << 5) ^ 167 ^ 72) + 65 + 20 ^ 31) + 11));
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_346.class.getClassLoader()).returnType();
         switch (((var4 + 54630024 ^ 1162498716) - 1065511799 - 1452078831 - 725052025 + 1440940927 + 200312858 ^ 458764613 ^ 1177180971) - 841405868) {
            case 672757420:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            case 725224965:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            case 752593534:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            case 1295418310:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_1751[((var10 ^ 1764084351 ^ 864136028 ^ 220287016) - 344759745 ^ 1787371701) - 86677287 + 2048139497 + 952104158 + 571165650 + 1148542927] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
