import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;
import net.minecraft.class_11908;
import net.minecraft.class_11909;

public class Class_182 extends Class_281 {
   // $VF: renamed from: tsk Class_414
   public Class_414 field_2466;
   // $VF: renamed from: yqz int
   public int field_2467;
   // $VF: renamed from: ti int
   public int field_2468;
   // $VF: renamed from: laq int
   public int field_2469;
   // $VF: renamed from: zp int
   public int field_2470;
   // $VF: renamed from: ixp int
   public int field_2471;
   // $VF: renamed from: pg Class_262
   public Class_262 field_2472;
   // $VF: renamed from: zgv int[]
   public int[] field_2473;
   // $VF: renamed from: ikn boolean
   public boolean field_2474;
   // $VF: renamed from: nz boolean
   public boolean field_2475;
   // $VF: renamed from: dc double
   public double field_2476;
   // $VF: renamed from: jpk double
   public double field_2477;
   // $VF: renamed from: qlj double
   public double field_2478;
   // $VF: renamed from: gek double
   public double field_2479;
   // $VF: renamed from: uik int[]
   public int[] field_2480;
   // $VF: renamed from: fvf java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_2482 = new MethodHandle[(1766086882 - 1766086882 | 238) & -519739906];

   public Class_182(Class_110 var1, Class_414 var2) {
      int var10 = -918545011;
      this.field_2481 = var1;
      String var9 = 0<"JNT",-2057832273,"Ⱬ⬛⩻ⲫⲫ⭻ⳋ⧛⮻ⳛ⭻","滥\u0ee4\ueed7⻜ໝ껛ໝ令\ueedbໝ껜仝令컖\ueeda⻛ໜ껜仝컡","聢㡬硥㡬硷\uf867㡬硧쁢硷롭\uf865硨䁢硧쁢",-1285074210>(
         0<"JNT",-2057832273,"⮋⭫ⰻ","滥\u0ee4\ueed7⻜ໝ껛ໝ令\ueedbໝ껜仝令컖\ueeda⻛ໜ껜仝컡","碞硩",-1285074207>(var2)
      );
      StringBuilder var10001 = (StringBuilder)0<"JNT",-1736728358,"⟫⬻⬋⬻Ⱬ⠋","滥\u0ee4껗","聢㡬硥㡬硷\uf867㡬硧쁢硷롭\uf865硨䁢硧쁢硴㡥䁢\uf867\uf869㡩硨",-1285074209>();
      int var10002 = 0;

      StringBuilder var10003;
      for (var10003 = (StringBuilder)0<"JNT",-1736728358,"⟫⬻⬋⬻Ⱬ⠋","滥\ueed7⻜ໝ껛ໝ令\ueedbໝ껜仝令컖\ueeda⻛ໜ껜仝컡\u0ee4껗","聢㡬硥㡬硷\uf867㡬硧쁢硷롭\uf865硨䁢硧쁢硴㡥䁢\uf867\uf869㡩硨",-1285074228>(
            "怈ꀍ\uf00dꀍ倍뀊뀏쀍怎\ue00d\u000e倍퀈뀊"
         );
         var10002 < ((134778929 | 1170886628) ^ 1305141243);
         var10002 += (52346022 * -489944418 | 1) & -419430007
      ) {
         char var14 = 0<"JNT",-2057832273,"⯛⬫⮻ⳋ⦻Ⱬ","滥໘\u0ee4컘","聢㡬硥㡬硷\uf867㡬硧쁢硷롭\uf865硨䁢硧쁢硴㡥䁢\uf867\uf869㡩硨",-1285076676>(var10003, var10002);
         char var15 = (char)((((var14 & '\uf000') >> 12 | var14 << 4) ^ 145 ^ 45) + 229 - 220);
         0<"JNT",-2057832273,"ⳛ⭻Ⱬ⧛⬫⮻ⳋ⦻Ⱬ","滥໘컘\u0ee4껗","聢㡬硥㡬硷\uf867㡬硧쁢硷롭\uf865硨䁢硧쁢硴㡥䁢\uf867\uf869㡩硨",-1285074235>(
            var10003, var10002, (char)((((var14 & '\uf000') >> 12 | var14 << 4) ^ 145 ^ 45) + 229 - 220)
         );
      }

      super(
         0<"JNT",-2057832273,"Ⱬ⬛⫛Ⱬⳋ⬻⬋⮛","滥\u0ee4\ueed7⻜ໝ껛ໝ令\ueedbໝ껜仝令컖\ueeda⻛ໜ껜仝컡","聢㡬硥㡬硷\uf867㡬硧쁢硷롭\uf865硨䁢硧쁢硴㡥䁢\uf867\uf869㡩硨",-1285074208>(
            0<"JNT",-2057832273,"⮻ⲫⲫ⭻⬋⭫","滥\ueed7⻜ໝ껛ໝ令\ueedbໝ껜仝令付⻝⻜軝컜\ueeda컡\u0ee4\ueed7⻜ໝ껛ໝ令\ueedbໝ껜仝令컖\ueeda⻛ໜ껜仝⻙軛ໜ\ueedb\ueedc軝⻛컡","聢㡬硥㡬硷\uf867㡬硧쁢硷롭\uf865硨䁢硧쁢硴㡥䁢\uf867\uf869㡩硨",-1285074221>(
               0<"JNT",-2057832273,"⮻ⲫⲫ⭻⬋⭫","滥\ueed7⻜ໝ껛ໝ令\ueedbໝ껜仝令컖\ueeda⻛ໜ껜仝컡\u0ee4\ueed7⻜ໝ껛ໝ令\ueedbໝ껜仝令컖\ueeda⻛ໜ껜仝⻙軛ໜ\ueedb\ueedc軝⻛컡","聢㡬硥㡬硷\uf867㡬硧쁢硷롭\uf865硨䁢硧쁢硴㡥䁢\uf867\uf869㡩硨",-1285074222>(
                  var10001,
                  0<"JNT",-2057832273,"Ⱬ⬛⫛Ⱬⳋ⬻⬋⮛","滥\u0ee4\ueed7⻜ໝ껛ໝ令\ueedbໝ껜仝令컖\ueeda⻛ໜ껜仝컡","聢㡬硥㡬硷\uf867㡬硧쁢硷롭\uf865硨䁢硧쁢硴㡥䁢\uf867\uf869㡩硨",-1285074219>(var10003)
               ),
               var9
            )
         )
      );
      this.field_2467 = 20;
      this.field_2468 = 200;
      this.field_2469 = 20;
      this.field_2470 = 15;
      this.field_2471 = 4;
      this.field_2474 = false;
      this.field_2475 = false;
      this.field_2479 = -1.0;
      this.field_2466 = var2;
      this.field_2472 = 0<"JNT",-2057832273,"⯛⯋⮻⮻","滥\u0ee4\ueed7滜仛컡","\uf864뢞",-1285074218>(0<"JNT",-2057832273,"⫻","滥\u0ee4\ueed7滜仛컡","碞硩",-1285074215>(var2));
      Class_262 var3 = 0<"JNT",-2057832273,"⫻","滥\u0ee4\ueed7滜仛컡","碞硩",-1285074217>(var2);
      float[] var4 = 0<"JNT",-1125373344,"ⰫⰫⰻ","滥໘໘໘컕껙\u0ee4컕껙","\uf864뢞",-1285074229>(
         1<"JNT",685411425,"ऀ߀ी","⏘⌸","귉귋괋",1142375971>(var3),
         1<"JNT",685411425,"\u0b00ঀ\u0a80","⏘⌸","귉귋괋",1142375968>(var3),
         1<"JNT",685411425,"ࠀీ","⏘⌸","귉귋괋",1142375965>(var3),
         null
      );
      this.field_2476 = 0<"JNT",-2057832273,"⭛","滥\u0ee4\ueed8","碞硩",-1285074216>(var2);
      this.field_2477 = (double)var4[1];
      this.field_2478 = (double)var4[2];
      byte var5 = 50;
      this.field_2473 = new int[var5];
      int var6 = 0;

      label25:
      while (true) {
         var10 = 1113045154;

         while (true) {
            switch (var10 + 1642957501 + 594018579 - 343987803 + 1826037022 - 1635269134 ^ 1146650175) {
               case -86823144:
               default:
                  if (var6 < var5) {
                     double var7 = (double)var6 / (double)var5 * 360.0;
                     1<"JNT",685411425,"ೀࠀீ","᱘᱘","귉귋괯괋",1142375980>(this)[var6] = 0<"JNT",-2057832273,"⭋ⳋⳛ","滥\u0ee4໘","\uf864뢞",-1285074225>(
                        0<"JNT",-1125373344,"ⲫⲫ⭻","滥\ueed8\ueed8\ueed8\u0ee4\ueed7滜仛컡","\uf864뢞",-1285074226>(var7, 1.0, 1.0)
                     );
                     var6++;
                     continue label25;
                  }

                  var10 = (122228027 | 122228027 | -450862820) & -38373412;
                  break;
               case 621511582:
                  return;
            }
         }
      }
   }

   // $VF: renamed from: rvj () int
   @Override
   public int method_2006() {
      byte var1 = 70;
      byte var2 = 8;
      int var3 = var1 * 3 + var2 * 2;
      int var4 = var3 + 40;
      short var5 = 275;
      return 0<"JNT",-1125373344,"⫻⮻Ⱛ","滥໘໘\u0ee4໘","聢㡬硥㡬硷\uf867㡬硧쁢硷㡯㡬\uf865\uf866",-1285076670>(var4, var5);
   }

   // $VF: renamed from: hc () int
   @Override
   public int method_2007() {
      return 370;
   }

   // $VF: renamed from: sz () void
   public void method_2034() {
      Class_262 var1 = 0<"JNT",-1125373344,"ⲫⲫ⭻","滥\ueed8\ueed8\ueed8\u0ee4\ueed7滜仛컡","\uf864뢞",-1285074234>(
         1<"JNT",685411425,"݀܀","᱘᱘","귉귋괁",1142375978>(this),
         1<"JNT",685411425,"ࣀੀऀ","᱘᱘","귉귋괁",1142375991>(this),
         1<"JNT",685411425,"\u0a80ीࣀ","᱘᱘","귉귋괁",1142375988>(this)
      );
      1<"JNT",2144288132,"\u0a80ࠀ","⏘⌸","귉귋괋",1142375990>(var1, 255);
      0<"JNT",-2057832273,"⬛","滥\ueed7滜仛컡\u0ee4껗","碞硩",-1285076675>(1<"JNT",685411425,"ୀ\u0b00ऀ","᱘᱘","귉귋광국굅귯",1142375987>(this), var1);
      0<"JNT",-2057832273,"ⳛ⬻","滥\ueed8\u0ee4껗","碞硩",-1285076664>(
         1<"JNT",685411425,"ୀ\u0b00ऀ","᱘᱘","귉귋광국굅귯",1142375981>(this), 1<"JNT",685411425,"݀܀","᱘᱘","귉귋괁",1142375986>(this)
      );
   }

   // $VF: renamed from: yeu () void
   public void method_2035() {
      int var8 = -1446730639;
      if (!(
         0<"JNT",-1125373344,"⮻⯋ⳛ","滥\ueed8\u0ee4\ueed8","聢㡬硥㡬硷\uf867㡬硧쁢硷㡯㡬\uf865\uf866",-1285076673>(
               1<"JNT",685411425,"ࠀހऀ","᱘᱘","귉귋괁",1142375996>(this) - 1<"JNT",685411425,"݀܀","᱘᱘","귉귋괁",1142375993>(this)
            )
            < 0.01
      )) {
         1<"JNT",2144288132,"ࠀހऀ","᱘᱘","귉귋괁",1142376004>(this, 1<"JNT",685411425,"݀܀","᱘᱘","귉귋괁",1142376007>(this));
         byte var1 = 50;
         1<"JNT",2144288132,"\u0b80ࢀऀ","᱘᱘","귉귋괯괋",1142376001>(this, new int[var1 * var1]);
         int var2 = 0;

         label46:
         while (true) {
            var8 = 2102816276 + 2102816276 ^ 1119457684;

            while (true) {
               switch ((var8 ^ 1130433083 ^ 48566286) - 1876666374 + 780308064 - 879226409 + 1045855475) {
                  case -1037644627:
                  default:
                     if (var2 < var1) {
                        int var3 = 0;

                        label43:
                        while (true) {
                           var8 = 1172641494 >>> 1172641494 ^ 1914451630;

                           while (true) {
                              switch ((var8 ^ 1171559083 ^ 1592443568) - 2096623232 + 1864409706 - 849824389 - 593551747) {
                                 case 88272772:
                                    if (var3 < var1) {
                                       double var4 = (double)var3 / (double)var1;
                                       double var6 = 1.0 - (double)var2 / (double)var1;
                                       1<"JNT",685411425,"\u0b80ࢀऀ","᱘᱘","귉귋괯괋",1142375995>(this)[var2 * var1 + var3] = 0<"JNT",-2057832273,"⭋ⳋⳛ","滥\u0ee4໘","\uf864뢞",-1285054157>(
                                          0<"JNT",-1125373344,"ⲫⲫ⭻","滥\ueed8\ueed8\ueed8\u0ee4\ueed7滜仛컡","\uf864뢞",-1285054158>(
                                             1<"JNT",685411425,"݀܀","᱘᱘","귉귋괁",1142375992>(this), var4, var6
                                          )
                                       );
                                       var3++;
                                       continue label43;
                                    }

                                    var8 = -699387974;
                                    break;
                                 case 1770981251:
                                 default:
                                    var2++;
                                    continue label46;
                              }
                           }
                        }
                     }

                     var8 = -312203884;
                     break;
                  case 1970648261:
                     return;
               }
            }
         }
      }
   }

   // $VF: renamed from: pn (RenderEngine_216, int, int, int, int, int, int, float) void
   @Override
   public void method_2010(RenderEngine_216 var1, int var2, int var3, int var4, int var5, int var6, int var7, float var8) {
      int var38 = -910580188;
      int var9 = var3 + 14;
      int var10 = var2 + 20;
      0<"JNT",-2057832273,"ⰻ⭻ⱻ","滥\u0ee4껗","\uf867\uf867",-1285054102>(this);
      0<"JNT",-2057832273,"⬋⫫","滥\ueed7軜껛컡໘໘໘໘\u0ee4껗","\uf867\uf867",-1285054101>(this, var1, var10, var9, 200, 200);
      int var12 = var10 + 200 + 15;
      0<"JNT",-2057832273,"⮻ⲋⲋ","滥\ueed7軜껛컡໘໘໘໘\u0ee4껗","\uf867\uf867",-1285054344>(this, var1, var12, var9, 20, 200);
      int var14 = var9 + 200 + 15;
      int var15 = (var4 - 40 - 15) / 2;
      byte var16 = 30;
      0<"JNT",-2057832273,"⬋⯛⭫","滥\ueed7滜仛컡\ueed8\ueed8\ueed8\ueed8\ueed8\ueed8\ueed8\ueed8\u0ee4껗","㡧硥",-1285054354>(
         var1,
         (Class_262)0<"JNT",-1736728358,"⟫⬻⬋⬻Ⱬ⠋","滥໘໘໘\u0ee4껗","\uf864뢞",-1285054351>(50, 50, 55),
         (double)(var10 - 1),
         (double)(var14 - 1),
         (double)(var10 + var15 + 1),
         (double)(var14 + var16 + 1),
         4.0,
         4.0,
         4.0,
         4.0
      );
      0<"JNT",-2057832273,"⬋⯛⭫","滥\ueed7滜仛컡\ueed8\ueed8\ueed8\ueed8\ueed8\ueed8\ueed8\ueed8\u0ee4껗","㡧硥",-1285054106>(
         var1,
         (Class_262)0<"JNT",-1736728358,"⟫⬻⬋⬻Ⱬ⠋","滥໘໘໘\u0ee4껗","\uf864뢞",-1285054103>(
            1<"JNT",685411425,"ऀ߀ी","⏘⌸","귉귋괋",1142375947>(1<"JNT",685411425,"ੀࠀ","᱘᱘","귉귋광굙굧귯",1142375950>(this)),
            1<"JNT",685411425,"\u0b00ঀ\u0a80","⏘⌸","귉귋괋",1142375941>(1<"JNT",685411425,"ੀࠀ","᱘᱘","귉귋광굙굧귯",1142375944>(this)),
            1<"JNT",685411425,"ࠀీ","⏘⌸","귉귋괋",1142375959>(1<"JNT",685411425,"ੀࠀ","᱘᱘","귉귋광굙굧귯",1142375946>(this))
         ),
         (double)var10,
         (double)var14,
         (double)(var10 + var15),
         (double)(var14 + var16),
         3.0,
         3.0,
         3.0,
         3.0
      );
      Class_262 var17 = (Class_262)0<"JNT",-1736728358,"⟫⬻⬋⬻Ⱬ⠋","滥໘໘໘໘\u0ee4껗","\uf864뢞",-1285054105>(150, 150, 150, 255);
      int var10001 = (-624213168 << -624213168 | 0) & -1809533334;

      StringBuilder var10002;
      for (var10002 = (StringBuilder)0<"JNT",-1736728358,"⟫⬻⬋⬻Ⱬ⠋","滥\ueed7⻜ໝ껛ໝ令\ueedbໝ껜仝令컖\ueeda⻛ໜ껜仝컡\u0ee4껗","聢㡬硥㡬硷\uf867㡬硧쁢硷롭\uf865硨䁢硧쁢硴㡥䁢\uf867\uf869㡩硨",-1285054124>(
            "♊㣊㍊㉊㍊㛊⽊㗊"
         );
         var10001 < (1114785197 >> 1114785197 ^ 136090);
         var10001 += -1048883390 >> (-1129952364 | 205493121) ^ -502
      ) {
         int var76 = ((0<"JNT",-2057832273,"⯛⬫⮻ⳋ⦻Ⱬ","滥໘\u0ee4컘","聢㡬硥㡬硷\uf867㡬硧쁢硷롭\uf865硨䁢硧쁢硴㡥䁢\uf867\uf869㡩硨",-1285054328>(var10002, var10001) ^ 244) + 87 ^ 42)
            + 65;
         char var77 = (char)((var76 & 65408) >> 7 | var76 << 9);
         0<"JNT",-2057832273,"ⳛ⭻Ⱬ⧛⬫⮻ⳋ⦻Ⱬ","滥໘컘\u0ee4껗","聢㡬硥㡬硷\uf867㡬硧쁢硷롭\uf865硨䁢硧쁢硴㡥䁢\uf867\uf869㡩硨",-1285054335>(
            var10002, var10001, (char)((var76 & 65408) >> 7 | var76 << 9)
         );
      }

      double var18 = 0<"JNT",-2057832273,"ⰻⱻ⭋","滥\ueed7⻜ໝ껛ໝ令\ueedbໝ껜仝令컖\ueeda⻛ໜ껜仝컡\u0ee4\ueed8","㡧硥",-1285054175>(
         var1, 0<"JNT",-2057832273,"Ⱬ⬛⫛Ⱬⳋ⬻⬋⮛","滥\u0ee4\ueed7⻜ໝ껛ໝ令\ueedbໝ껜仝令컖\ueeda⻛ໜ껜仝컡","聢㡬硥㡬硷\uf867㡬硧쁢硷롭\uf865硨䁢硧쁢硴㡥䁢\uf867\uf869㡩硨",-1285054168>(var10002)
      );
      var10001 = (1503018371 ^ 1503018371 | 0) & -860246983;

      for (var10002 = (StringBuilder)0<"JNT",-1736728358,"⟫⬻⬋⬻Ⱬ⠋","滥\ueed7⻜ໝ껛ໝ令\ueedbໝ껜仝令컖\ueeda⻛ໜ껜仝컡\u0ee4껗","聢㡬硥㡬硷\uf867㡬硧쁢硷롭\uf865硨䁢硧쁢硴㡥䁢\uf867\uf869㡩硨",-1285054178>(
            "胬郪⃪ë⃪僪ꃫ냪"
         );
         var10001 < ((695251684 >> -804869673 - -53819187 | 8) & -621706616);
         var10001 += -611271395 >>> -611271395 ^ 7
      ) {
         int var80 = 0<"JNT",-2057832273,"⯛⬫⮻ⳋ⦻Ⱬ","滥໘\u0ee4컘","聢㡬硥㡬硷\uf867㡬硧쁢硷롭\uf865硨䁢硧쁢硴㡥䁢\uf867\uf869㡩硨",-1285054182>(var10002, var10001) - 250;
         char var81 = (char)((((var80 & 61440) >> 12 | var80 << 4) ^ 18) + 247 ^ 99);
         0<"JNT",-2057832273,"ⳛ⭻Ⱬ⧛⬫⮻ⳋ⦻Ⱬ","滥໘컘\u0ee4껗","聢㡬硥㡬硷\uf867㡬硧쁢硷롭\uf865硨䁢硧쁢硴㡥䁢\uf867\uf869㡩硨",-1285054181>(
            var10002, var10001, (char)((((var80 & 61440) >> 12 | var80 << 4) ^ 18) + 247 ^ 99)
         );
      }

      0<"JNT",-2057832273,"⮛⬫","滥\ueed7⻜ໝ껛ໝ令\ueedbໝ껜仝令컖\ueeda⻛ໜ껜仝컡\ueed8\ueed8\ueed7滜仛컡\u0ee4\ueed8","㡧硥",-1285054159>(
         var1,
         0<"JNT",-2057832273,"Ⱬ⬛⫛Ⱬⳋ⬻⬋⮛","滥\u0ee4\ueed7⻜ໝ껛ໝ令\ueedbໝ껜仝令컖\ueeda⻛ໜ껜仝컡","聢㡬硥㡬硷\uf867㡬硧쁢硷롭\uf865硨䁢硧쁢硴㡥䁢\uf867\uf869㡩硨",-1285054152>(var10002),
         (double)(var10 + var15 / 2) - var18 / 2.0,
         (double)(var14 + var16 + 5),
         var17
      );
      Class_262 var20 = 0<"JNT",-2057832273,"⫻","滥\u0ee4\ueed7滜仛컡","碞硩",-1285054161>(1<"JNT",685411425,"ୀ\u0b00ऀ","᱘᱘","귉귋광국굅귯",1142376009>(this));
      int var21 = var10 + var15 + 15;
      0<"JNT",-2057832273,"⬋⯛⭫","滥\ueed7滜仛컡\ueed8\ueed8\ueed8\ueed8\ueed8\ueed8\ueed8\ueed8\u0ee4껗","㡧硥",-1285054171>(
         var1,
         (Class_262)0<"JNT",-1736728358,"⟫⬻⬋⬻Ⱬ⠋","滥໘໘໘\u0ee4껗","\uf864뢞",-1285054180>(50, 50, 55),
         (double)(var21 - 1),
         (double)(var14 - 1),
         (double)(var21 + var15 + 1),
         (double)(var14 + var16 + 1),
         4.0,
         4.0,
         4.0,
         4.0
      );
      0<"JNT",-2057832273,"⬋⯛⭫","滥\ueed7滜仛컡\ueed8\ueed8\ueed8\ueed8\ueed8\ueed8\ueed8\ueed8\u0ee4껗","㡧硥",-1285054170>(
         var1,
         (Class_262)0<"JNT",-1736728358,"⟫⬻⬋⬻Ⱬ⠋","滥໘໘໘\u0ee4껗","\uf864뢞",-1285054167>(
            1<"JNT",685411425,"ऀ߀ी","⏘⌸","귉귋괋",1142376005>(var20),
            1<"JNT",685411425,"\u0b00ঀ\u0a80","⏘⌸","귉귋괋",1142376010>(var20),
            1<"JNT",685411425,"ࠀీ","⏘⌸","귉귋괋",1142376023>(var20)
         ),
         (double)var21,
         (double)var14,
         (double)(var21 + var15),
         (double)(var14 + var16),
         3.0,
         3.0,
         3.0,
         3.0
      );
      var10001 = (164792789 * -167976577 | 0) & 100682308;

      for (var10002 = (StringBuilder)0<"JNT",-1736728358,"⟫⬻⬋⬻Ⱬ⠋","滥\ueed7⻜ໝ껛ໝ令\ueedbໝ껜仝令컖\ueeda⻛ໜ껜仝컡\u0ee4껗","聢㡬硥㡬硷\uf867㡬硧쁢硷롭\uf865硨䁢硧쁢硴㡥䁢\uf867\uf869㡩硨",-1285054169>(
            "佼䔼㦼"
         );
         var10001 < (-1548529000 - 585952192 ^ -2134481189);
         var10001 += -1638938987 - 1117794567 ^ 1538233743
      ) {
         char var84 = 0<"JNT",-2057832273,"⯛⬫⮻ⳋ⦻Ⱬ","滥໘\u0ee4컘","聢㡬硥㡬硷\uf867㡬硧쁢硷롭\uf865硨䁢硧쁢硴㡥䁢\uf867\uf869㡩硨",-1285054349>(var10002, var10001);
         int var149 = (var84 & '︀') >> 9;
         int var85 = (((var84 & '︀') >> 9 | var84 << 7) ^ 188) + 228 + 138;
         int var150 = ((((var84 & '︀') >> 9 | var84 << 7) ^ 188) + 228 + 138 & 57344) >> 13;
         var84 = (char)((((var149 | var84 << 7) ^ 188) + 228 + 138 & 57344) >> 13 | (((var84 & '︀') >> 9 | var84 << 7) ^ 188) + 228 + 138 << 3);
         0<"JNT",-2057832273,"ⳛ⭻Ⱬ⧛⬫⮻ⳋ⦻Ⱬ","滥໘컘\u0ee4껗","聢㡬硥㡬硷\uf867㡬硧쁢硷롭\uf865硨䁢硧쁢硴㡥䁢\uf867\uf869㡩硨",-1285054336>(
            var10002, var10001, (char)(var150 | var85 << 3)
         );
      }

      double var22 = 0<"JNT",-2057832273,"ⰻⱻ⭋","滥\ueed7⻜ໝ껛ໝ令\ueedbໝ껜仝令컖\ueeda⻛ໜ껜仝컡\u0ee4\ueed8","㡧硥",-1285054337>(
         var1, 0<"JNT",-2057832273,"Ⱬ⬛⫛Ⱬⳋ⬻⬋⮛","滥\u0ee4\ueed7⻜ໝ껛ໝ令\ueedbໝ껜仝令컖\ueeda⻛ໜ껜仝컡","聢㡬硥㡬硷\uf867㡬硧쁢硷롭\uf865硨䁢硧쁢硴㡥䁢\uf867\uf869㡩硨",-1285054338>(var10002)
      );
      var10001 = -1998351265 * -1998351265 ^ 1719139137;

      for (var10002 = (StringBuilder)0<"JNT",-1736728358,"⟫⬻⬋⬻Ⱬ⠋","滥\ueed7⻜ໝ껛ໝ令\ueedbໝ껜仝令컖\ueeda⻛ໜ껜仝컡\u0ee4껗","聢㡬硥㡬硷\uf867㡬硧쁢硷롭\uf865硨䁢硧쁢硴㡥䁢\uf867\uf869㡩硨",-1285054356>(
            "텿\udcff\ue5ff"
         );
         var10001 < (-359377136 & -1764645638 ^ -2104490989);
         var10001 += -715642139 + 1041091036 ^ 325448896
      ) {
         char var89 = 0<"JNT",-2057832273,"⯛⬫⮻ⳋ⦻Ⱬ","滥໘\u0ee4컘","聢㡬硥㡬硷\uf867㡬硧쁢硷롭\uf865硨䁢硧쁢硴㡥䁢\uf867\uf869㡩硨",-1285054192>(var10002, var10001);
         char var92 = (char)(
            (
                  (((((var89 & 0) >> 16 | var89 << 0) & 64512) >> 10 | ((var89 & 0) >> 16 | var89 << 0) << 6) & 57344) >> 13
                     | ((((var89 & 0) >> 16 | var89 << 0) & 64512) >> 10 | ((var89 & 0) >> 16 | var89 << 0) << 6) << 3
               )
               + 176
               - 4
         );
         0<"JNT",-2057832273,"ⳛ⭻Ⱬ⧛⬫⮻ⳋ⦻Ⱬ","滥໘컘\u0ee4껗","聢㡬硥㡬硷\uf867㡬硧쁢硷롭\uf865硨䁢硧쁢硴㡥䁢\uf867\uf869㡩硨",-1285054199>(
            var10002,
            var10001,
            (char)(
               (
                     (((((var89 & 0) >> 16 | var89 << 0) & 64512) >> 10 | ((var89 & 0) >> 16 | var89 << 0) << 6) & 57344) >> 13
                        | ((((var89 & 0) >> 16 | var89 << 0) & 64512) >> 10 | ((var89 & 0) >> 16 | var89 << 0) << 6) << 3
                  )
                  + 176
                  - 4
            )
         );
      }

      0<"JNT",-2057832273,"⮛⬫","滥\ueed7⻜ໝ껛ໝ令\ueedbໝ껜仝令컖\ueeda⻛ໜ껜仝컡\ueed8\ueed8\ueed7滜仛컡\u0ee4\ueed8","㡧硥",-1285054191>(
         var1,
         0<"JNT",-2057832273,"Ⱬ⬛⫛Ⱬⳋ⬻⬋⮛","滥\u0ee4\ueed7⻜ໝ껛ໝ令\ueedbໝ껜仝令컖\ueeda⻛ໜ껜仝컡","聢㡬硥㡬硷\uf867㡬硧쁢硷롭\uf865硨䁢硧쁢硴㡥䁢\uf867\uf869㡩硨",-1285054184>(var10002),
         (double)(var21 + var15 / 2) - var22 / 2.0,
         (double)(var14 + var16 + 5),
         var17
      );
      byte var24 = 70;
      byte var25 = 8;
      int var26 = 1<"JNT",685411425,"ࡀࢀ\u0a80݀","᱘᱘","귉귋괋",1142376169>(this) + 0<"JNT",-2057832273,"⬫⯛","滥\u0ee4໘","\uf867\uf867",-1285054193>(this) - 45;
      byte var27 = 30;
      int var28 = var2 + var4 - var24 - 20;
      int var29 = var28 - var24 - var25;
      int var30 = var29 - var24 - var25;
      Class_262 var31 = (Class_262)0<"JNT",-1736728358,"⟫⬻⬋⬻Ⱬ⠋","滥໘໘໘໘\u0ee4껗","\uf864뢞",-1285054340>(245, 245, 245, 255);
      0<"JNT",-2057832273,"⬋⯛⭫","滥\ueed7滜仛컡\ueed8\ueed8\ueed8\ueed8\ueed8\ueed8\ueed8\ueed8\u0ee4껗","㡧硥",-1285054334>(
         var1,
         0<"JNT",-1125373344,"ⳋⱻ⬛","滥໘໘\u0ee4\ueed7滜仛컡","硬롩",-1285054203>(255, 1),
         (double)var28,
         (double)var26,
         (double)(var28 + var24),
         (double)(var26 + var27),
         5.0,
         5.0,
         5.0,
         5.0
      );
      var10001 = -114605362 * 878324178 ^ -1482962180;

      for (var10002 = (StringBuilder)0<"JNT",-1736728358,"⟫⬻⬋⬻Ⱬ⠋","滥\ueed7⻜ໝ껛ໝ令\ueedbໝ껜仝令컖\ueeda⻛ໜ껜仝컡\u0ee4껗","聢㡬硥㡬硷\uf867㡬硧쁢硷롭\uf865硨䁢硧쁢硴㡥䁢\uf867\uf869㡩硨",-1285054333>(
            "唜挜瘜朜"
         );
         var10001 < ((-1699171183 & 1362558790 | 4) & 713704389);
         var10001 += 1249877480 & 777786198 ^ 173805889
      ) {
         char var95 = 0<"JNT",-2057832273,"⯛⬫⮻ⳋ⦻Ⱬ","滥໘\u0ee4컘","聢㡬硥㡬硷\uf867㡬硧쁢硷롭\uf865硨䁢硧쁢硴㡥䁢\uf867\uf869㡩硨",-1285054202>(var10002, var10001);
         char var98 = (char)(
            ((((((var95 & 'ﰀ') >> 10 | var95 << 6) & 65408) >> 7 | ((var95 & 'ﰀ') >> 10 | var95 << 6) << 9) ^ 184) - 182 & 65408) >> 7
               | (((((var95 & 'ﰀ') >> 10 | var95 << 6) & 65408) >> 7 | ((var95 & 'ﰀ') >> 10 | var95 << 6) << 9) ^ 184) - 182 << 9
         );
         0<"JNT",-2057832273,"ⳛ⭻Ⱬ⧛⬫⮻ⳋ⦻Ⱬ","滥໘컘\u0ee4껗","聢㡬硥㡬硷\uf867㡬硧쁢硷롭\uf865硨䁢硧쁢硴㡥䁢\uf867\uf869㡩硨",-1285054201>(
            var10002,
            var10001,
            (char)(
               ((((((var95 & 'ﰀ') >> 10 | var95 << 6) & 65408) >> 7 | ((var95 & 'ﰀ') >> 10 | var95 << 6) << 9) ^ 184) - 182 & 65408) >> 7
                  | (((((var95 & 'ﰀ') >> 10 | var95 << 6) & 65408) >> 7 | ((var95 & 'ﰀ') >> 10 | var95 << 6) << 9) ^ 184) - 182 << 9
            )
         );
      }

      double var32 = 0<"JNT",-2057832273,"ⰻⱻ⭋","滥\ueed7⻜ໝ껛ໝ令\ueedbໝ껜仝令컖\ueeda⻛ໜ껜仝컡\u0ee4\ueed8","㡧硥",-1285054166>(
         var1, 0<"JNT",-2057832273,"Ⱬ⬛⫛Ⱬⳋ⬻⬋⮛","滥\u0ee4\ueed7⻜ໝ껛ໝ令\ueedbໝ껜仝令컖\ueeda⻛ໜ껜仝컡","聢㡬硥㡬硷\uf867㡬硧쁢硷롭\uf865硨䁢硧쁢硴㡥䁢\uf867\uf869㡩硨",-1285054163>(var10002)
      );
      RenderEngine_216 var10000 = var1;
      var10001 = (1925812256 & -1614860585 | 0) & -1538065485;
      var10002 = (StringBuilder)0<"JNT",-1736728358,"⟫⬻⬋⬻Ⱬ⠋","滥\ueed7⻜ໝ껛ໝ令\ueedbໝ껜仝令컖\ueeda⻛ໜ껜仝컡\u0ee4껗","聢㡬硥㡬硷\uf867㡬硧쁢硷롭\uf865硨䁢硧쁢硴㡥䁢\uf867\uf869㡩硨",-1285054165>(
         "\ua7ed쏭\ueded쯭"
      );

      label82:
      while (true) {
         var38 = (2048177526 >>> 2048177526 | 463177728) & 2145386165;

         while (true) {
            label77: {
               StringBuilder var54;
               switch ((var38 - 1486567159 ^ 1816634646) + 1959161280 + 47464655 + 227626577 ^ 1328670615) {
                  case -146662585:
                     var54 = var10002;
                     if (var10001 < (-534830476 + -1437119055 ^ -1971949533)) {
                        int var124 = (
                              0<"JNT",-2057832273,"⯛⬫⮻ⳋ⦻Ⱬ","滥໘\u0ee4컘","聢㡬硥㡬硷\uf867㡬硧쁢硷롭\uf865硨䁢硧쁢硴㡥䁢\uf867\uf869㡩硨",-1285054188>(var10002, var10001) - ','
                                 ^ 93
                           )
                           - 91;
                        char var125 = (char)(((var124 & 49152) >> 14 | var124 << 2) ^ 240);
                        0<"JNT",-2057832273,"ⳛ⭻Ⱬ⧛⬫⮻ⳋ⦻Ⱬ","滥໘컘\u0ee4껗","聢㡬硥㡬硷\uf867㡬硧쁢硷롭\uf865硨䁢硧쁢硴㡥䁢\uf867\uf869㡩硨",-1285054179>(
                           var10002, var10001, (char)(((var124 & 49152) >> 14 | var124 << 2) ^ 240)
                        );
                        var10001 += (1941458559 * 236724951 | 0) & -2130443245;
                        break label77;
                     }

                     var38 = (378007633 >>> -1801434034 | -1924936366) & -1923354638;
                     break;
                  case 2067928584:
                  default:
                     var54 = var10002;
                     if (var10001 < (84126738 + 1156878285 ^ 1241005019)) {
                        int var101 = 0<"JNT",-2057832273,"⯛⬫⮻ⳋ⦻Ⱬ","滥໘\u0ee4컘","聢㡬硥㡬硷\uf867㡬硧쁢硷롭\uf865硨䁢硧쁢硴㡥䁢\uf867\uf869㡩硨",-1285054342>(var10002, var10001)
                           + '[';
                        int var157 = (var101 & 65532) >> 2;
                        int var102 = ((var101 & 65532) >> 2 | var101 << 14) + 57 - 203;
                        int var158 = (((var101 & 65532) >> 2 | var101 << 14) + 57 - 203 & 65408) >> 7;
                        char var103 = (char)(((var157 | var101 << 14) + 57 - 203 & 65408) >> 7 | ((var101 & 65532) >> 2 | var101 << 14) + 57 - 203 << 9);
                        0<"JNT",-2057832273,"ⳛ⭻Ⱬ⧛⬫⮻ⳋ⦻Ⱬ","滥໘컘\u0ee4껗","聢㡬硥㡬硷\uf867㡬硧쁢硷롭\uf865硨䁢硧쁢硴㡥䁢\uf867\uf869㡩硨",-1285054341>(
                           var10002, var10001, (char)(var158 | var102 << 9)
                        );
                        var10001 += (1638736871 | -1563992426) ^ -470843402;
                        continue label82;
                     }

                     var38 = (1570176169 | -2018589147) ^ 374062352;
               }

               switch (((var38 ^ 1586640046) - 1610543780 + 1612016298 - 1408524415 ^ 1230948610) - 281508520) {
                  case -99627792:
                  default:
                     0<"JNT",-2057832273,"⮛⬫","滥\ueed7⻜ໝ껛ໝ令\ueedbໝ껜仝令컖\ueeda⻛ໜ껜仝컡\ueed8\ueed8\ueed7滜仛컡\u0ee4\ueed8","㡧硥",-1285054346>(
                        var10000,
                        0<"JNT",-2057832273,"Ⱬ⬛⫛Ⱬⳋ⬻⬋⮛","滥\u0ee4\ueed7⻜ໝ껛ໝ令\ueedbໝ껜仝令컖\ueeda⻛ໜ껜仝컡","聢㡬硥㡬硷\uf867㡬硧쁢硷롭\uf865硨䁢硧쁢硴㡥䁢\uf867\uf869㡩硨",-1285054343>(
                           var54
                        ),
                        (double)(var28 + var24 / 2) - var32 / 2.0,
                        (double)(var26 + 8),
                        var31
                     );
                     0<"JNT",-2057832273,"⬋⯛⭫","滥\ueed7滜仛컡\ueed8\ueed8\ueed8\ueed8\ueed8\ueed8\ueed8\ueed8\u0ee4껗","㡧硥",-1285054108>(
                        var1,
                        (Class_262)0<"JNT",-1736728358,"⟫⬻⬋⬻Ⱬ⠋","滥໘໘໘໘\u0ee4껗","\uf864뢞",-1285054345>(60, 60, 65, 255),
                        (double)var29,
                        (double)var26,
                        (double)(var29 + var24),
                        (double)(var26 + var27),
                        5.0,
                        5.0,
                        5.0,
                        5.0
                     );
                     var10000 = var1;
                     var10001 = 1191307068 >> 1191307068 ^ 4;
                     var10002 = (StringBuilder)0<"JNT",-1736728358,"⟫⬻⬋⬻Ⱬ⠋","滥\ueed7⻜ໝ껛ໝ令\ueedbໝ껜仝令컖\ueeda⻛ໜ껜仝컡\u0ee4껗","聢㡬硥㡬硷\uf867㡬硧쁢硷롭\uf865硨䁢硧쁢硴㡥䁢\uf867\uf869㡩硨",-1285054355>(
                        "섆䁎脋쁎䄉ċ"
                     );
                     break;
                  case 635658201:
                     double var34 = 0<"JNT",-2057832273,"ⰻⱻ⭋","滥\ueed7⻜ໝ껛ໝ令\ueedbໝ껜仝令컖\ueeda⻛ໜ껜仝컡\u0ee4\ueed8","㡧硥",-1285054183>(
                        var10000,
                        0<"JNT",-2057832273,"Ⱬ⬛⫛Ⱬⳋ⬻⬋⮛","滥\u0ee4\ueed7⻜ໝ껛ໝ令\ueedbໝ껜仝令컖\ueeda⻛ໜ껜仝컡","聢㡬硥㡬硷\uf867㡬硧쁢硷롭\uf865硨䁢硧쁢硴㡥䁢\uf867\uf869㡩硨",-1285054176>(
                           var54
                        )
                     );
                     var10000 = var1;
                     var10001 = (525827243 | -1704406670 | 0) & 536871424;
                     var10002 = (StringBuilder)0<"JNT",-1736728358,"⟫⬻⬋⬻Ⱬ⠋","滥\ueed7⻜ໝ껛ໝ令\ueedbໝ껜仝令컖\ueeda⻛ໜ껜仝컡\u0ee4껗","聢㡬硥㡬硷\uf867㡬硧쁢硷롭\uf865硨䁢硧쁢硴㡥䁢\uf867\uf869㡩硨",-1285054186>(
                        "ꏿ傀䤀厀劀嘀"
                     );

                     label67:
                     while (true) {
                        var38 = -1480468813 >>> 1013093892 ^ 1085182551;

                        while (true) {
                           label62: {
                              StringBuilder var56;
                              switch (var38 - 67861355 - 910957597 - 290688759 - 320263443 ^ 858876779 ^ 803918121) {
                                 case -255120920:
                                    var56 = var10002;
                                    if (var10001 < ((1838182843 - 2130981642 | 6) & 17006598)) {
                                       char var119 = 0<"JNT",-2057832273,"⯛⬫⮻ⳋ⦻Ⱬ","滥໘\u0ee4컘","聢㡬硥㡬硷\uf867㡬硧쁢硷롭\uf865硨䁢硧쁢硴㡥䁢\uf867\uf869㡩硨",-1285054347>(
                                          var10002, var10001
                                       );
                                       char var122 = (char)(
                                          (
                                                (
                                                      (
                                                               (
                                                                     (((var119 & '\ue000') >> 13 | var119 << 3) & 65472) >> 6
                                                                        | ((var119 & '\ue000') >> 13 | var119 << 3) << 10
                                                                  )
                                                                  & 65520
                                                            )
                                                            >> 4
                                                         | (
                                                               (((var119 & '\ue000') >> 13 | var119 << 3) & 65472) >> 6
                                                                  | ((var119 & '\ue000') >> 13 | var119 << 3) << 10
                                                            )
                                                            << 12
                                                   )
                                                   ^ 178
                                             )
                                             + 78
                                       );
                                       0<"JNT",-2057832273,"ⳛ⭻Ⱬ⧛⬫⮻ⳋ⦻Ⱬ","滥໘컘\u0ee4껗","聢㡬硥㡬硷\uf867㡬硧쁢硷롭\uf865硨䁢硧쁢硴㡥䁢\uf867\uf869㡩硨",-1285054350>(
                                          var10002,
                                          var10001,
                                          (char)(
                                             (
                                                   (
                                                         (
                                                                  (
                                                                        (((var119 & '\ue000') >> 13 | var119 << 3) & 65472) >> 6
                                                                           | ((var119 & '\ue000') >> 13 | var119 << 3) << 10
                                                                     )
                                                                     & 65520
                                                               )
                                                               >> 4
                                                            | (
                                                                  (((var119 & '\ue000') >> 13 | var119 << 3) & 65472) >> 6
                                                                     | ((var119 & '\ue000') >> 13 | var119 << 3) << 10
                                                               )
                                                               << 12
                                                      )
                                                      ^ 178
                                                )
                                                + 78
                                          )
                                       );
                                       var10001 += 695461870 * -811584130 ^ -858755803;
                                       continue label67;
                                    }

                                    var38 = (-744961525 >>> 820518423 | 457197650) & -1141047301;
                                    break;
                                 case 566462697:
                                 default:
                                    var56 = var10002;
                                    if (var10001 < 5) {
                                       int var107 = 0<"JNT",-2057832273,"⯛⬫⮻ⳋ⦻Ⱬ","滥໘\u0ee4컘","聢㡬硥㡬硷\uf867㡬硧쁢硷롭\uf865硨䁢硧쁢硴㡥䁢\uf867\uf869㡩硨",-1285054153>(
                                          var10002, var10001
                                       );
                                       int var159 = (var107 & 49152) >> 14;
                                       int var108 = (var107 & 49152) >> 14 | var107 << 2;
                                       int var160 = (((var107 & 49152) >> 14 | var107 << 2) & 61440) >> 12;
                                       var107 = ((var159 | var107 << 2) & 61440) >> 12 | ((var107 & 49152) >> 14 | var107 << 2) << 4;
                                       var159 = ((var160 | var108 << 4) & 65534) >> 1;
                                       int var110 = (((var160 | var108 << 4) & 65534) >> 1 | var107 << 15) + 62;
                                       int var162 = ((((var160 | var108 << 4) & 65534) >> 1 | var107 << 15) + 62 & 65472) >> 6;
                                       char var111 = (char)(
                                          ((var159 | var107 << 15) + 62 & 65472) >> 6 | (((var160 | var108 << 4) & 65534) >> 1 | var107 << 15) + 62 << 10
                                       );
                                       0<"JNT",-2057832273,"ⳛ⭻Ⱬ⧛⬫⮻ⳋ⦻Ⱬ","滥໘컘\u0ee4껗","聢㡬硥㡬硷\uf867㡬硧쁢硷롭\uf865硨䁢硧쁢硴㡥䁢\uf867\uf869㡩硨",-1285054172>(
                                          var10002, var10001, (char)(var162 | var110 << 10)
                                       );
                                       var10001 += 1;
                                       break label62;
                                    }

                                    var38 = (-1272179459 | -1272179459 << -478201678) ^ 1579350017;
                              }

                              switch (var38 - 1345096797 - 2000604312 + 250874103 - 698034003 - 1759070212 - 1665753161) {
                                 case -72757922:
                                 default:
                                    double var36 = 0<"JNT",-2057832273,"ⰻⱻ⭋","滥\ueed7⻜ໝ껛ໝ令\ueedbໝ껜仝令컖\ueeda⻛ໜ껜仝컡\u0ee4\ueed8","㡧硥",-1285054204>(
                                       var10000,
                                       0<"JNT",-2057832273,"Ⱬ⬛⫛Ⱬⳋ⬻⬋⮛","滥\u0ee4\ueed7⻜ໝ껛ໝ令\ueedbໝ껜仝令컖\ueeda⻛ໜ껜仝컡","聢㡬硥㡬硷\uf867㡬硧쁢硷롭\uf865硨䁢硧쁢硴㡥䁢\uf867\uf869㡩硨",-1285054185>(
                                          var56
                                       )
                                    );
                                    var10001 = (-1695984416 | 390121154) ^ -1612065054;

                                    for (var10002 = (StringBuilder)0<"JNT",-1736728358,"⟫⬻⬋⬻Ⱬ⠋","滥\ueed7⻜ໝ껛ໝ令\ueedbໝ껜仝令컖\ueeda⻛ໜ껜仝컡\u0ee4껗","聢㡬硥㡬硷\uf867㡬硧쁢硷롭\uf865硨䁢硧쁢硴㡥䁢\uf867\uf869㡩硨",-1285054195>(
                                          "敒敥敳敥整"
                                       );
                                       var10001 < ((1981428288 + 2134919225 | 5) & 134251655);
                                       var10001 += (621880769 | 1602310806 | 0) & 819241
                                    ) {
                                       char var115 = 0<"JNT",-2057832273,"⯛⬫⮻ⳋ⦻Ⱬ","滥໘\u0ee4컘","聢㡬硥㡬硷\uf867㡬硧쁢硷롭\uf865硨䁢硧쁢硴㡥䁢\uf867\uf869㡩硨",-1285054348>(
                                          var10002, var10001
                                       );
                                       int var163 = (var115 & '\uffc0') >> 6;
                                       int var116 = ((var115 & '\uffc0') >> 6 | var115 << '\n') - 189 - 133 - 82;
                                       int var164 = (((var115 & '\uffc0') >> 6 | var115 << '\n') - 189 - 133 - 82 & 64512) >> 10;
                                       var115 = (char)(
                                          ((var163 | var115 << '\n') - 189 - 133 - 82 & 64512) >> 10
                                             | ((var115 & '\uffc0') >> 6 | var115 << '\n') - 189 - 133 - 82 << 6
                                       );
                                       0<"JNT",-2057832273,"ⳛ⭻Ⱬ⧛⬫⮻ⳋ⦻Ⱬ","滥໘컘\u0ee4껗","聢㡬硥㡬硷\uf867㡬硧쁢硷롭\uf865硨䁢硧쁢硴㡥䁢\uf867\uf869㡩硨",-1285054339>(
                                          var10002, var10001, (char)(var164 | var116 << 6)
                                       );
                                    }

                                    0<"JNT",-2057832273,"⮛⬫","滥\ueed7⻜ໝ껛ໝ令\ueedbໝ껜仝令컖\ueeda⻛ໜ껜仝컡\ueed8\ueed8\ueed7滜仛컡\u0ee4\ueed8","㡧硥",-1285054197>(
                                       var1,
                                       0<"JNT",-2057832273,"Ⱬ⬛⫛Ⱬⳋ⬻⬋⮛","滥\u0ee4\ueed7⻜ໝ껛ໝ令\ueedbໝ껜仝令컖\ueeda⻛ໜ껜仝컡","聢㡬硥㡬硷\uf867㡬硧쁢硷롭\uf865硨䁢硧쁢硴㡥䁢\uf867\uf869㡩硨",-1285054198>(
                                          var10002
                                       ),
                                       (double)(var30 + var24 / 2) - var36 / 2.0,
                                       (double)(var26 + 8),
                                       var31
                                    );
                                    return;
                                 case 1829448277:
                                    0<"JNT",-2057832273,"⮛⬫","滥\ueed7⻜ໝ껛ໝ令\ueedbໝ껜仝令컖\ueeda⻛ໜ껜仝컡\ueed8\ueed8\ueed7滜仛컡\u0ee4\ueed8","㡧硥",-1285054196>(
                                       var10000,
                                       0<"JNT",-2057832273,"Ⱬ⬛⫛Ⱬⳋ⬻⬋⮛","滥\u0ee4\ueed7⻜ໝ껛ໝ令\ueedbໝ껜仝令컖\ueeda⻛ໜ껜仝컡","聢㡬硥㡬硷\uf867㡬硧쁢硷롭\uf865硨䁢硧쁢硴㡥䁢\uf867\uf869㡩硨",-1285054177>(
                                          var56
                                       ),
                                       (double)(var29 + var24 / 2) - var34 / 2.0,
                                       (double)(var26 + 8),
                                       var31
                                    );
                                    0<"JNT",-2057832273,"⬋⯛⭫","滥\ueed7滜仛컡\ueed8\ueed8\ueed8\ueed8\ueed8\ueed8\ueed8\ueed8\u0ee4껗","㡧硥",-1285054190>(
                                       var1,
                                       (Class_262)0<"JNT",-1736728358,"⟫⬻⬋⬻Ⱬ⠋","滥໘໘໘໘\u0ee4껗","\uf864뢞",-1285054187>(70, 50, 40, 255),
                                       (double)var30,
                                       (double)var26,
                                       (double)(var30 + var24),
                                       (double)(var26 + var27),
                                       5.0,
                                       5.0,
                                       5.0,
                                       5.0
                                    );
                                    var10000 = var1;
                                    var10001 = 324426894 & -480438 ^ 324012042;
                                    var10002 = (StringBuilder)0<"JNT",-1736728358,"⟫⬻⬋⬻Ⱬ⠋","滥\ueed7⻜ໝ껛ໝ令\ueedbໝ껜仝令컖\ueeda⻛ໜ껜仝컡\u0ee4껗","聢㡬硥㡬硷\uf867㡬硧쁢硷롭\uf865硨䁢硧쁢硴㡥䁢\uf867\uf869㡩硨",-1285054189>(
                                       "Ⴂ\u10c8ფ\u10c8ღ"
                                    );
                              }
                           }

                           var38 = (1630721843 >>> 915786337 | -1958075355) & -604066179;
                        }
                     }
               }
            }

            var38 = -46541173 ^ -46541173 ^ -1214541347;
         }
      }
   }

   // $VF: renamed from: nl (RenderEngine_216, int, int, int, int) void
   public void method_2036(RenderEngine_216 var1, int var2, int var3, int var4, int var5) {
      int var11 = -380013470;
      int var6 = var4 / 4;
      int var7 = 0;

      label42:
      while (true) {
         var11 = (164326295 * 534958720 | 770707568) & 1039487984;

         while (true) {
            switch ((var11 - 633472097 + 1469021723 ^ 1475425511 ^ 1147662138) - 1205951035 + 611098347) {
               case -371287939:
               default:
                  0<"JNT",-2057832273,"⮋ⱋⲻ","滥\ueed7滜仛컡\ueed8\ueed8\ueed8\ueed8\ueed8\ueed8\ueed8\ueed8\ueed8\u0ee4껗","㡧硥",-1285054118>(
                     var1,
                     (Class_262)0<"JNT",-1736728358,"⟫⬻⬋⬻Ⱬ⠋","滥໘໘໘\u0ee4껗","\uf864뢞",-1285054115>(50, 50, 55),
                     (double)(var2 - 1),
                     (double)(var3 - 1),
                     (double)(var2 + var4 + 1),
                     (double)(var3 + var5 + 1),
                     2.0,
                     2.0,
                     2.0,
                     2.0,
                     1.0
                  );
                  var7 = var2 + (int)(1<"JNT",685411425,"ࣀੀऀ","᱘᱘","귉귋괁",1142375954>(this) * (double)var4);
                  int var13 = var3 + (int)((1.0 - 1<"JNT",685411425,"\u0a80ीࣀ","᱘᱘","귉귋괁",1142375839>(this)) * (double)var5);
                  0<"JNT",-2057832273,"⬫⭛ⲫ","滥\ueed7滜仛컡\ueed8\ueed8\ueed8\u0ee4껗","㡧硥",-1285054114>(
                     var1, (Class_262)0<"JNT",-1736728358,"⟫⬻⬋⬻Ⱬ⠋","滥໘໘໘໘\u0ee4껗","\uf864뢞",-1285054111>(0, 0, 0, 200), (double)var7, (double)var13, 6.0
                  );
                  0<"JNT",-2057832273,"⬫⭛ⲫ","滥\ueed7滜仛컡\ueed8\ueed8\ueed8\u0ee4껗","㡧硥",-1285054132>(
                     var1, (Class_262)0<"JNT",-1736728358,"⟫⬻⬋⬻Ⱬ⠋","滥໘໘໘\u0ee4껗","\uf864뢞",-1285054113>(255, 255, 255), (double)var7, (double)var13, 5.0
                  );
                  Class_262 var14 = 0<"JNT",-2057832273,"⫻","滥\u0ee4\ueed7滜仛컡","碞硩",-1285054126>(1<"JNT",685411425,"ୀ\u0b00ऀ","᱘᱘","귉귋광국굅귯",1142375832>(this));
                  0<"JNT",-2057832273,"⬫⭛ⲫ","滥\ueed7滜仛컡\ueed8\ueed8\ueed8\u0ee4껗","㡧硥",-1285054121>(
                     var1,
                     (Class_262)0<"JNT",-1736728358,"⟫⬻⬋⬻Ⱬ⠋","滥໘໘໘\u0ee4껗","\uf864뢞",-1285054122>(
                        1<"JNT",685411425,"ऀ߀ी","⏘⌸","귉귋괋",1142375834>(var14),
                        1<"JNT",685411425,"\u0b00ঀ\u0a80","⏘⌸","귉귋괋",1142375847>(var14),
                        1<"JNT",685411425,"ࠀీ","⏘⌸","귉귋괋",1142375844>(var14)
                     ),
                     (double)var7,
                     (double)var13,
                     4.0
                  );
                  return;
               case 685741351:
            }

            if (var7 < var6) {
               int var8 = 0;

               label39:
               while (true) {
                  var11 = 1709268575 & 1844142078;

                  while (true) {
                     switch (((var11 ^ 131428948) - 1977137421 ^ 1424629259) + 1311036249 - 1519018611 ^ 757950625) {
                        case -2123975299:
                        default:
                           if (var8 < var6) {
                              int var9 = 1<"JNT",685411425,"\u0b80ࢀऀ","᱘᱘","귉귋괯괋",1142375843>(this)[var7 * var6 + var8];
                              Class_262 var10 = (Class_262)0<"JNT",-1736728358,"⟫⬻⬋⬻Ⱬ⠋","滥໘\u0ee4껗","\uf864뢞",-1285054131>(var9);
                              0<"JNT",-2057832273,"⬋⮻Ⱬ","滥\ueed8\ueed8\ueed8\ueed8\ueed7滜仛컡\u0ee4껗","㡧硥",-1285054134>(
                                 var1, (double)(var2 + var8 * 4), (double)(var3 + var7 * 4), 4.0, 4.0, var10
                              );
                              var8++;
                              continue label39;
                           }

                           var11 = (1497750555 - -3703311 | 379628160) & 380681168;
                           break;
                        case -299046381:
                           var7++;
                           continue label42;
                     }
                  }
               }
            }

            var11 = -319287722;
         }
      }
   }

   // $VF: renamed from: avv (RenderEngine_216, int, int, int, int) void
   public void method_2037(RenderEngine_216 var1, int var2, int var3, int var4, int var5) {
      int var10 = -808510454;
      int var6 = var5 / 4;
      int var7 = 0;

      while (true) {
         var10 = 1487917883;

         while (true) {
            switch (((var10 - 1408194267 ^ 2024162725) - 29520140 ^ 63938400) - 1478711117 ^ 608139803) {
               case -750674527:
                  0<"JNT",-2057832273,"⮋ⱋⲻ","滥\ueed7滜仛컡\ueed8\ueed8\ueed8\ueed8\ueed8\ueed8\ueed8\ueed8\ueed8\u0ee4껗","㡧硥",-1285054120>(
                     var1,
                     (Class_262)0<"JNT",-1736728358,"⟫⬻⬋⬻Ⱬ⠋","滥໘໘໘\u0ee4껗","\uf864뢞",-1285054133>(50, 50, 55),
                     (double)(var2 - 1),
                     (double)(var3 - 1),
                     (double)(var2 + var4 + 1),
                     (double)(var3 + var5 + 1),
                     2.0,
                     2.0,
                     2.0,
                     2.0,
                     1.0
                  );
                  var7 = var3 + (int)(1<"JNT",685411425,"݀܀","᱘᱘","귉귋괁",1142375852>(this) / 360.0 * (double)var5);
                  0<"JNT",-2057832273,"⬋⯛⭫","滥\ueed7滜仛컡\ueed8\ueed8\ueed8\ueed8\ueed8\ueed8\ueed8\ueed8\u0ee4껗","㡧硥",-1285054129>(
                     var1,
                     (Class_262)0<"JNT",-1736728358,"⟫⬻⬋⬻Ⱬ⠋","滥໘໘໘໘\u0ee4껗","\uf864뢞",-1285054130>(0, 0, 0, 180),
                     (double)(var2 - 2),
                     (double)(var7 - 2),
                     (double)(var2 + var4 + 2),
                     (double)(var7 + 2),
                     2.0,
                     2.0,
                     2.0,
                     2.0
                  );
                  0<"JNT",-2057832273,"⬋⯛⭫","滥\ueed7滜仛컡\ueed8\ueed8\ueed8\ueed8\ueed8\ueed8\ueed8\ueed8\u0ee4껗","㡧硥",-1285054139>(
                     var1,
                     (Class_262)0<"JNT",-1736728358,"⟫⬻⬋⬻Ⱬ⠋","滥໘໘໘\u0ee4껗","\uf864뢞",-1285054532>(255, 255, 255),
                     (double)(var2 - 1),
                     (double)(var7 - 1),
                     (double)(var2 + var4 + 1),
                     (double)(var7 + 1),
                     1.0,
                     1.0,
                     1.0,
                     1.0
                  );
                  return;
               case 91650711:
            }

            if (var7 < var6) {
               int var8 = 1<"JNT",685411425,"ೀࠀீ","᱘᱘","귉귋괯괋",1142375845>(this)[var7];
               Class_262 var9 = (Class_262)0<"JNT",-1736728358,"⟫⬻⬋⬻Ⱬ⠋","滥໘\u0ee4껗","\uf864뢞",-1285054525>(var8);
               0<"JNT",-2057832273,"⬋⮻Ⱬ","滥\ueed8\ueed8\ueed8\ueed8\ueed7滜仛컡\u0ee4껗","㡧硥",-1285054128>(
                  var1, (double)var2, (double)(var3 + var7 * 4), (double)var4, 4.0, var9
               );
               var7++;
               break;
            }

            var10 = -1970951247;
         }
      }
   }

   public boolean method_25402(class_11909 var1, boolean var2) {
      int var21 = 708455362;
      int var3 = 0<"JNT",-2057832273,"ⳋⲫⰫ","滥\ueed8\u0ee4໘","\uf867\uf867",-1285054138>(
         this, 0<"JNT",-2057832273,"⯛⬛⫻ⲫ⨛⡫⢛⠻⠫","滥\u0ee4\ueed8","硧㡩\uf865硷㡧䁢硧㡩롩硨㡬硩\uf865硷롩\uf867㡬롥롥롬㡸㡸㡮\uf874㡮",-1285054135>(var1)
      );
      int var4 = 0<"JNT",-2057832273,"ⳋⲫⰫ","滥\ueed8\u0ee4໘","\uf867\uf867",-1285054540>(
         this, 0<"JNT",-2057832273,"⯛⬛⫻ⲫ⨛⡫⢛⠻⠻","滥\u0ee4\ueed8","硧㡩\uf865硷㡧䁢硧㡩롩硨㡬硩\uf865硷롩\uf867㡬롥롥롬㡸㡸㡮\uf874㡮",-1285054137>(var1)
      );
      int var5 = 0<"JNT",-2057832273,"ⳋⲋ⭋","滥\u0ee4໘","\uf867\uf867",-1285054531>(this);
      int var6 = 0<"JNT",-2057832273,"⬫⯛","滥\u0ee4໘","\uf867\uf867",-1285054534>(this);
      int var7 = 1<"JNT",685411425,"ࡀࢀ\u0a80݀","᱘᱘","귉귋괋",1142375858>(this) + 45;
      int var8 = 1<"JNT",685411425,"ࣀी݀","᱘᱘","귉귋괋",1142375871>(this) + 20;
      if (0<"JNT",-2057832273,"⭫⮛⭋","滥\ueed8\ueed8໘໘໘໘\u0ee4⻖","\uf867\uf867",-1285054527>(this, (double)var3, (double)var4, var8, var7, 200, 200)) {
         1<"JNT",2144288132,"ীೀ","᱘᱘","귉귋괭",1142375865>(this, true);
         0<"JNT",-2057832273,"ⲫ⮛⮋","滥\ueed8\ueed8໘໘໘໘\u0ee4껗","\uf867\uf867",-1285054529>(this, (double)var3, (double)var4, var8, var7, 200, 200);
         return true;
      } else {
         int var10 = var8 + 200 + 15;
         if (0<"JNT",-2057832273,"⭫⮛⭋","滥\ueed8\ueed8໘໘໘໘\u0ee4⻖","\uf867\uf867",-1285054548>(this, (double)var3, (double)var4, var10, var7, 20, 200)) {
            1<"JNT",2144288132,"ࢀऀী","᱘᱘","귉귋괭",1142375864>(this, true);
            0<"JNT",-2057832273,"⫫⭋⬋","滥\ueed8໘໘\u0ee4껗","\uf867\uf867",-1285054542>(this, (double)var4, var7, 200);
            return true;
         } else {
            byte var12 = 70;
            byte var13 = 8;
            int var14 = 1<"JNT",685411425,"ࡀࢀ\u0a80݀","᱘᱘","귉귋괋",1142375887>(this) + var6 - 45;
            byte var15 = 30;
            int var16 = 1<"JNT",685411425,"ࣀी݀","᱘᱘","귉귋괋",1142375884>(this) + var5 - var12 - 20;
            int var17 = var16 - var12 - var13;
            int var18 = var17 - var12 - var13;
            if (0<"JNT",-2057832273,"⭫⮛⭋","滥\ueed8\ueed8໘໘໘໘\u0ee4⻖","\uf867\uf867",-1285054546>(this, (double)var3, (double)var4, var16, var14, var12, var15)) {
               0<"JNT",-2057832273,"⫻⭻Ⱬ⬫⬛⭫⨛⢻⡻⢫⢛","滥\ueed7껜軝\ueeda令軜ໜ껜軝컜⻛ໝ껝\ueeda令컜\ueedbໝ컚컚他\ueee2컢代컡\u0ee4껗","硧㡩\uf865硷㡧䁢硧㡩롩硨㡬硩\uf865硷롩\uf867㡬롥롥롬롵㡸\uf874",-1285054557>(
                  1<"JNT",685411425,"ीી","᳘ᵘ","귉귋광굕굃굡귗굓굋굕굃괿굝괻굅굡귗괿굑괻굟굟괷귟귛귙귯",1142375883>(1<"JNT",685411425,"ࡀ܀","᱘᱘","귉귋광굉굁귯",1142375886>(this)),
                  (Class_359)1<"JNT",685411425,"ހڀࠀ","ᴘ᷸","귉귋광굍괻굥괻귗굑괻굕굇귗괗괽굍굃괿굡귯",1142375877>(
                     (ScreenUI_78)1<"JNT",-1107592717,"ހ\u0b80\u0a80","ᴘ᷸","귉귋광굍괻굥괻귗굑괻굕굇귗괗괽굍굃괿굡귯",1142375880>()
                  )
               );
               return true;
            } else {
               var21 = -34250913 & -176737;

               while (true) {
                  switch (((var21 ^ 1071529674) + 999749930 ^ 436001342 ^ 1925306131) + 874196096 ^ 1250658382) {
                     case -2121202148:
                     default:
                        if (0<"JNT",-2057832273,"⭫⮛⭋","滥\ueed8\ueed8໘໘໘໘\u0ee4⻖","\uf867\uf867",-1285054541>(
                           this, (double)var3, (double)var4, var17, var14, var12, var15
                        )) {
                           0<"JNT",-2057832273,"⬛","滥\ueed7滜仛컡\u0ee4껗","碞硩",-1285054538>(
                              1<"JNT",685411425,"ୀ\u0b00ऀ","᱘᱘","귉귋광국굅귯",1142375879>(this), 1<"JNT",685411425,"ੀࠀ","᱘᱘","귉귋광굙굧귯",1142375876>(this)
                           );
                           0<"JNT",-2057832273,"⫻⭻Ⱬ⬫⬛⭫⨛⢻⡻⢫⢛","滥\ueed7껜軝\ueeda令軜ໜ껜軝컜⻛ໝ껝\ueeda令컜\ueedbໝ컚컚他\ueee2컢代컡\u0ee4껗","硧㡩\uf865硷㡧䁢硧㡩롩硨㡬硩\uf865硷롩\uf867㡬롥롥롬롵㡸\uf874",-1285054549>(
                              1<"JNT",685411425,"ीી","᳘ᵘ","귉귋광굕굃굡귗굓굋굕굃괿굝괻굅굡귗괿굑괻굟굟괷귟귛귙귯",1142375875>(1<"JNT",685411425,"ࡀ܀","᱘᱘","귉귋광굉굁귯",1142375878>(this)),
                              (Class_359)1<"JNT",685411425,"ހڀࠀ","ᴘ᷸","귉귋광굍괻굥괻귗굑괻굕굇귗괗괽굍굃괿굡귯",1142375869>(
                                 (ScreenUI_78)1<"JNT",-1107592717,"ހ\u0b80\u0a80","ᴘ᷸","귉귋광굍괻굥괻귗굑괻굕굇귗괗괽굍굃괿굡귯",1142375872>()
                              )
                           );
                           return true;
                        }

                        var21 = -1781328480;
                        break;
                     case -2009080201:
                        if (0<"JNT",-2057832273,"⭫⮛⭋","滥\ueed8\ueed8໘໘໘໘\u0ee4⻖","\uf867\uf867",-1285054551>(
                           this, (double)var3, (double)var4, var18, var14, var12, var15
                        )) {
                           Class_262 var19 = 0<"JNT",-2057832273,"⭋","滥\u0ee4\ueed7滜仛컡","碞硩",-1285054553>(
                              1<"JNT",685411425,"ୀ\u0b00ऀ","᱘᱘","귉귋광국굅귯",1142375889>(this)
                           );
                           0<"JNT",-2057832273,"⬛","滥\ueed7滜仛컡\u0ee4껗","碞硩",-1285054563>(1<"JNT",685411425,"ୀ\u0b00ऀ","᱘᱘","귉귋광국굅귯",1142375891>(this), var19);
                           float[] var20 = 0<"JNT",-1125373344,"ⰫⰫⰻ","滥໘໘໘컕껙\u0ee4컕껙","\uf864뢞",-1285054559>(
                              1<"JNT",685411425,"ऀ߀ी","⏘⌸","귉귋괋",1142375885>(var19),
                              1<"JNT",685411425,"\u0b00ঀ\u0a80","⏘⌸","귉귋괋",1142375890>(var19),
                              1<"JNT",685411425,"ࠀీ","⏘⌸","귉귋괋",1142376031>(var19),
                              null
                           );
                           1<"JNT",2144288132,"݀܀","᱘᱘","귉귋괁",1142376025>(this, (double)(var20[0] * 360.0F));
                           1<"JNT",2144288132,"ࣀੀऀ","᱘᱘","귉귋괁",1142376030>(this, (double)var20[1]);
                           1<"JNT",2144288132,"\u0a80ीࣀ","᱘᱘","귉귋괁",1142376027>(this, (double)var20[2]);
                           0<"JNT",-2057832273,"ⳛ⬻","滥\ueed8\u0ee4껗","碞硩",-1285054573>(
                              1<"JNT",685411425,"ୀ\u0b00ऀ","᱘᱘","귉귋광국굅귯",1142376024>(this), 1<"JNT",685411425,"݀܀","᱘᱘","귉귋괁",1142376021>(this)
                           );
                           1<"JNT",2144288132,"ࠀހऀ","᱘᱘","귉귋괁",1142376039>(this, -1.0);
                           return true;
                        }

                        var21 = (-610355525 * -610355525 | -769859308) & -566238881;
                        break;
                     case 1007519970:
                        return 0<"JNT",-1868491241,"⫻⭻Ⱬ⬫⬛⭫⨛⣋⡻⡫⢫⣋","滥\ueed7껜軝\ueeda令軜ໜ껜軝컜⻛ໝ껝\ueeda令컜\ueedbໝ컚컚他\u0ee3\u0ee3\u0ee2滤\u0ee2컡⻖\u0ee4⻖","㡨㡥\uf864",-1285054544>(
                           this, var1, var2
                        );
                  }
               }
            }
         }
      }
   }

   public boolean method_25406(class_11909 var1) {
      1<"JNT",2144288132,"ࢀऀী","᱘᱘","귉귋괭",1142376036>(this, false);
      1<"JNT",2144288132,"ীೀ","᱘᱘","귉귋괭",1142376033>(this, false);
      return 0<"JNT",-1868491241,"⫻⭻Ⱬ⬫⬛⭫⨛⣋⡻⡫⢫⢋","滥\ueed7껜軝\ueeda令軜ໜ껜軝컜⻛ໝ껝\ueeda令컜\ueedbໝ컚컚他\u0ee3\u0ee3\u0ee2滤\u0ee2컡\u0ee4⻖","㡨㡥\uf864",-1285054569>(
         this, var1
      );
   }

   public boolean method_25403(class_11909 var1, double var2, double var4) {
      int var11 = 557596277;
      int var6 = 0<"JNT",-2057832273,"ⳋⲫⰫ","滥\ueed8\u0ee4໘","\uf867\uf867",-1285054568>(
         this, 0<"JNT",-2057832273,"⯛⬛⫻ⲫ⨛⡫⢛⠻⠫","滥\u0ee4\ueed8","硧㡩\uf865硷㡧䁢硧㡩롩硨㡬硩\uf865硷롩\uf867㡬롥롥롬㡸㡸㡮\uf874㡮",-1285054581>(var1)
      );
      int var7 = 0<"JNT",-2057832273,"ⳋⲫⰫ","滥\ueed8\u0ee4໘","\uf867\uf867",-1285054578>(
         this, 0<"JNT",-2057832273,"⯛⬛⫻ⲫ⨛⡫⢛⠻⠻","滥\u0ee4\ueed8","硧㡩\uf865硷㡧䁢硧㡩롩硨㡬硩\uf865硷롩\uf867㡬롥롥롬㡸㡸㡮\uf874㡮",-1285054575>(var1)
      );
      int var8 = 1<"JNT",685411425,"ࡀࢀ\u0a80݀","᱘᱘","귉귋괋",1142376046>(this) + 45;
      int var9 = 1<"JNT",685411425,"ࣀी݀","᱘᱘","귉귋괋",1142376043>(this) + 20;
      if (1<"JNT",685411425,"ীೀ","᱘᱘","귉귋괭",1142376040>(this)) {
         0<"JNT",-2057832273,"ⲫ⮛⮋","滥\ueed8\ueed8໘໘໘໘\u0ee4껗","\uf867\uf867",-1285054206>(this, (double)var6, (double)var7, var9, var8, 200, 200);
         return true;
      } else {
         var11 = 2045639761;

         while (true) {
            switch ((var11 ^ 1594092822 ^ 710472629 ^ 1815603701 ^ 1207790418) + 1356963762 ^ 1940392967) {
               case 200674304:
                  if (1<"JNT",685411425,"ࢀऀী","᱘᱘","귉귋괭",1142376032>(this)) {
                     0<"JNT",-2057832273,"⫫⭋⬋","滥\ueed8໘໘\u0ee4껗","\uf867\uf867",-1285054582>(this, (double)var7, var8, 200);
                     return true;
                  }

                  var11 = 1413332476;
                  break;
               case 673566125:
               default:
                  return 0<"JNT",-1868491241,"⫻⭻Ⱬ⬫⬛⭫⨛⣋⡻⡫⢫⣛","滥\ueed7껜軝\ueeda令軜ໜ껜軝컜⻛ໝ껝\ueeda令컜\ueedbໝ컚컚他\u0ee3\u0ee3\u0ee2滤\u0ee2컡\ueed8\ueed8\u0ee4⻖","㡨㡥\uf864",-1285054588>(
                     this, var1, var2, var4
                  );
            }
         }
      }
   }

   // $VF: renamed from: pgf (double, double, int, int, int, int) void
   public void method_2038(double var1, double var3, int var5, int var6, int var7, int var8) {
      1<"JNT",2144288132,"ࣀੀऀ","᱘᱘","귉귋괁",1142376055>(
         this,
         0<"JNT",-1125373344,"⫻⭻Ⱬ⬫⬛⭫⨛⢻⡻⣛⡻⢫","滥\ueed8\ueed8\ueed8\u0ee4\ueed8","硧㡩\uf865硷㡧䁢硧㡩롩硨㡬硩\uf865硷롩\uf867㡬롥롥롬롵㡵롵硸",-1285054205>(
            (var1 - (double)var5) / (double)var7, 0.0, 1.0
         )
      );
      1<"JNT",2144288132,"\u0a80ीࣀ","᱘᱘","귉귋괁",1142376049>(
         this,
         0<"JNT",-1125373344,"⫻⭻Ⱬ⬫⬛⭫⨛⢻⡻⣛⡻⢫","滥\ueed8\ueed8\ueed8\u0ee4\ueed8","硧㡩\uf865硷㡧䁢硧㡩롩硨㡬硩\uf865硷롩\uf867㡬롥롥롬롵㡵롵硸",-1285054583>(
            1.0 - (var3 - (double)var6) / (double)var8, 0.0, 1.0
         )
      );
      0<"JNT",-2057832273,"ⳛⱋ","滥\u0ee4껗","\uf867\uf867",-1285054585>(this);
   }

   // $VF: renamed from: ljn (double, int, int) void
   public void method_2039(double var1, int var3, int var4) {
      1<"JNT",2144288132,"݀܀","᱘᱘","귉귋괁",1142376048>(
         this,
         0<"JNT",-1125373344,"⫻⭻Ⱬ⬫⬛⭫⨛⢻⡻⣛⡻⢫","滥\ueed8\ueed8\ueed8\u0ee4\ueed8","硧㡩\uf865硷㡧䁢硧㡩롩硨㡬硩\uf865硷롩\uf867㡬롥롥롬롵㡵롵硸",-1285054220>(
            (var1 - (double)var3) / (double)var4 * 360.0, 0.0, 359.99
         )
      );
      0<"JNT",-2057832273,"ⳛⱋ","滥\u0ee4껗","\uf867\uf867",-1285054214>(this);
   }

   public boolean method_25404(class_11908 var1) {
      int var2 = 219081844;
      if (0<"JNT",-2057832273,"⫻⭻Ⱬ⬫⬛⭫⨛⢛⡫⣋⣋⠫","滥\u0ee4໘","硧㡩\uf865硷㡧䁢硧㡩롩硨㡬硩\uf865硷롩\uf867㡬롥롥롬㡸㡸㡮\uf874\uf872",-1285054213>(var1) == 256) {
         0<"JNT",-2057832273,"⬛","滥\ueed7滜仛컡\u0ee4껗","碞硩",-1285054210>(
            1<"JNT",685411425,"ୀ\u0b00ऀ","᱘᱘","귉귋광국굅귯",1142376063>(this), 1<"JNT",685411425,"ੀࠀ","᱘᱘","귉귋광굙굧귯",1142376060>(this)
         );
         0<"JNT",-2057832273,"⫻⭻Ⱬ⬫⬛⭫⨛⢻⡻⢫⢛","滥\ueed7껜軝\ueeda令軜ໜ껜軝컜⻛ໝ껝\ueeda令컜\ueedbໝ컚컚他\ueee2컢代컡\u0ee4껗","硧㡩\uf865硷㡧䁢硧㡩롩硨㡬硩\uf865硷롩\uf867㡬롥롥롬롵㡸\uf874",-1285054221>(
            1<"JNT",685411425,"ीી","᳘ᵘ","귉귋광굕굃굡귗굓굋굕굃괿굝괻굅굡귗괿굑괻굟굟괷귟귛귙귯",1142376059>(1<"JNT",685411425,"ࡀ܀","᱘᱘","귉귋광굉굁귯",1142376062>(this)),
            (Class_359)1<"JNT",685411425,"ހڀࠀ","ᴘ᷸","귉귋광굍괻굥괻귗굑괻굕굇귗괗괽굍굃괿굡귯",1142376053>(
               (ScreenUI_78)1<"JNT",-1107592717,"ހ\u0b80\u0a80","ᴘ᷸","귉귋광굍괻굥괻귗굑괻굕굇귗괗괽굍굃괿굡귯",1142376056>()
            )
         );
         return true;
      } else {
         var2 = 1554371626;

         while (true) {
            switch (((var2 ^ 885161069 ^ 52454897) + 973238003 + 474715199 ^ 696640092) - 1427045151) {
               case -1828636779:
               default:
                  if (0<"JNT",-2057832273,"⫻⭻Ⱬ⬫⬛⭫⨛⢛⡫⣋⣋⠫","滥\u0ee4໘","硧㡩\uf865硷㡧䁢硧㡩롩硨㡬硩\uf865硷롩\uf867㡬롥롥롬㡸㡸㡮\uf874\uf872",-1285054215>(var1) == 257) {
                     0<"JNT",-2057832273,"⫻⭻Ⱬ⬫⬛⭫⨛⢻⡻⢫⢛","滥\ueed7껜軝\ueeda令軜ໜ껜軝컜⻛ໝ껝\ueeda令컜\ueedbໝ컚컚他\ueee2컢代컡\u0ee4껗","硧㡩\uf865硷㡧䁢硧㡩롩硨㡬硩\uf865硷롩\uf867㡬롥롥롬롵㡸\uf874",-1285054486>(
                        1<"JNT",685411425,"ीી","᳘ᵘ","귉귋광굕굃굡귗굓굋굕굃괿굝괻굅굡귗괿굑괻굟굟괷귟귛귙귯",1142375814>(1<"JNT",685411425,"ࡀ܀","᱘᱘","귉귋광굉굁귯",1142375809>(this)),
                        (Class_359)1<"JNT",685411425,"ހڀࠀ","ᴘ᷸","귉귋광굍괻굥괻귗굑괻굕굇귗괗괽굍굃괿굡귯",1142375808>(
                           (ScreenUI_78)1<"JNT",-1107592717,"ހ\u0b80\u0a80","ᴘ᷸","귉귋광굍괻굥괻귗굑괻굕굇귗괗괽굍굃괿굡귯",1142375811>()
                        )
                     );
                     return true;
                  }

                  var2 = (1097494483 * 1097494483 | 9967124) & 448714261;
                  break;
               case -12945976:
                  return 0<"JNT",-1868491241,"⫻⭻Ⱬ⬫⬛⭫⨛⣋⡻⡫⢫⡫","滥\ueed7껜軝\ueeda令軜ໜ껜軝컜⻛ໝ껝\ueeda令컜\ueedbໝ컚컚他\u0ee3\u0ee3\u0ee2滤滣컡\u0ee4⻖","㡨㡥\uf864",-1285054208>(
                     this, var1
                  );
            }
         }
      }
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_2015(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = (((var10 + 1972504724 ^ 90320251) + 273479660 + 1600406189 ^ 1149217291 ^ 1792245424) + 1128128523 ^ 1744602106) - 785919829;
      MethodHandle var10000 = field_2482[(((var10 + 1972504724 ^ 90320251) + 273479660 + 1600406189 ^ 1149217291 ^ 1792245424) + 1128128523 ^ 1744602106)
         - 785919829
         - 1644861576];
      if (field_2482[var10001 - 1644861576] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = 492771915 + -492881857 ^ -109942; var23 < var13.length(); var23 += (2084375784 * (-1047121212 - 2084375784) | 1) & 1610694813) {
            int var42 = var13.charAt(var23);
            int var10004 = (var42 & 61440) >> 12;
            int var43 = (var42 & 61440) >> 12 | var42 << 4;
            int var87 = (((var42 & 61440) >> 12 | var42 << 4) & 61440) >> 12;
            var42 = (((var10004 | var42 << 4) & 61440) >> 12 | ((var42 & 61440) >> 12 | var42 << 4) << 4) + 229;
            var10004 = ((var87 | var43 << 4) + 229 & 65024) >> 9;
            int var45 = (((var87 | var43 << 4) + 229 & 65024) >> 9 | var42 << 7) - 190;
            int var89 = ((((var87 | var43 << 4) + 229 & 65024) >> 9 | var42 << 7) - 190 & 61440) >> 12;
            var42 = ((var10004 | var42 << 7) - 190 & 61440) >> 12 | (((var87 | var43 << 4) + 229 & 65024) >> 9 | var42 << 7) - 190 << 4;
            var10004 = ((var89 | var45 << 4) & 65535) >> 0;
            int var47 = ((var89 | var45 << 4) & 65535) >> 0 | var42 << 16;
            int var91 = ((((var89 | var45 << 4) & 65535) >> 0 | var42 << 16) & 65408) >> 7;
            char var48 = (char)((((var10004 | var42 << 16) & 65408) >> 7 | (((var89 | var45 << 4) & 65535) >> 0 | var42 << 16) << 9) - 7 ^ 140);
            var13.setCharAt(var23, (char)((var91 | var47 << 9) - 7 ^ 140));
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = 1208089124 ^ -1233943919 ^ -26052427; var29 < var16.length(); var29 += -1710417858 << -196131638 ^ 878770177) {
            char var53 = var16.charAt(var29);
            char var56 = (char)(
               (
                        (
                              (
                                       ((((var53 & '\uf800') >> 11 | var53 << 5) - 182 ^ 104) + 135 - 7 & 65408) >> 7
                                          | (((var53 & '\uf800') >> 11 | var53 << 5) - 182 ^ 104) + 135 - 7 << 9
                                    )
                                    + 220
                                    - 133
                                 ^ 14
                           )
                           & 63488
                     )
                     >> 11
                  | (
                        (
                                 ((((var53 & '\uf800') >> 11 | var53 << 5) - 182 ^ 104) + 135 - 7 & 65408) >> 7
                                    | (((var53 & '\uf800') >> 11 | var53 << 5) - 182 ^ 104) + 135 - 7 << 9
                              )
                              + 220
                              - 133
                           ^ 14
                     )
                     << 5
            );
            var16.setCharAt(
               var29,
               (char)(
                  (
                           (
                                 (
                                          ((((var53 & '\uf800') >> 11 | var53 << 5) - 182 ^ 104) + 135 - 7 & 65408) >> 7
                                             | (((var53 & '\uf800') >> 11 | var53 << 5) - 182 ^ 104) + 135 - 7 << 9
                                       )
                                       + 220
                                       - 133
                                    ^ 14
                              )
                              & 63488
                        )
                        >> 11
                     | (
                           (
                                    ((((var53 & '\uf800') >> 11 | var53 << 5) - 182 ^ 104) + 135 - 7 & 65408) >> 7
                                       | (((var53 & '\uf800') >> 11 | var53 << 5) - 182 ^ 104) + 135 - 7 << 9
                                 )
                                 + 220
                                 - 133
                              ^ 14
                        )
                        << 5
               )
            );
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_182.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = 2087384746 & -2025833119 ^ 71316512; var35 < var19.length(); var35 += 404417734 >>> 404417734 ^ 6319026) {
            int var61 = var19.charAt(var35) - 'c';
            int var95 = (var61 & 63488) >> 11;
            int var62 = ((var61 & 63488) >> 11 | var61 << 5) + 69;
            int var96 = (((var61 & 63488) >> 11 | var61 << 5) + 69 & 65532) >> 2;
            var61 = (((((var95 | var61 << 5) + 69 & 65532) >> 2 | ((var61 & 63488) >> 11 | var61 << 5) + 69 << 14) ^ 238) + 121 ^ 26) - 114;
            var95 = ((((var96 | var62 << 14) ^ 238) + 121 ^ 26) - 114 & 65520) >> 4;
            int var64 = ((((var96 | var62 << 14) ^ 238) + 121 ^ 26) - 114 & 65520) >> 4 | var61 << 12;
            int var98 = ((((((var96 | var62 << 14) ^ 238) + 121 ^ 26) - 114 & 65520) >> 4 | var61 << 12) & 57344) >> 13;
            char var65 = (char)(((var95 | var61 << 12) & 57344) >> 13 | (((((var96 | var62 << 14) ^ 238) + 121 ^ 26) - 114 & 65520) >> 4 | var61 << 12) << 3);
            var19.setCharAt(var35, (char)(var98 | var64 << 3));
         }

         Class var7 = Class.forName(var19.toString(), false, Class_182.class.getClassLoader());
         switch ((var4 ^ 1780623978 ^ 794213489 ^ 962829855 ^ 1225263217) - 1718397794 - 1220610788 - 873982057 + 492680842 - 477621897 + 1669121002) {
            case 185603921:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            case 651887518:
               var10000 = var0.findSpecial(var7, var5, var6, Class_182.class);
               break;
            case 780242411:
               var10000 = var0.findConstructor(var7, var6);
               break;
            case 828761622:
            case 1037950207:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_2482[(((var10 + 1972504724 ^ 90320251) + 273479660 + 1600406189 ^ 1149217291 ^ 1792245424) + 1128128523 ^ 1744602106) - 785919829 - 1644861576] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_2016(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 ^ 1279754872 ^ 479433210) + 1378016914 + 52312149 + 1345785249 - 956258271 ^ 1902747718) + 1555090715 + 866026847;
      MethodHandle var10000 = field_2482[((var10 ^ 1279754872 ^ 479433210) + 1378016914 + 52312149 + 1345785249 - 956258271 ^ 1902747718)
         + 1555090715
         + 866026847
         + 2136681349];
      if (field_2482[var10001 + 2136681349] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = 1034283485 + 1953023583 ^ -1307660228; var24 < var14.length(); var24 += (1632728073 | -288100681 - 1585465979 | 0) & 170658561) {
            int var43 = var14.charAt(var24);
            int var10004 = (var43 & 57344) >> 13;
            int var44 = (var43 & 57344) >> 13 | var43 << 3;
            int var96 = (((var43 & 57344) >> 13 | var43 << 3) & 65520) >> 4;
            var43 = ((var10004 | var43 << 3) & 65520) >> 4 | ((var43 & 57344) >> 13 | var43 << 3) << 12;
            var10004 = ((var96 | var44 << 12) & 65504) >> 5;
            int var46 = (((var96 | var44 << 12) & 65504) >> 5 | var43 << 11) - 53;
            int var98 = ((((var96 | var44 << 12) & 65504) >> 5 | var43 << 11) - 53 & 65024) >> 9;
            var43 = ((var10004 | var43 << 11) - 53 & 65024) >> 9 | (((var96 | var44 << 12) & 65504) >> 5 | var43 << 11) - 53 << 7;
            var10004 = ((var98 | var46 << 7) & 65472) >> 6;
            int var48 = (((var98 | var46 << 7) & 65472) >> 6 | var43 << 10) + 25 + 58 + 164;
            int var100 = ((((var98 | var46 << 7) & 65472) >> 6 | var43 << 10) + 25 + 58 + 164 & 65534) >> 1;
            char var49 = (char)(
               ((var10004 | var43 << 10) + 25 + 58 + 164 & 65534) >> 1 | (((var98 | var46 << 7) & 65472) >> 6 | var43 << 10) + 25 + 58 + 164 << 15
            );
            var14.setCharAt(var24, (char)(var100 | var48 << 15));
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = (-628701756 * -1258846919 | 0) & 807403856; var30 < var17.length(); var30 += (-996099228 & -237028848 & -996099228 | 1) & 308920525) {
            char var54 = var17.charAt(var30);
            char var59 = (char)(
               (
                        (
                                 (
                                          (
                                                   (
                                                            (
                                                                     (
                                                                           (((var54 & '\uffc0') >> 6 | var54 << '\n') & 57344) >> 13
                                                                              | ((var54 & '\uffc0') >> 6 | var54 << '\n') << 3
                                                                        )
                                                                        ^ 121
                                                                  )
                                                                  + 4
                                                               & 65534
                                                         )
                                                         >> 1
                                                      | (
                                                               (
                                                                     (((var54 & '\uffc0') >> 6 | var54 << '\n') & 57344) >> 13
                                                                        | ((var54 & '\uffc0') >> 6 | var54 << '\n') << 3
                                                                  )
                                                                  ^ 121
                                                            )
                                                            + 4
                                                         << 15
                                                )
                                                - 17
                                             & 65534
                                       )
                                       >> 1
                                    | (
                                             (
                                                      (
                                                               (
                                                                     (((var54 & '\uffc0') >> 6 | var54 << '\n') & 57344) >> 13
                                                                        | ((var54 & '\uffc0') >> 6 | var54 << '\n') << 3
                                                                  )
                                                                  ^ 121
                                                            )
                                                            + 4
                                                         & 65534
                                                   )
                                                   >> 1
                                                | (
                                                         (
                                                               (((var54 & '\uffc0') >> 6 | var54 << '\n') & 57344) >> 13
                                                                  | ((var54 & '\uffc0') >> 6 | var54 << '\n') << 3
                                                            )
                                                            ^ 121
                                                      )
                                                      + 4
                                                   << 15
                                          )
                                          - 17
                                       << 15
                              )
                              - 20
                              - 117
                           & 0
                     )
                     >> 16
                  | (
                           (
                                    (
                                             (
                                                      (
                                                               (
                                                                     (((var54 & '\uffc0') >> 6 | var54 << '\n') & 57344) >> 13
                                                                        | ((var54 & '\uffc0') >> 6 | var54 << '\n') << 3
                                                                  )
                                                                  ^ 121
                                                            )
                                                            + 4
                                                         & 65534
                                                   )
                                                   >> 1
                                                | (
                                                         (
                                                               (((var54 & '\uffc0') >> 6 | var54 << '\n') & 57344) >> 13
                                                                  | ((var54 & '\uffc0') >> 6 | var54 << '\n') << 3
                                                            )
                                                            ^ 121
                                                      )
                                                      + 4
                                                   << 15
                                          )
                                          - 17
                                       & 65534
                                 )
                                 >> 1
                              | (
                                       (
                                                (
                                                         (
                                                               (((var54 & '\uffc0') >> 6 | var54 << '\n') & 57344) >> 13
                                                                  | ((var54 & '\uffc0') >> 6 | var54 << '\n') << 3
                                                            )
                                                            ^ 121
                                                      )
                                                      + 4
                                                   & 65534
                                             )
                                             >> 1
                                          | (((((var54 & '\uffc0') >> 6 | var54 << '\n') & 57344) >> 13 | ((var54 & '\uffc0') >> 6 | var54 << '\n') << 3) ^ 121)
                                                + 4
                                             << 15
                                    )
                                    - 17
                                 << 15
                        )
                        - 20
                        - 117
                     << 0
            );
            var17.setCharAt(
               var30,
               (char)(
                  (
                           (
                                    (
                                             (
                                                      (
                                                               (
                                                                        (
                                                                              (((var54 & '\uffc0') >> 6 | var54 << '\n') & 57344) >> 13
                                                                                 | ((var54 & '\uffc0') >> 6 | var54 << '\n') << 3
                                                                           )
                                                                           ^ 121
                                                                     )
                                                                     + 4
                                                                  & 65534
                                                            )
                                                            >> 1
                                                         | (
                                                                  (
                                                                        (((var54 & '\uffc0') >> 6 | var54 << '\n') & 57344) >> 13
                                                                           | ((var54 & '\uffc0') >> 6 | var54 << '\n') << 3
                                                                     )
                                                                     ^ 121
                                                               )
                                                               + 4
                                                            << 15
                                                   )
                                                   - 17
                                                & 65534
                                          )
                                          >> 1
                                       | (
                                                (
                                                         (
                                                                  (
                                                                        (((var54 & '\uffc0') >> 6 | var54 << '\n') & 57344) >> 13
                                                                           | ((var54 & '\uffc0') >> 6 | var54 << '\n') << 3
                                                                     )
                                                                     ^ 121
                                                               )
                                                               + 4
                                                            & 65534
                                                      )
                                                      >> 1
                                                   | (
                                                            (
                                                                  (((var54 & '\uffc0') >> 6 | var54 << '\n') & 57344) >> 13
                                                                     | ((var54 & '\uffc0') >> 6 | var54 << '\n') << 3
                                                               )
                                                               ^ 121
                                                         )
                                                         + 4
                                                      << 15
                                             )
                                             - 17
                                          << 15
                                 )
                                 - 20
                                 - 117
                              & 0
                        )
                        >> 16
                     | (
                              (
                                       (
                                                (
                                                         (
                                                                  (
                                                                        (((var54 & '\uffc0') >> 6 | var54 << '\n') & 57344) >> 13
                                                                           | ((var54 & '\uffc0') >> 6 | var54 << '\n') << 3
                                                                     )
                                                                     ^ 121
                                                               )
                                                               + 4
                                                            & 65534
                                                      )
                                                      >> 1
                                                   | (
                                                            (
                                                                  (((var54 & '\uffc0') >> 6 | var54 << '\n') & 57344) >> 13
                                                                     | ((var54 & '\uffc0') >> 6 | var54 << '\n') << 3
                                                               )
                                                               ^ 121
                                                         )
                                                         + 4
                                                      << 15
                                             )
                                             - 17
                                          & 65534
                                    )
                                    >> 1
                                 | (
                                          (
                                                   (
                                                            (
                                                                  (((var54 & '\uffc0') >> 6 | var54 << '\n') & 57344) >> 13
                                                                     | ((var54 & '\uffc0') >> 6 | var54 << '\n') << 3
                                                               )
                                                               ^ 121
                                                         )
                                                         + 4
                                                      & 65534
                                                )
                                                >> 1
                                             | (
                                                      (
                                                            (((var54 & '\uffc0') >> 6 | var54 << '\n') & 57344) >> 13
                                                               | ((var54 & '\uffc0') >> 6 | var54 << '\n') << 3
                                                         )
                                                         ^ 121
                                                   )
                                                   + 4
                                                << 15
                                       )
                                       - 17
                                    << 15
                           )
                           - 20
                           - 117
                        << 0
               )
            );
         }

         Class var6 = Class.forName(var17.toString(), false, Class_182.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = (-1039833900 >>> 366136364 | 0) & 725701512; var36 < var20.length(); var36 += -1341644206 << 1016904672 ^ -1341644205) {
            int var64 = var20.charAt(var36) - 242;
            int var106 = (var64 & 65024) >> 9;
            int var65 = ((var64 & 65024) >> 9 | var64 << 7) - 192;
            int var107 = (((var64 & 65024) >> 9 | var64 << 7) - 192 & 65532) >> 2;
            var64 = (((var106 | var64 << 7) - 192 & 65532) >> 2 | ((var64 & 65024) >> 9 | var64 << 7) - 192 << 14) - 196;
            var106 = ((var107 | var65 << 14) - 196 & 65024) >> 9;
            int var67 = (((var107 | var65 << 14) - 196 & 65024) >> 9 | var64 << 7) ^ 200;
            int var109 = (((((var107 | var65 << 14) - 196 & 65024) >> 9 | var64 << 7) ^ 200) & 49152) >> 14;
            var64 = (((var106 | var64 << 7) ^ 200) & 49152) >> 14 | ((((var107 | var65 << 14) - 196 & 65024) >> 9 | var64 << 7) ^ 200) << 2;
            var106 = ((var109 | var67 << 2) & 64512) >> 10;
            int var69 = ((var109 | var67 << 2) & 64512) >> 10 | var64 << 6;
            int var111 = ((((var109 | var67 << 2) & 64512) >> 10 | var64 << 6) & 65504) >> 5;
            char var70 = (char)(((var106 | var64 << 6) & 65504) >> 5 | (((var109 | var67 << 2) & 64512) >> 10 | var64 << 6) << 11);
            var20.setCharAt(var36, (char)(var111 | var69 << 11));
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_182.class.getClassLoader()).returnType();
         switch ((var4 - 100063061 - 1099385501 ^ 1204354471 ^ 655459668) + 375609426 + 841258494 + 1705310455 - 451126550 + 1931490328 - 465751158) {
            case 21678789:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            case 704114357:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            case 1127157044:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            case 1814805615:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_2482[((var10 ^ 1279754872 ^ 479433210) + 1378016914 + 52312149 + 1345785249 - 956258271 ^ 1902747718) + 1555090715 + 866026847 + 2136681349] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
