import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;
import net.minecraft.class_11909;

public class Class_220 extends Class_375 {
   // $VF: renamed from: rvm Class_378
   public Class_378 field_1308;
   // $VF: renamed from: zbf Class_262
   public Class_262 field_1309 = (Class_262)0<"JNT",-724050520,"杢\udd63썣\udd63흣换","瘡穁穁穁癁篡","ڀޠ",-2013928741>(120, 210, 255);
   // $VF: renamed from: ury Class_262
   public Class_262 field_1310 = (Class_262)0<"JNT",-724050520,"杢\udd63썣\udd63흣换","瘡穁穁穁癁篡","ڀޠ",-2013928732>(30, 30, 35);
   // $VF: renamed from: uph Class_262
   public Class_262 field_1311 = (Class_262)0<"JNT",-724050520,"杢\udd63썣\udd63흣换","瘡穁穁穁癁篡","ڀޠ",-2013928731>(60, 60, 65);
   // $VF: renamed from: ce float
   public float field_1312 = 4.0F;
   // $VF: renamed from: gdy java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_1313 = new MethodHandle[56];

   public Class_220(Class_199 var1, Class_271 var2, int var3) {
      super(var1, var2, var3);
      this.field_1308 = (Class_378)var2;
   }

   // $VF: renamed from: vk (RenderEngine_216, int, int, float) void
   @Override
   public void method_1268(RenderEngine_216 var1, int var2, int var3, float var4) {
      int var5 = 0<"JNT",308372356,"｣\uef63｣","瘡癁穁","ۀŠ",-2013928724>(this) + 5;
      int var6 = 0<"JNT",308372356,"\ued63\ueb63썣","瘡癁穁","ۀŠ",-2013928723>(this)
         + 0<"JNT",308372356,"앣앣㍢","瘡癁穁","ۀŠ",-2013928714>(this)
         + 1<"JNT",-44860157,"돹韹鏹","蒠骠","ᆉᅭᇭ",33661529>(this)
         + 9;
      String var15 = 0<"JNT",308372356,"㍢㝢ﵣ","瘡癁窡繡絁翡絁省纡絁绡縁省箁羡罡繁绡縁碁","ޠڠ",-2013928719>(1<"JNT",-44860157,"韹蟹믹","蒠骠","ᆉᅭᇹእኅᆵ",33661530>(this));
      String var7 = 0<"JNT",308372356,"흣셣ꥣ흣\ueb63\udd63썣ㅢ","瘡癁窡繡絁翡絁省纡絁绡縁省箁羡罡繁绡縁碁","ـŠ߀Šເ\u0600ŠۀƠເ̠܀݀٠ۀƠീߠ٠\u0600ĀǠ݀",-2013928955>(
         0<"JNT",308372356,"쵣\uef63\uef63㕢썣㝢","瘡窡繡絁翡絁省纡絁绡縁省箁羡罡繁绡縁碁癁窡繡絁翡絁省纡絁绡縁省箁羡罡繁绡縁祡翁繁纡綡緁罡碁","ـŠ߀Šເ\u0600ŠۀƠເ̠܀݀٠ۀƠീߠ٠\u0600ĀǠ݀",-2013928956>(
            0<"JNT",308372356,"쵣\uef63\uef63㕢썣㝢","瘡窡繡絁翡絁省纡絁绡縁省笁絡繡緁綁羡碁癁窡繡絁翡絁省纡絁绡縁省箁羡罡繁绡縁祡翁繁纡綡緁罡碁","ـŠ߀Šເ\u0600ŠۀƠເ̠܀݀٠ۀƠീߠ٠\u0600ĀǠ݀",-2013928709>(
               (StringBuilder)0<"JNT",-724050520,"杢\udd63썣\udd63흣换","瘡癁篡","ـŠ߀Šເ\u0600ŠۀƠເ̠܀݀٠ۀƠീߠ٠\u0600ĀǠ݀",-2013928726>(), var15
            ),
            ":"
         )
      );
      0<"JNT",308372356,"ㅢ\udf63","瘡窡繡絁翡絁省纡絁绡縁省箁羡罡繁绡縁碁禡禡窡缡老碁癁禡","۠߀",-2013928945>(
         var1, var7, (double)var5, (double)var6, 1<"JNT",-1301044160,"돹꯸","蒠骠","ᆉᅭᇹኩእᆵ",33661532>()
      );
      String var16 = 0<"JNT",308372356,"㍢㝢ﵣ","瘡癁窡繡絁翡絁省纡絁绡縁省箁羡罡繁绡縁碁","ޠڠ",-2013928951>(1<"JNT",-44860157,"韹蟹믹","蒠骠","ᆉᅭᇹእኅᆵ",33661538>(this));
      StringBuilder var10000 = 0<"JNT",308372356,"쵣\uef63\uef63㕢썣㝢","瘡窡繡絁翡絁省纡絁绡縁省笁絡繡緁綁羡碁癁窡繡絁翡絁省纡絁绡縁省箁羡罡繁绡縁祡翁繁纡綡緁罡碁","ـŠ߀Šເ\u0600ŠۀƠເ̠܀݀٠ۀƠീߠ٠\u0600ĀǠ݀",-2013928717>(
         (StringBuilder)0<"JNT",-724050520,"杢\udd63썣\udd63흣换","瘡癁篡","ـŠ߀Šເ\u0600ŠۀƠເ̠܀݀٠ۀƠീߠ٠\u0600ĀǠ݀",-2013928958>(), var16
      );
      int var10001 = (264021951 ^ 264021951 | 0) & 1921232299;

      StringBuilder var10002;
      for (var10002 = (StringBuilder)0<"JNT",-724050520,"杢\udd63썣\udd63흣换","瘡窡繡絁翡絁省纡絁绡縁省箁羡罡繁绡縁碁癁篡","ـŠ߀Šເ\u0600ŠۀƠເ̠܀݀٠ۀƠീߠ٠\u0600ĀǠ݀",-2013928708>("胻Ė");
         var10001 < (861354046 & 250527487 ^ 38156348);
         var10001 += 1682424221 >>> 107600108 ^ 410749
      ) {
         int var26 = 0<"JNT",308372356,"쥣\udf63쵣\ueb63赣흣","瘡穁癁禁","ـŠ߀Šເ\u0600ŠۀƠເ̠܀݀٠ۀƠീߠ٠\u0600ĀǠ݀",-2013928707>(var10002, var10001) - 217;
         int var10005 = (var26 & 65535) >> 0;
         int var27 = (var26 & 65535) >> 0 | var26 << 16;
         int var38 = (((var26 & 65535) >> 0 | var26 << 16) & 49152) >> 14;
         char var28 = (char)(((((var10005 | var26 << 16) & 49152) >> 14 | ((var26 & 65535) >> 0 | var26 << 16) << 2) ^ 70) - 146);
         0<"JNT",308372356,"\ue963㕢흣襣\udf63쵣\ueb63赣흣","瘡穁禁癁篡","ـŠ߀Šເ\u0600ŠۀƠເ̠܀݀٠ۀƠീߠ٠\u0600ĀǠ݀",-2013928954>(
            var10002, var10001, (char)(((var38 | var27 << 2) ^ 70) - 146)
         );
      }

      String var8 = 0<"JNT",308372356,"흣셣ꥣ흣\ueb63\udd63썣ㅢ","瘡癁窡繡絁翡絁省纡絁绡縁省箁羡罡繁绡縁碁","ـŠ߀Šເ\u0600ŠۀƠເ̠܀݀٠ۀƠീߠ٠\u0600ĀǠ݀",-2013928736>(
         0<"JNT",308372356,"쵣\uef63\uef63㕢썣㝢","瘡窡繡絁翡絁省纡絁绡縁省箁羡罡繁绡縁碁癁窡繡絁翡絁省纡絁绡縁省箁羡罡繁绡縁祡翁繁纡綡緁罡碁","ـŠ߀Šເ\u0600ŠۀƠເ̠܀݀٠ۀƠീߠ٠\u0600ĀǠ݀",-2013928729>(
            var10000, 0<"JNT",308372356,"흣셣ꥣ흣\ueb63\udd63썣ㅢ","瘡癁窡繡絁翡絁省纡絁绡縁省箁羡罡繁绡縁碁","ـŠ߀Šເ\u0600ŠۀƠເ̠܀݀٠ۀƠീߠ٠\u0600ĀǠ݀",-2013928730>(var10002)
         )
      );
      double var9 = (double)var5 + 0<"JNT",308372356,"ﵣ핣\udb63","瘡窡繡絁翡絁省纡絁绡縁省箁羡罡繁绡縁碁癁禡","۠߀",-2013928735>(var1, var8) + 5.0;
      int var11 = (int)(
         (double)0<"JNT",308372356,"\udb63\udf63","瘡癁穁","ۀŠ",-2013928742>(this)
            - var9
            + (double)0<"JNT",308372356,"｣\uef63｣","瘡癁穁","ۀŠ",-2013928725>(this)
            - 5.0
      );
      int var12 = var6 - 2;
      byte var13 = 18;
      0<"JNT",308372356,"썣쥣㝢","瘡窡缡老碁禡禡禡禡禡禡禡禡癁篡","۠߀",-2013928715>(
         var1,
         1<"JNT",-44860157,"鯹\ueff9迹","蒠骠","ᆉᅭᇹኩእᆵ",33661582>(this),
         var9,
         (double)var12,
         var9 + (double)var11,
         (double)(var12 + var13),
         4.0,
         4.0,
         4.0,
         4.0
      );
      0<"JNT",308372356,"썣쥣㝢","瘡窡缡老碁禡禡禡禡禡禡禡禡癁篡","۠߀",-2013928769>(
         var1,
         1<"JNT",-44860157,"鯹韹쯹","蒠骠","ᆉᅭᇹኩእᆵ",33661580>(this),
         var9 + 1.0,
         (double)(var12 + 1),
         var9 + (double)var11 - 1.0,
         (double)(var12 + var13 - 1),
         3.5,
         3.5,
         3.5,
         3.5
      );
      String var18 = 0<"JNT",308372356,"㍢앣","瘡癁穁","ޠڠ",-2013928733>(1<"JNT",-44860157,"韹蟹믹","蒠骠","ᆉᅭᇹእኅᆵ",33661584>(this)) != 1 ? "s" : "";
      int var17 = 0<"JNT",308372356,"㍢앣","瘡癁穁","ޠڠ",-2013928775>(1<"JNT",-44860157,"韹蟹믹","蒠骠","ᆉᅭᇹእኅᆵ",33661586>(this));
      var10000 = 0<"JNT",308372356,"쵣\uef63\uef63㕢썣㝢","瘡穁癁窡繡絁翡絁省纡絁绡縁省箁羡罡繁绡縁祡翁繁纡綡緁罡碁","ـŠ߀Šເ\u0600ŠۀƠເ̠܀݀٠ۀƠീߠ٠\u0600ĀǠ݀",-2013928960>(
         (StringBuilder)0<"JNT",-724050520,"杢\udd63썣\udd63흣换","瘡癁篡","ـŠ߀Šເ\u0600ŠۀƠເ̠܀݀٠ۀƠീߠ٠\u0600ĀǠ݀",-2013928953>(), var17
      );
      var10001 = (-1744861785 ^ 1033181961 | 0) & 1351680000;

      for (var10002 = (StringBuilder)0<"JNT",-724050520,"杢\udd63썣\udd63흣换","瘡窡繡絁翡絁省纡絁绡縁省箁羡罡繁绡縁碁癁篡","ـŠ߀Šເ\u0600ŠۀƠເ̠܀݀٠ۀƠീߠ٠\u0600ĀǠ݀",-2013928959>(
            "\ue893ʒ窒纒Გڒ"
         );
         var10001 < 6;
         var10001 += 1
      ) {
         int var31 = 0<"JNT",308372356,"쥣\udf63쵣\ueb63赣흣","瘡穁癁禁","ـŠ߀Šເ\u0600ŠۀƠເ̠܀݀٠ۀƠീߠ٠\u0600ĀǠ݀",-2013928740>(var10002, var10001) - 148;
         int var39 = (var31 & 65520) >> 4;
         int var32 = (var31 & 65520) >> 4 | var31 << 12;
         int var40 = (((var31 & 65520) >> 4 | var31 << 12) & 65504) >> 5;
         char var33 = (char)(((((var39 | var31 << 12) & 65504) >> 5 | ((var31 & 65520) >> 4 | var31 << 12) << 11) ^ 164) + 201);
         0<"JNT",308372356,"\ue963㕢흣襣\udf63쵣\ueb63赣흣","瘡穁禁癁篡","ـŠ߀Šເ\u0600ŠۀƠເ̠܀݀٠ۀƠീߠ٠\u0600ĀǠ݀",-2013928739>(
            var10002, var10001, (char)(((var40 | var32 << 11) ^ 164) + 201)
         );
      }

      String var14 = 0<"JNT",308372356,"흣셣ꥣ흣\ueb63\udd63썣ㅢ","瘡癁窡繡絁翡絁省纡絁绡縁省箁羡罡繁绡縁碁","ـŠ߀Šເ\u0600ŠۀƠເ̠܀݀٠ۀƠീߠ٠\u0600ĀǠ݀",-2013928727>(
         0<"JNT",308372356,"쵣\uef63\uef63㕢썣㝢","瘡窡繡絁翡絁省纡絁绡縁省笁絡繡緁綁羡碁癁窡繡絁翡絁省纡絁绡縁省箁羡罡繁绡縁祡翁繁纡綡緁罡碁","ـŠ߀Šເ\u0600ŠۀƠເ̠܀݀٠ۀƠീߠ٠\u0600ĀǠ݀",-2013928728>(
            0<"JNT",308372356,"쵣\uef63\uef63㕢썣㝢","瘡窡繡絁翡絁省纡絁绡縁省箁羡罡繁绡縁碁癁窡繡絁翡絁省纡絁绡縁省箁羡罡繁绡縁祡翁繁纡綡緁罡碁","ـŠ߀Šເ\u0600ŠۀƠເ̠܀݀٠ۀƠീߠ٠\u0600ĀǠ݀",-2013928721>(
               var10000, 0<"JNT",308372356,"흣셣ꥣ흣\ueb63\udd63썣ㅢ","瘡癁窡繡絁翡絁省纡絁绡縁省箁羡罡繁绡縁碁","ـŠ߀Šເ\u0600ŠۀƠເ̠܀݀٠ۀƠീߠ٠\u0600ĀǠ݀",-2013928722>(var10002)
            ),
            var18
         )
      );
      0<"JNT",308372356,"ㅢ\udf63","瘡窡繡絁翡絁省纡絁绡縁省箁羡罡繁绡縁碁禡禡窡缡老碁癁禡","۠߀",-2013928749>(
         var1, var14, var9 + 4.0, (double)(var12 + 3), 1<"JNT",-44860157,"돹蟹돹","蒠骠","ᆉᅭᇹኩእᆵ",33661568>(this)
      );
   }

   // $VF: renamed from: yr (net.minecraft.class_11909, boolean) void
   @Override
   public void method_1272(class_11909 var1, boolean var2) {
      if (0<"JNT",308372356,"ㅢ｣핣","瘡禡禡癁籡","ۀŠ",-2013928939>(
            this,
            0<"JNT",308372356,"쥣셣앣\uef63ꅣ坢兢絢罢","瘡癁禡","ۀǠ܀ເ۠٠ۀǠĠ݀Šǀ܀ເĠ\u0600Šܠܠ འའౠ\u0e80ౠ",-2013928949>(var1),
            0<"JNT",308372356,"쥣셣앣\uef63ꅣ坢兢絢絢","瘡癁禡","ۀǠ܀ເ۠٠ۀǠĠ݀Šǀ܀ເĠ\u0600Šܠܠ འའౠ\u0e80ౠ",-2013928940>(var1)
         )
         && 0<"JNT",308372356,"앣㕢흣\udf63셣㝢ꅣ兢坢止坢啢","瘡癁穁","ۀǠ܀ເ۠٠ۀǠĠ݀Šǀ܀ເĠ\u0600Šܠܠ འའౠ\u0e80ౠ",-2013928738>(var1) == 0) {
         0<"JNT",308372356,"앣㕢흣\udf63셣㝢ꅣ浢啢潢兢","瘡窡绡緁羡省绁繁绡緁綁罡絁緡羡省綁纡絁羁羁紁瞡瞁码碁癁篡","ۀǠ܀ເ۠٠ۀǠĠ݀Šǀ܀ເĠ\u0600Šܠܠ ༠འ\u0e80",-2013928750>(
            1<"JNT",-44860157,"뿹韹","蒠骠","ᆉᅭᇹኁቝኙᆅችቭኁቝቕኑቍቡኙᆅቕቹቍንንቅᆕᆍᆩᆵ",33661553>(this),
            (Class_187)0<"JNT",-724050520,"杢\udd63썣\udd63흣换","瘡窡绡絁碁窡老缁碁癁篡","\u0600ݠ",-2013928743>(this, 1<"JNT",-44860157,"韹蟹믹","蒠骠","ᆉᅭᇹእኅᆵ",33661554>(this))
         );
      }

      0<"JNT",1007440953,"ﵣ\ueb63","瘡窡绡緁羡省绁繁绡緁綁罡絁緡羡省綁纡絁羁羁紁睁睁硁眡硁碁籡癁篡","ޠـ",-2013928710>(this, var1, var2);
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1293(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 ^ 554614294 ^ 785069284 ^ 1663563656) - 677702474 ^ 2036920037) - 567479 - 1905456252 - 1683704101 + 1966244413;
      MethodHandle var10000 = field_1313[((var10 ^ 554614294 ^ 785069284 ^ 1663563656) - 677702474 ^ 2036920037)
            - 567479
            - 1905456252
            - 1683704101
            + 1966244413
         ^ 1528166039];
      if (field_1313[var10001 ^ 1528166039] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = -1034395661 ^ (4299086 | -1029242671) ^ 12568108;
            var23 < var13.length();
            var23 += (-2131532290 | -1563525757 * (-2131532290 | -1563525757)) ^ -352846338
         ) {
            int var42 = var13.charAt(var23) + 154;
            char var45 = (char)(
               (((((((var42 & 65408) >> 7 | var42 << 9) & 65528) >> 3 | ((var42 & 65408) >> 7 | var42 << 9) << 13) ^ 179) - 3 + 108 + 22 + 99 ^ 146) & 32768)
                     >> 15
                  | ((((((var42 & 65408) >> 7 | var42 << 9) & 65528) >> 3 | ((var42 & 65408) >> 7 | var42 << 9) << 13) ^ 179) - 3 + 108 + 22 + 99 ^ 146) << 1
            );
            var13.setCharAt(
               var23,
               (char)(
                  (((((((var42 & 65408) >> 7 | var42 << 9) & 65528) >> 3 | ((var42 & 65408) >> 7 | var42 << 9) << 13) ^ 179) - 3 + 108 + 22 + 99 ^ 146) & 32768)
                        >> 15
                     | ((((((var42 & 65408) >> 7 | var42 << 9) & 65528) >> 3 | ((var42 & 65408) >> 7 | var42 << 9) << 13) ^ 179) - 3 + 108 + 22 + 99 ^ 146)
                        << 1
               )
            );
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = -2115115573 >> (-2142665641 & -2115115573 >> -2142665641) ^ -264389447;
            var29 < var16.length();
            var29 += (769117501 - 1713756575 | 1) & 272893953
         ) {
            int var50 = var16.charAt(var29);
            int var85 = (var50 & 65408) >> 7;
            int var51 = ((var50 & 65408) >> 7 | var50 << 9) - 74 + 63 - 228 + 9;
            int var86 = (((var50 & 65408) >> 7 | var50 << 9) - 74 + 63 - 228 + 9 & 65528) >> 3;
            var50 = ((var85 | var50 << 9) - 74 + 63 - 228 + 9 & 65528) >> 3 | ((var50 & 65408) >> 7 | var50 << 9) - 74 + 63 - 228 + 9 << 13;
            var85 = ((var86 | var51 << 13) & 65535) >> 0;
            int var53 = (((var86 | var51 << 13) & 65535) >> 0 | var50 << 16) ^ 64;
            int var88 = (((((var86 | var51 << 13) & 65535) >> 0 | var50 << 16) ^ 64) & 63488) >> 11;
            char var54 = (char)(((((var85 | var50 << 16) ^ 64) & 63488) >> 11 | ((((var86 | var51 << 13) & 65535) >> 0 | var50 << 16) ^ 64) << 5) + 15);
            var16.setCharAt(var29, (char)((var88 | var53 << 5) + 15));
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_220.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = (1582099159 << -823024665 | 0) & 1099600975;
            var35 < var19.length();
            var35 += -1422427932 - (-1847296570 >>> -1847296570) ^ -1460672788
         ) {
            int var59 = var19.charAt(var35);
            int var89 = (var59 & 65520) >> 4;
            int var60 = (var59 & 65520) >> 4 | var59 << 12;
            int var90 = (((var59 & 65520) >> 4 | var59 << 12) & 65534) >> 1;
            var59 = ((((var89 | var59 << 12) & 65534) >> 1 | ((var59 & 65520) >> 4 | var59 << 12) << 15) ^ 211) - 17;
            var89 = (((var90 | var60 << 15) ^ 211) - 17 & 61440) >> 12;
            int var62 = (((var90 | var60 << 15) ^ 211) - 17 & 61440) >> 12 | var59 << 4;
            int var92 = (((((var90 | var60 << 15) ^ 211) - 17 & 61440) >> 12 | var59 << 4) & 65520) >> 4;
            char var63 = (char)(
               (((var89 | var59 << 4) & 65520) >> 4 | ((((var90 | var60 << 15) ^ 211) - 17 & 61440) >> 12 | var59 << 4) << 12) + 23 - 240 + 96 + 19
            );
            var19.setCharAt(var35, (char)((var92 | var62 << 12) + 23 - 240 + 96 + 19));
         }

         Class var7 = Class.forName(var19.toString(), false, Class_220.class.getClassLoader());
         switch ((var4 - 63672313 + 1504466181 ^ 532092133) - 2133361670 - 524502376 + 1355683853 + 587076066 + 581238193 - 1127277568 + 883759541) {
            case 512838200:
               var10000 = var0.findConstructor(var7, var6);
               break;
            case 1109629834:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            case 1635176540:
            case 2103150331:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 2010882439:
               var10000 = var0.findSpecial(var7, var5, var6, Class_220.class);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_1313[((var10 ^ 554614294 ^ 785069284 ^ 1663563656) - 677702474 ^ 2036920037) - 567479 - 1905456252 - 1683704101 + 1966244413 ^ 1528166039] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1294(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = var10 + 1704996643 - 616387720 - 842539826 - 54449228 + 1782212062 - 1288033490 ^ 1403945606 ^ 1831995327 ^ 561415067;
      MethodHandle var10000 = field_1313[(var10 + 1704996643 - 616387720 - 842539826 - 54449228 + 1782212062 - 1288033490 ^ 1403945606 ^ 1831995327 ^ 561415067)
         - 889720836];
      if (field_1313[var10001 - 889720836] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = (457115110 + 1944571266 | 0) & 818487444; var24 < var14.length(); var24 += (-807601448 ^ 1429876658 | 1) & 1140850705) {
            char var43 = var14.charAt(var24);
            char var48 = (char)(
               (
                     (
                              (
                                    (
                                             (
                                                   (
                                                            (
                                                                  (
                                                                           (
                                                                                 (((var43 & '\ue000') >> 13 | var43 << 3) & 65535) >> 0
                                                                                    | ((var43 & '\ue000') >> 13 | var43 << 3) << 16
                                                                              )
                                                                              & 65408
                                                                        )
                                                                        >> 7
                                                                     | (
                                                                           (((var43 & '\ue000') >> 13 | var43 << 3) & 65535) >> 0
                                                                              | ((var43 & '\ue000') >> 13 | var43 << 3) << 16
                                                                        )
                                                                        << 9
                                                               )
                                                               & 65535
                                                         )
                                                         >> 0
                                                      | (
                                                            (
                                                                     (
                                                                           (((var43 & '\ue000') >> 13 | var43 << 3) & 65535) >> 0
                                                                              | ((var43 & '\ue000') >> 13 | var43 << 3) << 16
                                                                        )
                                                                        & 65408
                                                                  )
                                                                  >> 7
                                                               | (
                                                                     (((var43 & '\ue000') >> 13 | var43 << 3) & 65535) >> 0
                                                                        | ((var43 & '\ue000') >> 13 | var43 << 3) << 16
                                                                  )
                                                                  << 9
                                                         )
                                                         << 16
                                                )
                                                & 65472
                                          )
                                          >> 6
                                       | (
                                             (
                                                      (
                                                            (
                                                                     (
                                                                           (((var43 & '\ue000') >> 13 | var43 << 3) & 65535) >> 0
                                                                              | ((var43 & '\ue000') >> 13 | var43 << 3) << 16
                                                                        )
                                                                        & 65408
                                                                  )
                                                                  >> 7
                                                               | (
                                                                     (((var43 & '\ue000') >> 13 | var43 << 3) & 65535) >> 0
                                                                        | ((var43 & '\ue000') >> 13 | var43 << 3) << 16
                                                                  )
                                                                  << 9
                                                         )
                                                         & 65535
                                                   )
                                                   >> 0
                                                | (
                                                      (
                                                               (
                                                                     (((var43 & '\ue000') >> 13 | var43 << 3) & 65535) >> 0
                                                                        | ((var43 & '\ue000') >> 13 | var43 << 3) << 16
                                                                  )
                                                                  & 65408
                                                            )
                                                            >> 7
                                                         | (
                                                               (((var43 & '\ue000') >> 13 | var43 << 3) & 65535) >> 0
                                                                  | ((var43 & '\ue000') >> 13 | var43 << 3) << 16
                                                            )
                                                            << 9
                                                   )
                                                   << 16
                                          )
                                          << 10
                                 )
                                 ^ 245
                           )
                           - 74
                           + 205
                        ^ 216
                  )
                  + 167
            );
            var14.setCharAt(
               var24,
               (char)(
                  (
                        (
                                 (
                                       (
                                                (
                                                      (
                                                               (
                                                                     (
                                                                              (
                                                                                    (((var43 & '\ue000') >> 13 | var43 << 3) & 65535) >> 0
                                                                                       | ((var43 & '\ue000') >> 13 | var43 << 3) << 16
                                                                                 )
                                                                                 & 65408
                                                                           )
                                                                           >> 7
                                                                        | (
                                                                              (((var43 & '\ue000') >> 13 | var43 << 3) & 65535) >> 0
                                                                                 | ((var43 & '\ue000') >> 13 | var43 << 3) << 16
                                                                           )
                                                                           << 9
                                                                  )
                                                                  & 65535
                                                            )
                                                            >> 0
                                                         | (
                                                               (
                                                                        (
                                                                              (((var43 & '\ue000') >> 13 | var43 << 3) & 65535) >> 0
                                                                                 | ((var43 & '\ue000') >> 13 | var43 << 3) << 16
                                                                           )
                                                                           & 65408
                                                                     )
                                                                     >> 7
                                                                  | (
                                                                        (((var43 & '\ue000') >> 13 | var43 << 3) & 65535) >> 0
                                                                           | ((var43 & '\ue000') >> 13 | var43 << 3) << 16
                                                                     )
                                                                     << 9
                                                            )
                                                            << 16
                                                   )
                                                   & 65472
                                             )
                                             >> 6
                                          | (
                                                (
                                                         (
                                                               (
                                                                        (
                                                                              (((var43 & '\ue000') >> 13 | var43 << 3) & 65535) >> 0
                                                                                 | ((var43 & '\ue000') >> 13 | var43 << 3) << 16
                                                                           )
                                                                           & 65408
                                                                     )
                                                                     >> 7
                                                                  | (
                                                                        (((var43 & '\ue000') >> 13 | var43 << 3) & 65535) >> 0
                                                                           | ((var43 & '\ue000') >> 13 | var43 << 3) << 16
                                                                     )
                                                                     << 9
                                                            )
                                                            & 65535
                                                      )
                                                      >> 0
                                                   | (
                                                         (
                                                                  (
                                                                        (((var43 & '\ue000') >> 13 | var43 << 3) & 65535) >> 0
                                                                           | ((var43 & '\ue000') >> 13 | var43 << 3) << 16
                                                                     )
                                                                     & 65408
                                                               )
                                                               >> 7
                                                            | (
                                                                  (((var43 & '\ue000') >> 13 | var43 << 3) & 65535) >> 0
                                                                     | ((var43 & '\ue000') >> 13 | var43 << 3) << 16
                                                               )
                                                               << 9
                                                      )
                                                      << 16
                                             )
                                             << 10
                                    )
                                    ^ 245
                              )
                              - 74
                              + 205
                           ^ 216
                     )
                     + 167
               )
            );
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = (-1263736872 & -2121834227 >>> 912848448 | 0) & 926518273; var30 < var17.length(); var30 += -509549576 >> -517163338 ^ -121) {
            int var53 = (var17.charAt(var30) ^ 240) + 5 + 25;
            char var56 = (char)(
               (
                        (((((var53 & 63488) >> 11 | var53 << 5) + 65 ^ 237) - 33 & 65520) >> 4 | (((var53 & 63488) >> 11 | var53 << 5) + 65 ^ 237) - 33 << 12)
                              - 236
                           & 64512
                     )
                     >> 10
                  | (((((var53 & 63488) >> 11 | var53 << 5) + 65 ^ 237) - 33 & 65520) >> 4 | (((var53 & 63488) >> 11 | var53 << 5) + 65 ^ 237) - 33 << 12)
                        - 236
                     << 6
            );
            var17.setCharAt(
               var30,
               (char)(
                  (
                           (
                                    ((((var53 & 63488) >> 11 | var53 << 5) + 65 ^ 237) - 33 & 65520) >> 4
                                       | (((var53 & 63488) >> 11 | var53 << 5) + 65 ^ 237) - 33 << 12
                                 )
                                 - 236
                              & 64512
                        )
                        >> 10
                     | (((((var53 & 63488) >> 11 | var53 << 5) + 65 ^ 237) - 33 & 65520) >> 4 | (((var53 & 63488) >> 11 | var53 << 5) + 65 ^ 237) - 33 << 12)
                           - 236
                        << 6
               )
            );
         }

         Class var6 = Class.forName(var17.toString(), false, Class_220.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = -1574985900 << 632539871 ^ 0; var36 < var20.length(); var36 += (-801042119 ^ 1549645481 | 1) & 562235463) {
            int var61 = var20.charAt(var36) - '+';
            int var97 = (var61 & 65024) >> 9;
            int var62 = ((var61 & 65024) >> 9 | var61 << 7) - 3 + 239;
            int var98 = (((var61 & 65024) >> 9 | var61 << 7) - 3 + 239 & 65528) >> 3;
            var61 = ((var97 | var61 << 7) - 3 + 239 & 65528) >> 3 | ((var61 & 65024) >> 9 | var61 << 7) - 3 + 239 << 13;
            var97 = ((var98 | var62 << 13) & 65520) >> 4;
            int var64 = ((var98 | var62 << 13) & 65520) >> 4 | var61 << 12;
            int var100 = ((((var98 | var62 << 13) & 65520) >> 4 | var61 << 12) & 0) >> 16;
            var61 = ((var97 | var61 << 12) & 0) >> 16 | (((var98 | var62 << 13) & 65520) >> 4 | var61 << 12) << 0;
            var97 = ((var100 | var64 << 0) & 65504) >> 5;
            int var66 = (((var100 | var64 << 0) & 65504) >> 5 | var61 << 11) + 187;
            int var102 = ((((var100 | var64 << 0) & 65504) >> 5 | var61 << 11) + 187 & 57344) >> 13;
            char var67 = (char)(((var97 | var61 << 11) + 187 & 57344) >> 13 | (((var100 | var64 << 0) & 65504) >> 5 | var61 << 11) + 187 << 3);
            var20.setCharAt(var36, (char)(var102 | var66 << 3));
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_220.class.getClassLoader()).returnType();
         switch ((var4 - 2084575685 - 1289853939 - 109124684 - 1120849193 + 81687543 ^ 2111758445 ^ 1958320774) + 1146826395 + 213434689 + 309690175) {
            case 182359387:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            case 253716144:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            case 286290684:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            case 1244699201:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_1313[(var10 + 1704996643 - 616387720 - 842539826 - 54449228 + 1782212062 - 1288033490 ^ 1403945606 ^ 1831995327 ^ 561415067) - 889720836] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
