import dev.krypton.native.Loader;
import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;

public enum Class_266 {
   // $VF: renamed from: iu Class_266
   field_1084,
   // $VF: renamed from: anf Class_266
   field_1085;

   // $VF: renamed from: nen java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_1087 = new MethodHandle[15];

   // $VF: Failed to inline enum fields
   // Please report this to the Vineflower issue tracker, at https://github.com/Vineflower/vineflower/issues with a copy of the class file (if you have the rights to distribute it!)
   static {
      Loader.init(Class_266.class);
      int var10000 = 506658232 >> 506658232 ^ 30;

      StringBuilder var10001;
      for (var10001 = (StringBuilder)0<"JNT",-1743748590,"\u0a61㝡㱡㝡䉡ౡ","뽀݁䍁ㅁ孁ㅁ쵀䝁ㅁ䭁㵁쵀ᕁ坁十䅁䭁㵁\ue540셀ᭁ","胠胷胬胷肤胢胷胤能肤胉胪胨胿胤能胘胫胿胢胺胻胨",-672312173>("\ue49e\ue6be\ue79e");
         var10000 < (1719926784 ^ 1719926787);
         var10000 += (418897554 & 418897554 | 1) & 1140858917
      ) {
         int var6 = 0<"JNT",980945560,"ㅡ㙡⽡䁡佡䉡","뽀Ł셀\uf540","胠胷胬胷肤胢胷胤能肤胉胪胨胿胤能胘胫胿胢胺胻胨",-672312169>(var10001, var10000) ^ 233 ^ 40;
         char var7 = (char)((((var6 & 65504) >> 5 | var6 << 11) ^ 175) + 180);
         0<"JNT",980945560,"䅡㍡䉡兡㙡⽡䁡佡䉡","뽀Ł\uf540셀ᭁ","胠胷胬胷肤胢胷胤能肤胉胪胨胿胤能胘胫胿胢胺胻胨",-672312168>(
            var10001, var10000, (char)((((var6 & 65504) >> 5 | var6 << 11) ^ 175) + 180)
         );
      }

      field_1084 = (Class_266)0<"JNT",-1743748590,"\u0a61㝡㱡㝡䉡ౡ","뽀݁䍁ㅁ孁ㅁ쵀䝁ㅁ䭁㵁쵀ᕁ坁十䅁䭁㵁\ue540Ł셀ᭁ","胧",-672312171>(
         0<"JNT",980945560,"䉡㵡慡䉡䁡㝡㱡㕡","뽀셀݁䍁ㅁ孁ㅁ쵀䝁ㅁ䭁㵁쵀ᕁ坁十䅁䭁㵁\ue540","胠胷胬胷肤胢胷胤能肤胉胪胨胿胤能胘胫胿胢胺胻胨",-672312172>(var10001), 0
      );
      var10000 = (-1100181049 >>> 742676857 | 0) & -1683550976;

      for (var10001 = (StringBuilder)0<"JNT",-1743748590,"\u0a61㝡㱡㝡䉡ౡ","뽀݁䍁ㅁ孁ㅁ쵀䝁ㅁ䭁㵁쵀ᕁ坁十䅁䭁㵁\ue540셀ᭁ","胠胷胬胷肤胢胷胤能肤胉胪胨胿胤能胘胫胿胢胺胻胨",-672312170>("䀔翩耔䀖翩\u0014");
         var10000 < ((-1091889931 * -350345102 | 6) & 541335655);
         var10000 += 1839904206 ^ 2038764823 ^ 338665688
      ) {
         int var10 = 0<"JNT",980945560,"ㅡ㙡⽡䁡佡䉡","뽀Ł셀\uf540","胠胷胬胷肤胢胷胤能肤胉胪胨胿胤能胘胫胿胢胺胻胨",-672312167>(var10001, var10000) ^ 20;
         char var13 = (char)(
            (
                  (((((var10 & 65504) >> 5 | var10 << 11) & 65024) >> 9 | ((var10 & 65504) >> 5 | var10 << 11) << 7) & 0) >> 16
                     | ((((var10 & 65504) >> 5 | var10 << 11) & 65024) >> 9 | ((var10 & 65504) >> 5 | var10 << 11) << 7) << 0
               )
               + 76
         );
         0<"JNT",980945560,"䅡㍡䉡兡㙡⽡䁡佡䉡","뽀Ł\uf540셀ᭁ","胠胷胬胷肤胢胷胤能肤胉胪胨胿胤能胘胫胿胢胺胻胨",-672312166>(
            var10001,
            var10000,
            (char)(
               (
                     (((((var10 & 65504) >> 5 | var10 << 11) & 65024) >> 9 | ((var10 & 65504) >> 5 | var10 << 11) << 7) & 0) >> 16
                        | ((((var10 & 65504) >> 5 | var10 << 11) & 65024) >> 9 | ((var10 & 65504) >> 5 | var10 << 11) << 7) << 0
                  )
                  + 76
            )
         );
      }

      field_1085 = (Class_266)0<"JNT",-1743748590,"\u0a61㝡㱡㝡䉡ౡ","뽀݁䍁ㅁ孁ㅁ쵀䝁ㅁ䭁㵁쵀ᕁ坁十䅁䭁㵁\ue540Ł셀ᭁ","胧",-672312176>(
         0<"JNT",980945560,"䉡㵡慡䉡䁡㝡㱡㕡","뽀셀݁䍁ㅁ孁ㅁ쵀䝁ㅁ䭁㵁쵀ᕁ坁十䅁䭁㵁\ue540","胠胷胬胷肤胢胷胤能肤胉胪胨胿胤能胘胫胿胢胺胻胨",-672312177>(var10001), 1
      );
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1185(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 - 2128200603 ^ 634573343) + 1179342142 - 669711472 ^ 1924757938 ^ 829655878 ^ 341787211) + 1542753598 ^ 568695212;
      MethodHandle var10000 = field_1087[(
            ((var10 - 2128200603 ^ 634573343) + 1179342142 - 669711472 ^ 1924757938 ^ 829655878 ^ 341787211) + 1542753598 ^ 568695212
         )
         - 156049884];
      if (field_1087[var10001 - 156049884] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = (-934615392 - -1358491793 | 0) & -1004003122; var23 < var13.length(); var23 += -1542387019 << (-372643832 | 1433835196) ^ 1342177281) {
            char var42 = var13.charAt(var23);
            char var47 = (char)(
               (
                        (
                              (
                                       (
                                             (
                                                      (
                                                            (
                                                                     (
                                                                           (((var42 & '\uffc0') >> 6 | var42 << '\n') + 97 + 229 & 65534) >> 1
                                                                              | ((var42 & '\uffc0') >> 6 | var42 << '\n') + 97 + 229 << 15
                                                                        )
                                                                        & 57344
                                                                  )
                                                                  >> 13
                                                               | (
                                                                     (((var42 & '\uffc0') >> 6 | var42 << '\n') + 97 + 229 & 65534) >> 1
                                                                        | ((var42 & '\uffc0') >> 6 | var42 << '\n') + 97 + 229 << 15
                                                                  )
                                                                  << 3
                                                         )
                                                         & 65024
                                                   )
                                                   >> 9
                                                | (
                                                      (
                                                               (
                                                                     (((var42 & '\uffc0') >> 6 | var42 << '\n') + 97 + 229 & 65534) >> 1
                                                                        | ((var42 & '\uffc0') >> 6 | var42 << '\n') + 97 + 229 << 15
                                                                  )
                                                                  & 57344
                                                            )
                                                            >> 13
                                                         | (
                                                               (((var42 & '\uffc0') >> 6 | var42 << '\n') + 97 + 229 & 65534) >> 1
                                                                  | ((var42 & '\uffc0') >> 6 | var42 << '\n') + 97 + 229 << 15
                                                            )
                                                            << 3
                                                   )
                                                   << 7
                                          )
                                          ^ 7
                                    )
                                    + 250
                                 ^ 6
                           )
                           & 63488
                     )
                     >> 11
                  | (
                        (
                                 (
                                       (
                                                (
                                                      (
                                                               (
                                                                     (((var42 & '\uffc0') >> 6 | var42 << '\n') + 97 + 229 & 65534) >> 1
                                                                        | ((var42 & '\uffc0') >> 6 | var42 << '\n') + 97 + 229 << 15
                                                                  )
                                                                  & 57344
                                                            )
                                                            >> 13
                                                         | (
                                                               (((var42 & '\uffc0') >> 6 | var42 << '\n') + 97 + 229 & 65534) >> 1
                                                                  | ((var42 & '\uffc0') >> 6 | var42 << '\n') + 97 + 229 << 15
                                                            )
                                                            << 3
                                                   )
                                                   & 65024
                                             )
                                             >> 9
                                          | (
                                                (
                                                         (
                                                               (((var42 & '\uffc0') >> 6 | var42 << '\n') + 97 + 229 & 65534) >> 1
                                                                  | ((var42 & '\uffc0') >> 6 | var42 << '\n') + 97 + 229 << 15
                                                            )
                                                            & 57344
                                                      )
                                                      >> 13
                                                   | (
                                                         (((var42 & '\uffc0') >> 6 | var42 << '\n') + 97 + 229 & 65534) >> 1
                                                            | ((var42 & '\uffc0') >> 6 | var42 << '\n') + 97 + 229 << 15
                                                      )
                                                      << 3
                                             )
                                             << 7
                                    )
                                    ^ 7
                              )
                              + 250
                           ^ 6
                     )
                     << 5
            );
            var13.setCharAt(
               var23,
               (char)(
                  (
                           (
                                 (
                                          (
                                                (
                                                         (
                                                               (
                                                                        (
                                                                              (((var42 & '\uffc0') >> 6 | var42 << '\n') + 97 + 229 & 65534) >> 1
                                                                                 | ((var42 & '\uffc0') >> 6 | var42 << '\n') + 97 + 229 << 15
                                                                           )
                                                                           & 57344
                                                                     )
                                                                     >> 13
                                                                  | (
                                                                        (((var42 & '\uffc0') >> 6 | var42 << '\n') + 97 + 229 & 65534) >> 1
                                                                           | ((var42 & '\uffc0') >> 6 | var42 << '\n') + 97 + 229 << 15
                                                                     )
                                                                     << 3
                                                            )
                                                            & 65024
                                                      )
                                                      >> 9
                                                   | (
                                                         (
                                                                  (
                                                                        (((var42 & '\uffc0') >> 6 | var42 << '\n') + 97 + 229 & 65534) >> 1
                                                                           | ((var42 & '\uffc0') >> 6 | var42 << '\n') + 97 + 229 << 15
                                                                     )
                                                                     & 57344
                                                               )
                                                               >> 13
                                                            | (
                                                                  (((var42 & '\uffc0') >> 6 | var42 << '\n') + 97 + 229 & 65534) >> 1
                                                                     | ((var42 & '\uffc0') >> 6 | var42 << '\n') + 97 + 229 << 15
                                                               )
                                                               << 3
                                                      )
                                                      << 7
                                             )
                                             ^ 7
                                       )
                                       + 250
                                    ^ 6
                              )
                              & 63488
                        )
                        >> 11
                     | (
                           (
                                    (
                                          (
                                                   (
                                                         (
                                                                  (
                                                                        (((var42 & '\uffc0') >> 6 | var42 << '\n') + 97 + 229 & 65534) >> 1
                                                                           | ((var42 & '\uffc0') >> 6 | var42 << '\n') + 97 + 229 << 15
                                                                     )
                                                                     & 57344
                                                               )
                                                               >> 13
                                                            | (
                                                                  (((var42 & '\uffc0') >> 6 | var42 << '\n') + 97 + 229 & 65534) >> 1
                                                                     | ((var42 & '\uffc0') >> 6 | var42 << '\n') + 97 + 229 << 15
                                                               )
                                                               << 3
                                                      )
                                                      & 65024
                                                )
                                                >> 9
                                             | (
                                                   (
                                                            (
                                                                  (((var42 & '\uffc0') >> 6 | var42 << '\n') + 97 + 229 & 65534) >> 1
                                                                     | ((var42 & '\uffc0') >> 6 | var42 << '\n') + 97 + 229 << 15
                                                               )
                                                               & 57344
                                                         )
                                                         >> 13
                                                      | (
                                                            (((var42 & '\uffc0') >> 6 | var42 << '\n') + 97 + 229 & 65534) >> 1
                                                               | ((var42 & '\uffc0') >> 6 | var42 << '\n') + 97 + 229 << 15
                                                         )
                                                         << 3
                                                )
                                                << 7
                                       )
                                       ^ 7
                                 )
                                 + 250
                              ^ 6
                        )
                        << 5
               )
            );
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = (2132011558 * 452659801 * -1684647613 | 0) & 1434546304;
            var29 < var16.length();
            var29 += (-1494798615 >>> -1597724652 | 1) & -1222339567
         ) {
            char var52 = var16.charAt(var29);
            char var57 = (char)(
               (
                     (
                              (
                                    (
                                             (
                                                   (
                                                            (
                                                                     (
                                                                           (((var52 & '\uf800') >> 11 | var52 << 5) & 63488) >> 11
                                                                              | ((var52 & '\uf800') >> 11 | var52 << 5) << 5
                                                                        )
                                                                        ^ 3
                                                                  )
                                                                  + 131
                                                                  + 137
                                                                  - 122
                                                               & 65024
                                                         )
                                                         >> 9
                                                      | (
                                                               (
                                                                     (((var52 & '\uf800') >> 11 | var52 << 5) & 63488) >> 11
                                                                        | ((var52 & '\uf800') >> 11 | var52 << 5) << 5
                                                                  )
                                                                  ^ 3
                                                            )
                                                            + 131
                                                            + 137
                                                            - 122
                                                         << 7
                                                )
                                                & 64512
                                          )
                                          >> 10
                                       | (
                                             (
                                                      (
                                                               (
                                                                     (((var52 & '\uf800') >> 11 | var52 << 5) & 63488) >> 11
                                                                        | ((var52 & '\uf800') >> 11 | var52 << 5) << 5
                                                                  )
                                                                  ^ 3
                                                            )
                                                            + 131
                                                            + 137
                                                            - 122
                                                         & 65024
                                                   )
                                                   >> 9
                                                | (((((var52 & '\uf800') >> 11 | var52 << 5) & 63488) >> 11 | ((var52 & '\uf800') >> 11 | var52 << 5) << 5) ^ 3)
                                                      + 131
                                                      + 137
                                                      - 122
                                                   << 7
                                          )
                                          << 6
                                 )
                                 & 65535
                           )
                           >> 0
                        | (
                              (
                                       (
                                             (
                                                      (
                                                               (
                                                                     (((var52 & '\uf800') >> 11 | var52 << 5) & 63488) >> 11
                                                                        | ((var52 & '\uf800') >> 11 | var52 << 5) << 5
                                                                  )
                                                                  ^ 3
                                                            )
                                                            + 131
                                                            + 137
                                                            - 122
                                                         & 65024
                                                   )
                                                   >> 9
                                                | (((((var52 & '\uf800') >> 11 | var52 << 5) & 63488) >> 11 | ((var52 & '\uf800') >> 11 | var52 << 5) << 5) ^ 3)
                                                      + 131
                                                      + 137
                                                      - 122
                                                   << 7
                                          )
                                          & 64512
                                    )
                                    >> 10
                                 | (
                                       (
                                                (((((var52 & '\uf800') >> 11 | var52 << 5) & 63488) >> 11 | ((var52 & '\uf800') >> 11 | var52 << 5) << 5) ^ 3)
                                                      + 131
                                                      + 137
                                                      - 122
                                                   & 65024
                                             )
                                             >> 9
                                          | (((((var52 & '\uf800') >> 11 | var52 << 5) & 63488) >> 11 | ((var52 & '\uf800') >> 11 | var52 << 5) << 5) ^ 3)
                                                + 131
                                                + 137
                                                - 122
                                             << 7
                                    )
                                    << 6
                           )
                           << 16
                  )
                  - 74
            );
            var16.setCharAt(
               var29,
               (char)(
                  (
                        (
                                 (
                                       (
                                                (
                                                      (
                                                               (
                                                                        (
                                                                              (((var52 & '\uf800') >> 11 | var52 << 5) & 63488) >> 11
                                                                                 | ((var52 & '\uf800') >> 11 | var52 << 5) << 5
                                                                           )
                                                                           ^ 3
                                                                     )
                                                                     + 131
                                                                     + 137
                                                                     - 122
                                                                  & 65024
                                                            )
                                                            >> 9
                                                         | (
                                                                  (
                                                                        (((var52 & '\uf800') >> 11 | var52 << 5) & 63488) >> 11
                                                                           | ((var52 & '\uf800') >> 11 | var52 << 5) << 5
                                                                     )
                                                                     ^ 3
                                                               )
                                                               + 131
                                                               + 137
                                                               - 122
                                                            << 7
                                                   )
                                                   & 64512
                                             )
                                             >> 10
                                          | (
                                                (
                                                         (
                                                                  (
                                                                        (((var52 & '\uf800') >> 11 | var52 << 5) & 63488) >> 11
                                                                           | ((var52 & '\uf800') >> 11 | var52 << 5) << 5
                                                                     )
                                                                     ^ 3
                                                               )
                                                               + 131
                                                               + 137
                                                               - 122
                                                            & 65024
                                                      )
                                                      >> 9
                                                   | (
                                                            (
                                                                  (((var52 & '\uf800') >> 11 | var52 << 5) & 63488) >> 11
                                                                     | ((var52 & '\uf800') >> 11 | var52 << 5) << 5
                                                               )
                                                               ^ 3
                                                         )
                                                         + 131
                                                         + 137
                                                         - 122
                                                      << 7
                                             )
                                             << 6
                                    )
                                    & 65535
                              )
                              >> 0
                           | (
                                 (
                                          (
                                                (
                                                         (
                                                                  (
                                                                        (((var52 & '\uf800') >> 11 | var52 << 5) & 63488) >> 11
                                                                           | ((var52 & '\uf800') >> 11 | var52 << 5) << 5
                                                                     )
                                                                     ^ 3
                                                               )
                                                               + 131
                                                               + 137
                                                               - 122
                                                            & 65024
                                                      )
                                                      >> 9
                                                   | (
                                                            (
                                                                  (((var52 & '\uf800') >> 11 | var52 << 5) & 63488) >> 11
                                                                     | ((var52 & '\uf800') >> 11 | var52 << 5) << 5
                                                               )
                                                               ^ 3
                                                         )
                                                         + 131
                                                         + 137
                                                         - 122
                                                      << 7
                                             )
                                             & 64512
                                       )
                                       >> 10
                                    | (
                                          (
                                                   (
                                                            (
                                                                  (((var52 & '\uf800') >> 11 | var52 << 5) & 63488) >> 11
                                                                     | ((var52 & '\uf800') >> 11 | var52 << 5) << 5
                                                               )
                                                               ^ 3
                                                         )
                                                         + 131
                                                         + 137
                                                         - 122
                                                      & 65024
                                                )
                                                >> 9
                                             | (((((var52 & '\uf800') >> 11 | var52 << 5) & 63488) >> 11 | ((var52 & '\uf800') >> 11 | var52 << 5) << 5) ^ 3)
                                                   + 131
                                                   + 137
                                                   - 122
                                                << 7
                                       )
                                       << 6
                              )
                              << 16
                     )
                     - 74
               )
            );
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_266.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = (-1192409702 + 1692037765 | 0) & -1073739968; var35 < var19.length(); var35 += (-334572665 | 549511016 << -334572665 | 0) & 268437513) {
            int var62 = var19.charAt(var35);
            int var98 = (var62 & 32768) >> 15;
            int var63 = (((var62 & 32768) >> 15 | var62 << 1) ^ 32) + 29;
            int var99 = ((((var62 & 32768) >> 15 | var62 << 1) ^ 32) + 29 & 65532) >> 2;
            var62 = (((var98 | var62 << 1) ^ 32) + 29 & 65532) >> 2 | (((var62 & 32768) >> 15 | var62 << 1) ^ 32) + 29 << 14;
            var98 = ((var99 | var63 << 14) & 65472) >> 6;
            int var65 = ((var99 | var63 << 14) & 65472) >> 6 | var62 << 10;
            int var101 = ((((var99 | var63 << 14) & 65472) >> 6 | var62 << 10) & 65024) >> 9;
            char var66 = (char)((((var98 | var62 << 10) & 65024) >> 9 | (((var99 | var63 << 14) & 65472) >> 6 | var62 << 10) << 7) + 13 + 78 - 236 - 4);
            var19.setCharAt(var35, (char)((var101 | var65 << 7) + 13 + 78 - 236 - 4));
         }

         Class var7 = Class.forName(var19.toString(), false, Class_266.class.getClassLoader());
         switch (((var4 - 1979397216 - 611533642 - 1227641083 ^ 772689438) + 1382123692 - 625976810 ^ 1170799790 ^ 1668488396 ^ 772711780) - 1641439758) {
            case 1118778687:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            case 1266374043:
            case 1299023643:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 1322176209:
               var10000 = var0.findSpecial(var7, var5, var6, Class_266.class);
               break;
            case 1835154725:
               var10000 = var0.findConstructor(var7, var6);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_1087[(((var10 - 2128200603 ^ 634573343) + 1179342142 - 669711472 ^ 1924757938 ^ 829655878 ^ 341787211) + 1542753598 ^ 568695212) - 156049884] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1186(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = (var10 + 1585116034 + 1052889278 + 322796103 + 1850321983 - 126071326 ^ 1507336546 ^ 957615402) - 216127298 ^ 1234961425;
      MethodHandle var10000 = field_1087[(var10 + 1585116034 + 1052889278 + 322796103 + 1850321983 - 126071326 ^ 1507336546 ^ 957615402) - 216127298
         ^ 1234961425
         ^ 92994618];
      if (field_1087[var10001 ^ 92994618] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = 1445018801 + -151213432 ^ 1293805369; var24 < var14.length(); var24 += 1791576925 & 721225091 ^ 717816064) {
            int var43 = var14.charAt(var24) ^ 213 ^ 207;
            char var48 = (char)(
               (
                     (
                              (
                                       (
                                                (
                                                      (
                                                               (
                                                                     (((var43 & 65520) >> 4 | var43 << 12) & 65528) >> 3
                                                                        | ((var43 & 65520) >> 4 | var43 << 12) << 13
                                                                  )
                                                                  & 57344
                                                            )
                                                            >> 13
                                                         | ((((var43 & 65520) >> 4 | var43 << 12) & 65528) >> 3 | ((var43 & 65520) >> 4 | var43 << 12) << 13)
                                                            << 3
                                                   )
                                                   & 65408
                                             )
                                             >> 7
                                          | (
                                                (((((var43 & 65520) >> 4 | var43 << 12) & 65528) >> 3 | ((var43 & 65520) >> 4 | var43 << 12) << 13) & 57344)
                                                      >> 13
                                                   | ((((var43 & 65520) >> 4 | var43 << 12) & 65528) >> 3 | ((var43 & 65520) >> 4 | var43 << 12) << 13) << 3
                                             )
                                             << 9
                                    )
                                    + 152
                                 & 65532
                           )
                           >> 2
                        | (
                                 (
                                          (
                                                (((((var43 & 65520) >> 4 | var43 << 12) & 65528) >> 3 | ((var43 & 65520) >> 4 | var43 << 12) << 13) & 57344)
                                                      >> 13
                                                   | ((((var43 & 65520) >> 4 | var43 << 12) & 65528) >> 3 | ((var43 & 65520) >> 4 | var43 << 12) << 13) << 3
                                             )
                                             & 65408
                                       )
                                       >> 7
                                    | (
                                          (((((var43 & 65520) >> 4 | var43 << 12) & 65528) >> 3 | ((var43 & 65520) >> 4 | var43 << 12) << 13) & 57344) >> 13
                                             | ((((var43 & 65520) >> 4 | var43 << 12) & 65528) >> 3 | ((var43 & 65520) >> 4 | var43 << 12) << 13) << 3
                                       )
                                       << 9
                              )
                              + 152
                           << 14
                  )
                  + 40
                  - 210
            );
            var14.setCharAt(
               var24,
               (char)(
                  (
                        (
                                 (
                                          (
                                                   (
                                                         (
                                                                  (
                                                                        (((var43 & 65520) >> 4 | var43 << 12) & 65528) >> 3
                                                                           | ((var43 & 65520) >> 4 | var43 << 12) << 13
                                                                     )
                                                                     & 57344
                                                               )
                                                               >> 13
                                                            | ((((var43 & 65520) >> 4 | var43 << 12) & 65528) >> 3 | ((var43 & 65520) >> 4 | var43 << 12) << 13)
                                                               << 3
                                                      )
                                                      & 65408
                                                )
                                                >> 7
                                             | (
                                                   (((((var43 & 65520) >> 4 | var43 << 12) & 65528) >> 3 | ((var43 & 65520) >> 4 | var43 << 12) << 13) & 57344)
                                                         >> 13
                                                      | ((((var43 & 65520) >> 4 | var43 << 12) & 65528) >> 3 | ((var43 & 65520) >> 4 | var43 << 12) << 13) << 3
                                                )
                                                << 9
                                       )
                                       + 152
                                    & 65532
                              )
                              >> 2
                           | (
                                    (
                                             (
                                                   (((((var43 & 65520) >> 4 | var43 << 12) & 65528) >> 3 | ((var43 & 65520) >> 4 | var43 << 12) << 13) & 57344)
                                                         >> 13
                                                      | ((((var43 & 65520) >> 4 | var43 << 12) & 65528) >> 3 | ((var43 & 65520) >> 4 | var43 << 12) << 13) << 3
                                                )
                                                & 65408
                                          )
                                          >> 7
                                       | (
                                             (((((var43 & 65520) >> 4 | var43 << 12) & 65528) >> 3 | ((var43 & 65520) >> 4 | var43 << 12) << 13) & 57344) >> 13
                                                | ((((var43 & 65520) >> 4 | var43 << 12) & 65528) >> 3 | ((var43 & 65520) >> 4 | var43 << 12) << 13) << 3
                                          )
                                          << 9
                                 )
                                 + 152
                              << 14
                     )
                     + 40
                     - 210
               )
            );
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = (-527669965 - (-527669965 ^ -527669965) | 0) & 39948992; var30 < var17.length(); var30 += (-1899041780 | -1355736479) ^ -1342177684) {
            int var53 = var17.charAt(var30);
            int var83 = (var53 & 63488) >> 11;
            int var54 = (var53 & 63488) >> 11 | var53 << 5;
            int var84 = (((var53 & 63488) >> 11 | var53 << 5) & 65472) >> 6;
            var53 = ((((var83 | var53 << 5) & 65472) >> 6 | ((var53 & 63488) >> 11 | var53 << 5) << 10) - 27 ^ 38) + 236 - 244;
            var83 = (((var84 | var54 << 10) - 27 ^ 38) + 236 - 244 & 63488) >> 11;
            int var56 = (((var84 | var54 << 10) - 27 ^ 38) + 236 - 244 & 63488) >> 11 | var53 << 5;
            int var86 = (((((var84 | var54 << 10) - 27 ^ 38) + 236 - 244 & 63488) >> 11 | var53 << 5) & 65408) >> 7;
            char var57 = (char)(
               ((((var83 | var53 << 5) & 65408) >> 7 | ((((var84 | var54 << 10) - 27 ^ 38) + 236 - 244 & 63488) >> 11 | var53 << 5) << 9) ^ 76) + 143
            );
            var17.setCharAt(var30, (char)(((var86 | var56 << 9) ^ 76) + 143));
         }

         Class var6 = Class.forName(var17.toString(), false, Class_266.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = 1812973827 - 1812973827 ^ 0; var36 < var20.length(); var36 += (445629124 | 442003173 | 0) & 1612713995) {
            var20.setCharAt(var36, (char)(((var20.charAt(var36) + '\f' - 129 - 122 ^ 164) - 145 + 94 + 44 ^ 111 ^ 165) + 226));
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_266.class.getClassLoader()).returnType();
         switch ((((var4 ^ 1022328512) - 306347904 - 315875716 - 532353636 ^ 1157164265) - 1684106956 - 828065748 ^ 401574352) + 263297183 ^ 856997934) {
            case 646590097:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            case 1161827181:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            case 1359884773:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            case 1366184639:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_1087[(var10 + 1585116034 + 1052889278 + 322796103 + 1850321983 - 126071326 ^ 1507336546 ^ 957615402) - 216127298 ^ 1234961425 ^ 92994618] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }

   public static native void guard();
}
