import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;
import net.minecraft.class_11905;
import net.minecraft.class_11908;

public class Class_369 {
   // $VF: renamed from: oiz int
   public static int field_155 = 530;
   // $VF: renamed from: ury Class_262
   public static Class_262 field_156 = (Class_262)0<"JNT",924561676,"\uf38b\ude8b\udd8b\ude8b쮋趋","씼䤽䤽䤽䤽줼紽","ᮾᯢ",-1003274807>(20, 20, 25, 255);
   // $VF: renamed from: uph Class_262
   public static Class_262 field_157 = (Class_262)0<"JNT",924561676,"\uf38b\ude8b\udd8b\ude8b쮋趋","씼䤽䤽䤽䤽줼紽","ᮾᯢ",-1003274808>(60, 60, 65, 255);
   // $VF: renamed from: ka Class_262
   public static Class_262 field_158 = (Class_262)0<"JNT",924561676,"\uf38b\ude8b\udd8b\ude8b쮋趋","씼䤽䤽䤽줼紽","ᮾᯢ",-1003274801>(245, 245, 245);
   // $VF: renamed from: vu Class_262
   public static Class_262 field_159 = (Class_262)0<"JNT",924561676,"\uf38b\ude8b\udd8b\ude8b쮋趋","씼䤽䤽䤽䤽줼紽","ᮾᯢ",-1003274802>(120, 120, 130, 180);
   // $VF: renamed from: ke java.lang.String
   public String field_160;
   // $VF: renamed from: jlc int
   public int field_161;
   // $VF: renamed from: uuj int
   public int field_162 = -1;
   // $VF: renamed from: wdz boolean
   public boolean field_163 = true;
   // $VF: renamed from: rz int
   public int field_164;
   // $VF: renamed from: iz java.lang.String
   public String field_165 = "";
   // $VF: renamed from: yxd java.lang.Runnable
   public Runnable field_166;
   // $VF: renamed from: qk long
   public long field_167;
   // $VF: renamed from: bn boolean
   public boolean field_168 = true;
   // $VF: renamed from: dou java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_169 = new MethodHandle[346];

   public Class_369(String var1, int var2) {
      this.field_160 = var1;
      this.field_164 = var2;
      this.field_161 = 0<"JNT",1600502365,"쎋\uda8b\udd8b풋쮋\udf8b","씼줼䤽","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢ",-1003274985>(var1);
   }

   public Class_369() {
      this("", 200);
   }

   // $VF: renamed from: xxo () boolean
   // $VF: Irreducible bytecode was duplicated to produce valid code
   public static boolean method_209() {
      int var2 = -1484819587;
      long var0 = 0<"JNT",1600502365,"슋\uda8b쮋\udf8b\udc8b\udb8bⱴ讋讋躋螋","씼줼䴽","᮶ᮚᯎ᪶ᮺ᮪᮶ᮚᮒᯆᮊᮖᯎ᪶ᮒᮮᮊᯒᯒᮂ᫊᪾᫊ᫎ",-1003274988>(
         0<"JNT",1600502365,"슋\uda8b쮋\udf8b\udc8b\udb8bⱴ膋膋薋辋肋","씼줼唽\udd3d뤽\uf53d\ue13c\ud93d줽\udd3d뤽넽\ued3dꤽ봽\uf53d\ue13c넽픽ꤽ\uf13d\uf13dꄽ\ue93c\ue53c\uf53c\ue93cᄽ","᮶ᮚᯎ᪶ᮺ᮪᮶ᮚᮒᯆᮊᮖᯎ᪶ᮒᮮᮊᯒᯒᮂ\u1ad2᫊᪾",-1003274987>(
            0<"JNT",598047213,"슋\uda8b쮋\udf8b\udc8b\udb8bⱴ蚋誋誋蚋","씼줼唽\udd3d뤽\uf53d\ue13c\ud93d줽\udd3d뤽넽\ued3dꤽ봽\uf53d\ue13c넽픽ꤽ\uf13d\uf13dꄽ\uf13c\ue93c\ue53cᄽ","᮶ᮚᯎ᪶ᮺ᮪᮶ᮚᮒᯆᮊᮖᯎ᪶ᮒᮮᮊᯒᯒᮂ\u1ad2᫊᪾",-1003274986>()
         )
      );
      int var10000;
      if (1<"JNT",-639325801,"\udadc으\udabc쀜\udb1c\ud97c좼졜졼쟼줜","❣♃⢣ὣ❃⟃❣♃⚃⣣⛃♣⢣ὣ⚃➣⛃⢃⢃┃\u2063₣\u20c3 ","㭒㭜㳾",-490301716>()) {
         var10000 = 0<"JNT",598047213,"풋쎋햋쒋㑴\uda8b쮋㡴\uda8b캋","씼䴽䤽줼䤽","ᯂᯆᮢ᪶ᮮᯢᮦᮢᮮ᪶ᮢᮮᮖᯢ᪶ᬢᬮᬖ᭢",-1003274982>(var0, 343);
         var2 = (586672561 | 586672561) ^ 1462145852;
      } else {
         var2 = 1394600218;
         switch ((var2 - 625157829 ^ 1039130459 ^ 957317723) - 1976434726 + 1664561053 - 605458535) {
            case -225493403:
            default:
               var10000 = 0<"JNT",598047213,"풋쎋햋쒋㑴\uda8b쮋㡴\uda8b캋","씼䴽䤽줼䤽","ᯂᯆᮢ᪶ᮮᯢᮦᮢᮮ᪶ᮢᮮᮖᯢ᪶ᬢᬮᬖ᭢",-1003274983>(var0, 341);
               var2 = (586672561 | 586672561) ^ 1462145852;
               break;
            case 198823451:
               var10000 = 0;
               var2 = -1256623236;
         }
      }

      while (true) {
         switch ((var2 - 2136768778 + 1551647587 ^ 715036219) - 2084225953 - 1318660572 - 1687290186) {
            case -1992182489:
            default:
               return (boolean)var10000;
            case 1225374742:
         }

         if (var10000 == 1) {
            var10000 = 1;
            var2 = -1256623236;
         } else {
            var2 = 10 ^ 1806342362;
            switch ((var2 - 625157829 ^ 1039130459 ^ 957317723) - 1976434726 + 1664561053 - 605458535) {
               case -225493403:
               default:
                  var10000 = 0<"JNT",598047213,"풋쎋햋쒋㑴\uda8b쮋㡴\uda8b캋","씼䴽䤽줼䤽","ᯂᯆᮢ᪶ᮮᯢᮦᮢᮮ᪶ᮢᮮᮖᯢ᪶ᬢᬮᬖ᭢",-1003274983>(var0, 341);
                  var2 = (586672561 | 586672561) ^ 1462145852;
                  break;
               case 198823451:
                  var10000 = 0;
                  var2 = -1256623236;
            }
         }
      }
   }

   // $VF: renamed from: nv (RenderEngine_216, double, double, double, double) void
   // $VF: Irreducible bytecode was duplicated to produce valid code
   public void method_210(RenderEngine_216 var1, double var2, double var4, double var6, double var8) {
      int var14 = 731713070;
      0<"JNT",1600502365,"얋\uda8b\udf8b","씼줼紽","ᯢᮒ",-1003274984>(this);
      0<"JNT",1600502365,"\udd8b킋\udb8b","씼唽\ue53dĽᄽ㔽㔽㔽㔽㔽㔽㔽㔽줼紽","ᮺᯖ",-1003274978>(
         var1, 1<"JNT",-639325801,"삼쁜씼","⠃⚃","㭒㭜㲚㰢㰰㲸",-490301704>(), var2, var4, var2 + var6, var4 + var8, 5.0, 5.0, 5.0, 5.0
      );
      0<"JNT",1600502365,"햋즋욋","씼唽\ue53dĽᄽ㔽㔽㔽㔽㔽㔽㔽㔽㔽줼紽","ᮺᯖ",-1003274980>(
         var1, 1<"JNT",-639325801,"삼삜잜","⠃⚃","㭒㭜㲚㰢㰰㲸",-490301710>(), var2, var4, var2 + var6, var4 + var8, 5.0, 5.0, 5.0, 5.0, 1.0
      );
      double var10 = var2 + 10.0;
      double var12 = var4 + (var8 - 14.0) / 2.0;
      if (0<"JNT",1600502365,"\ude8b삋㩴슋잋쮋캋","씼줼贽","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢ",-1003288862>(1<"JNT",-1720667752,"웼\udabc","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490301708>(this))
         && !0<"JNT",1600502365,"\ude8b삋㩴슋잋쮋캋","씼줼贽","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢ",-1003288864>(1<"JNT",-1720667752,"으앜","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490301730>(this))) {
         0<"JNT",1600502365,"풋\udf8b","씼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ᄽ㔽㔽唽\ue53dĽᄽ줼㔽","ᮺᯖ",-1003275003>(
            var1, 1<"JNT",-1720667752,"으앜","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490301728>(this), var10, var12, 1<"JNT",-639325801,"샜삼","⠃⚃","㭒㭜㲚㰢㰰㲸",-490301703>()
         );
         var14 = 2004497510;
      } else {
         var14 = (1758866766 | 1758866766) ^ 1856754776;
      }

      while (true) {
         switch ((var14 ^ 1515104216) + 1633569004 - 2108212498 + 1839989890 - 1535534628 - 198079550) {
            case 390152632:
               return;
            case 1178602696:
            default:
               0<"JNT",1600502365,"\ud88b\ud98b슋","씼唽\ud93dﴽᄽ㔽㔽줼紽","ᯢᮒ",-1003275004>(this, var1, var10, var12);
         }

         var14 = 2004497510;
      }
   }

   // $VF: renamed from: iwk (RenderEngine_216, double, double) void
   // $VF: Irreducible bytecode was duplicated to produce valid code
   public void method_211(RenderEngine_216 var1, double var2, double var4) {
      int var6 = 1464500793;
      0<"JNT",1600502365,"얋\uda8b\udf8b","씼줼紽","ᯢᮒ",-1003274997>(this);
      if (0<"JNT",1600502365,"\ude8b삋㩴슋잋쮋캋","씼줼贽","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢ",-1003274999>(1<"JNT",-1720667752,"웼\udabc","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490301723>(this))
         && !0<"JNT",1600502365,"\ude8b삋㩴슋잋쮋캋","씼줼贽","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢ",-1003274993>(1<"JNT",-1720667752,"으앜","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490301721>(this))) {
         0<"JNT",1600502365,"풋\udf8b","씼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ᄽ㔽㔽唽\ue53dĽᄽ줼㔽","ᮺᯖ",-1003274996>(
            var1, 1<"JNT",-1720667752,"으앜","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490301727>(this), var2, var4, 1<"JNT",-639325801,"샜삼","⠃⚃","㭒㭜㲚㰢㰰㲸",-490301726>()
         );
         var6 = -745240772;
      } else {
         var6 = 202155077 >>> 202155077 ^ 432812115;
      }

      while (true) {
         switch ((var6 ^ 1442629565 ^ 1765555830 ^ 1793522591) + 1410895070 + 1937643132 + 1498748311) {
            case -1499578791:
            default:
               return;
            case 1886785558:
               0<"JNT",1600502365,"\ud88b\ud98b슋","씼唽\ud93dﴽᄽ㔽㔽줼紽","ᯢᮒ",-1003274989>(this, var1, var2, var4);
         }

         var6 = -745240772;
      }
   }

   // $VF: renamed from: kjm (RenderEngine_216, double, double) void
   // $VF: Irreducible bytecode was duplicated to produce valid code
   public void method_212(RenderEngine_216 var1, double var2, double var4) {
      int var15 = -1646964207;
      if (0<"JNT",1600502365,"잋쮋","씼줼贽","ᯢᮒ",-1003274990>(this)) {
         int var6 = 0<"JNT",598047213,"슋\ude8b\udd8b","씼䤽䤽줼䤽","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶ᬺᮊᯎᮞ",-1003288841>(
            1<"JNT",-1720667752,"삼삼읜","⠃⚃","㭒㭜㲜",-490301810>(this), 1<"JNT",-1720667752,"읜쀜\ud9fc","⠃⚃","㭒㭜㲜",-490301809>(this)
         );
         int var7 = 0<"JNT",598047213,"슋횋쾋","씼䤽䤽줼䤽","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶ᬺᮊᯎᮞ",-1003288844>(
            1<"JNT",-1720667752,"삼삼읜","⠃⚃","㭒㭜㲜",-490301719>(this), 1<"JNT",-1720667752,"읜쀜\ud9fc","⠃⚃","㭒㭜㲜",-490301814>(this)
         );
         String var8 = 0<"JNT",1600502365,"삋쪋톋삋쮋솋\ude8b\udd8b풋","씼䤽䤽줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ᄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢ",-1003288838>(
            1<"JNT",-1720667752,"웼\udabc","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490301812>(this), 0, var6
         );
         String var9 = 0<"JNT",1600502365,"삋쪋톋삋쮋솋\ude8b\udd8b풋","씼䤽䤽줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ᄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢ",-1003288840>(
            1<"JNT",-1720667752,"웼\udabc","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490301802>(this), var6, var7
         );
         String var10 = 0<"JNT",1600502365,"삋쪋톋삋쮋솋\ude8b\udd8b풋","씼䤽줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ᄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢ",-1003288834>(
            1<"JNT",-1720667752,"웼\udabc","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490301800>(this), var7
         );
         double var11 = 0<"JNT",1600502365,"캋쪋\ud98b","씼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ᄽ줼㔽","ᮺᯖ",-1003288835>(var1, var8);
         double var13 = 0<"JNT",1600502365,"캋쪋\ud98b","씼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ᄽ줼㔽","ᮺᯖ",-1003288836>(var1, var9);
         0<"JNT",1600502365,"풋\udf8b","씼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ᄽ㔽㔽唽\ue53dĽᄽ줼㔽","ᮺᯖ",-1003288894>(
            var1, var8, var2, var4, 1<"JNT",-639325801,"웼\uda3c","⠃⚃","㭒㭜㲚㰢㰰㲸",-490301804>()
         );
         0<"JNT",1600502365,"쒋쮋\uda8b","씼㔽㔽㔽㔽唽\ue53dĽᄽ줼紽","ᮺᯖ",-1003288896>(
            var1, var2 + var11, var4 - 2.0, var2 + var11 + var13, var4 + 14.0, 0<"JNT",598047213,"솋쪋\udc8b","씼䤽䤽줼唽\ue53dĽᄽ","ᮆᮒ",-1003288895>(100, 1)
         );
         0<"JNT",1600502365,"풋\udf8b","씼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ᄽ㔽㔽唽\ue53dĽᄽ줼㔽","ᮺᯖ",-1003288858>(
            var1, var9, var2 + var11, var4, 1<"JNT",-639325801,"일쀜앜","⼣⠃","㭒㭜㲚㰢㰰㲸",-490301824>()
         );
         0<"JNT",1600502365,"풋\udf8b","씼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ᄽ㔽㔽唽\ue53dĽᄽ줼㔽","ᮺᯖ",-1003288860>(
            var1, var10, var2 + var11 + var13, var4, 1<"JNT",-639325801,"웼\uda3c","⠃⚃","㭒㭜㲚㰢㰰㲸",-490301830>()
         );
         var15 = 1920704126 & 1937659643;
      } else {
         var15 = 1595609164;
      }

      while (true) {
         switch (((var15 - 113787876 ^ 851143735) - 2094812153 ^ 1519556245) + 670619157 - 23366874) {
            case -1387188872:
               return;
            case -617346002:
         }

         0<"JNT",1600502365,"풋\udf8b","씼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ᄽ㔽㔽唽\ue53dĽᄽ줼㔽","ᮺᯖ",-1003288855>(
            var1,
            1<"JNT",-1720667752,"웼\udabc","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490301828>(this),
            var2,
            var4,
            1<"JNT",-639325801,"웼\uda3c","⠃⚃","㭒㭜㲚㰢㰰㲸",-490301819>()
         );
         if (1<"JNT",-1720667752,"쁼\udb1c앜","⠃⚃","㭒㭜㳾",-490301817>(this) && 1<"JNT",-1720667752,"\uda5c뿜","⠃⚃","㭒㭜㳾",-490301816>(this)) {
            String var16 = 0<"JNT",1600502365,"삋쪋톋삋쮋솋\ude8b\udd8b풋","씼䤽䤽줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ᄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢ",-1003288852>(
               1<"JNT",-1720667752,"웼\udabc","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490301823>(this), 0, 1<"JNT",-1720667752,"읜쀜\ud9fc","⠃⚃","㭒㭜㲜",-490301822>(this)
            );
            double var17 = var2 + 0<"JNT",1600502365,"캋쪋\ud98b","씼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ᄽ줼㔽","ᮺᯖ",-1003288845>(var1, var16);
            0<"JNT",1600502365,"쒋쮋\uda8b","씼㔽㔽㔽㔽唽\ue53dĽᄽ줼紽","ᮺᯖ",-1003288847>(
               var1, var17, var4 - 2.0, var17 + 1.0, var4 + 14.0, 1<"JNT",-639325801,"웼\uda3c","⠃⚃","㭒㭜㲚㰢㰰㲸",-490301779>()
            );
         }

         var15 = 1920704126 & 1937659643;
      }
   }

   // $VF: renamed from: veh () void
   public void method_213() {
      long var1 = 0<"JNT",598047213,"킋쪋솋솋\uda8b\udd8b쮋\u2b74\ude8b슋\uda8b≴\ude8b쎋쎋\ude8b삋","씼줼䴽","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯪᯒᯎᮚᮺ",-1003288848>();
      if (var1 - 1<"JNT",-1720667752,"쀼웼","⠃⚃","㭒㭜㲞",-490301776>(this) > 530L) {
         1<"JNT",1148819398,"\uda5c뿜","⠃⚃","㭒㭜㳾",-490301782>(this, !1<"JNT",-1720667752,"\uda5c뿜","⠃⚃","㭒㭜㳾",-490301815>(this));
         1<"JNT",1148819398,"쀼웼","⠃⚃","㭒㭜㲞",-490301781>(this, var1);
      }
   }

   // $VF: renamed from: dg (net.minecraft.class_11908) boolean
   public boolean method_214(class_11908 var1) {
      int var11 = 968540942;
      if (!1<"JNT",-1720667752,"쁼\udb1c앜","⠃⚃","㭒㭜㳾",-490301837>(this)) {
         return false;
      } else {
         0<"JNT",1600502365,"솋삋\ude8b쮋","씼줼紽","ᯢᮒ",-1003288885>(this);
         int var2 = 0<"JNT",1600502365,"슋\uda8b쮋\udf8b\udc8b\udb8bⱴ蒋讋膋膋辋","씼줼䤽","᮶ᮚᯎ᪶ᮺ᮪᮶ᮚᮒᯆᮊᮖᯎ᪶ᮒᮮᮊᯒᯒᮂ᫊᫊\u1aea᪾\u1ade",-1003288886>(var1);
         boolean var3 = (0<"JNT",1600502365,"킋\udc8b슋잋ⱴ讋蒋躋蒋","씼줼䤽","᮶ᮚᯎ᪶ᮺ᮪᮶ᮚᮒᯆᮊᮖᯎ᪶ᮒᮮᮊᯒᯒᮂ᫊᫊\u1aea᪾\u1ade",-1003288887>(var1) & 1) != 0;
         boolean var4 = 0<"JNT",598047213,"쾋쾋\udc8b","씼줼贽","ᯢᮒ",-1003274910>();
         if (var2 == 65 && var4) {
            1<"JNT",1148819398,"삼삼읜","⠃⚃","㭒㭜㲜",-490301858>(this, 0);
            1<"JNT",1148819398,"읜쀜\ud9fc","⠃⚃","㭒㭜㲜",-490301831>(
               this,
               0<"JNT",1600502365,"쎋\uda8b\udd8b풋쮋\udf8b","씼줼䤽","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢ",-1003274873>(
                  1<"JNT",-1720667752,"웼\udabc","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490301857>(this)
               )
            );
            return true;
         } else {
            var11 = (619613747 - 619613747 | 1540664533) & 1608494295;

            while (true) {
               label201:
               while (true) {
                  label198:
                  while (true) {
                     label196:
                     while (true) {
                        label194:
                        while (true) {
                           label179: {
                              label178: {
                                 int var19;
                                 Class_369 var10000;
                                 label240: {
                                    label174: {
                                       label173:
                                       while (true) {
                                          switch ((var11 ^ 75153067) + 1129650088 + 121417613 - 396450239 + 1118001947 ^ 2048791731) {
                                             case -1988620452:
                                                if (var2 == 86 && var4) {
                                                   0<"JNT",1600502365,"얋슋슋","씼줼紽","ᯢᮒ",-1003274851>(this);
                                                   return true;
                                                }

                                                var11 = -969239167 - -1378741976 ^ -102926352;
                                                continue;
                                             case -1841151714:
                                                String var22 = 0<"JNT",1600502365,"삋쪋톋삋쮋솋\ude8b\udd8b풋","씼䤽䤽줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ᄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢ",-1003288912>(
                                                   1<"JNT",-1720667752,"웼\udabc","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490301843>(this),
                                                   0,
                                                   1<"JNT",-1720667752,"읜쀜\ud9fc","⠃⚃","㭒㭜㲜",-490301842>(this) - 1
                                                );
                                                String var14 = 0<"JNT",1600502365,"삋쪋톋삋쮋솋\ude8b\udd8b풋","씼䤽줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ᄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢ",-1003274859>(
                                                   1<"JNT",-1720667752,"웼\udabc","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490301840>(this),
                                                   1<"JNT",-1720667752,"읜쀜\ud9fc","⠃⚃","㭒㭜㲜",-490301879>(this)
                                                );
                                                String var13 = var22;
                                                1<"JNT",1148819398,"웼\udabc","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490301833>(
                                                   this,
                                                   0<"JNT",1600502365,"쮋\udc8b⁴쮋솋\ude8b\udd8b풋","씼줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ᄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢᬆᯚ᮪ᮮᮎᮚᯆ",-1003274855>(
                                                      0<"JNT",1600502365,"횋잋잋\uda8b\udd8b\udb8b","씼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c愽괽촽뤽넽\uf53dᄽ줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ⴽ綠줽픽딽뤽\ued3dᄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢᬆᯚ᮪ᮮᮎᮚᯆ",-1003274854>(
                                                         0<"JNT",1600502365,"횋잋잋\uda8b\udd8b\udb8b","씼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c愽괽촽뤽넽\uf53dᄽ줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ⴽ綠줽픽딽뤽\ued3dᄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢᬆᯚ᮪ᮮᮎᮚᯆ",-1003274853>(
                                                            (StringBuilder)0<"JNT",924561676,"\uf38b\ude8b\udd8b\ude8b쮋趋","씼줼紽","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢᬆᯚ᮪ᮮᮎᮚᯆ",-1003274860>(),
                                                            var13
                                                         ),
                                                         var14
                                                      )
                                                   )
                                                );
                                                1<"JNT",1148819398,"읜쀜\ud9fc","⠃⚃","㭒㭜㲜",-490301839>(
                                                   this, 1<"JNT",-1720667752,"읜쀜\ud9fc","⠃⚃","㭒㭜㲜",-490301832>(this) - 1
                                                );
                                                break label179;
                                             case -1819098160:
                                                return false;
                                             case -1767346622:
                                                String var21 = 0<"JNT",1600502365,"삋쪋톋삋쮋솋\ude8b\udd8b풋","씼䤽䤽줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ᄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢ",-1003288907>(
                                                   1<"JNT",-1720667752,"웼\udabc","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490301872>(this),
                                                   0,
                                                   1<"JNT",-1720667752,"읜쀜\ud9fc","⠃⚃","㭒㭜㲜",-490301783>(this)
                                                );
                                                String var10 = 0<"JNT",1600502365,"삋쪋톋삋쮋솋\ude8b\udd8b풋","씼䤽줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ᄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢ",-1003288902>(
                                                   1<"JNT",-1720667752,"웼\udabc","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490301877>(this),
                                                   1<"JNT",-1720667752,"읜쀜\ud9fc","⠃⚃","㭒㭜㲜",-490301876>(this) + 1
                                                );
                                                String var15 = var21;
                                                1<"JNT",1148819398,"웼\udabc","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490301870>(
                                                   this,
                                                   0<"JNT",1600502365,"쮋\udc8b⁴쮋솋\ude8b\udd8b풋","씼줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ᄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢᬆᯚ᮪ᮮᮎᮚᯆ",-1003288898>(
                                                      0<"JNT",1600502365,"횋잋잋\uda8b\udd8b\udb8b","씼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c愽괽촽뤽넽\uf53dᄽ줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ⴽ綠줽픽딽뤽\ued3dᄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢᬆᯚ᮪ᮮᮎᮚᯆ",-1003288897>(
                                                         0<"JNT",1600502365,"횋잋잋\uda8b\udd8b\udb8b","씼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c愽괽촽뤽넽\uf53dᄽ줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ⴽ綠줽픽딽뤽\ued3dᄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢᬆᯚ᮪ᮮᮎᮚᯆ",-1003288904>(
                                                            (StringBuilder)0<"JNT",924561676,"\uf38b\ude8b\udd8b\ude8b쮋趋","씼줼紽","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢᬆᯚ᮪ᮮᮎᮚᯆ",-1003288903>(),
                                                            var15
                                                         ),
                                                         var10
                                                      )
                                                   )
                                                );
                                                break label178;
                                             case -1560045203:
                                                if (1<"JNT",-1720667752,"읜쀜\ud9fc","⠃⚃","㭒㭜㲜",-490301771>(this)
                                                   >= 0<"JNT",1600502365,"쎋\uda8b\udd8b풋쮋\udf8b","씼줼䤽","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢ",-1003288872>(
                                                      1<"JNT",-1720667752,"웼\udabc","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490301770>(this)
                                                   )) {
                                                   break label196;
                                                }

                                                if (!var4) {
                                                   var11 = 1935150283;
                                                   continue;
                                                }

                                                int var12 = 0<"JNT",1600502365,"쎋톋","씼䤽줼䤽","ᯢᮒ",-1003288866>(
                                                   this, 1<"JNT",-1720667752,"읜쀜\ud9fc","⠃⚃","㭒㭜㲜",-490301768>(this)
                                                );
                                                String var20 = 0<"JNT",1600502365,"삋쪋톋삋쮋솋\ude8b\udd8b풋","씼䤽䤽줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ᄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢ",-1003288925>(
                                                   1<"JNT",-1720667752,"웼\udabc","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490301774>(this),
                                                   0,
                                                   1<"JNT",-1720667752,"읜쀜\ud9fc","⠃⚃","㭒㭜㲜",-490301773>(this)
                                                );
                                                String var9 = 0<"JNT",1600502365,"삋쪋톋삋쮋솋\ude8b\udd8b풋","씼䤽줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ᄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢ",-1003288927>(
                                                   1<"JNT",-1720667752,"웼\udabc","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490301795>(this), var12
                                                );
                                                String var8 = var20;
                                                1<"JNT",1148819398,"웼\udabc","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490301797>(
                                                   this,
                                                   0<"JNT",1600502365,"쮋\udc8b⁴쮋솋\ude8b\udd8b풋","씼줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ᄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢᬆᯚ᮪ᮮᮎᮚᯆ",-1003288891>(
                                                      0<"JNT",1600502365,"횋잋잋\uda8b\udd8b\udb8b","씼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c愽괽촽뤽넽\uf53dᄽ줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ⴽ綠줽픽딽뤽\ued3dᄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢᬆᯚ᮪ᮮᮎᮚᯆ",-1003288890>(
                                                         0<"JNT",1600502365,"횋잋잋\uda8b\udd8b\udb8b","씼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c愽괽촽뤽넽\uf53dᄽ줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ⴽ綠줽픽딽뤽\ued3dᄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢᬆᯚ᮪ᮮᮎᮚᯆ",-1003288889>(
                                                            (StringBuilder)0<"JNT",924561676,"\uf38b\ude8b\udd8b\ude8b쮋趋","씼줼紽","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢᬆᯚ᮪ᮮᮎᮚᯆ",-1003288928>(),
                                                            var8
                                                         ),
                                                         var9
                                                      )
                                                   )
                                                );
                                                break label178;
                                             case -1352675396:
                                             default:
                                                if (var2 == 67 && var4) {
                                                   0<"JNT",1600502365,"\ud98b\uda8b","씼줼紽","ᯢᮒ",-1003274909>(this);
                                                   return true;
                                                }

                                                var11 = 619198166 * 1774613771 * -629588485 ^ 738093795;
                                                continue;
                                             case -1192189979:
                                                if (var2 == 269) {
                                                   0<"JNT",1600502365,"쾋즋","씼贽줼紽","ᯢᮒ",-1003288882>(this, var3);
                                                   1<"JNT",1148819398,"읜쀜\ud9fc","⠃⚃","㭒㭜㲜",-490301788>(
                                                      this,
                                                      0<"JNT",1600502365,"쎋\uda8b\udd8b풋쮋\udf8b","씼줼䤽","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢ",-1003288884>(
                                                         1<"JNT",-1720667752,"웼\udabc","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490301790>(this)
                                                      )
                                                   );
                                                   return true;
                                                }

                                                var11 = 405326583 & -1226851602 - 1522473366 ^ 1872965673;
                                                continue;
                                             case -1040250958:
                                                return true;
                                             case -937211492:
                                                return true;
                                             case -430376672:
                                                return true;
                                             case -171416860:
                                                if (var2 != 263) {
                                                   var11 = -668595305 << 1151863180 ^ -275338149;
                                                   continue;
                                                }

                                                0<"JNT",1600502365,"쾋즋","씼贽줼紽","ᯢᮒ",-1003274875>(this, var3);
                                                if (1<"JNT",-1720667752,"읜쀜\ud9fc","⠃⚃","㭒㭜㲜",-490301861>(this) <= 0) {
                                                   break label198;
                                                }

                                                var10000 = this;
                                                if (var4) {
                                                   var19 = 0<"JNT",1600502365,"\ude8b슋","씼䤽줼䤽","ᯢᮒ",-1003274870>(
                                                      this, 1<"JNT",-1720667752,"읜쀜\ud9fc","⠃⚃","㭒㭜㲜",-490301860>(this)
                                                   );
                                                   break label173;
                                                }

                                                var11 = (876835594 + -183878064 | 274814502) & 846288807;
                                                break;
                                             case 561840416:
                                                if (var2 == 259) {
                                                   if (0<"JNT",1600502365,"\udb8b캋얋","씼줼贽","ᯢᮒ",-1003288879>(this)) {
                                                      return true;
                                                   }

                                                   var11 = (-16555683 >> -16555683 | 4236296) & -1964266338;
                                                } else {
                                                   var11 = (-1287045915 | 1030169192 | -629060214) & -623022690;
                                                }
                                                continue;
                                             case 580288452:
                                                if (var2 == 268) {
                                                   0<"JNT",1600502365,"쾋즋","씼贽줼紽","ᯢᮒ",-1003288916>(this, var3);
                                                   1<"JNT",1148819398,"읜쀜\ud9fc","⠃⚃","㭒㭜㲜",-490301884>(this, 0);
                                                   return true;
                                                }

                                                var11 = (1757313273 * 1757313273 | 1092648046) & 1764261358;
                                                continue;
                                             case 777359109:
                                                if (var2 == 261) {
                                                   if (0<"JNT",1600502365,"\udb8b캋얋","씼줼贽","ᯢᮒ",-1003288869>(this)) {
                                                      return true;
                                                   }

                                                   var11 = 1744010214;
                                                } else {
                                                   var11 = -997969484 ^ 2084853790 ^ -1493665081;
                                                }
                                                continue;
                                             case 838563436:
                                                if (var2 == 88 && var4) {
                                                   0<"JNT",1600502365,"욋삋","씼줼紽","ᯢᮒ",-1003288900>(this);
                                                   return true;
                                                }

                                                var11 = (909239380 | 909239380 | 1770532325) & -102040065;
                                                continue;
                                             case 2017272828:
                                                return true;
                                             case 2063023922:
                                                if (var2 != 262) {
                                                   var11 = (1882824018 + -1942915412 | -963900339) & -426861491;
                                                   continue;
                                                }

                                                0<"JNT",1600502365,"쾋즋","씼贽줼紽","ᯢᮒ",-1003274872>(this, var3);
                                                if (1<"JNT",-1720667752,"읜쀜\ud9fc","⠃⚃","㭒㭜㲜",-490301848>(this)
                                                   >= 0<"JNT",1600502365,"쎋\uda8b\udd8b풋쮋\udf8b","씼줼䤽","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢ",-1003274867>(
                                                      1<"JNT",-1720667752,"웼\udabc","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490301855>(this)
                                                   )) {
                                                   break label194;
                                                }

                                                var10000 = this;
                                                if (var4) {
                                                   var19 = 0<"JNT",1600502365,"쎋톋","씼䤽줼䤽","ᯢᮒ",-1003274861>(
                                                      this, 1<"JNT",-1720667752,"읜쀜\ud9fc","⠃⚃","㭒㭜㲜",-490301853>(this)
                                                   );
                                                   break label174;
                                                }

                                                var11 = -973513721 >>> -743920628 ^ -136114241;
                                                break;
                                             case 2117783157:
                                                if (1<"JNT",-1720667752,"읜쀜\ud9fc","⠃⚃","㭒㭜㲜",-490301891>(this) <= 0) {
                                                   break label201;
                                                }

                                                if (!var4) {
                                                   var11 = (-1146095142 << -1146095142 | 917648311) & -155500545;
                                                   continue;
                                                }

                                                int var5 = 0<"JNT",1600502365,"\ude8b슋","씼䤽줼䤽","ᯢᮒ",-1003288960>(
                                                   this, 1<"JNT",-1720667752,"읜쀜\ud9fc","⠃⚃","㭒㭜㲜",-490301890>(this)
                                                );
                                                String var10001 = 0<"JNT",1600502365,"삋쪋톋삋쮋솋\ude8b\udd8b풋","씼䤽䤽줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ᄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢ",-1003288922>(
                                                   1<"JNT",-1720667752,"웼\udabc","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490301888>(this), 0, var5
                                                );
                                                String var7 = 0<"JNT",1600502365,"삋쪋톋삋쮋솋\ude8b\udd8b풋","씼䤽줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ᄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢ",-1003288917>(
                                                   1<"JNT",-1720667752,"웼\udabc","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490301894>(this),
                                                   1<"JNT",-1720667752,"읜쀜\ud9fc","⠃⚃","㭒㭜㲜",-490301893>(this)
                                                );
                                                String var6 = var10001;
                                                1<"JNT",1148819398,"웼\udabc","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490301887>(
                                                   this,
                                                   0<"JNT",1600502365,"쮋\udc8b⁴쮋솋\ude8b\udd8b풋","씼줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ᄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢᬆᯚ᮪ᮮᮎᮚᯆ",-1003288913>(
                                                      0<"JNT",1600502365,"횋잋잋\uda8b\udd8b\udb8b","씼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c愽괽촽뤽넽\uf53dᄽ줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ⴽ綠줽픽딽뤽\ued3dᄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢᬆᯚ᮪ᮮᮎᮚᯆ",-1003288920>(
                                                         0<"JNT",1600502365,"횋잋잋\uda8b\udd8b\udb8b","씼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c愽괽촽뤽넽\uf53dᄽ줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ⴽ綠줽픽딽뤽\ued3dᄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢᬆᯚ᮪ᮮᮎᮚᯆ",-1003288919>(
                                                            (StringBuilder)0<"JNT",924561676,"\uf38b\ude8b\udd8b\ude8b쮋趋","씼줼紽","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢᬆᯚ᮪ᮮᮎᮚᯆ",-1003288918>(),
                                                            var6
                                                         ),
                                                         var7
                                                      )
                                                   )
                                                );
                                                1<"JNT",1148819398,"읜쀜\ud9fc","⠃⚃","㭒㭜㲜",-490301886>(this, var5);
                                                break label179;
                                          }

                                          switch ((var11 ^ 1248102577) - 20667038 - 414647769 + 1559601269 + 247396932 + 134450764) {
                                             case -741627867:
                                                var19 = 1<"JNT",-1720667752,"읜쀜\ud9fc","⠃⚃","㭒㭜㲜",-490301868>(this) - 1;
                                                break label173;
                                             case 391225641:
                                             default:
                                                var19 = 1<"JNT",-1720667752,"읜쀜\ud9fc","⠃⚃","㭒㭜㲜",-490301785>(this) + 1;
                                                break label174;
                                          }
                                       }

                                       var11 = (1563816404 & 1563816404 | -1564456438) & -1563504821;
                                       break label240;
                                    }

                                    var11 = (1729780393 >>> (-776760779 << -1785644386) | 82370816) & -1897005710;
                                 }

                                 switch (((var11 ^ 280094342) + 1827611440 ^ 508325964) + 308886063 - 148131759 + 1558873551) {
                                    case 58958569:
                                       1<"JNT",1148819398,"읜쀜\ud9fc","⠃⚃","㭒㭜㲜",-490301850>(var10000, var19);
                                       break label194;
                                    case 1739034879:
                                    default:
                                       1<"JNT",1148819398,"읜쀜\ud9fc","⠃⚃","㭒㭜㲜",-490301784>(var10000, var19);
                                       break label198;
                                 }
                              }

                              0<"JNT",1600502365,"\udc8b\udb8b","씼줼紽","ᯢᮒ",-1003288880>(this);
                              break label196;
                           }

                           0<"JNT",1600502365,"\udc8b\udb8b","씼줼紽","ᯢᮒ",-1003288878>(this);
                           break label201;
                        }

                        var11 = (-347607067 & -347607067 | 545854120) & 921279419;
                     }

                     var11 = (553471977 << 13174976 | 406987316) & -1177306569;
                  }

                  var11 = 510211537 >> 1192698941 ^ 1110963419;
               }

               var11 = (115304831 * (1389781372 + -1753504537) | -2005823488) & -1963468521;
            }
         }
      }
   }

   // $VF: renamed from: wto (net.minecraft.class_11905) boolean
   public boolean method_215(class_11905 var1) {
      int var9 = 651790379;
      if (!1<"JNT",-1720667752,"쁼\udb1c앜","⠃⚃","㭒㭜㳾",-490301947>(this)) {
         return false;
      } else {
         var9 = 100 ^ 1304771469;

         label30:
         while (true) {
            switch ((var9 ^ 590832965 ^ 1863028200 ^ 1988998908) - 1161671031 - 1920619908 ^ 2071094031) {
               case -2009153368:
                  String var13 = 0<"JNT",1600502365,"삋쪋톋삋쮋솋\ude8b\udd8b풋","씼䤽䤽줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ᄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢ",-1003274900>(
                     1<"JNT",-1720667752,"웼\udabc","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490301951>(this),
                     0,
                     1<"JNT",-1720667752,"읜쀜\ud9fc","⠃⚃","㭒㭜㲜",-490301950>(this)
                  );
                  String var10002 = 0<"JNT",1600502365,"슋\uda8b쮋\udf8b\udc8b\udb8bⱴ蒋讋膋膋薋","씼줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ᄽ","᮶ᮚᯎ᪶ᮺ᮪᮶ᮚᮒᯆᮊᮖᯎ᪶ᮒᮮᮊᯒᯒᮂ᫊᫊\u1aea᪾\u1ada",-1003274893>(
                     var1
                  );
                  String var8 = 0<"JNT",1600502365,"삋쪋톋삋쮋솋\ude8b\udd8b풋","씼䤽줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ᄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢ",-1003274896>(
                     1<"JNT",-1720667752,"웼\udabc","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490301907>(this), 1<"JNT",-1720667752,"읜쀜\ud9fc","⠃⚃","㭒㭜㲜",-490301906>(this)
                  );
                  String var11 = var10002;
                  String var10 = var13;
                  1<"JNT",1148819398,"웼\udabc","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490301899>(
                     this,
                     0<"JNT",1600502365,"쮋\udc8b⁴쮋솋\ude8b\udd8b풋","씼줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ᄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢᬆᯚ᮪ᮮᮎᮚᯆ",-1003274917>(
                        0<"JNT",1600502365,"횋잋잋\uda8b\udd8b\udb8b","씼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c愽괽촽뤽넽\uf53dᄽ줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ⴽ綠줽픽딽뤽\ued3dᄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢᬆᯚ᮪ᮮᮎᮚᯆ",-1003274924>(
                           0<"JNT",1600502365,"횋잋잋\uda8b\udd8b\udb8b","씼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c愽괽촽뤽넽\uf53dᄽ줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ⴽ綠줽픽딽뤽\ued3dᄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢᬆᯚ᮪ᮮᮎᮚᯆ",-1003274923>(
                              0<"JNT",1600502365,"횋잋잋\uda8b\udd8b\udb8b","씼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c愽괽촽뤽넽\uf53dᄽ줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ⴽ綠줽픽딽뤽\ued3dᄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢᬆᯚ᮪ᮮᮎᮚᯆ",-1003274922>(
                                 (StringBuilder)0<"JNT",924561676,"\uf38b\ude8b\udd8b\ude8b쮋趋","씼줼紽","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢᬆᯚ᮪ᮮᮎᮚᯆ",-1003274921>(), var10
                              ),
                              var11
                           ),
                           var8
                        )
                     )
                  );
                  1<"JNT",1148819398,"읜쀜\ud9fc","⠃⚃","㭒㭜㲜",-490301897>(this, 1<"JNT",-1720667752,"읜쀜\ud9fc","⠃⚃","㭒㭜㲜",-490301898>(this) + 1);
                  break label30;
               case -1869698187:
                  if (0<"JNT",1600502365,"쎋\uda8b\udd8b풋쮋\udf8b","씼줼䤽","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢ",-1003274904>(
                        1<"JNT",-1720667752,"웼\udabc","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490301946>(this)
                     )
                     >= 1<"JNT",-1720667752,"쁜앜","⠃⚃","㭒㭜㲜",-490301944>(this)) {
                     return true;
                  }

                  var9 = -1850346253;
                  break;
               case -993116750:
               default:
                  0<"JNT",1600502365,"솋삋\ude8b쮋","씼줼紽","ᯢᮒ",-1003274862>(this);
                  if (0<"JNT",1600502365,"잋쮋","씼줼贽","ᯢᮒ",-1003274863>(this)) {
                     int var2 = 0<"JNT",598047213,"슋\ude8b\udd8b","씼䤽䤽줼䤽","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶ᬺᮊᯎᮞ",-1003274890>(
                        1<"JNT",-1720667752,"삼삼읜","⠃⚃","㭒㭜㲜",-490301937>(this), 1<"JNT",-1720667752,"읜쀜\ud9fc","⠃⚃","㭒㭜㲜",-490301936>(this)
                     );
                     int var3 = 0<"JNT",598047213,"슋횋쾋","씼䤽䤽줼䤽","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶ᬺᮊᯎᮞ",-1003274885>(
                        1<"JNT",-1720667752,"삼삼읜","⠃⚃","㭒㭜㲜",-490301942>(this), 1<"JNT",-1720667752,"읜쀜\ud9fc","⠃⚃","㭒㭜㲜",-490301941>(this)
                     );
                     String var10000 = 0<"JNT",1600502365,"삋쪋톋삋쮋솋\ude8b\udd8b풋","씼䤽䤽줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ᄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢ",-1003274887>(
                        1<"JNT",-1720667752,"웼\udabc","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490301931>(this), 0, var2
                     );
                     String var10001 = 0<"JNT",1600502365,"슋\uda8b쮋\udf8b\udc8b\udb8bⱴ蒋讋膋膋薋","씼줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ᄽ","᮶ᮚᯎ᪶ᮺ᮪᮶ᮚᮒᯆᮊᮖᯎ᪶ᮒᮮᮊᯒᯒᮂ᫊᫊\u1aea᪾\u1ada",-1003274888>(
                        var1
                     );
                     String var7 = 0<"JNT",1600502365,"삋쪋톋삋쮋솋\ude8b\udd8b풋","씼䤽줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ᄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢ",-1003274882>(
                        1<"JNT",-1720667752,"웼\udabc","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490301928>(this), var3
                     );
                     String var6 = var10001;
                     String var5 = var10000;
                     String var4 = 0<"JNT",1600502365,"쮋\udc8b⁴쮋솋\ude8b\udd8b풋","씼줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ᄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢᬆᯚ᮪ᮮᮎᮚᯆ",-1003274943>(
                        0<"JNT",1600502365,"횋잋잋\uda8b\udd8b\udb8b","씼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c愽괽촽뤽넽\uf53dᄽ줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ⴽ綠줽픽딽뤽\ued3dᄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢᬆᯚ᮪ᮮᮎᮚᯆ",-1003274942>(
                           0<"JNT",1600502365,"횋잋잋\uda8b\udd8b\udb8b","씼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c愽괽촽뤽넽\uf53dᄽ줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ⴽ綠줽픽딽뤽\ued3dᄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢᬆᯚ᮪ᮮᮎᮚᯆ",-1003274941>(
                              0<"JNT",1600502365,"횋잋잋\uda8b\udd8b\udb8b","씼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c愽괽촽뤽넽\uf53dᄽ줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ⴽ綠줽픽딽뤽\ued3dᄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢᬆᯚ᮪ᮮᮎᮚᯆ",-1003274884>(
                                 (StringBuilder)0<"JNT",924561676,"\uf38b\ude8b\udd8b\ude8b쮋趋","씼줼紽","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢᬆᯚ᮪ᮮᮎᮚᯆ",-1003274883>(), var5
                              ),
                              var6
                           ),
                           var7
                        )
                     );
                     if (0<"JNT",1600502365,"쎋\uda8b\udd8b풋쮋\udf8b","씼줼䤽","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢ",-1003274944>(var4)
                        > 1<"JNT",-1720667752,"쁜앜","⠃⚃","㭒㭜㲜",-490301952>(this)) {
                        return true;
                     }

                     1<"JNT",1148819398,"웼\udabc","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490301958>(this, var4);
                     1<"JNT",1148819398,"읜쀜\ud9fc","⠃⚃","㭒㭜㲜",-490301957>(this, var2 + 1);
                     1<"JNT",1148819398,"삼삼읜","⠃⚃","㭒㭜㲜",-490301956>(this, -1);
                     break label30;
                  }

                  var9 = 858422572 ^ -1013004244 ^ 1773216804;
            }
         }

         0<"JNT",1600502365,"\udc8b\udb8b","씼줼紽","ᯢᮒ",-1003274906>(this);
         return true;
      }
   }

   // $VF: renamed from: pt () boolean
   public boolean method_216() {
      return 1<"JNT",-1720667752,"삼삼읜","⠃⚃","㭒㭜㲜",-490301896>(this) != -1
         && 1<"JNT",-1720667752,"삼삼읜","⠃⚃","㭒㭜㲜",-490301903>(this) != 1<"JNT",-1720667752,"읜쀜\ud9fc","⠃⚃","㭒㭜㲜",-490301902>(this);
   }

   // $VF: renamed from: xz (boolean) void
   // $VF: Irreducible bytecode was duplicated to produce valid code
   public void method_217(boolean var1) {
      int var2 = 1217573696;
      if (var1) {
         if (1<"JNT",-1720667752,"삼삼읜","⠃⚃","㭒㭜㲜",-490301901>(this) == -1) {
            1<"JNT",1148819398,"삼삼읜","⠃⚃","㭒㭜㲜",-490301923>(this, 1<"JNT",-1720667752,"읜쀜\ud9fc","⠃⚃","㭒㭜㲜",-490301900>(this));
         }

         var2 = -1006875253;
      } else {
         var2 = -327235682;
      }

      while (true) {
         switch ((var2 ^ 685516947) - 1269931955 + 1956008389 + 885016926 + 132997991 + 251003917) {
            case 959140337:
            default:
               1<"JNT",1148819398,"삼삼읜","⠃⚃","㭒㭜㲜",-490301922>(this, -1);
               var2 = -1006875253;
               break;
            case 1604896764:
               return;
         }
      }
   }

   // $VF: renamed from: dyv () boolean
   public boolean method_218() {
      if (!0<"JNT",1600502365,"잋쮋","씼줼贽","ᯢᮒ",-1003274976>(this)) {
         return false;
      } else {
         int var1 = 0<"JNT",598047213,"슋\ude8b\udd8b","씼䤽䤽줼䤽","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶ᬺᮊᯎᮞ",-1003274939>(
            1<"JNT",-1720667752,"삼삼읜","⠃⚃","㭒㭜㲜",-490301920>(this), 1<"JNT",-1720667752,"읜쀜\ud9fc","⠃⚃","㭒㭜㲜",-490301895>(this)
         );
         int var2 = 0<"JNT",598047213,"슋횋쾋","씼䤽䤽줼䤽","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶ᬺᮊᯎᮞ",-1003274934>(
            1<"JNT",-1720667752,"삼삼읜","⠃⚃","㭒㭜㲜",-490301925>(this), 1<"JNT",-1720667752,"읜쀜\ud9fc","⠃⚃","㭒㭜㲜",-490301924>(this)
         );
         String var10001 = 0<"JNT",1600502365,"삋쪋톋삋쮋솋\ude8b\udd8b풋","씼䤽䤽줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ᄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢ",-1003274936>(
            1<"JNT",-1720667752,"웼\udabc","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490301914>(this), 0, var1
         );
         String var4 = 0<"JNT",1600502365,"삋쪋톋삋쮋솋\ude8b\udd8b풋","씼䤽줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ᄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢ",-1003274930>(
            1<"JNT",-1720667752,"웼\udabc","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490301912>(this), var2
         );
         String var3 = var10001;
         1<"JNT",1148819398,"웼\udabc","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490303026>(
            this,
            0<"JNT",1600502365,"쮋\udc8b⁴쮋솋\ude8b\udd8b풋","씼줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ᄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢᬆᯚ᮪ᮮᮎᮚᯆ",-1003274926>(
               0<"JNT",1600502365,"횋잋잋\uda8b\udd8b\udb8b","씼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c愽괽촽뤽넽\uf53dᄽ줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ⴽ綠줽픽딽뤽\ued3dᄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢᬆᯚ᮪ᮮᮎᮚᯆ",-1003274925>(
                  0<"JNT",1600502365,"횋잋잋\uda8b\udd8b\udb8b","씼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c愽괽촽뤽넽\uf53dᄽ줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ⴽ綠줽픽딽뤽\ued3dᄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢᬆᯚ᮪ᮮᮎᮚᯆ",-1003274932>(
                     (StringBuilder)0<"JNT",924561676,"\uf38b\ude8b\udd8b\ude8b쮋趋","씼줼紽","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢᬆᯚ᮪ᮮᮎᮚᯆ",-1003274931>(), var3
                  ),
                  var4
               )
            )
         );
         1<"JNT",1148819398,"읜쀜\ud9fc","⠃⚃","㭒㭜㲜",-490303025>(this, var1);
         1<"JNT",1148819398,"삼삼읜","⠃⚃","㭒㭜㲜",-490303024>(this, -1);
         0<"JNT",1600502365,"\udc8b\udb8b","씼줼紽","ᯢᮒ",-1003274954>(this);
         return true;
      }
   }

   // $VF: renamed from: je () void
   public void method_219() {
      if (0<"JNT",1600502365,"잋쮋","씼줼贽","ᯢᮒ",-1003275007>(this)) {
         int var1 = 0<"JNT",598047213,"슋\ude8b\udd8b","씼䤽䤽줼䤽","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶ᬺᮊᯎᮞ",-1003274949>(
            1<"JNT",-1720667752,"삼삼읜","⠃⚃","㭒㭜㲜",-490303030>(this), 1<"JNT",-1720667752,"읜쀜\ud9fc","⠃⚃","㭒㭜㲜",-490303029>(this)
         );
         int var2 = 0<"JNT",598047213,"슋횋쾋","씼䤽䤽줼䤽","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶ᬺᮊᯎᮞ",-1003274952>(
            1<"JNT",-1720667752,"삼삼읜","⠃⚃","㭒㭜㲜",-490303019>(this), 1<"JNT",-1720667752,"읜쀜\ud9fc","⠃⚃","㭒㭜㲜",-490303018>(this)
         );
         long var3 = 0<"JNT",1600502365,"슋\uda8b쮋\udf8b\udc8b\udb8bⱴ讋讋躋螋","씼줼䴽","᮶ᮚᯎ᪶ᮺ᮪᮶ᮚᮒᯆᮊᮖᯎ᪶ᮒᮮᮊᯒᯒᮂ᫊᪾᫊ᫎ",-1003274947>(
            0<"JNT",1600502365,"슋\uda8b쮋\udf8b\udc8b\udb8bⱴ膋膋薋辋肋","씼줼唽\udd3d뤽\uf53d\ue13c\ud93d줽\udd3d뤽넽\ued3dꤽ봽\uf53d\ue13c넽픽ꤽ\uf13d\uf13dꄽ\ue93c\ue53c\uf53c\ue93cᄽ","᮶ᮚᯎ᪶ᮺ᮪᮶ᮚᮒᯆᮊᮖᯎ᪶ᮒᮮᮊᯒᯒᮂ\u1ad2᫊᪾",-1003274946>(
               0<"JNT",598047213,"슋\uda8b쮋\udf8b\udc8b\udb8bⱴ蚋誋誋蚋","씼줼唽\udd3d뤽\uf53d\ue13c\ud93d줽\udd3d뤽넽\ued3dꤽ봽\uf53d\ue13c넽픽ꤽ\uf13d\uf13dꄽ\uf13c\ue93c\ue53cᄽ","᮶ᮚᯎ᪶ᮺ᮪᮶ᮚᮒᯆᮊᮖᯎ᪶ᮒᮮᮊᯒᯒᮂ\u1ad2᫊᪾",-1003274945>()
            )
         );
         0<"JNT",598047213,"풋쎋햋쒋⁴\uda8b쮋ぴ쎋\ude8b잋톋\udc8b횋솋\udb8b⁴쮋솋\ude8b\udd8b풋","씼䴽唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13cㄽ씽ꤽ\ued3d焽뤽\ue93d綠뤽\udd3d넽뤽ᄽ줼紽","ᯂᯆᮢ᪶ᮮᯢᮦᮢᮮ᪶ᮢᮮᮖᯢ᪶ᬢᬮᬖ᭢",-1003275006>(
            var3,
            0<"JNT",1600502365,"삋쪋톋삋쮋솋\ude8b\udd8b풋","씼䤽䤽줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ᄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢ",-1003275005>(
               1<"JNT",-1720667752,"웼\udabc","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490303021>(this), var1, var2
            )
         );
      }
   }

   // $VF: renamed from: qs () void
   public void method_220() {
      if (0<"JNT",1600502365,"잋쮋","씼줼贽","ᯢᮒ",-1003275008>(this)) {
         0<"JNT",1600502365,"\ud98b\uda8b","씼줼紽","ᯢᮒ",-1003274969>(this);
         0<"JNT",1600502365,"\udb8b캋얋","씼줼贽","ᯢᮒ",-1003274970>(this);
      }
   }

   // $VF: renamed from: vmm () void
   public void method_221() {
      String var1 = 0<"JNT",1600502365,"슋\uda8b쮋\udf8b\udc8b\udb8bⱴ蚋讋薋螋","씼줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ᄽ","᮶ᮚᯎ᪶ᮺ᮪᮶ᮚᮒᯆᮊᮖᯎ᪶ᮒᮮᮊᯒᯒᮂ\u1ad2᪾\u1aea",-1003274965>(
         1<"JNT",-1720667752,"\udadc으\udabc쀜\udb1c\ud97c젼졼졼줜","❣♃⢣ὣ❃⟃❣♃⚃⣣⛃♣⢣ὣ⚃➣⛃⢃⢃┃₃\u20c3✣","㭒㭜㲚㰦㳔㰪㲠㰤㳜㰦㳔㳈㰮㳌㳖㰪㲠㳈㳚㳌㰨㰨㳀㲨㲢㲼㲸",-490303045>(
            0<"JNT",598047213,"슋\uda8b쮋\udf8b\udc8b\udb8bⱴ蚋誋誋蚋","씼줼唽\udd3d뤽\uf53d\ue13c\ud93d줽\udd3d뤽넽\ued3dꤽ봽\uf53d\ue13c넽픽ꤽ\uf13d\uf13dꄽ\uf13c\ue93c\ue53cᄽ","᮶ᮚᯎ᪶ᮺ᮪᮶ᮚᮒᯆᮊᮖᯎ᪶ᮒᮮᮊᯒᯒᮂ\u1ad2᫊᪾",-1003274971>()
         )
      );
      if (0<"JNT",1600502365,"잋쮋","씼줼贽","ᯢᮒ",-1003274966>(this)) {
         int var2 = 0<"JNT",598047213,"슋\ude8b\udd8b","씼䤽䤽줼䤽","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶ᬺᮊᯎᮞ",-1003274961>(
            1<"JNT",-1720667752,"삼삼읜","⠃⚃","㭒㭜㲜",-490303034>(this), 1<"JNT",-1720667752,"읜쀜\ud9fc","⠃⚃","㭒㭜㲜",-490303033>(this)
         );
         int var3 = 0<"JNT",598047213,"슋횋쾋","씼䤽䤽줼䤽","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶ᬺᮊᯎᮞ",-1003274964>(
            1<"JNT",-1720667752,"삼삼읜","⠃⚃","㭒㭜㲜",-490303039>(this), 1<"JNT",-1720667752,"읜쀜\ud9fc","⠃⚃","㭒㭜㲜",-490303038>(this)
         );
         String var10000 = 0<"JNT",1600502365,"삋쪋톋삋쮋솋\ude8b\udd8b풋","씼䤽䤽줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ᄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢ",-1003274958>(
            1<"JNT",-1720667752,"웼\udabc","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490303036>(this), 0, var2
         );
         String var7 = 0<"JNT",1600502365,"삋쪋톋삋쮋솋\ude8b\udd8b풋","씼䤽줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ᄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢ",-1003274960>(
            1<"JNT",-1720667752,"웼\udabc","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490302994>(this), var3
         );
         String var5 = var10000;
         String var4 = 0<"JNT",1600502365,"쮋\udc8b⁴쮋솋\ude8b\udd8b풋","씼줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ᄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢᬆᯚ᮪ᮮᮎᮚᯆ",-1003275237>(
            0<"JNT",1600502365,"횋잋잋\uda8b\udd8b\udb8b","씼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c愽괽촽뤽넽\uf53dᄽ줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ⴽ綠줽픽딽뤽\ued3dᄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢᬆᯚ᮪ᮮᮎᮚᯆ",-1003275244>(
               0<"JNT",1600502365,"횋잋잋\uda8b\udd8b\udb8b","씼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c愽괽촽뤽넽\uf53dᄽ줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ⴽ綠줽픽딽뤽\ued3dᄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢᬆᯚ᮪ᮮᮎᮚᯆ",-1003275243>(
                  0<"JNT",1600502365,"횋잋잋\uda8b\udd8b\udb8b","씼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c愽괽촽뤽넽\uf53dᄽ줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ⴽ綠줽픽딽뤽\ued3dᄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢᬆᯚ᮪ᮮᮎᮚᯆ",-1003275242>(
                     (StringBuilder)0<"JNT",924561676,"\uf38b\ude8b\udd8b\ude8b쮋趋","씼줼紽","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢᬆᯚ᮪ᮮᮎᮚᯆ",-1003275241>(), var5
                  ),
                  var1
               ),
               var7
            )
         );
         if (0<"JNT",1600502365,"쎋\uda8b\udd8b풋쮋\udf8b","씼줼䤽","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢ",-1003275238>(var4) > 1<"JNT",-1720667752,"쁜앜","⠃⚃","㭒㭜㲜",-490302986>(this)) {
            var4 = 0<"JNT",1600502365,"삋쪋톋삋쮋솋\ude8b\udd8b풋","씼䤽䤽줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ᄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢ",-1003275233>(
               var4, 0, 1<"JNT",-1720667752,"쁜앜","⠃⚃","㭒㭜㲜",-490302985>(this)
            );
         }

         1<"JNT",1148819398,"웼\udabc","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490303008>(this, var4);
         1<"JNT",1148819398,"읜쀜\ud9fc","⠃⚃","㭒㭜㲜",-490303003>(
            this,
            0<"JNT",598047213,"슋\ude8b\udd8b","씼䤽䤽줼䤽","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶ᬺᮊᯎᮞ",-1003275253>(
               var2 + 0<"JNT",1600502365,"쎋\uda8b\udd8b풋쮋\udf8b","씼줼䤽","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢ",-1003275258>(var1),
               0<"JNT",1600502365,"쎋\uda8b\udd8b풋쮋\udf8b","씼줼䤽","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢ",-1003275260>(
                  1<"JNT",-1720667752,"웼\udabc","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490303014>(this)
               )
            )
         );
         1<"JNT",1148819398,"삼삼읜","⠃⚃","㭒㭜㲜",-490303002>(this, -1);
      } else {
         String var10 = 0<"JNT",1600502365,"삋쪋톋삋쮋솋\ude8b\udd8b풋","씼䤽䤽줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ᄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢ",-1003275251>(
            1<"JNT",-1720667752,"웼\udabc","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490303000>(this), 0, 1<"JNT",-1720667752,"읜쀜\ud9fc","⠃⚃","㭒㭜㲜",-490303007>(this)
         );
         String var8 = 0<"JNT",1600502365,"삋쪋톋삋쮋솋\ude8b\udd8b풋","씼䤽줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ᄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢ",-1003275246>(
            1<"JNT",-1720667752,"웼\udabc","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490303005>(this), 1<"JNT",-1720667752,"읜쀜\ud9fc","⠃⚃","㭒㭜㲜",-490303004>(this)
         );
         String var6 = var10;
         String var9 = 0<"JNT",1600502365,"쮋\udc8b⁴쮋솋\ude8b\udd8b풋","씼줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ᄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢᬆᯚ᮪ᮮᮎᮚᯆ",-1003274763>(
            0<"JNT",1600502365,"횋잋잋\uda8b\udd8b\udb8b","씼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c愽괽촽뤽넽\uf53dᄽ줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ⴽ綠줽픽딽뤽\ued3dᄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢᬆᯚ᮪ᮮᮎᮚᯆ",-1003274762>(
               0<"JNT",1600502365,"횋잋잋\uda8b\udd8b\udb8b","씼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c愽괽촽뤽넽\uf53dᄽ줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ⴽ綠줽픽딽뤽\ued3dᄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢᬆᯚ᮪ᮮᮎᮚᯆ",-1003274761>(
                  0<"JNT",1600502365,"횋잋잋\uda8b\udd8b\udb8b","씼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c愽괽촽뤽넽\uf53dᄽ줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ⴽ綠줽픽딽뤽\ued3dᄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢᬆᯚ᮪ᮮᮎᮚᯆ",-1003275248>(
                     (StringBuilder)0<"JNT",924561676,"\uf38b\ude8b\udd8b\ude8b쮋趋","씼줼紽","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢᬆᯚ᮪ᮮᮎᮚᯆ",-1003275247>(), var6
                  ),
                  var1
               ),
               var8
            )
         );
         if (0<"JNT",1600502365,"쎋\uda8b\udd8b풋쮋\udf8b","씼줼䤽","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢ",-1003274764>(var9) > 1<"JNT",-1720667752,"쁜앜","⠃⚃","㭒㭜㲜",-490301044>(this)) {
            var9 = 0<"JNT",1600502365,"삋쪋톋삋쮋솋\ude8b\udd8b풋","씼䤽䤽줼唽촽ꤽﴽꤽ\ue13c픽ꤽ\udd3d섽\ue13c焽\uf53d\ued3d줽\udd3d섽ᄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢ",-1003274759>(
               var9, 0, 1<"JNT",-1720667752,"쁜앜","⠃⚃","㭒㭜㲜",-490301035>(this)
            );
         }

         1<"JNT",1148819398,"웼\udabc","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490302991>(this, var9);
         1<"JNT",1148819398,"읜쀜\ud9fc","⠃⚃","㭒㭜㲜",-490303009>(
            this,
            0<"JNT",598047213,"슋\ude8b\udd8b","씼䤽䤽줼䤽","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶ᬺᮊᯎᮞ",-1003274783>(
               1<"JNT",-1720667752,"읜쀜\ud9fc","⠃⚃","㭒㭜㲜",-490302990>(this)
                  + 0<"JNT",1600502365,"쎋\uda8b\udd8b풋쮋\udf8b","씼줼䤽","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢ",-1003275236>(var1),
               0<"JNT",1600502365,"쎋\uda8b\udd8b풋쮋\udf8b","씼줼䤽","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢ",-1003274782>(
                  1<"JNT",-1720667752,"웼\udabc","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490302988>(this)
               )
            )
         );
      }

      0<"JNT",1600502365,"\udc8b\udb8b","씼줼紽","ᯢᮒ",-1003275256>(this);
   }

   // $VF: renamed from: im (int) int
   public int method_222(int var1) {
      int var2 = -306262088;

      label32:
      while (true) {
         var2 = (456692115 * (-665774123 + -665774123) | 147135697) & -889365257;

         while (true) {
            switch ((var2 + 1366910403 ^ 966280041) + 208272746 + 528089133 - 553368187 ^ 165984308) {
               case -1415619790:
                  if (var1 <= 0
                     || !0<"JNT",598047213,"\ude8b삋⍴\uda8b쮋쮋\uda8b솋㱴솋㭴\ude8b풋\ude8b쮋","씼ㄽ줼贽","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶ᬒᮞᮊᯆᮊᮒᯎᮚᯆ",-1003274754>(
                        0<"JNT",1600502365,"킋\udf8b횋솋㙴쮋","씼䤽줼ㄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢ",-1003274753>(
                           1<"JNT",-1720667752,"웼\udabc","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490301033>(this), var1 - 1
                        )
                     )) {
                     var2 = (1301257244 | 1301257244 << 1301257244) ^ -18781663;
                     continue;
                  }

                  var1--;
                  break;
               case -1044587855:
                  return var1;
               case -413418181:
               default:
                  if (var1 > 0
                     && !0<"JNT",598047213,"\ude8b삋⍴\uda8b쮋쮋\uda8b솋㱴솋㭴\ude8b풋\ude8b쮋","씼ㄽ줼贽","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶ᬒᮞᮊᯆᮊᮒᯎᮚᯆ",-1003274813>(
                        0<"JNT",1600502365,"킋\udf8b횋솋㙴쮋","씼䤽줼ㄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢ",-1003274756>(
                           1<"JNT",-1720667752,"웼\udabc","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490301038>(this), var1 - 1
                        )
                     )) {
                     var1--;
                     continue label32;
                  }
            }

            var2 = (1476533161 >> 1476533161 | 1553102528) & 2110944960;
         }
      }
   }

   // $VF: renamed from: lb (int) int
   public int method_223(int var1) {
      int var2 = 1363351866;

      label31:
      while (true) {
         var2 = (1290024600 ^ 1291734071 - 1485452747 | 336301105) & 1953476283;

         while (true) {
            switch ((var2 ^ 1925808282) + 1297789900 - 203981962 ^ 386511979 ^ 1388490908 ^ 511338167) {
               case -1354003192:
                  return var1;
               case -599443155:
                  if (var1
                        < 0<"JNT",1600502365,"쎋\uda8b\udd8b풋쮋\udf8b","씼줼䤽","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢ",-1003274780>(
                           1<"JNT",-1720667752,"웼\udabc","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490301062>(this)
                        )
                     && !0<"JNT",598047213,"\ude8b삋⍴\uda8b쮋쮋\uda8b솋㱴솋㭴\ude8b풋\ude8b쮋","씼ㄽ줼贽","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶ᬒᮞᮊᯆᮊᮒᯎᮚᯆ",-1003274775>(
                        0<"JNT",1600502365,"킋\udf8b횋솋㙴쮋","씼䤽줼ㄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢ",-1003274774>(
                           1<"JNT",-1720667752,"웼\udabc","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490301060>(this), var1
                        )
                     )) {
                     var1++;
                     continue label31;
                  }
                  break;
               case 2008854227:
               default:
                  if (var1
                        >= 0<"JNT",1600502365,"쎋\uda8b\udd8b풋쮋\udf8b","씼줼䤽","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢ",-1003274815>(
                           1<"JNT",-1720667752,"웼\udabc","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490301059>(this)
                        )
                     || !0<"JNT",598047213,"\ude8b삋⍴\uda8b쮋쮋\uda8b솋㱴솋㭴\ude8b풋\ude8b쮋","씼ㄽ줼贽","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶ᬒᮞᮊᯆᮊᮒᯎᮚᯆ",-1003274778>(
                        0<"JNT",1600502365,"킋\udf8b횋솋㙴쮋","씼䤽줼ㄽ","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢ",-1003274777>(
                           1<"JNT",-1720667752,"웼\udabc","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490301057>(this), var1
                        )
                     )) {
                     var2 = -1056882532;
                     continue;
                  }

                  var1++;
            }

            var2 = -1743643189;
         }
      }
   }

   public void rsit() {
      1<"JNT",1148819398,"\uda5c뿜","⠃⚃","㭒㭜㳾",-490301049>(this, true);
      1<"JNT",1148819398,"쀼웼","⠃⚃","㭒㭜㲞",-490301055>(
         this, 0<"JNT",598047213,"킋쪋솋솋\uda8b\udd8b쮋\u2b74\ude8b슋\uda8b≴\ude8b쎋쎋\ude8b삋","씼줼䴽","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯪᯒᯎᮚᮺ",-1003274769>()
      );
   }

   // $VF: renamed from: od () void
   public void method_224() {
      if (1<"JNT",-1720667752,"씼얜\udb1c","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳮㰴㰦㰦㳌㳎㳚㳔㲸",-490301054>(this) != null) {
         0<"JNT",507575243,"솋쪋\udd8b","씼줼紽","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶ᭆᯚ᮶᮶ᮊᮆᮮᮚ",-1003274765>(1<"JNT",-1720667752,"씼얜\udb1c","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳮㰴㰦㰦㳌㳎㳚㳔㲸",-490301053>(this));
      }
   }

   // $VF: renamed from: tl () java.lang.String
   public String method_225() {
      return 1<"JNT",-1720667752,"웼\udabc","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490301011>(this);
   }

   // $VF: renamed from: omw (java.lang.String) void
   public void method_226(String var1) {
      1<"JNT",1148819398,"웼\udabc","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490301010>(this, var1);
      1<"JNT",1148819398,"읜쀜\ud9fc","⠃⚃","㭒㭜㲜",-490301014>(
         this,
         0<"JNT",598047213,"슋\ude8b\udd8b","씼䤽䤽줼䤽","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶ᬺᮊᯎᮞ",-1003274794>(
            1<"JNT",-1720667752,"읜쀜\ud9fc","⠃⚃","㭒㭜㲜",-490301009>(this), 0<"JNT",1600502365,"쎋\uda8b\udd8b풋쮋\udf8b","씼줼䤽","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢ",-1003274793>(var1)
         )
      );
      if (1<"JNT",-1720667752,"삼삼읜","⠃⚃","㭒㭜㲜",-490301013>(this) != -1) {
         1<"JNT",1148819398,"삼삼읜","⠃⚃","㭒㭜㲜",-490301001>(
            this,
            0<"JNT",598047213,"슋\ude8b\udd8b","씼䤽䤽줼䤽","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶ᬺᮊᯎᮞ",-1003274791>(
               1<"JNT",-1720667752,"삼삼읜","⠃⚃","㭒㭜㲜",-490301012>(this), 0<"JNT",1600502365,"쎋\uda8b\udd8b풋쮋\udf8b","씼줼䤽","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢ",-1003274790>(var1)
            )
         );
      }
   }

   // $VF: renamed from: xog () int
   public int method_227() {
      return 1<"JNT",-1720667752,"읜쀜\ud9fc","⠃⚃","㭒㭜㲜",-490301000>(this);
   }

   // $VF: renamed from: yd () void
   public void method_228() {
      1<"JNT",1148819398,"읜쀜\ud9fc","⠃⚃","㭒㭜㲜",-490301005>(
         this,
         0<"JNT",1600502365,"쎋\uda8b\udd8b풋쮋\udf8b","씼줼䤽","ᮦᮊᯖᮊ᪶ᮮᮊ᮶ᮢ᪶᭒ᯎᯆ᮪᮶ᮢ",-1003274787>(
            1<"JNT",-1720667752,"웼\udabc","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490301007>(this)
         )
      );
      1<"JNT",1148819398,"삼삼읜","⠃⚃","㭒㭜㲜",-490301004>(this, -1);
   }

   // $VF: renamed from: lso () boolean
   public boolean method_229() {
      return 1<"JNT",-1720667752,"쁼\udb1c앜","⠃⚃","㭒㭜㳾",-490301027>(this);
   }

   // $VF: renamed from: mie (boolean) void
   public void method_230(boolean var1) {
      1<"JNT",1148819398,"쁼\udb1c앜","⠃⚃","㭒㭜㳾",-490301026>(this, var1);
   }

   // $VF: renamed from: klq (java.lang.String) void
   public void method_231(String var1) {
      1<"JNT",1148819398,"으앜","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490301025>(this, var1);
   }

   // $VF: renamed from: bai (int) void
   public void method_232(int var1) {
      1<"JNT",1148819398,"쁜앜","⠃⚃","㭒㭜㲜",-490301024>(this, var1);
   }

   // $VF: renamed from: jvn (java.lang.Runnable) void
   public void method_233(Runnable var1) {
      1<"JNT",1148819398,"씼얜\udb1c","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳮㰴㰦㰦㳌㳎㳚㳔㲸",-490300999>(this, var1);
   }

   // $VF: renamed from: xkj () void
   public void method_234() {
      1<"JNT",1148819398,"웼\udabc","⠃⚃","㭒㭜㲚㳞㳌㰶㳌㲠㳚㳌㰦㳐㲠㳨㰪㰮㳜㰦㳐㲸",-490301030>(this, "");
      1<"JNT",1148819398,"읜쀜\ud9fc","⠃⚃","㭒㭜㲜",-490301029>(this, 0);
      1<"JNT",1148819398,"삼삼읜","⠃⚃","㭒㭜㲜",-490301028>(this, -1);
      0<"JNT",1600502365,"\udc8b\udb8b","씼줼紽","ᯢᮒ",-1003274806>(this);
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_235(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 ^ 2029230706) - 2082913226 - 974296742 + 1906518929 - 552649505 ^ 1559262572) - 1427162046 - 1397319646 ^ 1664356281;
      MethodHandle var10000 = field_169[((var10 ^ 2029230706) - 2082913226 - 974296742 + 1906518929 - 552649505 ^ 1559262572) - 1427162046 - 1397319646
         ^ 1664356281
         ^ 6001620];
      if (field_169[var10001 ^ 6001620] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = (-310124340 >> 1440048600 | 0) & 2; var23 < var13.length(); var23 += (1621652133 + (-2125304500 ^ -2095664463) | 1) & 16944141) {
            int var42 = var13.charAt(var23) ^ 211 ^ 88;
            char var45 = (char)(
               (
                        (
                              ((((((var42 & 65504) >> 5 | var42 << 11) & 65528) >> 3 | ((var42 & 65504) >> 5 | var42 << 11) << 13) ^ 164) & 0) >> 16
                                 | (((((var42 & 65504) >> 5 | var42 << 11) & 65528) >> 3 | ((var42 & 65504) >> 5 | var42 << 11) << 13) ^ 164) << 0
                           )
                           ^ 105
                     )
                     + 4
                     + 30
                  ^ 92
            );
            var13.setCharAt(
               var23,
               (char)(
                  (
                           (
                                 ((((((var42 & 65504) >> 5 | var42 << 11) & 65528) >> 3 | ((var42 & 65504) >> 5 | var42 << 11) << 13) ^ 164) & 0) >> 16
                                    | (((((var42 & 65504) >> 5 | var42 << 11) & 65528) >> 3 | ((var42 & 65504) >> 5 | var42 << 11) << 13) ^ 164) << 0
                              )
                              ^ 105
                        )
                        + 4
                        + 30
                     ^ 92
               )
            );
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = (1448355318 * 500090429 | 0) & 1243787360; var29 < var16.length(); var29 += -1192971824 >> -1943257825 ^ -2) {
            int var50 = var16.charAt(var29);
            int var85 = (var50 & 65534) >> 1;
            int var51 = (var50 & 65534) >> 1 | var50 << 15;
            int var86 = (((var50 & 65534) >> 1 | var50 << 15) & 32768) >> 15;
            var50 = (((var85 | var50 << 15) & 32768) >> 15 | ((var50 & 65534) >> 1 | var50 << 15) << 1) - 156 - 17 - 147;
            var85 = ((var86 | var51 << 1) - 156 - 17 - 147 & 63488) >> 11;
            int var53 = ((var86 | var51 << 1) - 156 - 17 - 147 & 63488) >> 11 | var50 << 5;
            int var88 = ((((var86 | var51 << 1) - 156 - 17 - 147 & 63488) >> 11 | var50 << 5) & 32768) >> 15;
            char var54 = (char)(
               (((var85 | var50 << 5) & 32768) >> 15 | (((var86 | var51 << 1) - 156 - 17 - 147 & 63488) >> 11 | var50 << 5) << 1) + 199 - 101 + 150
            );
            var16.setCharAt(var29, (char)((var88 | var53 << 1) + 199 - 101 + 150));
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_369.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = 164039499 >> 1366843109 ^ 5126234; var35 < var19.length(); var35 += 465105634 + (-1624162581 >> -559522968) ^ 458761249) {
            int var59 = var19.charAt(var35) - 3;
            int var89 = (var59 & 63488) >> 11;
            int var60 = (((var59 & 63488) >> 11 | var59 << 5) + 199 ^ 249) - 179;
            int var90 = ((((var59 & 63488) >> 11 | var59 << 5) + 199 ^ 249) - 179 & 49152) >> 14;
            var59 = ((((var89 | var59 << 5) + 199 ^ 249) - 179 & 49152) >> 14 | (((var59 & 63488) >> 11 | var59 << 5) + 199 ^ 249) - 179 << 2) - 83 ^ 46;
            var89 = (((var90 | var60 << 2) - 83 ^ 46) & 65520) >> 4;
            int var62 = (((var90 | var60 << 2) - 83 ^ 46) & 65520) >> 4 | var59 << 12;
            int var92 = (((((var90 | var60 << 2) - 83 ^ 46) & 65520) >> 4 | var59 << 12) & 65504) >> 5;
            char var63 = (char)(((var89 | var59 << 12) & 65504) >> 5 | ((((var90 | var60 << 2) - 83 ^ 46) & 65520) >> 4 | var59 << 12) << 11);
            var19.setCharAt(var35, (char)(var92 | var62 << 11));
         }

         Class var7 = Class.forName(var19.toString(), false, Class_369.class.getClassLoader());
         switch (((var4 - 154730276 + 1866351154 + 1831998054 - 1891260078 ^ 138164665) + 2119943614 ^ 516805980) + 1833006516 - 574206272 - 860140786) {
            case 647010551:
               var10000 = var0.findConstructor(var7, var6);
               break;
            case 712696598:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            case 802385212:
            case 1857725062:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 1299876931:
               var10000 = var0.findSpecial(var7, var5, var6, Class_369.class);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_169[((var10 ^ 2029230706) - 2082913226 - 974296742 + 1906518929 - 552649505 ^ 1559262572) - 1427162046 - 1397319646 ^ 1664356281 ^ 6001620] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_236(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = (var10 - 624608149 - 628736549 ^ 199883778 ^ 56598573) - 348120400 - 1844196110 - 1033926494 + 1443304315 ^ 672605691;
      MethodHandle var10000 = field_169[((var10 - 624608149 - 628736549 ^ 199883778 ^ 56598573) - 348120400 - 1844196110 - 1033926494 + 1443304315 ^ 672605691)
         - 239727907];
      if (field_169[var10001 - 239727907] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = (1553815419 - 1553815419 | 0) & 938443638; var24 < var14.length(); var24 += (-470090288 + -899576718 | 1) & 1090535817) {
            int var43 = var14.charAt(var24) + 'c';
            int var10004 = (var43 & 65504) >> 5;
            int var44 = (((var43 & 65504) >> 5 | var43 << 11) ^ 161) - 24 + 147;
            int var80 = ((((var43 & 65504) >> 5 | var43 << 11) ^ 161) - 24 + 147 & 0) >> 16;
            char var45 = (char)(
               (((((var10004 | var43 << 11) ^ 161) - 24 + 147 & 0) >> 16 | (((var43 & 65504) >> 5 | var43 << 11) ^ 161) - 24 + 147 << 0) + 208 - 182 ^ 211)
                  + 136
            );
            var14.setCharAt(var24, (char)(((var80 | var44 << 0) + 208 - 182 ^ 211) + 136));
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = -1154289498 - -37746650 ^ -1116542848; var30 < var17.length(); var30 += 252722030 << -1401605041 + -1401605041 ^ -2147483647) {
            int var50 = var17.charAt(var30) ^ 222;
            int var81 = (var50 & 63488) >> 11;
            int var51 = ((var50 & 63488) >> 11 | var50 << 5) + 97 + 12 + 60 - 67;
            int var82 = (((var50 & 63488) >> 11 | var50 << 5) + 97 + 12 + 60 - 67 & 32768) >> 15;
            var50 = ((var81 | var50 << 5) + 97 + 12 + 60 - 67 & 32768) >> 15 | ((var50 & 63488) >> 11 | var50 << 5) + 97 + 12 + 60 - 67 << 1;
            var81 = ((var82 | var51 << 1) & 57344) >> 13;
            int var53 = (((var82 | var51 << 1) & 57344) >> 13 | var50 << 3) - 148;
            int var84 = ((((var82 | var51 << 1) & 57344) >> 13 | var50 << 3) - 148 & 49152) >> 14;
            char var54 = (char)(((var81 | var50 << 3) - 148 & 49152) >> 14 | (((var82 | var51 << 1) & 57344) >> 13 | var50 << 3) - 148 << 2);
            var17.setCharAt(var30, (char)(var84 | var53 << 2));
         }

         Class var6 = Class.forName(var17.toString(), false, Class_369.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = -1054063730 * -1154666244 ^ 238231496; var36 < var20.length(); var36 += (1741600273 >>> 1741600273 | 0) & 1060044825) {
            int var59 = var20.charAt(var36) ^ 169;
            char var62 = (char)(
               (
                     (
                              (
                                    ((((var59 & 65532) >> 2 | var59 << 14) - 44 + 212 & 64512) >> 10 | ((var59 & 65532) >> 2 | var59 << 14) - 44 + 212 << 6)
                                          + 67
                                          + 175
                                       ^ 218
                                 )
                                 & 65504
                           )
                           >> 5
                        | (
                              ((((var59 & 65532) >> 2 | var59 << 14) - 44 + 212 & 64512) >> 10 | ((var59 & 65532) >> 2 | var59 << 14) - 44 + 212 << 6)
                                    + 67
                                    + 175
                                 ^ 218
                           )
                           << 11
                  )
                  + 213
            );
            var20.setCharAt(
               var36,
               (char)(
                  (
                        (
                                 (
                                       ((((var59 & 65532) >> 2 | var59 << 14) - 44 + 212 & 64512) >> 10 | ((var59 & 65532) >> 2 | var59 << 14) - 44 + 212 << 6)
                                             + 67
                                             + 175
                                          ^ 218
                                    )
                                    & 65504
                              )
                              >> 5
                           | (
                                 ((((var59 & 65532) >> 2 | var59 << 14) - 44 + 212 & 64512) >> 10 | ((var59 & 65532) >> 2 | var59 << 14) - 44 + 212 << 6)
                                       + 67
                                       + 175
                                    ^ 218
                              )
                              << 11
                     )
                     + 213
               )
            );
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_369.class.getClassLoader()).returnType();
         switch (((var4 + 1669577997 - 1058819027 ^ 1804157342 ^ 841874774 ^ 1833578530) + 1789673489 + 1019045276 ^ 1023817336 ^ 381596593) + 557097647) {
            case 1011710171:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            case 1240879373:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            case 1454949659:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            case 2062115024:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_169[((var10 - 624608149 - 628736549 ^ 199883778 ^ 56598573) - 348120400 - 1844196110 - 1033926494 + 1443304315 ^ 672605691) - 239727907] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
