import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;
import java.util.ArrayList;
import java.util.Iterator;
import java.util.List;
import net.minecraft.class_11905;
import net.minecraft.class_11908;
import net.minecraft.class_11909;

public class Class_187 extends Class_281 {
   // $VF: renamed from: rvm Class_378
   public Class_378 field_2458;
   // $VF: renamed from: xwl java.util.List
   public List field_2459;
   // $VF: renamed from: st Class_369
   public Class_369 field_2460;
   // $VF: renamed from: rjg float
   public float field_2461;
   // $VF: renamed from: xzd int
   public int field_2462;
   // $VF: renamed from: bez int
   public int field_2463;
   // $VF: renamed from: mzl java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_2465 = new MethodHandle[350];

   public Class_187(Class_220 var1, Class_378 var2) {
      int var5 = -1452650556;
      this.field_2464 = var1;
      int var10001 = (-721694868 | 0) & 134230018;

      StringBuilder var10002;
      for (var10002 = (StringBuilder)0<"JNT",-659212643,"\uf72b좫퀫좫\udb2b\uf82b","⨷⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆⨸⧱","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148900>(
            "䳖\uecda\u0cda泜\uecd1賗\u0cda䳚Ⳝ쳛䳜"
         );
         var10001 < 11;
         var10001 += 1
      ) {
         int var9 = 0<"JNT",569743778,"춫줫첫혫벫\udb2b","⨷⧘⨸⧞","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148914>(var10002, var10001) + 242;
         char var12 = (char)(
            (((((var9 & 65504) >> 5 | var9 << 11) + 146 & 65534) >> 1 | ((var9 & 65504) >> 5 | var9 << 11) + 146 << 15) & 65408) >> 7
               | ((((var9 & 65504) >> 5 | var9 << 11) + 146 & 65534) >> 1 | ((var9 & 65504) >> 5 | var9 << 11) + 146 << 15) << 9
         );
         0<"JNT",569743778,"햫튫\udb2b붫줫첫혫벫\udb2b","⨷⧘⧞⨸⧱","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148913>(
            var10002,
            var10001,
            (char)(
               (((((var9 & 65504) >> 5 | var9 << 11) + 146 & 65534) >> 1 | ((var9 & 65504) >> 5 | var9 << 11) + 146 << 15) & 65408) >> 7
                  | ((((var9 & 65504) >> 5 | var9 << 11) + 146 & 65534) >> 1 | ((var9 & 65504) >> 5 | var9 << 11) + 146 << 15) << 9
            )
         );
      }

      super(0<"JNT",569743778,"\udb2b쾫얫\udb2b혫좫퀫펫","⨷⨸⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148816>(var10002));
      this.field_2460 = (Class_369)0<"JNT",-659212643,"\uf72b좫퀫좫\udb2b\uf82b","⨷⨸⧱","딾떎",-1517148815>();
      this.field_2461 = 0.0F;
      this.field_2462 = -1;
      this.field_2463 = -1;
      this.field_2458 = var2;
      this.field_2459 = (ArrayList)0<"JNT",-659212643,"\uf72b좫퀫좫\udb2b\uf82b","⨷⨸⧱","땪떆딺떆둚딶딲땦땒둚똆땊땊떆딦뗒땦땎딲",-1517148814>();
      Iterator var3 = 0<"JNT",-334177668,"좫\udb2b튫혫첫\udb2b쾫혫","⨷⨸⧛⧵⨀⨑⨀⨺⨔⨓⧸⧻⨺⧘⨓⨄⨍⨀⨓⧺⨍⩆","땪떆딺떆둚딶딲땦땒둚뗒땦땎딲",-1517148812>(
         0<"JNT",569743778,"팫\udaab","⨷⨸⧛⧵⨀⨑⨀⨺⨔⨓⧸⧻⨺⧛⧸⨎⨓⩆","딾땞",-1517148813>(var2)
      );

      while (true) {
         var5 = (-708758968 - 1017760212 | 113819277) & 1741225871;

         while (true) {
            switch ((var5 + 1677029146 + 418775496 ^ 1448704517) - 1377124512 - 44587348 ^ 386555163) {
               case -2146643958:
                  0<"JNT",569743778,"캫좫튫","⨷⧥⨸⧱","딾떎",-1517148915>(1<"JNT",624103572,"羿뾿","襝衍","\ue7ab\ue7b3\ue8cb\uea23\ue983\ue843",1855621427>(this), false);
                  return;
               case 1764042349:
            }

            if (0<"JNT",-334177668,"줫첫햫쀫튫턫\udb2b","⨷⨸⧥","땪떆딺떆둚딶딲땦땒둚뗦딲땶땊떆딲땞땊",-1517148811>(var3)) {
               Class_352 var4 = (Class_352)0<"JNT",-334177668,"퀫튫턫\udb2b","⨷⨸⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧚⧽⧵⨄⧾⨓⩆","땪떆딺떆둚딶딲땦땒둚뗦딲땶땊떆딲땞땊",-1517148810>(var3);
               0<"JNT",-334177668,"첫팫팫","⨷⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧚⧽⧵⨄⧾⨓⩆⨸⧥","땪떆딺떆둚딶딲땦땒둚뗒땦땎딲",-1517148805>(
                  1<"JNT",624103572,"뾾羾뿁","襝衍","\ue7ab\ue7b3\ue8cb\ue9bb\ue973\uea1b\ue973\ue7e3\uea13\uea0b\ue9b3\ue9cb\ue7e3\ue8cb\ue9b3\uea03\uea0b\ue843",1855621468>(
                     this
                  ),
                  (Class_12)0<"JNT",-659212643,"\uf72b좫퀫좫\udb2b\uf82b","⨷⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆⧘⨸⧱","떆땊",-1517148806>(
                     1<"JNT",624103572,"翁ﾕ","蟽袍","\ue7ab\ue7b3\ue8cb\ue9bb\ue973\uea1b\ue973\ue7e3\ue9cb\ue973\ue9db\ue9a3\ue7e3\ue903\uea0b\ue9fb\ue9b3\ue9db\ue9a3\ue843",1855621479>(
                        var4
                     ),
                     1<"JNT",624103572,"\uffc1뿀㿀","蟽袍","\ue7ab\ue7b3\ue8b3",1855621478>(var4)
                  )
               );
               break;
            }

            var5 = (1230818693 & 129159721 | 1084353566) & 1526594622;
         }
      }
   }

   // $VF: renamed from: yfv () int
   @Override
   public int method_2008() {
      return 40;
   }

   // $VF: renamed from: rvj () int
   @Override
   public int method_2006() {
      return 550;
   }

   // $VF: renamed from: hc () int
   @Override
   public int method_2007() {
      return 500;
   }

   // $VF: renamed from: pn (RenderEngine_216, int, int, int, int, int, int, float) void
   // $VF: Irreducible bytecode was duplicated to produce valid code
   @Override
   public void method_2010(RenderEngine_216 var1, int var2, int var3, int var4, int var5, int var6, int var7, float var8) {
      int var46 = -1490957189;
      int var9 = 0<"JNT",569743778,"혫\udc2b쨫","⨷⨸⧘","땒땆",-1517148899>(this);
      int var10 = 0<"JNT",569743778,"줫춫","⨷⨸⧘","땒땆",-1517148898>(this);
      int var11 = 1<"JNT",624103572,"㿃뿁뾓","襝衍","\ue7ab\ue7b3\ue8b3",1855621460>(this);
      int var12 = 1<"JNT",624103572,"뿂ￂ\uffc0뾓","襝衍","\ue7ab\ue7b3\ue8b3",1855621471>(this);
      int var13 = var3 + 7;
      Class_262 var14 = (Class_262)0<"JNT",-659212643,"\uf72b좫퀫좫\udb2b\uf82b","⨷⧘⧘⧘⨸⧱","땂딾",-1517148927>(160, 160, 165);
      RenderEngine_216 var10000 = var1;
      int var10001 = 749525079 ^ -1071087554 >> 749525079 ^ -749525033;
      StringBuilder var10002 = (StringBuilder)0<"JNT",-659212643,"\uf72b좫퀫좫\udb2b\uf82b","⨷⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆⨸⧱","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148926>(
         "\ue068恮䁯䁯\u206e聮恮"
      );

      label214:
      while (true) {
         var46 = -1309843232 << -164033886 ^ -1839074188;

         while (true) {
            label209: {
               StringBuilder var64;
               switch ((var46 ^ 1853807891) + 1476603209 ^ 1896701439 ^ 1225463243 ^ 537155927 ^ 872832865) {
                  case -1492511890:
                     var64 = var10002;
                     if (var10001 < ((-295007234 >> 621172739 | 4) & 1222151)) {
                        int var146 = (0<"JNT",569743778,"춫줫첫혫벫\udb2b","⨷⧘⨸⧞","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148675>(var10002, var10001) ^ 220) + 16;
                        char var147 = (char)((((var146 & 61440) >> 12 | var146 << 4) ^ 6) + 9);
                        0<"JNT",569743778,"햫튫\udb2b붫줫첫혫벫\udb2b","⨷⧘⧞⨸⧱","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148674>(
                           var10002, var10001, (char)((((var146 & 61440) >> 12 | var146 << 4) ^ 6) + 9)
                        );
                        var10001 += (1128369722 * 1128369722 | 1) & 33790537;
                        break label209;
                     }

                     var46 = 795611676 << -1423736392 ^ 381271394;
                     break;
                  case -1079405006:
                  default:
                     var64 = var10002;
                     if (var10001 < ((1201329301 - (1435041727 >> -2091000774) | 7) & -1474025377)) {
                        int var105 = 0<"JNT",569743778,"춫줫첫혫벫\udb2b","⨷⧘⨸⧞","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148720>(var10002, var10001) ^ 20 ^ 118;
                        char var106 = (char)(((var105 & 61440) >> 12 | var105 << 4) - 29 - 68);
                        0<"JNT",569743778,"햫튫\udb2b붫줫첫혫벫\udb2b","⨷⧘⧞⨸⧱","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148719>(
                           var10002, var10001, (char)(((var105 & 61440) >> 12 | var105 << 4) - 29 - 68)
                        );
                        var10001 += (-1324531871 | -1324531871 | 0) & 81952779;
                        continue label214;
                     }

                     var46 = -1205766148 - 1168076572 ^ -357108112;
               }

               switch (((var46 + 1431562881 ^ 1158082784) + 944443675 + 174324419 ^ 1004481981) + 1648307967) {
                  case -1096516005:
                  default:
                     0<"JNT",569743778,"펫줫","⨷⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆⧣⧣⧛⨏⨒⩆⨸⧣","땖딺",-1517148907>(
                        var10000,
                        0<"JNT",569743778,"\udb2b쾫얫\udb2b혫좫퀫펫","⨷⨸⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148908>(var64),
                        (double)(var11 + var9 - 160),
                        (double)var13,
                        var14
                     );
                     int var15 = var12 + 75;
                     byte var16 = 35;
                     int var17 = var12 + var10 - 50;
                     Class_262 var18 = (Class_262)0<"JNT",-659212643,"\uf72b좫퀫좫\udb2b\uf82b","⨷⧘⧘⧘⨸⧱","땂딾",-1517148906>(245, 245, 245);
                     Class_262 var19 = (Class_262)0<"JNT",-659212643,"\uf72b좫퀫좫\udb2b\uf82b","⨷⧘⧘⧘⨸⧱","땂딾",-1517148905>(255, 255, 255);
                     int var20 = 0;

                     label199:
                     while (true) {
                        var46 = -1531366905 >> -1462673292 ^ 629049609;

                        while (true) {
                           switch (((var46 ^ 1407248974) + 2065617440 ^ 1772520441) - 1862340095 + 1498217501 - 1432529944) {
                              case 34613979:
                                 if (var20
                                    < 0<"JNT",-334177668,"햫좫툫튫","⨷⨸⧘","땪떆딺떆둚딶딲땦땒둚뗒땦땎딲",-1517148705>(
                                       1<"JNT",624103572,"뾾羾뿁","襝衍","\ue7ab\ue7b3\ue8cb\ue9bb\ue973\uea1b\ue973\ue7e3\uea13\uea0b\ue9b3\ue9cb\ue7e3\ue8cb\ue9b3\uea03\uea0b\ue843",1855621525>(
                                          this
                                       )
                                    )) {
                                    int var48 = var15 + var20 * var16 - (int)1<"JNT",624103572,"㿁㿃翂","襝衍","\ue7ab\ue7b3\ue89b",1855621535>(this);
                                    if (var48 + var16 >= var12 + 60) {
                                       if (var48 > var17) {
                                          var46 = (490559331 | 711994496) ^ -2061589418;
                                       } else {
                                          var46 = (-281835730 + (-1656000827 & -1108173381) | 1082917376) & -761497890;
                                       }
                                    } else {
                                       var46 = (490559331 | 711994496) ^ -2061589418;
                                    }

                                    while (true) {
                                       Class_12 var22;
                                       boolean var49;
                                       boolean var50;
                                       switch ((var46 + 387726001 - 657362499 ^ 1318709991) + 510313754 - 1632536622 - 304152437) {
                                          case -1883004869:
                                          default:
                                             var20++;
                                             continue label199;
                                          case -1458859630:
                                             var22 = (Class_12)0<"JNT",-334177668,"펫튫\udb2b","⨷⧘⨸⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧚⧽⧵⨄⧾⨓⩆","땪떆딺떆둚딶딲땦땒둚뗒땦땎딲",-1517148918>(
                                                1<"JNT",624103572,"뾾羾뿁","襝衍","\ue7ab\ue7b3\ue8cb\ue9bb\ue973\uea1b\ue973\ue7e3\uea13\uea0b\ue9b3\ue9cb\ue7e3\ue8cb\ue9b3\uea03\uea0b\ue843",1855621462>(
                                                   this
                                                ),
                                                var20
                                             );
                                             var49 = var20 == 1<"JNT",624103572,"뾾㾿뾓","襝衍","\ue7ab\ue7b3\ue8b3",1855621464>(this);
                                             var50 = 0<"JNT",569743778,"켫햫쾫","⨷⨸⧥","딾떎",-1517148709>(
                                                   1<"JNT",624103572,"羿뾿","襝衍","\ue7ab\ue7b3\ue8cb\uea23\ue983\ue843",1855621513>(this)
                                                )
                                                ? var49
                                                : false;
                                       }

                                       Class_262 var25 = var49
                                          ? 0<"JNT",-536709671,"혫\udaab쾫","⨷⧘⧘⨸⧛⨏⨒⩆","떊떎",-1517148893>(50, 1)
                                          : (Class_262)0<"JNT",-659212643,"\uf72b좫퀫좫\udb2b\uf82b","⨷⧘⧘⧘⧘⨸⧱","땂딾",-1517148718>(25, 25, 30, 255);
                                       0<"JNT",569743778,"퀫춫팫","⨷⧛⨏⨒⩆⧣⧣⧣⧣⧣⧣⧣⧣⨸⧱","땖딺",-1517148881>(
                                          var1,
                                          var25,
                                          (double)(var11 + 15),
                                          (double)var48,
                                          (double)(var11 + var9 - 15),
                                          (double)(var48 + var16 - 5),
                                          4.0,
                                          4.0,
                                          4.0,
                                          4.0
                                       );
                                       int var51 = var11 + 20;
                                       int var52 = var9 - 195;
                                       int var28 = var48 + 3;
                                       int var29 = var16 - 11;
                                       0<"JNT",569743778,"퀫춫팫","⨷⧛⨏⨒⩆⧣⧣⧣⧣⧣⧣⧣⧣⨸⧱","땖딺",-1517148911>(
                                          var1,
                                          (Class_262)0<"JNT",-659212643,"\uf72b좫퀫좫\udb2b\uf82b","⨷⧘⧘⧘⧘⨸⧱","땂딾",-1517148912>(20, 20, 25, 255),
                                          (double)var51,
                                          (double)var28,
                                          (double)(var51 + var52),
                                          (double)(var28 + var29),
                                          3.0,
                                          3.0,
                                          3.0,
                                          3.0
                                       );
                                       if (var50) {
                                          0<"JNT",569743778,"좫\udbab즫","⨷⧛⧼⨑⩆⧣⧣⨸⧱","딾떎",-1517148909>(
                                             1<"JNT",624103572,"羿뾿","襝衍","\ue7ab\ue7b3\ue8cb\uea23\ue983\ue843",1855621393>(this),
                                             var1,
                                             (double)(var51 + 5),
                                             (double)(var28 + 5)
                                          );
                                       } else {
                                          String var30 = 1<"JNT",624103572,"翁ﾕ","襍螽","\ue7ab\ue7b3\ue8cb\ue9bb\ue973\uea1b\ue973\ue7e3\ue9cb\ue973\ue9db\ue9a3\ue7e3\ue903\uea0b\ue9fb\ue9b3\ue9db\ue9a3\ue843",1855621501>(
                                             var22
                                          );
                                          int var31 = var52 - 10;
                                          if (0<"JNT",569743778,"킫\udaab쨫","⨷⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆⨸⧣","땖딺",-1517148713>(var1, var30) > (double)var31) {
                                             var46 = -76057331 + -1596134135 ^ 2139428940;
                                          } else {
                                             var46 = 321586983 - -1555276820 ^ 1991904724;
                                          }

                                          label181:
                                          while (true) {
                                             switch (((var46 ^ 163431066) + 1086031389 ^ 2073896649) + 1690599682 - 841477741 ^ 536212693) {
                                                case -1666949508:
                                                default:
                                                   StringBuilder var77 = 0<"JNT",569743778,"첫픫픫튫퀫팫","⨷⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧚⧽⧵⨄⧾⨓⩆⨸⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⧝⨔⧸⧻⨃⨄⨍⩆","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148866>(
                                                      (StringBuilder)0<"JNT",-659212643,"\uf72b좫퀫좫\udb2b\uf82b","⨷⨸⧱","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148867>(),
                                                      var30
                                                   );
                                                   int var96 = -773310852 * (-773310852 >> 1266265018) ^ 689795632;

                                                   StringBuilder var138;
                                                   for (var138 = (StringBuilder)0<"JNT",-659212643,"\uf72b좫퀫좫\udb2b\uf82b","⨷⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆⨸⧱","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148865>(
                                                         "ꃂꃂꃂ"
                                                      );
                                                      var96 < (768847303 ^ 288380198 ^ 1021573346);
                                                      var96 += 331531212 ^ 331531212 ^ 1
                                                   ) {
                                                      char var161 = 0<"JNT",569743778,"춫줫첫혫벫\udb2b","⨷⧘⨸⧞","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148878>(var138, var96);
                                                      int var10006 = (var161 & '\uffc0') >> 6;
                                                      int var162 = (((var161 & '\uffc0') >> 6 | var161 << '\n') ^ 113) - 74 + 216;
                                                      int var184 = ((((var161 & '\uffc0') >> 6 | var161 << '\n') ^ 113) - 74 + 216 & 65472) >> 6;
                                                      var161 = (char)(
                                                         (((var10006 | var161 << '\n') ^ 113) - 74 + 216 & 65472) >> 6
                                                            | (((var161 & '\uffc0') >> 6 | var161 << '\n') ^ 113) - 74 + 216 << 10
                                                      );
                                                      0<"JNT",569743778,"햫튫\udb2b붫줫첫혫벫\udb2b","⨷⧘⧞⨸⧱","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148877>(
                                                         var138, var96, (char)(var184 | var162 << 10)
                                                      );
                                                   }

                                                   if (0<"JNT",569743778,"킫\udaab쨫","⨷⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆⨸⧣","땖딺",-1517148732>(
                                                            var1,
                                                            0<"JNT",569743778,"\udb2b쾫얫\udb2b혫좫퀫펫","⨷⨸⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148733>(
                                                               0<"JNT",569743778,"첫픫픫튫퀫팫","⨷⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆⨸⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⧝⨔⧸⧻⨃⨄⨍⩆","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148734>(
                                                                  var77,
                                                                  0<"JNT",569743778,"\udb2b쾫얫\udb2b혫좫퀫펫","⨷⨸⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148735>(
                                                                     var138
                                                                  )
                                                               )
                                                            )
                                                         )
                                                         > (double)var31
                                                      && 0<"JNT",569743778,"켫튫퀫펫\udb2b줫","⨷⨸⧘","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾",-1517148731>(var30) > 1) {
                                                      var30 = 0<"JNT",569743778,"햫\udaab츫햫\udb2b혫좫퀫펫","⨷⧘⧘⨸⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾",-1517148729>(
                                                         var30, 0, 0<"JNT",569743778,"켫튫퀫펫\udb2b줫","⨷⨸⧘","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾",-1517148730>(var30) - 1
                                                      );
                                                      var46 = -76057331 + -1596134135 ^ 2139428940;
                                                      break;
                                                   }

                                                   StringBuilder var60 = 0<"JNT",569743778,"첫픫픫튫퀫팫","⨷⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧚⧽⧵⨄⧾⨓⩆⨸⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⧝⨔⧸⧻⨃⨄⨍⩆","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148891>(
                                                      (StringBuilder)0<"JNT",-659212643,"\uf72b좫퀫좫\udb2b\uf82b","⨷⨸⧱","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148892>(),
                                                      var30
                                                   );
                                                   var10001 = -32771166 * 445765861 ^ -922509334;

                                                   for (var10002 = (StringBuilder)0<"JNT",-659212643,"\uf72b좫퀫좫\udb2b\uf82b","⨷⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆⨸⧱","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148890>(
                                                         "էէէ"
                                                      );
                                                      var10001 < ((2034911754 | 2034911754) ^ 2034911753);
                                                      var10001 += -934848286 ^ -843269503 ^ 100393570
                                                   ) {
                                                      int var141 = (
                                                            (
                                                                     0<"JNT",569743778,"춫줫첫혫벫\udb2b","⨷⧘⨸⧞","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148876>(
                                                                           var10002, var10001
                                                                        )
                                                                        ^ 'H'
                                                                  )
                                                                  + 113
                                                               ^ 83
                                                         )
                                                         - 51;
                                                      char var142 = (char)((var141 & 65504) >> 5 | var141 << 11);
                                                      0<"JNT",569743778,"햫튫\udb2b붫줫첫혫벫\udb2b","⨷⧘⧞⨸⧱","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148875>(
                                                         var10002, var10001, (char)((var141 & 65504) >> 5 | var141 << 11)
                                                      );
                                                   }

                                                   var30 = 0<"JNT",569743778,"\udb2b쾫얫\udb2b혫좫퀫펫","⨷⨸⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148882>(
                                                      0<"JNT",569743778,"첫픫픫튫퀫팫","⨷⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆⨸⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⧝⨔⧸⧻⨃⨄⨍⩆","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148883>(
                                                         var60,
                                                         0<"JNT",569743778,"\udb2b쾫얫\udb2b혫좫퀫펫","⨷⨸⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148884>(
                                                            var10002
                                                         )
                                                      )
                                                   );
                                                   var46 = 321586983 - -1555276820 ^ 1991904724;
                                                   break;
                                                case 1129556517:
                                                   0<"JNT",569743778,"펫줫","⨷⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆⧣⧣⧛⨏⨒⩆⨸⧣","땖딺",-1517148723>(
                                                      var1, var30, (double)(var51 + 5), (double)(var28 + 5), var18
                                                   );
                                                   break label181;
                                             }
                                          }
                                       }

                                       int var53 = var11 + var9 - 165;
                                       byte var54 = 110;
                                       int var32 = var48 + 3;
                                       int var33 = var16 - 11;
                                       boolean var34 = 1<"JNT",624103572,"㾕ﾕ㾿","襝衍","\ue7ab\ue7b3\ue8b3",1855621466>(this) == var20;
                                       Class_262 var35 = var34
                                          ? 0<"JNT",-536709671,"혫\udaab쾫","⨷⧘⧘⨸⧛⨏⨒⩆","떊떎",-1517148922>(120, 1)
                                          : (Class_262)0<"JNT",-659212643,"\uf72b좫퀫좫\udb2b\uf82b","⨷⧘⧘⧘⧘⨸⧱","땂딾",-1517148869>(50, 50, 55, 255);
                                       0<"JNT",569743778,"퀫춫팫","⨷⧛⨏⨒⩆⧣⧣⧣⧣⧣⧣⧣⧣⨸⧱","땖딺",-1517148722>(
                                          var1, var35, (double)var53, (double)var32, (double)(var53 + var54), (double)(var32 + var33), 3.0, 3.0, 3.0, 3.0
                                       );
                                       String var63;
                                       if (!var34) {
                                          var63 = 0<"JNT",-536709671,"툫츫펫","⨷⧘⨸⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆","땒떊",-1517148924>(
                                             1<"JNT",624103572,"\uffc1뿀㿀","襍螽","\ue7ab\ue7b3\ue8b3",1855621472>(var22)
                                          );
                                       } else {
                                          int var61 = 442751729 - 1561722473 ^ -1118970744;

                                          for (var80 = (StringBuilder)0<"JNT",-659212643,"\uf72b좫퀫좫\udb2b\uf82b","⨷⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆⨸⧱","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148721>(
                                                "⒓⒓⒓"
                                             );
                                             var61 < (-237703 ^ -237702);
                                             var61 += (1975865234 & 1975865234 * 1975865234 | 1) & -1767731081
                                          ) {
                                             int var101 = 0<"JNT",569743778,"춫줫첫혫벫\udb2b","⨷⧘⨸⧞","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148921>(var80, var61) - 147;
                                             int var166 = (var101 & 65472) >> 6;
                                             int var102 = ((var101 & 65472) >> 6 | var101 << 10) - 21;
                                             int var167 = (((var101 & 65472) >> 6 | var101 << 10) - 21 & 32768) >> 15;
                                             char var103 = (char)(
                                                (((var166 | var101 << 10) - 21 & 32768) >> 15 | ((var101 & 65472) >> 6 | var101 << 10) - 21 << 1) - 200
                                             );
                                             0<"JNT",569743778,"햫튫\udb2b붫줫첫혫벫\udb2b","⨷⧘⧞⨸⧱","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148920>(
                                                var80, var61, (char)((var167 | var102 << 1) - 200)
                                             );
                                          }

                                          var63 = 0<"JNT",569743778,"\udb2b쾫얫\udb2b혫좫퀫펫","⨷⨸⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148676>(var80);
                                       }

                                       String var36 = var63;
                                       double var37 = 0<"JNT",569743778,"킫\udaab쨫","⨷⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆⨸⧣","땖딺",-1517148726>(var1, var36);
                                       0<"JNT",569743778,"펫줫","⨷⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆⧣⧣⧛⨏⨒⩆⨸⧣","땖딺",-1517148725>(
                                          var1, var36, (double)var53 + ((double)var54 - var37) / 2.0, (double)(var32 + 5), var18
                                       );
                                       int var39 = var11 + var9 - 45;
                                       int var40 = var48 + 3;
                                       int var41 = var16 - 11;
                                       0<"JNT",569743778,"퀫춫팫","⨷⧛⨏⨒⩆⧣⧣⧣⧣⧣⧣⧣⧣⨸⧱","땖딺",-1517148691>(
                                          var1,
                                          (Class_262)0<"JNT",-659212643,"\uf72b좫퀫좫\udb2b\uf82b","⨷⧘⧘⧘⧘⨸⧱","땂딾",-1517148692>(180, 50, 50, 255),
                                          (double)var39,
                                          (double)var40,
                                          (double)(var39 + var41),
                                          (double)(var40 + var41),
                                          3.0,
                                          3.0,
                                          3.0,
                                          3.0
                                       );
                                       double var42 = 0<"JNT",569743778,"킫\udaab쨫","⨷⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆⨸⧣","땖딺",-1517148690>(var1, "X");
                                       0<"JNT",569743778,"펫줫","⨷⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆⧣⧣⧛⨏⨒⩆⨸⧣","땖딺",-1517148689>(
                                          var1, "X", (double)(var39 + var41 / 2) - var42 / 2.0, (double)(var40 + 5), var19
                                       );
                                       var46 = (490559331 | 711994496) ^ -2061589418;
                                    }
                                 }

                                 var46 = (-626986342 | 1759941005 * -626986342 | 1639973889) & 2077468289;
                                 break;
                              case 1607524124:
                              default:
                                 var20 = var12 + var10 - 40;
                                 0<"JNT",569743778,"퀫춫팫","⨷⧛⨏⨒⩆⧣⧣⧣⧣⧣⧣⧣⧣⨸⧱","땖딺",-1517148888>(
                                    var1,
                                    0<"JNT",-536709671,"혫\udaab쾫","⨷⧘⧘⨸⧛⨏⨒⩆","떊떎",-1517148889>(255, 1),
                                    (double)(var11 + 20),
                                    (double)var20,
                                    (double)(var11 + 140),
                                    (double)(var20 + 28),
                                    5.0,
                                    5.0,
                                    5.0,
                                    5.0
                                 );
                                 var10001 = -581821972 + -881800534 ^ -1463622506;

                                 for (var10002 = (StringBuilder)0<"JNT",-659212643,"\uf72b좫퀫좫\udb2b\uf82b","⨷⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆⨸⧱","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148887>(
                                       "⣯滯滯\ue6ee䃯棯泯諯蓯"
                                    );
                                    var10001 < ((1851733612 ^ -1407899176 | 9) & 151117897);
                                    var10001 += (243839185 >>> -826350278 | 0) & -1350196271
                                 ) {
                                    int var110 = 0<"JNT",569743778,"춫줫첫혫벫\udb2b","⨷⧘⨸⧞","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148880>(var10002, var10001) ^ '4' ^ 218;
                                    int var169 = (var110 & 32768) >> 15;
                                    int var111 = (var110 & 32768) >> 15 | var110 << 1;
                                    int var170 = (((var110 & 32768) >> 15 | var110 << 1) & 64512) >> 10;
                                    char var112 = (char)((((var169 | var110 << 1) & 64512) >> 10 | ((var110 & 32768) >> 15 | var110 << 1) << 6) - 83);
                                    0<"JNT",569743778,"햫튫\udb2b붫줫첫혫벫\udb2b","⨷⧘⧞⨸⧱","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148879>(
                                       var10002, var10001, (char)((var170 | var111 << 6) - 83)
                                    );
                                 }

                                 double var21 = 0<"JNT",569743778,"킫\udaab쨫","⨷⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆⨸⧣","땖딺",-1517148885>(
                                    var1, 0<"JNT",569743778,"\udb2b쾫얫\udb2b혫좫퀫펫","⨷⨸⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148886>(var10002)
                                 );
                                 var10001 = (-479355853 >>> -1271829208 | 0) & -100106142;

                                 for (var10002 = (StringBuilder)0<"JNT",-659212643,"\uf72b좫퀫좫\udb2b\uf82b","⨷⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆⨸⧱","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148724>(
                                       "ဈ䀆䀆\n퀈ဆ〆 \uf006"
                                    );
                                    var10001 < (426996973 >> 23216355 ^ 53374612);
                                    var10001 += -622233665 * 2146646514 ^ 1470740879
                                 ) {
                                    int var115 = 0<"JNT",569743778,"춫줫첫혫벫\udb2b","⨷⧘⨸⧞","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148901>(var10002, var10001)
                                          + 213
                                          + 83
                                          - 246
                                       ^ 62;
                                    char var116 = (char)((var115 & 61440) >> 12 | var115 << 4);
                                    0<"JNT",569743778,"햫튫\udb2b붫줫첫혫벫\udb2b","⨷⧘⧞⨸⧱","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148868>(
                                       var10002, var10001, (char)((var115 & 61440) >> 12 | var115 << 4)
                                    );
                                 }

                                 0<"JNT",569743778,"펫줫","⨷⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆⧣⧣⧛⨏⨒⩆⨸⧣","땖딺",-1517148702>(
                                    var1,
                                    0<"JNT",569743778,"\udb2b쾫얫\udb2b혫좫퀫펫","⨷⨸⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148703>(var10002),
                                    (double)(var11 + 80) - var21 / 2.0,
                                    (double)(var20 + 7),
                                    var18
                                 );
                                 int var23 = var11 + var9 - 100;
                                 0<"JNT",569743778,"퀫춫팫","⨷⧛⨏⨒⩆⧣⧣⧣⧣⧣⧣⧣⧣⨸⧱","땖딺",-1517148700>(
                                    var1,
                                    0<"JNT",-536709671,"혫\udaab쾫","⨷⧘⧘⨸⧛⨏⨒⩆","떊떎",-1517148701>(255, 1),
                                    (double)var23,
                                    (double)var20,
                                    (double)(var23 + 80),
                                    (double)(var20 + 28),
                                    5.0,
                                    5.0,
                                    5.0,
                                    5.0
                                 );
                                 var10001 = (-1069726964 << -1578553719 | 0) & -2060877541;

                                 for (var10002 = (StringBuilder)0<"JNT",-659212643,"\uf72b좫퀫좫\udb2b\uf82b","⨷⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆⨸⧱","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148699>(
                                       "Іܦٖݦ"
                                    );
                                    var10001 < (-13122209 & 775876976 ^ 775340372);
                                    var10001 += (-665826085 * -1797983271 * -1797983271 | 0) & 1644167249
                                 ) {
                                    char var119 = 0<"JNT",569743778,"춫줫첫혫벫\udb2b","⨷⧘⨸⧞","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148708>(var10002, var10001);
                                    int var172 = (var119 & '\ufffe') >> 1;
                                    int var120 = (((var119 & '\ufffe') >> 1 | var119 << 15) ^ 217) + 56 - 122;
                                    int var173 = ((((var119 & '\ufffe') >> 1 | var119 << 15) ^ 217) + 56 - 122 & 65528) >> 3;
                                    var119 = (char)(
                                       (((var172 | var119 << 15) ^ 217) + 56 - 122 & 65528) >> 3
                                          | (((var119 & '\ufffe') >> 1 | var119 << 15) ^ 217) + 56 - 122 << 13
                                    );
                                    0<"JNT",569743778,"햫튫\udb2b붫줫첫혫벫\udb2b","⨷⧘⧞⨸⧱","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148707>(
                                       var10002, var10001, (char)(var173 | var120 << 13)
                                    );
                                 }

                                 double var24 = 0<"JNT",569743778,"킫\udaab쨫","⨷⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆⨸⧣","땖딺",-1517148716>(
                                    var1, 0<"JNT",569743778,"\udb2b쾫얫\udb2b혫좫퀫펫","⨷⨸⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148717>(var10002)
                                 );
                                 var10001 = 632308664 << 438667197 ^ 0;

                                 for (var10002 = (StringBuilder)0<"JNT",-659212643,"\uf72b좫퀫좫\udb2b\uf82b","⨷⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆⨸⧱","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148715>(
                                       "\ud813ࠑ쀐树"
                                    );
                                    var10001 < (36274111 + 1704916888 ^ 1741190995);
                                    var10001 += (-1049348171 | -1101942769) ^ -9062466
                                 ) {
                                    char var124 = 0<"JNT",569743778,"춫줫첫혫벫\udb2b","⨷⧘⨸⧞","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148698>(var10002, var10001);
                                    char var125 = (char)((((var124 & '\uf800') >> 11 | var124 << 5) - 143 ^ 213) - 67 - 163);
                                    0<"JNT",569743778,"햫튫\udb2b붫줫첫혫벫\udb2b","⨷⧘⧞⨸⧱","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148697>(
                                       var10002, var10001, (char)((((var124 & '\uf800') >> 11 | var124 << 5) - 143 ^ 213) - 67 - 163)
                                    );
                                 }

                                 0<"JNT",569743778,"펫줫","⨷⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆⧣⧣⧛⨏⨒⩆⨸⧣","땖딺",-1517148873>(
                                    var1,
                                    0<"JNT",569743778,"\udb2b쾫얫\udb2b혫좫퀫펫","⨷⨸⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148874>(var10002),
                                    (double)(var23 + 40) - var24 / 2.0,
                                    (double)(var20 + 7),
                                    var18
                                 );
                                 int var26 = var23 - 90;
                                 0<"JNT",569743778,"퀫춫팫","⨷⧛⨏⨒⩆⧣⧣⧣⧣⧣⧣⧣⧣⨸⧱","땖딺",-1517148871>(
                                    var1,
                                    (Class_262)0<"JNT",-659212643,"\uf72b좫퀫좫\udb2b\uf82b","⨷⧘⧘⧘⧘⨸⧱","땂딾",-1517148872>(60, 60, 65, 255),
                                    (double)var26,
                                    (double)var20,
                                    (double)(var26 + 80),
                                    (double)(var20 + 28),
                                    5.0,
                                    5.0,
                                    5.0,
                                    5.0
                                 );
                                 var10001 = (-1933226901 << 1538712357 | 0) & 1628463234;

                                 for (var10002 = (StringBuilder)0<"JNT",-659212643,"\uf72b좫퀫좫\udb2b\uf82b","⨷⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆⨸⧱","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148870>(
                                       "횉횧횴횩횫횲"
                                    );
                                    var10001 < (-1493165572 << -1493165572 ^ -1073741818);
                                    var10001 += (150671699 * 1121008125 | 1) & 25761
                                 ) {
                                    char var128 = 0<"JNT",569743778,"춫줫첫혫벫\udb2b","⨷⧘⨸⧞","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148712>(var10002, var10001);
                                    int var175 = (var128 & '︀') >> 9;
                                    int var129 = ((var128 & '︀') >> 9 | var128 << 7) + 125 + 152;
                                    int var176 = (((var128 & '︀') >> 9 | var128 << 7) + 125 + 152 & 65408) >> 7;
                                    var128 = (char)(
                                       (((var175 | var128 << 7) + 125 + 152 & 65408) >> 7 | ((var128 & '︀') >> 9 | var128 << 7) + 125 + 152 << 9) - 73
                                    );
                                    0<"JNT",569743778,"햫튫\udb2b붫줫첫혫벫\udb2b","⨷⧘⧞⨸⧱","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148711>(
                                       var10002, var10001, (char)((var176 | var129 << 9) - 73)
                                    );
                                 }

                                 double var27 = 0<"JNT",569743778,"킫\udaab쨫","⨷⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆⨸⧣","땖딺",-1517148895>(
                                    var1, 0<"JNT",569743778,"\udb2b쾫얫\udb2b혫좫퀫펫","⨷⨸⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148896>(var10002)
                                 );
                                 var10001 = -47764649 << 1343373296 ^ 727121920;

                                 for (var10002 = (StringBuilder)0<"JNT",-659212643,"\uf72b좫퀫좫\udb2b\uf82b","⨷⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆⨸⧱","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148894>(
                                       "疡鎡ꂡ閡鞡麡"
                                    );
                                    var10001 < ((2041903640 & -1183308925 << 2062728862 | 6) & 498274822);
                                    var10001 += 1083998879 + 1083998879 ^ -2126969537
                                 ) {
                                    int var133 = 0<"JNT",569743778,"춫줫첫혫벫\udb2b","⨷⧘⨸⧞","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148673>(var10002, var10001) ^ 161;
                                    char var136 = (char)(
                                       (
                                             (((((var133 & 65504) >> 5 | var133 << 11) & 65472) >> 6 | ((var133 & 65504) >> 5 | var133 << 11) << 10) & 57344)
                                                   >> 13
                                                | ((((var133 & 65504) >> 5 | var133 << 11) & 65472) >> 6 | ((var133 & 65504) >> 5 | var133 << 11) << 10) << 3
                                          )
                                          - 50
                                    );
                                    0<"JNT",569743778,"햫튫\udb2b붫줫첫혫벫\udb2b","⨷⧘⧞⨸⧱","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148704>(
                                       var10002,
                                       var10001,
                                       (char)(
                                          (
                                                (((((var133 & 65504) >> 5 | var133 << 11) & 65472) >> 6 | ((var133 & 65504) >> 5 | var133 << 11) << 10) & 57344)
                                                      >> 13
                                                   | ((((var133 & 65504) >> 5 | var133 << 11) & 65472) >> 6 | ((var133 & 65504) >> 5 | var133 << 11) << 10)
                                                      << 3
                                             )
                                             - 50
                                       )
                                    );
                                 }

                                 0<"JNT",569743778,"펫줫","⨷⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆⧣⧣⧛⨏⨒⩆⨸⧣","땖딺",-1517148727>(
                                    var1,
                                    0<"JNT",569743778,"\udb2b쾫얫\udb2b혫좫퀫펫","⨷⨸⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148728>(var10002),
                                    (double)(var26 + 40) - var27 / 2.0,
                                    (double)(var20 + 7),
                                    var18
                                 );
                                 return;
                           }
                        }
                     }
                  case 857814897:
                     0<"JNT",569743778,"펫줫","⨷⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆⧣⧣⧛⨏⨒⩆⨸⧣","땖딺",-1517148903>(
                        var10000,
                        0<"JNT",569743778,"\udb2b쾫얫\udb2b혫좫퀫펫","⨷⨸⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148904>(var64),
                        (double)(var11 + 25),
                        (double)var13,
                        var14
                     );
                     var10000 = var1;
                     var10001 = (2035834026 * -384986356 | 0) & 604241927;
                     var10002 = (StringBuilder)0<"JNT",-659212643,"\uf72b좫퀫좫\udb2b\uf82b","⨷⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆⨸⧱","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148902>(
                        "㼨鼩弫\uef29弪⼪켩"
                     );
               }
            }

            var46 = 1568009520;
         }
      }
   }

   // $VF: Irreducible bytecode was duplicated to produce valid code
   public boolean method_25402(class_11909 var1, boolean var2) {
      int var25 = -2139172389;
      int var3 = 0<"JNT",569743778,"혫픫턫","⨷⧣⨸⧘","땒땆",-1517143385>(
         this, 0<"JNT",569743778,"춫쾫캫픫잫שׂﮫ\uf0ab\uf12b","⨷⨸⧣","땚땶딲둚땖땦땚땶떎땊떆땺딲둚떎땒떆땎땎떞둆둆됦둂됦",-1517143386>(var1)
      );
      int var4 = 0<"JNT",569743778,"혫픫턫","⨷⧣⨸⧘","땒땆",-1517143383>(
         this, 0<"JNT",569743778,"춫쾫캫픫잫שׂﮫ\uf0ab\uf0ab","⨷⨸⧣","땚땶딲둚땖땦땚땶떎땊떆땺딲둚떎땒떆땎땎떞둆둆됦둂됦",-1517143384>(var1)
      );
      int var5 = 0<"JNT",569743778,"혫\udc2b쨫","⨷⨸⧘","땒땆",-1517143382>(this);
      int var6 = 0<"JNT",569743778,"줫춫","⨷⨸⧘","땒땆",-1517143381>(this);
      int var7 = 1<"JNT",624103572,"㿃뿁뾓","襝衍","\ue7ab\ue7b3\ue8b3",1855621363>(this);
      int var8 = 1<"JNT",624103572,"뿂ￂ\uffc0뾓","襝衍","\ue7ab\ue7b3\ue8b3",1855621362>(this);
      int var9 = var8 + var6 - 40;
      int var10 = var7 + var5 - 100;
      int var11 = var10 - 90;
      if (0<"JNT",569743778,"팫펫쨫","⨷⧣⧣⧘⧘⧘⧘⨸⧥","땒땆",-1517148850>(this, (double)var3, (double)var4, var10, var9, 80, 28)) {
         0<"JNT",569743778,"펫줫턫","⨷⨸⧱","땒땆",-1517148849>(this);
         return true;
      } else {
         var25 = -658208527 * 1072934789 ^ -334766199;

         while (true) {
            switch ((var25 + 430447601 + 1142974724 + 139534648 ^ 1224362402 ^ 1192743646) + 876127061) {
               case -1423861079:
                  if (0<"JNT",569743778,"팫펫쨫","⨷⧣⧣⧘⧘⧘⧘⨸⧥","땒땆",-1517143309>(this, (double)var3, (double)var4, var7 + 20, var9, 120, 28)
                     && 0<"JNT",-334177668,"햫좫툫튫","⨷⨸⧘","땪떆딺떆둚딶딲땦땒둚뗒땦땎딲",-1517143307>(
                           1<"JNT",624103572,"뾾羾뿁","襝衍","\ue7ab\ue7b3\ue8cb\ue9bb\ue973\uea1b\ue973\ue7e3\uea13\uea0b\ue9b3\ue9cb\ue7e3\ue8cb\ue9b3\uea03\uea0b\ue843",1855621355>(
                              this
                           )
                        )
                        < 50) {
                     List var10000 = 1<"JNT",624103572,"뾾羾뿁","襝衍","\ue7ab\ue7b3\ue8cb\ue9bb\ue973\uea1b\ue973\ue7e3\uea13\uea0b\ue9b3\ue9cb\ue7e3\ue8cb\ue9b3\uea03\uea0b\ue843",1855621341>(
                        this
                     );
                     int var10001 = -477563104 >> -477563104 ^ -477563104;

                     StringBuilder var10002;
                     for (var10002 = (StringBuilder)0<"JNT",-659212643,"\uf72b좫퀫좫\udb2b\uf82b","⨷⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆⨸⧱","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517143305>(
                           "㹒繬\ufe67빝繒繭\ufe6c㹩﹩"
                        );
                        var10001 < 9;
                        var10001 += (-400147243 - (-400147243 - -400147243) | 1) & 378126369
                     ) {
                        int var39 = 0<"JNT",569743778,"춫줫첫혫벫\udb2b","⨷⧘⨸⧞","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148694>(var10002, var10001) + 174 ^ 234;
                        char var40 = (char)((((var39 & 49152) >> 14 | var39 << 2) ^ 23) + 143);
                        0<"JNT",569743778,"햫튫\udb2b붫줫첫혫벫\udb2b","⨷⧘⧞⨸⧱","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148693>(
                           var10002, var10001, (char)((((var39 & 49152) >> 14 | var39 << 2) ^ 23) + 143)
                        );
                     }

                     0<"JNT",-334177668,"첫팫팫","⨷⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧚⧽⧵⨄⧾⨓⩆⨸⧥","땪떆딺떆둚딶딲땦땒둚뗒땦땎딲",-1517148846>(
                        var10000,
                        (Class_12)0<"JNT",-659212643,"\uf72b좫퀫좫\udb2b\uf82b","⨷⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆⧘⨸⧱","떆땊",-1517148847>(
                           0<"JNT",569743778,"\udb2b쾫얫\udb2b혫좫퀫펫","⨷⨸⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148848>(var10002), -1
                        )
                     );
                     1<"JNT",-285231332,"뾾㾿뾓","襝衍","\ue7ab\ue7b3\ue8b3",1855621386>(
                        this,
                        0<"JNT",-334177668,"햫좫툫튫","⨷⨸⧘","땪떆딺떆둚딶딲땦땒둚뗒땦땎딲",-1517148844>(
                              1<"JNT",624103572,"뾾羾뿁","襝衍","\ue7ab\ue7b3\ue8cb\ue9bb\ue973\uea1b\ue973\ue7e3\uea13\uea0b\ue9b3\ue9cb\ue7e3\ue8cb\ue9b3\uea03\uea0b\ue843",1855621328>(
                                 this
                              )
                           )
                           - 1
                     );
                     Class_369 var32 = 1<"JNT",624103572,"羿뾿","襝衍","\ue7ab\ue7b3\ue8cb\uea23\ue983\ue843",1855621373>(this);
                     var10001 = -1851830557 >>> -1851830557 ^ 305392092;

                     for (var10002 = (StringBuilder)0<"JNT",-659212643,"\uf72b좫퀫좫\udb2b\uf82b","⨷⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆⨸⧱","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517148841>(
                           "ϨϿБκϧϻϽЌЉ"
                        );
                        var10001 < (-651599889 >>> -651599889 ^ 111195);
                        var10001 += -71551876 << 1607172106 ^ -254676991
                     ) {
                        int var43 = 0<"JNT",569743778,"춫줫첫혫벫\udb2b","⨷⧘⨸⧞","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517143311>(var10002, var10001) - 242 - 227 - 218 - 235;
                        char var44 = (char)((var43 & 0) >> 16 | var43 << 0);
                        0<"JNT",569743778,"햫튫\udb2b붫줫첫혫벫\udb2b","⨷⧘⧞⨸⧱","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517143310>(
                           var10002, var10001, (char)((var43 & 0) >> 16 | var43 << 0)
                        );
                     }

                     0<"JNT",569743778,"쾫캫\udbab","⨷⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆⨸⧱","딾떎",-1517143303>(
                        var32, 0<"JNT",569743778,"\udb2b쾫얫\udb2b혫좫퀫펫","⨷⨸⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾똊딶땦땒땲땶땊",-1517143304>(var10002)
                     );
                     0<"JNT",569743778,"킫팫","⨷⨸⧱","딾떎",-1517143301>(1<"JNT",624103572,"羿뾿","襝衍","\ue7ab\ue7b3\ue8cb\uea23\ue983\ue843",1855621353>(this));
                     0<"JNT",569743778,"캫좫튫","⨷⧥⨸⧱","딾떎",-1517143395>(
                        1<"JNT",624103572,"羿뾿","襝衍","\ue7ab\ue7b3\ue8cb\uea23\ue983\ue843",1855621347>(this), true
                     );
                     1<"JNT",-285231332,"㾕ﾕ㾿","襝衍","\ue7ab\ue7b3\ue8b3",1855621333>(this, -1);
                     return true;
                  }

                  var25 = -1620062043;
                  break;
               case 1050513667:
                  if (1<"JNT",624103572,"㾕ﾕ㾿","襝衍","\ue7ab\ue7b3\ue8b3",1855621342>(this) >= 0
                     && 1<"JNT",624103572,"㾕ﾕ㾿","襝衍","\ue7ab\ue7b3\ue8b3",1855621345>(this)
                        < 0<"JNT",-334177668,"햫좫툫튫","⨷⨸⧘","땪떆딺떆둚딶딲땦땒둚뗒땦땎딲",-1517143420>(
                           1<"JNT",624103572,"뾾羾뿁","襝衍","\ue7ab\ue7b3\ue8cb\ue9bb\ue973\uea1b\ue973\ue7e3\uea13\uea0b\ue9b3\ue9cb\ue7e3\ue8cb\ue9b3\uea03\uea0b\ue843",1855621344>(
                              this
                           )
                        )) {
                     0<"JNT",569743778,"춫춫","⨷⧘⧘⨸⧱","땒땆",-1517143417>(
                        this,
                        0<"JNT",569743778,"캫튫\udb2b줫쾫팫잫ﮫשׂ\uf62bשׂ磌","⨷⨸⧘","땚땶딲둚땖땦땚땶떎땊떆땺딲둚떎땒떆땎땎떞둆둆됦둂됦",-1517143419>(var1),
                        1<"JNT",624103572,"㾕ﾕ㾿","襝衍","\ue7ab\ue7b3\ue8b3",1855621325>(this)
                     );
                     1<"JNT",-285231332,"\uffc1뿀㿀","襍螽","\ue7ab\ue7b3\ue8b3",1855621267>(
                        (Class_12)0<"JNT",-334177668,"펫튫\udb2b","⨷⧘⨸⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧚⧽⧵⨄⧾⨓⩆","땪떆딺떆둚딶딲땦땒둚뗒땦땎딲",-1517143414>(
                           1<"JNT",624103572,"뾾羾뿁","襝衍","\ue7ab\ue7b3\ue8cb\ue9bb\ue973\uea1b\ue973\ue7e3\uea13\uea0b\ue9b3\ue9cb\ue7e3\ue8cb\ue9b3\uea03\uea0b\ue843",1855621335>(
                              this
                           ),
                           1<"JNT",624103572,"㾕ﾕ㾿","襝衍","\ue7ab\ue7b3\ue8b3",1855621334>(this)
                        ),
                        0<"JNT",569743778,"캫튫\udb2b줫쾫팫잫ﮫשׂ\uf62bשׂ磌","⨷⨸⧘","땚땶딲둚땖땦땚땶떎땊떆땺딲둚떎땒떆땎땎떞둆둆됦둂됦",-1517143413>(var1)
                     );
                     1<"JNT",-285231332,"㾕ﾕ㾿","襝衍","\ue7ab\ue7b3\ue8b3",1855621266>(this, -1);
                     return true;
                  }

                  var25 = -1960867472 << 816260934 ^ 307828516;
                  break;
               case 1319116266:
               default:
                  if (0<"JNT",569743778,"팫펫쨫","⨷⧣⧣⧘⧘⧘⧘⨸⧥","땒땆",-1517143376>(this, (double)var3, (double)var4, var11, var9, 80, 28)) {
                     0<"JNT",569743778,"캫튫\udb2b줫쾫팫잫\uf4ab磌\uf52bﮫ","⨷⧛⧹⨄⨓⨺⧼⧸⧹⨄⧾⨍⨀⨁⨓⨺⧾⧻⨀⨎⨎⧪⩓⩎⩒⩆⨸⧱","땚땶딲둚땖땦땚땶떎땊떆땺딲둚떎땒떆땎땎떞둎둆둂",-1517143371>(
                        1<"JNT",624103572,"뿁㿁","襽襍","\ue7ab\ue7b3\ue8cb\ue9db\ue993\uea0b\ue7e3\ue9d3\ue9b3\ue9db\ue993\ue983\ue9fb\ue973\ue99b\uea0b\ue7e3\ue983\ue9cb\ue973\uea03\uea03\ue963\ue803\ue7f3\ue7eb\ue843",1855621361>(
                           1<"JNT",624103572,"\uffc1뿁뾿","襝衍","\ue7ab\ue7b3\ue8cb\ue9db\ue973\ue843",1855621358>(this)
                        ),
                        (Class_359)1<"JNT",624103572,"ﾕﾔ翂","製襍","\ue7ab\ue7b3\ue8cb\ue9bb\ue973\uea1b\ue973\ue7e3\ue9cb\ue973\ue9db\ue9a3\ue7e3\ue8e3\ue97b\ue9bb\ue993\ue983\uea0b\ue843",1855621419>(
                           (ScreenUI_78)1<"JNT",-930630794,"ﾕ\uffc1\uffc0","製襍","\ue7ab\ue7b3\ue8cb\ue9bb\ue973\uea1b\ue973\ue7e3\ue9cb\ue973\ue9db\ue9a3\ue7e3\ue8e3\ue97b\ue9bb\ue993\ue983\uea0b\ue843",1855621360>()
                        )
                     );
                     return true;
                  }

                  var25 = 944911592 >> 1038727179 ^ 317509565;
                  break;
               case 1752305026:
                  int var12 = var8 + 65;
                  byte var13 = 35;
                  int var14 = 0;

                  label179:
                  while (true) {
                     var25 = 1657469017 >>> (442076378 >>> 131134584) ^ 49863756;

                     while (true) {
                        switch ((var25 ^ 1291260680) - 1123251125 + 1461571872 - 1025811360 - 1560831069 + 1453554884) {
                           case -2113385569:
                           default:
                              if (0<"JNT",569743778,"켫햫쾫","⨷⨸⧥","딾떎",-1517148863>(
                                    1<"JNT",624103572,"羿뾿","襝衍","\ue7ab\ue7b3\ue8cb\uea23\ue983\ue843",1855621407>(this)
                                 )
                                 && 1<"JNT",624103572,"뾾㾿뾓","襝衍","\ue7ab\ue7b3\ue8b3",1855621409>(this) >= 0) {
                                 1<"JNT",-285231332,"翁ﾕ","襍螽","\ue7ab\ue7b3\ue8cb\ue9bb\ue973\uea1b\ue973\ue7e3\ue9cb\ue973\ue9db\ue9a3\ue7e3\ue903\uea0b\ue9fb\ue9b3\ue9db\ue9a3\ue843",1855621398>(
                                    (Class_12)0<"JNT",-334177668,"펫튫\udb2b","⨷⧘⨸⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧚⧽⧵⨄⧾⨓⩆","땪떆딺떆둚딶딲땦땒둚뗒땦땎딲",-1517148859>(
                                       1<"JNT",624103572,"뾾羾뿁","襝衍","\ue7ab\ue7b3\ue8cb\ue9bb\ue973\uea1b\ue973\ue7e3\uea13\uea0b\ue9b3\ue9cb\ue7e3\ue8cb\ue9b3\uea03\uea0b\ue843",1855621408>(
                                          this
                                       ),
                                       1<"JNT",624103572,"뾾㾿뾓","襝衍","\ue7ab\ue7b3\ue8b3",1855621403>(this)
                                    ),
                                    0<"JNT",569743778,"\udb2b혫좫캫","⨷⨸⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾",-1517148856>(
                                       0<"JNT",569743778,"\udb2b켫","⨷⨸⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆","딾떎",-1517148857>(
                                          1<"JNT",624103572,"羿뾿","襝衍","\ue7ab\ue7b3\ue8cb\uea23\ue983\ue843",1855621389>(this)
                                       )
                                    )
                                 );
                                 0<"JNT",569743778,"캫좫튫","⨷⧥⨸⧱","딾떎",-1517148853>(
                                    1<"JNT",624103572,"羿뾿","襝衍","\ue7ab\ue7b3\ue8cb\uea23\ue983\ue843",1855621401>(this), false
                                 );
                                 1<"JNT",-285231332,"뾾㾿뾓","襝衍","\ue7ab\ue7b3\ue8b3",1855621331>(this, -1);
                              }

                              var25 = (30051923 - -1867041694 | -1903807474) & -1092700274;
                              break;
                           case -1023280968:
                              1<"JNT",-285231332,"㾕ﾕ㾿","襝衍","\ue7ab\ue7b3\ue8b3",1855621299>(this, -1);
                              return 0<"JNT",-1486302104,"캫튫\udb2b줫쾫팫잫\uf62b磌שׂ\uf52b\uf62b","⨷⧛⧹⨄⨓⨺⧼⧸⧹⨄⧾⨍⨀⨁⨓⨺⧾⧻⨀⨎⨎⧪⩐⩐⩈⩏⩈⩆⧥⨸⧥","땆딶땂",-1517143411>(
                                 this, var1, var2
                              );
                           case 514892174:
                              if (var14
                                 < 0<"JNT",-334177668,"햫좫툫튫","⨷⨸⧘","땪떆딺떆둚딶딲땦땒둚뗒땦땎딲",-1517148834>(
                                    1<"JNT",624103572,"뾾羾뿁","襝衍","\ue7ab\ue7b3\ue8cb\ue9bb\ue973\uea1b\ue973\ue7e3\uea13\uea0b\ue9b3\ue9cb\ue7e3\ue8cb\ue9b3\uea03\uea0b\ue843",1855621410>(
                                       this
                                    )
                                 )) {
                                 int var15 = var12 + var14 * var13 - (int)1<"JNT",624103572,"㿁㿃翂","襝衍","\ue7ab\ue7b3\ue89b",1855621396>(this);
                                 int var16 = var8 + var6 - 50;
                                 if (var15 + var13 >= var8 + 60) {
                                    if (var15 > var16) {
                                       var25 = (-1292820098 ^ -1663409410 | -1962854046) & -884883485;
                                    } else {
                                       var25 = -636187698 & -8761741 ^ 1056624460;
                                    }
                                 } else {
                                    var25 = (-1292820098 ^ -1663409410 | -1962854046) & -884883485;
                                 }

                                 label167:
                                 while (true) {
                                    switch ((var25 + 1676653221 ^ 978182728) + 1791530080 + 1929376653 + 244411949 ^ 2088318645) {
                                       case -1116851108:
                                          var14++;
                                          continue label179;
                                       case 579386016:
                                    }

                                    int var17 = var7 + var5 - 45;
                                    int var18 = var13 - 11;
                                    if (0<"JNT",569743778,"팫펫쨫","⨷⧣⧣⧘⧘⧘⧘⨸⧥","땒땆",-1517143370>(this, (double)var3, (double)var4, var17, var15 + 3, var18, var18)
                                       )
                                     {
                                       0<"JNT",-334177668,"혫튫캫쾫\udc2b튫","⨷⧘⨸⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧚⧽⧵⨄⧾⨓⩆","땪떆딺떆둚딶딲땦땒둚뗒땦땎딲",-1517143368>(
                                          1<"JNT",624103572,"뾾羾뿁","襝衍","\ue7ab\ue7b3\ue8cb\ue9bb\ue973\uea1b\ue973\ue7e3\uea13\uea0b\ue9b3\ue9cb\ue7e3\ue8cb\ue9b3\uea03\uea0b\ue843",1855621404>(
                                             this
                                          ),
                                          var14
                                       );
                                       if (1<"JNT",624103572,"뾾㾿뾓","襝衍","\ue7ab\ue7b3\ue8b3",1855621414>(this) == var14) {
                                          1<"JNT",-285231332,"뾾㾿뾓","襝衍","\ue7ab\ue7b3\ue8b3",1855621417>(this, -1);
                                          0<"JNT",569743778,"캫좫튫","⨷⧥⨸⧱","딾떎",-1517148836>(
                                             1<"JNT",624103572,"羿뾿","襝衍","\ue7ab\ue7b3\ue8cb\uea23\ue983\ue843",1855621416>(this), false
                                          );
                                          var25 = -1535590966 - -1559830795 ^ -1103430910;
                                       } else {
                                          var25 = (-1701851667 | -570338052 | 12622016) & -1563255593;
                                       }
                                    } else {
                                       var25 = -861080410 ^ 317515435 ^ 1100731598;
                                    }

                                    while (true) {
                                       switch ((var25 + 75806831 + 1732705616 ^ 955668763 ^ 1534379689) + 1796533159 - 1207280714) {
                                          case -1958401395:
                                          default:
                                             int var19 = var7 + var5 - 165;
                                             byte var20 = 110;
                                             int var21 = var13 - 11;
                                             if (0<"JNT",569743778,"팫펫쨫","⨷⧣⧣⧘⧘⧘⧘⨸⧥","땒땆",-1517143377>(
                                                this, (double)var3, (double)var4, var19, var15 + 3, var20, var21
                                             )) {
                                                if (0<"JNT",569743778,"켫햫쾫","⨷⨸⧥","딾떎",-1517143407>(
                                                      1<"JNT",624103572,"羿뾿","襝衍","\ue7ab\ue7b3\ue8cb\uea23\ue983\ue843",1855621263>(this)
                                                   )
                                                   && 1<"JNT",624103572,"뾾㾿뾓","襝衍","\ue7ab\ue7b3\ue8b3",1855621265>(this) >= 0) {
                                                   1<"JNT",-285231332,"翁ﾕ","襍螽","\ue7ab\ue7b3\ue8cb\ue9bb\ue973\uea1b\ue973\ue7e3\ue9cb\ue973\ue9db\ue9a3\ue7e3\ue903\uea0b\ue9fb\ue9b3\ue9db\ue9a3\ue843",1855621318>(
                                                      (Class_12)0<"JNT",-334177668,"펫튫\udb2b","⨷⧘⨸⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧚⧽⧵⨄⧾⨓⩆","땪떆딺떆둚딶딲땦땒둚뗒땦땎딲",-1517143403>(
                                                         1<"JNT",624103572,"뾾羾뿁","襝衍","\ue7ab\ue7b3\ue8cb\ue9bb\ue973\uea1b\ue973\ue7e3\uea13\uea0b\ue9b3\ue9cb\ue7e3\ue8cb\ue9b3\uea03\uea0b\ue843",1855621264>(
                                                            this
                                                         ),
                                                         1<"JNT",624103572,"뾾㾿뾓","襝衍","\ue7ab\ue7b3\ue8b3",1855621323>(this)
                                                      ),
                                                      0<"JNT",569743778,"\udb2b혫좫캫","⨷⨸⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾",-1517143400>(
                                                         0<"JNT",569743778,"\udb2b켫","⨷⨸⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆","딾떎",-1517143401>(
                                                            1<"JNT",624103572,"羿뾿","襝衍","\ue7ab\ue7b3\ue8cb\uea23\ue983\ue843",1855621309>(this)
                                                         )
                                                      )
                                                   );
                                                   0<"JNT",569743778,"캫좫튫","⨷⧥⨸⧱","딾떎",-1517143397>(
                                                      1<"JNT",624103572,"羿뾿","襝衍","\ue7ab\ue7b3\ue8cb\uea23\ue983\ue843",1855621321>(this), false
                                                   );
                                                }

                                                var25 = (-1994324282 * -1014109499 | 1277546153) & 1605365419;
                                             } else {
                                                var25 = (1789706832 ^ -870010745 | 473336148) & 1551347572;
                                             }

                                             while (true) {
                                                switch (((var25 ^ 959603567) - 1931127524 + 25719026 + 1410344536 ^ 1990113236) + 973128881) {
                                                   case -1605963080:
                                                   default:
                                                      1<"JNT",-285231332,"㾕ﾕ㾿","襝衍","\ue7ab\ue7b3\ue8b3",1855621317>(this, var14);
                                                      var25 = -1803375325 >> -363165048 ^ -1814306688;
                                                      break;
                                                   case -1424177114:
                                                      int var22 = var7 + 20;
                                                      int var23 = var5 - 195;
                                                      int var24 = var13 - 11;
                                                      if (0<"JNT",569743778,"팫펫쨫","⨷⧣⧣⧘⧘⧘⧘⨸⧥","땒땆",-1517148830>(
                                                         this, (double)var3, (double)var4, var22, var15 + 3, var23, var24
                                                      )) {
                                                         1<"JNT",-285231332,"㾕ﾕ㾿","襝衍","\ue7ab\ue7b3\ue8b3",1855621376>(this, -1);
                                                         if (1<"JNT",624103572,"뾾㾿뾓","襝衍","\ue7ab\ue7b3\ue8b3",1855621371>(this) == var14) {
                                                            if (!0<"JNT",569743778,"켫햫쾫","⨷⨸⧥","딾떎",-1517148826>(
                                                               1<"JNT",624103572,"羿뾿","襝衍","\ue7ab\ue7b3\ue8cb\uea23\ue983\ue843",1855621370>(this)
                                                            )) {
                                                               var25 = (-1396468286 & 1757790819 | -1525619680) & -1223235867;
                                                            } else {
                                                               var25 = (-28382289 ^ -515544987 | 558674097) & 600766897;
                                                            }
                                                         } else {
                                                            var25 = (-1396468286 & 1757790819 | -1525619680) & -1223235867;
                                                         }

                                                         while (true) {
                                                            switch ((var25 - 15039400 ^ 634313046) - 791703386 + 368296884 - 2041759857 + 462564169) {
                                                               case -1874155887:
                                                                  return true;
                                                               case -1678990303:
                                                               default:
                                                                  1<"JNT",-285231332,"뾾㾿뾓","襝衍","\ue7ab\ue7b3\ue8b3",1855621315>(this, var14);
                                                                  0<"JNT",569743778,"쾫캫\udbab","⨷⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆⨸⧱","딾떎",-1517143391>(
                                                                     1<"JNT",624103572,"羿뾿","襝衍","\ue7ab\ue7b3\ue8cb\uea23\ue983\ue843",1855621314>(this),
                                                                     1<"JNT",624103572,"翁ﾕ","襍螽","\ue7ab\ue7b3\ue8cb\ue9bb\ue973\uea1b\ue973\ue7e3\ue9cb\ue973\ue9db\ue9a3\ue7e3\ue903\uea0b\ue9fb\ue9b3\ue9db\ue9a3\ue843",1855621311>(
                                                                        (Class_12)0<"JNT",-334177668,"펫튫\udb2b","⨷⧘⨸⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧚⧽⧵⨄⧾⨓⩆","땪떆딺떆둚딶딲땦땒둚뗒땦땎딲",-1517143361>(
                                                                           1<"JNT",624103572,"뾾羾뿁","襝衍","\ue7ab\ue7b3\ue8cb\ue9bb\ue973\uea1b\ue973\ue7e3\uea13\uea0b\ue9b3\ue9cb\ue7e3\ue8cb\ue9b3\uea03\uea0b\ue843",1855621301>(
                                                                              this
                                                                           ),
                                                                           var14
                                                                        )
                                                                     )
                                                                  );
                                                                  0<"JNT",569743778,"킫팫","⨷⨸⧱","딾떎",-1517143389>(
                                                                     1<"JNT",624103572,"羿뾿","襝衍","\ue7ab\ue7b3\ue8cb\uea23\ue983\ue843",1855621313>(this)
                                                                  );
                                                                  0<"JNT",569743778,"캫좫튫","⨷⧥⨸⧱","딾떎",-1517143387>(
                                                                     1<"JNT",624103572,"羿뾿","襝衍","\ue7ab\ue7b3\ue8cb\uea23\ue983\ue843",1855621307>(this), true
                                                                  );
                                                                  var25 = (-28382289 ^ -515544987 | 558674097) & 600766897;
                                                                  continue;
                                                               case 176711968:
                                                            }

                                                            if (0<"JNT",569743778,"켫햫쾫","⨷⨸⧥","딾떎",-1517148839>(
                                                                  1<"JNT",624103572,"羿뾿","襝衍","\ue7ab\ue7b3\ue8cb\uea23\ue983\ue843",1855621383>(this)
                                                               )
                                                               && 1<"JNT",624103572,"뾾㾿뾓","襝衍","\ue7ab\ue7b3\ue8b3",1855621385>(this) >= 0) {
                                                               1<"JNT",-285231332,"翁ﾕ","襍螽","\ue7ab\ue7b3\ue8cb\ue9bb\ue973\uea1b\ue973\ue7e3\ue9cb\ue973\ue9db\ue9a3\ue7e3\ue903\uea0b\ue9fb\ue9b3\ue9db\ue9a3\ue843",1855621374>(
                                                                  (Class_12)0<"JNT",-334177668,"펫튫\udb2b","⨷⧘⨸⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧚⧽⧵⨄⧾⨓⩆","땪떆딺떆둚딶딲땦땒둚뗒땦땎딲",-1517148803>(
                                                                     1<"JNT",624103572,"뾾羾뿁","襝衍","\ue7ab\ue7b3\ue8cb\ue9bb\ue973\uea1b\ue973\ue7e3\uea13\uea0b\ue9b3\ue9cb\ue7e3\ue8cb\ue9b3\uea03\uea0b\ue843",1855621384>(
                                                                        this
                                                                     ),
                                                                     1<"JNT",624103572,"뾾㾿뾓","襝衍","\ue7ab\ue7b3\ue8b3",1855621379>(this)
                                                                  ),
                                                                  0<"JNT",569743778,"\udb2b혫좫캫","⨷⨸⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾",-1517148832>(
                                                                     0<"JNT",569743778,"\udb2b켫","⨷⨸⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆","딾떎",-1517148801>(
                                                                        1<"JNT",624103572,"羿뾿","襝衍","\ue7ab\ue7b3\ue8cb\uea23\ue983\ue843",1855621365>(this)
                                                                     )
                                                                  )
                                                               );
                                                            }

                                                            var25 = -380884163 - -380884163 ^ 929870177;
                                                         }
                                                      }

                                                      var25 = (-1292820098 ^ -1663409410 | -1962854046) & -884883485;
                                                      continue label167;
                                                   case 1770295983:
                                                      if (1<"JNT",624103572,"㾕ﾕ㾿","襝衍","\ue7ab\ue7b3\ue8b3",1855621332>(this) == var14) {
                                                         1<"JNT",-285231332,"㾕ﾕ㾿","襝衍","\ue7ab\ue7b3\ue8b3",1855621343>(this, -1);
                                                         var25 = -1803375325 >> -363165048 ^ -1814306688;
                                                      } else {
                                                         var25 = -119732898 + (-110028779 >>> -119732898) ^ -273298589;
                                                      }
                                                      break;
                                                   case 2070224685:
                                                      return true;
                                                }
                                             }
                                          case -1527324904:
                                             return true;
                                          case -1339288445:
                                             if (1<"JNT",624103572,"뾾㾿뾓","襝衍","\ue7ab\ue7b3\ue8b3",1855621330>(this) > var14) {
                                                1<"JNT",-285231332,"뾾㾿뾓","襝衍","\ue7ab\ue7b3\ue8b3",1855621380>(
                                                   this, 1<"JNT",624103572,"뾾㾿뾓","襝衍","\ue7ab\ue7b3\ue8b3",1855621381>(this) - 1
                                                );
                                             }

                                             var25 = -1535590966 - -1559830795 ^ -1103430910;
                                             continue;
                                          case 1074914984:
                                             if (1<"JNT",624103572,"㾕ﾕ㾿","襝衍","\ue7ab\ue7b3\ue8b3",1855621349>(this) > var14) {
                                                1<"JNT",-285231332,"㾕ﾕ㾿","襝衍","\ue7ab\ue7b3\ue8b3",1855621295>(
                                                   this, 1<"JNT",624103572,"㾕ﾕ㾿","襝衍","\ue7ab\ue7b3\ue8b3",1855621348>(this) - 1
                                                );
                                             }

                                             var25 = -1065524022 & -1065524022 ^ -1225509248;
                                             continue;
                                          case 1806928769:
                                       }

                                       if (1<"JNT",624103572,"㾕ﾕ㾿","襝衍","\ue7ab\ue7b3\ue8b3",1855621495>(this) == var14) {
                                          1<"JNT",-285231332,"㾕ﾕ㾿","襝衍","\ue7ab\ue7b3\ue8b3",1855621494>(this, -1);
                                          var25 = -1065524022 & -1065524022 ^ -1225509248;
                                       } else {
                                          var25 = 1510143883 >>> (-1234365477 >> 1510143883) ^ 86308568;
                                       }
                                    }
                                 }
                              }

                              var25 = -1661553827 + 1781534633 ^ -88692381;
                        }
                     }
                  }
            }
         }
      }
   }

   // $VF: renamed from: ghx () void
   public void method_2032() {
      int var4 = 1230130731;
      if (0<"JNT",569743778,"켫햫쾫","⨷⨸⧥","딾떎",-1517149062>(1<"JNT",624103572,"羿뾿","襝衍","\ue7ab\ue7b3\ue8cb\uea23\ue983\ue843",1855621222>(this))
         && 1<"JNT",624103572,"뾾㾿뾓","襝衍","\ue7ab\ue7b3\ue8b3",1855621224>(this) >= 0) {
         1<"JNT",-285231332,"翁ﾕ","襍螽","\ue7ab\ue7b3\ue8cb\ue9bb\ue973\uea1b\ue973\ue7e3\ue9cb\ue973\ue9db\ue9a3\ue7e3\ue903\uea0b\ue9fb\ue9b3\ue9db\ue9a3\ue843",1855621217>(
            (Class_12)0<"JNT",-334177668,"펫튫\udb2b","⨷⧘⨸⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧚⧽⧵⨄⧾⨓⩆","땪떆딺떆둚딶딲땦땒둚뗒땦땎딲",-1517149154>(
               1<"JNT",624103572,"뾾羾뿁","襝衍","\ue7ab\ue7b3\ue8cb\ue9bb\ue973\uea1b\ue973\ue7e3\uea13\uea0b\ue9b3\ue9cb\ue7e3\ue8cb\ue9b3\uea03\uea0b\ue843",1855621219>(
                  this
               ),
               1<"JNT",624103572,"뾾㾿뾓","襝衍","\ue7ab\ue7b3\ue8b3",1855621218>(this)
            ),
            0<"JNT",569743778,"\udb2b혫좫캫","⨷⨸⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾",-1517149183>(
               0<"JNT",569743778,"\udb2b켫","⨷⨸⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆","딾떎",-1517149184>(
                  1<"JNT",624103572,"羿뾿","襝衍","\ue7ab\ue7b3\ue8cb\uea23\ue983\ue843",1855621204>(this)
               )
            )
         );
      }

      ArrayList var1 = (ArrayList)0<"JNT",-659212643,"\uf72b좫퀫좫\udb2b\uf82b","⨷⨸⧱","땪떆딺떆둚딶딲땦땒둚똆땊땊떆딦뗒땦땎딲",-1517149170>();
      Iterator var2 = 0<"JNT",-334177668,"좫\udb2b튫혫첫\udb2b쾫혫","⨷⨸⧛⧵⨀⨑⨀⨺⨔⨓⧸⧻⨺⧘⨓⨄⨍⨀⨓⧺⨍⩆","땪떆딺떆둚딶딲땦땒둚뗒땦땎딲",-1517149072>(
         1<"JNT",624103572,"뾾羾뿁","襝衍","\ue7ab\ue7b3\ue8cb\ue9bb\ue973\uea1b\ue973\ue7e3\uea13\uea0b\ue9b3\ue9cb\ue7e3\ue8cb\ue9b3\uea03\uea0b\ue843",1855621220>(
            this
         )
      );

      while (true) {
         var4 = 620369875;

         while (true) {
            switch (var4 - 1752872675 + 712318123 ^ 2000333568 ^ 1095469836 ^ 2143296700 ^ 2069060394) {
               case -1162689650:
               default:
                  0<"JNT",569743778,"픫툫킫","⨷⧛⧵⨀⨑⨀⨺⨔⨓⧸⧻⨺⧛⧸⨎⨓⩆⨸⧱","딾땞",-1517148824>(
                     1<"JNT",624103572,"㿁㿀ￃ","襝衍","\ue7ab\ue7b3\ue8cb\uea23\ue9e3\ue843",1855621356>(this), var1
                  );
                  0<"JNT",569743778,"캫튫\udb2b줫쾫팫잫\uf4ab磌\uf52bﮫ","⨷⧛⧹⨄⨓⨺⧼⧸⧹⨄⧾⨍⨀⨁⨓⨺⧾⧻⨀⨎⨎⧪⩓⩎⩒⩆⨸⧱","땚땶딲둚땖땦땚땶떎땊떆땺딲둚떎땒떆땎땎떞둎둆둂",-1517149171>(
                     1<"JNT",624103572,"뿁㿁","襽襍","\ue7ab\ue7b3\ue8cb\ue9db\ue993\uea0b\ue7e3\ue9d3\ue9b3\ue9db\ue993\ue983\ue9fb\ue973\ue99b\uea0b\ue7e3\ue983\ue9cb\ue973\uea03\uea03\ue963\ue803\ue7f3\ue7eb\ue843",1855621369>(
                        1<"JNT",624103572,"\uffc1뿁뾿","襝衍","\ue7ab\ue7b3\ue8cb\ue9db\ue973\ue843",1855621366>(this)
                     ),
                     (Class_359)1<"JNT",624103572,"ﾕﾔ翂","製襍","\ue7ab\ue7b3\ue8cb\ue9bb\ue973\uea1b\ue973\ue7e3\ue9cb\ue973\ue9db\ue9a3\ue7e3\ue8e3\ue97b\ue9bb\ue993\ue983\uea0b\ue843",1855621171>(
                        (ScreenUI_78)1<"JNT",-930630794,"ﾕ\uffc1\uffc0","製襍","\ue7ab\ue7b3\ue8cb\ue9bb\ue973\uea1b\ue973\ue7e3\ue9cb\ue973\ue9db\ue9a3\ue7e3\ue8e3\ue97b\ue9bb\ue993\ue983\uea0b\ue843",1855621368>()
                     )
                  );
                  return;
               case -736749055:
            }

            if (0<"JNT",-334177668,"줫첫햫쀫튫턫\udb2b","⨷⨸⧥","땪떆딺떆둚딶딲땦땒둚뗦딲땶땊떆딲땞땊",-1517149071>(var2)) {
               Class_12 var3 = (Class_12)0<"JNT",-334177668,"퀫튫턫\udb2b","⨷⨸⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧚⧽⧵⨄⧾⨓⩆","땪떆딺떆둚딶딲땦땒둚뗦딲땶땊떆딲땞땊",-1517149070>(var2);
               if (!0<"JNT",569743778,"좫햫슫캫픫\udb2b킫","⨷⨸⧥","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾",-1517149068>(
                  1<"JNT",624103572,"翁ﾕ","襍螽","\ue7ab\ue7b3\ue8cb\ue9bb\ue973\uea1b\ue973\ue7e3\ue9cb\ue973\ue9db\ue9a3\ue7e3\ue903\uea0b\ue9fb\ue9b3\ue9db\ue9a3\ue843",1855621168>(
                     var3
                  )
               )) {
                  0<"JNT",-334177668,"첫팫팫","⨷⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧚⧽⧵⨄⧾⨓⩆⨸⧥","땪떆딺떆둚딶딲땦땒둚뗒땦땎딲",-1517149064>(
                     var1,
                     (Class_352)0<"JNT",-659212643,"\uf72b좫퀫좫\udb2b\uf82b","⨷⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆⧘⨸⧱","딺땶",-1517149065>(
                        1<"JNT",624103572,"翁ﾕ","襍螽","\ue7ab\ue7b3\ue8cb\ue9bb\ue973\uea1b\ue973\ue7e3\ue9cb\ue973\ue9db\ue9a3\ue7e3\ue903\uea0b\ue9fb\ue9b3\ue9db\ue9a3\ue843",1855621226>(
                           var3
                        ),
                        1<"JNT",624103572,"\uffc1뿀㿀","襍螽","\ue7ab\ue7b3\ue8b3",1855621213>(var3)
                     )
                  );
               }
               break;
            }

            var4 = -967426484;
         }
      }
   }

   // $VF: renamed from: cc (int, int) void
   public void method_2033(int var1, int var2) {
      int var4 = -1096556817;
      if (var1 != -1) {
         int var3 = 0;

         label31:
         while (true) {
            var4 = -1203676105;

            while (true) {
               switch ((var4 + 1950059862 ^ 686296528) + 131408360 + 301761949 + 269119604 - 658885682) {
                  case 120270884:
                     if (var3
                        < 0<"JNT",-334177668,"햫좫툫튫","⨷⨸⧘","땪떆딺떆둚딶딲땦땒둚뗒땦땎딲",-1517149180>(
                           1<"JNT",624103572,"뾾羾뿁","襝衍","\ue7ab\ue7b3\ue8cb\ue9bb\ue973\uea1b\ue973\ue7e3\uea13\uea0b\ue9b3\ue9cb\ue7e3\ue8cb\ue9b3\uea03\uea0b\ue843",1855621216>(
                              this
                           )
                        )) {
                        if (var3 != var2
                           && 1<"JNT",624103572,"\uffc1뿀㿀","襍螽","\ue7ab\ue7b3\ue8b3",1855621196>(
                                 (Class_12)0<"JNT",-334177668,"펫튫\udb2b","⨷⧘⨸⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧚⧽⧵⨄⧾⨓⩆","땪떆딺떆둚딶딲땦땒둚뗒땦땎딲",-1517149178>(
                                    1<"JNT",624103572,"뾾羾뿁","襝衍","\ue7ab\ue7b3\ue8cb\ue9bb\ue973\uea1b\ue973\ue7e3\uea13\uea0b\ue9b3\ue9cb\ue7e3\ue8cb\ue9b3\uea03\uea0b\ue843",1855621210>(
                                       this
                                    ),
                                    var3
                                 )
                              )
                              == var1) {
                           1<"JNT",-285231332,"\uffc1뿀㿀","襍螽","\ue7ab\ue7b3\ue8b3",1855621209>(
                              (Class_12)0<"JNT",-334177668,"펫튫\udb2b","⨷⧘⨸⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧚⧽⧵⨄⧾⨓⩆","땪떆딺떆둚딶딲땦땒둚뗒땦땎딲",-1517149175>(
                                 1<"JNT",624103572,"뾾羾뿁","襝衍","\ue7ab\ue7b3\ue8cb\ue9bb\ue973\uea1b\ue973\ue7e3\uea13\uea0b\ue9b3\ue9cb\ue7e3\ue8cb\ue9b3\uea03\uea0b\ue843",1855621207>(
                                    this
                                 ),
                                 var3
                              ),
                              -1
                           );
                        }

                        var4 = (-1995252622 * -1995252622 | 69271723) & 874614527;
                     } else {
                        var4 = -632140863;
                     }
                     break;
                  case 1397418332:
                  default:
                     var3++;
                     continue label31;
                  case 1761353870:
                     return;
               }
            }
         }
      }
   }

   // $VF: Irreducible bytecode was duplicated to produce valid code
   public boolean method_25404(class_11908 var1) {
      int var2 = -807698922;
      if (1<"JNT",624103572,"㾕ﾕ㾿","襝衍","\ue7ab\ue7b3\ue8b3",1855621276>(this) < 0
         || 1<"JNT",624103572,"㾕ﾕ㾿","襝衍","\ue7ab\ue7b3\ue8b3",1855621287>(this)
            >= 0<"JNT",-334177668,"햫좫툫튫","⨷⨸⧘","땪떆딺떆둚딶딲땦땒둚뗒땦땎딲",-1517149126>(
               1<"JNT",624103572,"뾾羾뿁","襝衍","\ue7ab\ue7b3\ue8cb\ue9bb\ue973\uea1b\ue973\ue7e3\uea13\uea0b\ue9b3\ue9cb\ue7e3\ue8cb\ue9b3\uea03\uea0b\ue843",1855621286>(
                  this
               )
            )) {
         var2 = -589788995 & -4135631 << -4135631 ^ 1704466064;
      } else if (0<"JNT",569743778,"캫튫\udb2b줫쾫팫잫ﮫשׂ\uf62b\uf62b\uf12b","⨷⨸⧘","땚땶딲둚땖땦땚땶떎땊떆땺딲둚떎땒떆땎땎떞둆둆됦둂됢",-1517149125>(var1) == 256) {
         1<"JNT",-285231332,"㾕ﾕ㾿","襝衍","\ue7ab\ue7b3\ue8b3",1855621283>(this, -1);
         var2 = -345800568;
      } else {
         var2 = (-1289507041 | -1289507041 & 939963907 | 203722784) & 1873280572;
      }

      while (true) {
         switch ((var2 - 1455376843 - 502031831 - 2078651469 ^ 1007615481 ^ 2048568554) - 251501947) {
            case -1379356657:
               return true;
            case -329955785:
               if (0<"JNT",569743778,"캫튫\udb2b줫쾫팫잫ﮫשׂ\uf62b\uf62b\uf12b","⨷⨸⧘","땚땶딲둚땖땦땚땶떎땊떆땺딲둚떎땒떆땎땎떞둆둆됦둂됢",-1517149146>(var1) == 256) {
                  if (0<"JNT",569743778,"켫햫쾫","⨷⨸⧥","딾떎",-1517149144>(1<"JNT",624103572,"羿뾿","襝衍","\ue7ab\ue7b3\ue8cb\uea23\ue983\ue843",1855621164>(this))
                     && 1<"JNT",624103572,"뾾㾿뾓","襝衍","\ue7ab\ue7b3\ue8b3",1855621174>(this) >= 0) {
                     1<"JNT",-285231332,"翁ﾕ","襍螽","\ue7ab\ue7b3\ue8cb\ue9bb\ue973\uea1b\ue973\ue7e3\ue9cb\ue973\ue9db\ue9a3\ue7e3\ue903\uea0b\ue9fb\ue9b3\ue9db\ue9a3\ue843",1855621231>(
                        (Class_12)0<"JNT",-334177668,"펫튫\udb2b","⨷⧘⨸⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧚⧽⧵⨄⧾⨓⩆","땪떆딺떆둚딶딲땦땒둚뗒땦땎딲",-1517148980>(
                           1<"JNT",624103572,"뾾羾뿁","襝衍","\ue7ab\ue7b3\ue8cb\ue9bb\ue973\uea1b\ue973\ue7e3\uea13\uea0b\ue9b3\ue9cb\ue7e3\ue8cb\ue9b3\uea03\uea0b\ue843",1855621177>(
                              this
                           ),
                           1<"JNT",624103572,"뾾㾿뾓","襝衍","\ue7ab\ue7b3\ue8b3",1855621176>(this)
                        ),
                        0<"JNT",569743778,"\udb2b혫좫캫","⨷⨸⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾",-1517148977>(
                           0<"JNT",569743778,"\udb2b켫","⨷⨸⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆","딾떎",-1517148978>(
                              1<"JNT",624103572,"羿뾿","襝衍","\ue7ab\ue7b3\ue8cb\uea23\ue983\ue843",1855621234>(this)
                           )
                        )
                     );
                  }

                  var2 = (-971976455 ^ -971976455 | 975458447) & -26258257;
               } else {
                  var2 = (362525810 | 362525810) ^ -1570322769;
               }
               continue;
            case 8986680:
               0<"JNT",569743778,"펫줫턫","⨷⨸⧱","땒땆",-1517149164>(this);
               return true;
            case 1159162802:
               0<"JNT",569743778,"춫춫","⨷⧘⧘⨸⧱","땒땆",-1517149139>(
                  this,
                  0<"JNT",569743778,"캫튫\udb2b줫쾫팫잫ﮫשׂ\uf62b\uf62b\uf12b","⨷⨸⧘","땚땶딲둚땖땦땚땶떎땊떆땺딲둚떎땒떆땎땎떞둆둆됦둂됢",-1517149173>(var1),
                  1<"JNT",624103572,"㾕ﾕ㾿","襝衍","\ue7ab\ue7b3\ue8b3",1855621139>(this)
               );
               1<"JNT",-285231332,"\uffc1뿀㿀","襍螽","\ue7ab\ue7b3\ue8b3",1855621137>(
                  (Class_12)0<"JNT",-334177668,"펫튫\udb2b","⨷⧘⨸⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧚⧽⧵⨄⧾⨓⩆","땪떆딺떆둚딶딲땦땒둚뗒땦땎딲",-1517149168>(
                     1<"JNT",624103572,"뾾羾뿁","襝衍","\ue7ab\ue7b3\ue8cb\ue9bb\ue973\uea1b\ue973\ue7e3\uea13\uea0b\ue9b3\ue9cb\ue7e3\ue8cb\ue9b3\uea03\uea0b\ue843",1855621189>(
                        this
                     ),
                     1<"JNT",624103572,"㾕ﾕ㾿","襝衍","\ue7ab\ue7b3\ue8b3",1855621188>(this)
                  ),
                  0<"JNT",569743778,"캫튫\udb2b줫쾫팫잫ﮫשׂ\uf62b\uf62b\uf12b","⨷⨸⧘","땚땶딲둚땖땦땚땶떎땊떆땺딲둚떎땒떆땎땎떞둆둆됦둂됢",-1517149167>(var1)
               );
               1<"JNT",-285231332,"㾕ﾕ㾿","襝衍","\ue7ab\ue7b3\ue8b3",1855621136>(this, -1);
               var2 = -345800568;
               continue;
            case 1161989089:
               0<"JNT",569743778,"캫좫튫","⨷⧥⨸⧱","딾떎",-1517149157>(1<"JNT",624103572,"羿뾿","襝衍","\ue7ab\ue7b3\ue8cb\uea23\ue983\ue843",1855621193>(this), false);
               1<"JNT",-285231332,"뾾㾿뾓","襝衍","\ue7ab\ue7b3\ue8b3",1855621187>(this, -1);
               return true;
            case 1700231931:
               if (0<"JNT",569743778,"캫튫\udb2b줫쾫팫잫ﮫשׂ\uf62b\uf62b\uf12b","⨷⨸⧘","땚땶딲둚땖땦땚땶떎땊떆땺딲둚떎땒떆땎땎떞둆둆됦둂됢",-1517149123>(var1) == 257) {
                  if (1<"JNT",624103572,"뾾㾿뾓","襝衍","\ue7ab\ue7b3\ue8b3",1855621173>(this) >= 0) {
                     1<"JNT",-285231332,"翁ﾕ","襍螽","\ue7ab\ue7b3\ue8cb\ue9bb\ue973\uea1b\ue973\ue7e3\ue9cb\ue973\ue9db\ue9a3\ue7e3\ue903\uea0b\ue9fb\ue9b3\ue9db\ue9a3\ue843",1855621178>(
                        (Class_12)0<"JNT",-334177668,"펫튫\udb2b","⨷⧘⨸⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧚⧽⧵⨄⧾⨓⩆","땪떆딺떆둚딶딲땦땒둚뗒땦땎딲",-1517149151>(
                           1<"JNT",624103572,"뾾羾뿁","襝衍","\ue7ab\ue7b3\ue8cb\ue9bb\ue973\uea1b\ue973\ue7e3\uea13\uea0b\ue9b3\ue9cb\ue7e3\ue8cb\ue9b3\uea03\uea0b\ue843",1855621172>(
                              this
                           ),
                           1<"JNT",624103572,"뾾㾿뾓","襝衍","\ue7ab\ue7b3\ue8b3",1855621183>(this)
                        ),
                        0<"JNT",569743778,"\udb2b혫좫캫","⨷⨸⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆","땪떆딺떆둚땒떆땚땾둚뗎딲땊땦땚땾",-1517149148>(
                           0<"JNT",569743778,"\udb2b켫","⨷⨸⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧮⨓⨍⧸⧹⨂⩆","딾떎",-1517149149>(
                              1<"JNT",624103572,"羿뾿","襝衍","\ue7ab\ue7b3\ue8cb\uea23\ue983\ue843",1855621185>(this)
                           )
                        )
                     );
                  }

                  var2 = (2032706498 - 2032706498 | 48618558) & 1072684478;
               } else {
                  var2 = 768559436;
               }
               continue;
            case 1770286563:
            default:
               if (0<"JNT",569743778,"캫튫\udb2b줫쾫팫잫ﮫשׂ\uf62b\uf62b\uf12b","⨷⨸⧘","땚땶딲둚땖땦땚땶떎땊떆땺딲둚떎땒떆땎땎떞둆둆됦둂됢",-1517149135>(var1) == 259) {
                  1<"JNT",-285231332,"\uffc1뿀㿀","襍螽","\ue7ab\ue7b3\ue8b3",1855621290>(
                     (Class_12)0<"JNT",-334177668,"펫튫\udb2b","⨷⧘⨸⧛⧵⨀⨑⨀⨺⧻⨀⧹⨂⨺⧚⧽⧵⨄⧾⨓⩆","땪떆딺떆둚딶딲땦땒둚뗒땦땎딲",-1517149132>(
                        1<"JNT",624103572,"뾾羾뿁","襝衍","\ue7ab\ue7b3\ue8cb\ue9bb\ue973\uea1b\ue973\ue7e3\uea13\uea0b\ue9b3\ue9cb\ue7e3\ue8cb\ue9b3\uea03\uea0b\ue843",1855621233>(
                           this
                        ),
                        1<"JNT",624103572,"㾕ﾕ㾿","襝衍","\ue7ab\ue7b3\ue8b3",1855621232>(this)
                     ),
                     -1
                  );
                  1<"JNT",-285231332,"㾕ﾕ㾿","襝衍","\ue7ab\ue7b3\ue8b3",1855621277>(this, -1);
                  var2 = -345800568;
               } else {
                  var2 = (-896601851 | -896601851 | -1341734638 | 34745384) & 112376877;
               }
               continue;
            case 1814828755:
               return 0<"JNT",569743778,"팫펫","⨷⧛⧹⨄⨓⨺⧼⧸⧹⨄⧾⨍⨀⨁⨓⨺⧾⧻⨀⨎⨎⧪⩐⩐⩈⩏⩇⩆⨸⧥","딾떎",-1517149159>(
                  1<"JNT",624103572,"羿뾿","襝衍","\ue7ab\ue7b3\ue8cb\uea23\ue983\ue843",1855621191>(this), var1
               );
            case 1920647810:
         }

         if (!0<"JNT",569743778,"켫햫쾫","⨷⨸⧥","딾떎",-1517149162>(1<"JNT",624103572,"羿뾿","襝衍","\ue7ab\ue7b3\ue8cb\uea23\ue983\ue843",1855621194>(this))) {
            return 0<"JNT",-1486302104,"캫튫\udb2b줫쾫팫잫\uf62b磌שׂ\uf52bשׂ","⨷⧛⧹⨄⨓⨺⧼⧸⧹⨄⧾⨍⨀⨁⨓⨺⧾⧻⨀⨎⨎⧪⩐⩐⩈⩏⩇⩆⨸⧥","땆딶땂",-1517149161>(this, var1);
         }

         var2 = 1157188625 >>> 1157188625 ^ 584224552;
      }
   }

   public boolean method_25400(class_11905 var1) {
      int var2 = 1602487356;
      if (1<"JNT",624103572,"㾕ﾕ㾿","襝衍","\ue7ab\ue7b3\ue8b3",1855621281>(this) >= 0) {
         return true;
      } else {
         var2 = (1490384920 >> -79107880 | 1683897923) & -285311165;

         while (true) {
            switch ((var2 + 288659040 - 1167833514 ^ 903392492) - 434232920 - 1991978516 - 1607376390) {
               case 700713891:
                  if (!0<"JNT",569743778,"켫햫쾫","⨷⨸⧥","딾떎",-1517148992>(1<"JNT",624103572,"羿뾿","襝衍","\ue7ab\ue7b3\ue8cb\uea23\ue983\ue843",1855621268>(this))) {
                     return 0<"JNT",-1486302104,"캫튫\udb2b줫쾫팫잫\uf62b磌שׂ\uf52b\uf52b","⨷⧛⧹⨄⨓⨺⧼⧸⧹⨄⧾⨍⨀⨁⨓⨺⧾⧻⨀⨎⨎⧪⩐⩐⩈⩏⩔⩆⨸⧥","땆딶땂",-1517148991>(this, var1);
                  }

                  var2 = -1460113259;
                  break;
               case 1356740405:
               default:
                  return 0<"JNT",569743778,"\udbab\udb2b쾫","⨷⧛⧹⨄⨓⨺⧼⧸⧹⨄⧾⨍⨀⨁⨓⨺⧾⧻⨀⨎⨎⧪⩐⩐⩈⩏⩔⩆⨸⧥","딾떎",-1517148962>(
                     1<"JNT",624103572,"羿뾿","襝衍","\ue7ab\ue7b3\ue8cb\uea23\ue983\ue843",1855621282>(this), var1
                  );
            }
         }
      }
   }

   public boolean method_25401(double var1, double var3, double var5, double var7) {
      int var9 = 0<"JNT",-536709671,"캫첫턫","⨷⧘⧘⨸⧘","땪떆딺떆둚땒떆땚땾둚뗖떆딲땢",-1517148987>(
         0,
         0<"JNT",-334177668,"햫좫툫튫","⨷⨸⧘","땪떆딺떆둚딶딲땦땒둚뗒땦땎딲",-1517148988>(
                  1<"JNT",624103572,"뾾羾뿁","襝衍","\ue7ab\ue7b3\ue8cb\ue9bb\ue973\uea1b\ue973\ue7e3\uea13\uea0b\ue9b3\ue9cb\ue7e3\ue8cb\ue9b3\uea03\uea0b\ue843",1855621280>(
                     this
                  )
               )
               * 35
            - 380
      );
      1<"JNT",-285231332,"㿁㿃翂","襝衍","\ue7ab\ue7b3\ue89b",1855621270>(
         this,
         (float)0<"JNT",-536709671,"캫첫턫","⨷⧣⧣⨸⧣","땪떆딺떆둚땒떆땚땾둚뗖떆딲땢",-1517148984>(
            0.0,
            0<"JNT",-536709671,"캫좫퀫","⨷⧣⧣⨸⧣","땪떆딺떆둚땒떆땚땾둚뗖떆딲땢",-1517148985>(
               (double)var9, (double)1<"JNT",624103572,"㿁㿃翂","襝衍","\ue7ab\ue7b3\ue89b",1855621261>(this) - var7 * 20.0
            )
         )
      );
      return true;
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_2015(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 ^ 731160056 ^ 2042836751) + 2479951 + 1157641393 ^ 880284788 ^ 932365263) + 587922028 - 130851872 ^ 699566753;
      MethodHandle var10000 = field_2465[((var10 ^ 731160056 ^ 2042836751) + 2479951 + 1157641393 ^ 880284788 ^ 932365263) + 587922028 - 130851872
         ^ 699566753
         ^ 1938630701];
      if (field_2465[var10001 ^ 1938630701] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = 693301951 ^ -852023560 ^ -463088569; var23 < var13.length(); var23 += (-87307002 << (-449409303 >> -265993154) | 1) & -979366669) {
            int var42 = var13.charAt(var23) ^ 7;
            char var47 = (char)(
               (
                        (
                                 (
                                       (
                                                (
                                                      (
                                                               (
                                                                     (
                                                                           (((var42 & 0) >> 16 | var42 << 0) - 84 & 65528) >> 3
                                                                              | ((var42 & 0) >> 16 | var42 << 0) - 84 << 13
                                                                        )
                                                                        ^ 91
                                                                  )
                                                                  & 49152
                                                            )
                                                            >> 14
                                                         | (
                                                               (
                                                                     (((var42 & 0) >> 16 | var42 << 0) - 84 & 65528) >> 3
                                                                        | ((var42 & 0) >> 16 | var42 << 0) - 84 << 13
                                                                  )
                                                                  ^ 91
                                                            )
                                                            << 2
                                                   )
                                                   & 0
                                             )
                                             >> 16
                                          | (
                                                (
                                                         (
                                                               (
                                                                     (((var42 & 0) >> 16 | var42 << 0) - 84 & 65528) >> 3
                                                                        | ((var42 & 0) >> 16 | var42 << 0) - 84 << 13
                                                                  )
                                                                  ^ 91
                                                            )
                                                            & 49152
                                                      )
                                                      >> 14
                                                   | (((((var42 & 0) >> 16 | var42 << 0) - 84 & 65528) >> 3 | ((var42 & 0) >> 16 | var42 << 0) - 84 << 13) ^ 91)
                                                      << 2
                                             )
                                             << 0
                                    )
                                    & 65472
                              )
                              >> 6
                           | (
                                 (
                                          (
                                                (
                                                         (
                                                               (
                                                                     (((var42 & 0) >> 16 | var42 << 0) - 84 & 65528) >> 3
                                                                        | ((var42 & 0) >> 16 | var42 << 0) - 84 << 13
                                                                  )
                                                                  ^ 91
                                                            )
                                                            & 49152
                                                      )
                                                      >> 14
                                                   | (((((var42 & 0) >> 16 | var42 << 0) - 84 & 65528) >> 3 | ((var42 & 0) >> 16 | var42 << 0) - 84 << 13) ^ 91)
                                                      << 2
                                             )
                                             & 0
                                       )
                                       >> 16
                                    | (
                                          ((((((var42 & 0) >> 16 | var42 << 0) - 84 & 65528) >> 3 | ((var42 & 0) >> 16 | var42 << 0) - 84 << 13) ^ 91) & 49152)
                                                >> 14
                                             | (((((var42 & 0) >> 16 | var42 << 0) - 84 & 65528) >> 3 | ((var42 & 0) >> 16 | var42 << 0) - 84 << 13) ^ 91) << 2
                                       )
                                       << 0
                              )
                              << 10
                     )
                     - 244
                  ^ 200
            );
            var13.setCharAt(
               var23,
               (char)(
                  (
                           (
                                    (
                                          (
                                                   (
                                                         (
                                                                  (
                                                                        (
                                                                              (((var42 & 0) >> 16 | var42 << 0) - 84 & 65528) >> 3
                                                                                 | ((var42 & 0) >> 16 | var42 << 0) - 84 << 13
                                                                           )
                                                                           ^ 91
                                                                     )
                                                                     & 49152
                                                               )
                                                               >> 14
                                                            | (
                                                                  (
                                                                        (((var42 & 0) >> 16 | var42 << 0) - 84 & 65528) >> 3
                                                                           | ((var42 & 0) >> 16 | var42 << 0) - 84 << 13
                                                                     )
                                                                     ^ 91
                                                               )
                                                               << 2
                                                      )
                                                      & 0
                                                )
                                                >> 16
                                             | (
                                                   (
                                                            (
                                                                  (
                                                                        (((var42 & 0) >> 16 | var42 << 0) - 84 & 65528) >> 3
                                                                           | ((var42 & 0) >> 16 | var42 << 0) - 84 << 13
                                                                     )
                                                                     ^ 91
                                                               )
                                                               & 49152
                                                         )
                                                         >> 14
                                                      | (
                                                            ((((var42 & 0) >> 16 | var42 << 0) - 84 & 65528) >> 3 | ((var42 & 0) >> 16 | var42 << 0) - 84 << 13)
                                                               ^ 91
                                                         )
                                                         << 2
                                                )
                                                << 0
                                       )
                                       & 65472
                                 )
                                 >> 6
                              | (
                                    (
                                             (
                                                   (
                                                            (
                                                                  (
                                                                        (((var42 & 0) >> 16 | var42 << 0) - 84 & 65528) >> 3
                                                                           | ((var42 & 0) >> 16 | var42 << 0) - 84 << 13
                                                                     )
                                                                     ^ 91
                                                               )
                                                               & 49152
                                                         )
                                                         >> 14
                                                      | (
                                                            ((((var42 & 0) >> 16 | var42 << 0) - 84 & 65528) >> 3 | ((var42 & 0) >> 16 | var42 << 0) - 84 << 13)
                                                               ^ 91
                                                         )
                                                         << 2
                                                )
                                                & 0
                                          )
                                          >> 16
                                       | (
                                             (
                                                      (
                                                            ((((var42 & 0) >> 16 | var42 << 0) - 84 & 65528) >> 3 | ((var42 & 0) >> 16 | var42 << 0) - 84 << 13)
                                                               ^ 91
                                                         )
                                                         & 49152
                                                   )
                                                   >> 14
                                                | (((((var42 & 0) >> 16 | var42 << 0) - 84 & 65528) >> 3 | ((var42 & 0) >> 16 | var42 << 0) - 84 << 13) ^ 91)
                                                   << 2
                                          )
                                          << 0
                                 )
                                 << 10
                        )
                        - 244
                     ^ 200
               )
            );
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = -936856860 & 349123596 ^ 536580; var29 < var16.length(); var29 += (1604797727 + 483130814 | 1) & 17073153) {
            char var52 = var16.charAt(var29);
            char var57 = (char)(
               (
                        (
                                 (
                                          (
                                                   (
                                                         (
                                                                  ((((var52 & '￼') >> 2 | var52 << 14) & 0) >> 16 | ((var52 & '￼') >> 2 | var52 << 14) << 0)
                                                                        - 237
                                                                     & 65528
                                                               )
                                                               >> 3
                                                            | ((((var52 & '￼') >> 2 | var52 << 14) & 0) >> 16 | ((var52 & '￼') >> 2 | var52 << 14) << 0) - 237
                                                               << 13
                                                      )
                                                      & 65532
                                                )
                                                >> 2
                                             | (
                                                   (((((var52 & '￼') >> 2 | var52 << 14) & 0) >> 16 | ((var52 & '￼') >> 2 | var52 << 14) << 0) - 237 & 65528)
                                                         >> 3
                                                      | ((((var52 & '￼') >> 2 | var52 << 14) & 0) >> 16 | ((var52 & '￼') >> 2 | var52 << 14) << 0) - 237 << 13
                                                )
                                                << 14
                                       )
                                       - 78
                                    & 65024
                              )
                              >> 9
                           | (
                                    (
                                             (
                                                   (((((var52 & '￼') >> 2 | var52 << 14) & 0) >> 16 | ((var52 & '￼') >> 2 | var52 << 14) << 0) - 237 & 65528)
                                                         >> 3
                                                      | ((((var52 & '￼') >> 2 | var52 << 14) & 0) >> 16 | ((var52 & '￼') >> 2 | var52 << 14) << 0) - 237 << 13
                                                )
                                                & 65532
                                          )
                                          >> 2
                                       | (
                                             (((((var52 & '￼') >> 2 | var52 << 14) & 0) >> 16 | ((var52 & '￼') >> 2 | var52 << 14) << 0) - 237 & 65528) >> 3
                                                | ((((var52 & '￼') >> 2 | var52 << 14) & 0) >> 16 | ((var52 & '￼') >> 2 | var52 << 14) << 0) - 237 << 13
                                          )
                                          << 14
                                 )
                                 - 78
                              << 7
                     )
                     + 110
                     + 242
                  ^ 202
            );
            var16.setCharAt(
               var29,
               (char)(
                  (
                           (
                                    (
                                             (
                                                      (
                                                            (
                                                                     ((((var52 & '￼') >> 2 | var52 << 14) & 0) >> 16 | ((var52 & '￼') >> 2 | var52 << 14) << 0)
                                                                           - 237
                                                                        & 65528
                                                                  )
                                                                  >> 3
                                                               | ((((var52 & '￼') >> 2 | var52 << 14) & 0) >> 16 | ((var52 & '￼') >> 2 | var52 << 14) << 0)
                                                                     - 237
                                                                  << 13
                                                         )
                                                         & 65532
                                                   )
                                                   >> 2
                                                | (
                                                      (((((var52 & '￼') >> 2 | var52 << 14) & 0) >> 16 | ((var52 & '￼') >> 2 | var52 << 14) << 0) - 237 & 65528)
                                                            >> 3
                                                         | ((((var52 & '￼') >> 2 | var52 << 14) & 0) >> 16 | ((var52 & '￼') >> 2 | var52 << 14) << 0) - 237
                                                            << 13
                                                   )
                                                   << 14
                                          )
                                          - 78
                                       & 65024
                                 )
                                 >> 9
                              | (
                                       (
                                                (
                                                      (((((var52 & '￼') >> 2 | var52 << 14) & 0) >> 16 | ((var52 & '￼') >> 2 | var52 << 14) << 0) - 237 & 65528)
                                                            >> 3
                                                         | ((((var52 & '￼') >> 2 | var52 << 14) & 0) >> 16 | ((var52 & '￼') >> 2 | var52 << 14) << 0) - 237
                                                            << 13
                                                   )
                                                   & 65532
                                             )
                                             >> 2
                                          | (
                                                (((((var52 & '￼') >> 2 | var52 << 14) & 0) >> 16 | ((var52 & '￼') >> 2 | var52 << 14) << 0) - 237 & 65528) >> 3
                                                   | ((((var52 & '￼') >> 2 | var52 << 14) & 0) >> 16 | ((var52 & '￼') >> 2 | var52 << 14) << 0) - 237 << 13
                                             )
                                             << 14
                                    )
                                    - 78
                                 << 7
                        )
                        + 110
                        + 242
                     ^ 202
               )
            );
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_187.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = (810485161 - (-1984029300 & 810485161) | 0) & 1136436496; var35 < var19.length(); var35 += (-777866369 & 1819781492 | 1) & 234951691) {
            char var62 = var19.charAt(var35);
            char var67 = (char)(
               (
                     (
                              (
                                       (
                                                (
                                                      (
                                                            (
                                                                     (
                                                                              (((var62 & '\ufff8') >> 3 | var62 << '\r') & 64512) >> 10
                                                                                 | ((var62 & '\ufff8') >> 3 | var62 << '\r') << 6
                                                                           )
                                                                           - 112
                                                                        & 57344
                                                                  )
                                                                  >> 13
                                                               | (
                                                                        (((var62 & '\ufff8') >> 3 | var62 << '\r') & 64512) >> 10
                                                                           | ((var62 & '\ufff8') >> 3 | var62 << '\r') << 6
                                                                     )
                                                                     - 112
                                                                  << 3
                                                         )
                                                         ^ 93
                                                   )
                                                   & 65528
                                             )
                                             >> 3
                                          | (
                                                (
                                                      (
                                                               (
                                                                        (((var62 & '\ufff8') >> 3 | var62 << '\r') & 64512) >> 10
                                                                           | ((var62 & '\ufff8') >> 3 | var62 << '\r') << 6
                                                                     )
                                                                     - 112
                                                                  & 57344
                                                            )
                                                            >> 13
                                                         | (
                                                                  (((var62 & '\ufff8') >> 3 | var62 << '\r') & 64512) >> 10
                                                                     | ((var62 & '\ufff8') >> 3 | var62 << '\r') << 6
                                                               )
                                                               - 112
                                                            << 3
                                                   )
                                                   ^ 93
                                             )
                                             << 13
                                    )
                                    - 46
                                 & 65504
                           )
                           >> 5
                        | (
                                 (
                                          (
                                                (
                                                      (
                                                               (
                                                                        (((var62 & '\ufff8') >> 3 | var62 << '\r') & 64512) >> 10
                                                                           | ((var62 & '\ufff8') >> 3 | var62 << '\r') << 6
                                                                     )
                                                                     - 112
                                                                  & 57344
                                                            )
                                                            >> 13
                                                         | (
                                                                  (((var62 & '\ufff8') >> 3 | var62 << '\r') & 64512) >> 10
                                                                     | ((var62 & '\ufff8') >> 3 | var62 << '\r') << 6
                                                               )
                                                               - 112
                                                            << 3
                                                   )
                                                   ^ 93
                                             )
                                             & 65528
                                       )
                                       >> 3
                                    | (
                                          (
                                                (
                                                         (
                                                                  (((var62 & '\ufff8') >> 3 | var62 << '\r') & 64512) >> 10
                                                                     | ((var62 & '\ufff8') >> 3 | var62 << '\r') << 6
                                                               )
                                                               - 112
                                                            & 57344
                                                      )
                                                      >> 13
                                                   | (
                                                            (((var62 & '\ufff8') >> 3 | var62 << '\r') & 64512) >> 10
                                                               | ((var62 & '\ufff8') >> 3 | var62 << '\r') << 6
                                                         )
                                                         - 112
                                                      << 3
                                             )
                                             ^ 93
                                       )
                                       << 13
                              )
                              - 46
                           << 11
                  )
                  ^ 160
                  ^ 156
            );
            var19.setCharAt(
               var35,
               (char)(
                  (
                        (
                                 (
                                          (
                                                   (
                                                         (
                                                               (
                                                                        (
                                                                                 (((var62 & '\ufff8') >> 3 | var62 << '\r') & 64512) >> 10
                                                                                    | ((var62 & '\ufff8') >> 3 | var62 << '\r') << 6
                                                                              )
                                                                              - 112
                                                                           & 57344
                                                                     )
                                                                     >> 13
                                                                  | (
                                                                           (((var62 & '\ufff8') >> 3 | var62 << '\r') & 64512) >> 10
                                                                              | ((var62 & '\ufff8') >> 3 | var62 << '\r') << 6
                                                                        )
                                                                        - 112
                                                                     << 3
                                                            )
                                                            ^ 93
                                                      )
                                                      & 65528
                                                )
                                                >> 3
                                             | (
                                                   (
                                                         (
                                                                  (
                                                                           (((var62 & '\ufff8') >> 3 | var62 << '\r') & 64512) >> 10
                                                                              | ((var62 & '\ufff8') >> 3 | var62 << '\r') << 6
                                                                        )
                                                                        - 112
                                                                     & 57344
                                                               )
                                                               >> 13
                                                            | (
                                                                     (((var62 & '\ufff8') >> 3 | var62 << '\r') & 64512) >> 10
                                                                        | ((var62 & '\ufff8') >> 3 | var62 << '\r') << 6
                                                                  )
                                                                  - 112
                                                               << 3
                                                      )
                                                      ^ 93
                                                )
                                                << 13
                                       )
                                       - 46
                                    & 65504
                              )
                              >> 5
                           | (
                                    (
                                             (
                                                   (
                                                         (
                                                                  (
                                                                           (((var62 & '\ufff8') >> 3 | var62 << '\r') & 64512) >> 10
                                                                              | ((var62 & '\ufff8') >> 3 | var62 << '\r') << 6
                                                                        )
                                                                        - 112
                                                                     & 57344
                                                               )
                                                               >> 13
                                                            | (
                                                                     (((var62 & '\ufff8') >> 3 | var62 << '\r') & 64512) >> 10
                                                                        | ((var62 & '\ufff8') >> 3 | var62 << '\r') << 6
                                                                  )
                                                                  - 112
                                                               << 3
                                                      )
                                                      ^ 93
                                                )
                                                & 65528
                                          )
                                          >> 3
                                       | (
                                             (
                                                   (
                                                            (
                                                                     (((var62 & '\ufff8') >> 3 | var62 << '\r') & 64512) >> 10
                                                                        | ((var62 & '\ufff8') >> 3 | var62 << '\r') << 6
                                                                  )
                                                                  - 112
                                                               & 57344
                                                         )
                                                         >> 13
                                                      | (
                                                               (((var62 & '\ufff8') >> 3 | var62 << '\r') & 64512) >> 10
                                                                  | ((var62 & '\ufff8') >> 3 | var62 << '\r') << 6
                                                            )
                                                            - 112
                                                         << 3
                                                )
                                                ^ 93
                                          )
                                          << 13
                                 )
                                 - 46
                              << 11
                     )
                     ^ 160
                     ^ 156
               )
            );
         }

         Class var7 = Class.forName(var19.toString(), false, Class_187.class.getClassLoader());
         switch (((var4 - 2031292626 + 52458132 + 1062340751 ^ 1386123400) + 580401294 + 240994499 - 1278230942 + 1940843221 ^ 83114989) - 268667844) {
            case 113769002:
            case 883374428:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 1007080767:
               var10000 = var0.findConstructor(var7, var6);
               break;
            case 1082397955:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            case 1849382800:
               var10000 = var0.findSpecial(var7, var5, var6, Class_187.class);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_2465[((var10 ^ 731160056 ^ 2042836751) + 2479951 + 1157641393 ^ 880284788 ^ 932365263) + 587922028 - 130851872 ^ 699566753 ^ 1938630701] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_2016(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = (var10 - 948491565 - 1398268359 + 312970152 ^ 1579213798) + 355431622 + 1517168360 - 1110812097 - 135893009 + 1137838718;
      MethodHandle var10000 = field_2465[(var10 - 948491565 - 1398268359 + 312970152 ^ 1579213798)
            + 355431622
            + 1517168360
            - 1110812097
            - 135893009
            + 1137838718
         ^ 341978715];
      if (field_2465[var10001 ^ 341978715] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = 1989860739 << -2019086812 ^ 1773000752; var24 < var14.length(); var24 += (1809952981 >>> 1809952981 | 0) & -1006864351) {
            int var43 = var14.charAt(var24);
            int var10004 = (var43 & 65534) >> 1;
            int var44 = (var43 & 65534) >> 1 | var43 << 15;
            int var80 = (((var43 & 65534) >> 1 | var43 << 15) & 65535) >> 0;
            var43 = (((var10004 | var43 << 15) & 65535) >> 0 | ((var43 & 65534) >> 1 | var43 << 15) << 16) + 195 - 100;
            var10004 = ((var80 | var44 << 16) + 195 - 100 & 61440) >> 12;
            int var46 = ((((var80 | var44 << 16) + 195 - 100 & 61440) >> 12 | var43 << 4) - 76 ^ 184) - 196;
            int var82 = (((((var80 | var44 << 16) + 195 - 100 & 61440) >> 12 | var43 << 4) - 76 ^ 184) - 196 & 65534) >> 1;
            char var47 = (char)(
               (
                     (((var10004 | var43 << 4) - 76 ^ 184) - 196 & 65534) >> 1
                        | ((((var80 | var44 << 16) + 195 - 100 & 61440) >> 12 | var43 << 4) - 76 ^ 184) - 196 << 15
                  )
                  - 183
            );
            var14.setCharAt(var24, (char)((var82 | var46 << 15) - 183));
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = -1383475884 ^ 2053607040 ^ -672244780; var30 < var17.length(); var30 += -831255964 & -831255964 ^ -831255963) {
            int var52 = (var17.charAt(var30) ^ 'K') + 80;
            char var55 = (char)(
               (
                     ((((((var52 & 32768) >> 15 | var52 << 1) ^ 62) - 185 & 65534) >> 1 | (((var52 & 32768) >> 15 | var52 << 1) ^ 62) - 185 << 15) + 99 & 65520)
                           >> 4
                        | (((((var52 & 32768) >> 15 | var52 << 1) ^ 62) - 185 & 65534) >> 1 | (((var52 & 32768) >> 15 | var52 << 1) ^ 62) - 185 << 15) + 99
                           << 12
                  )
                  ^ 57
                  ^ 205
            );
            var17.setCharAt(
               var30,
               (char)(
                  (
                        (
                                 (((((var52 & 32768) >> 15 | var52 << 1) ^ 62) - 185 & 65534) >> 1 | (((var52 & 32768) >> 15 | var52 << 1) ^ 62) - 185 << 15)
                                       + 99
                                    & 65520
                              )
                              >> 4
                           | (((((var52 & 32768) >> 15 | var52 << 1) ^ 62) - 185 & 65534) >> 1 | (((var52 & 32768) >> 15 | var52 << 1) ^ 62) - 185 << 15) + 99
                              << 12
                     )
                     ^ 57
                     ^ 205
               )
            );
         }

         Class var6 = Class.forName(var17.toString(), false, Class_187.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = (380522195 | -1173074870 | 0) & 4194304; var36 < var20.length(); var36 += (-1125167130 & -1125167130 | 1) & 16785409) {
            char var60 = var20.charAt(var36);
            int var86 = (var60 & '￼') >> 2;
            int var61 = ((var60 & '￼') >> 2 | var60 << 14) - 75 + 245 + 164 - 47;
            int var87 = (((var60 & '￼') >> 2 | var60 << 14) - 75 + 245 + 164 - 47 & 65534) >> 1;
            var60 = (char)(
               (((var86 | var60 << 14) - 75 + 245 + 164 - 47 & 65534) >> 1 | ((var60 & '￼') >> 2 | var60 << 14) - 75 + 245 + 164 - 47 << 15)
                  + 126
                  + 243
                  + 87
                  + 220
            );
            var20.setCharAt(var36, (char)((var87 | var61 << 15) + 126 + 243 + 87 + 220));
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_187.class.getClassLoader()).returnType();
         switch ((((var4 + 625816135 + 291018053 ^ 401378383) - 1679206256 ^ 1508187505) - 1433863067 + 1488301655 ^ 632593122) - 1409061988 - 53896733) {
            case 961596455:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            case 1735303071:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            case 1845849353:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            case 2099093934:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_2465[(var10 - 948491565 - 1398268359 + 312970152 ^ 1579213798) + 355431622 + 1517168360 - 1110812097 - 135893009 + 1137838718 ^ 341978715] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
