import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;
import net.minecraft.class_11905;
import net.minecraft.class_11908;
import net.minecraft.class_11909;

public class Class_24 extends Class_281 {
   // $VF: renamed from: mza Class_168
   public Class_168 field_2537;
   // $VF: renamed from: st Class_369
   public Class_369 field_2538;
   // $VF: renamed from: idx java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_2540 = new MethodHandle[84];

   public Class_24(Class_377 var1, Class_168 var2) {
      this.field_2539 = var1;
      super(0<"JNT",-1537108594,"㶇㳧㷗","ｄｈﾔL￨|￨＠\u0014￨\u001c@＠\ufff0t,H\u001c@ｐ","훑雜",-204431401>(var2));
      this.field_2537 = var2;
      this.field_2538 = (Class_369)0<"JNT",-1561585853,"㥧㳗㴇㳗㷧㨇","ｄﾔL￨|￨＠\u0014￨\u001c@＠\ufff0t,H\u001c@ｐ\uffc8ｈ￼","四훒",-204431399>(
         0<"JNT",-1537108594,"㳷㳷","ｄｈﾔL￨|￨＠\u0014￨\u001c@＠\ufff0t,H\u001c@ｐ","훑雜",-204431402>(var2), 200
      );
   }

   // $VF: renamed from: rvj () int
   @Override
   public int method_2006() {
      double var1 = 0<"JNT",-1537108594,"㷗ẗ㳇","ｄﾔL￨|￨＠\u0014￨\u001c@＠\ufff0t,H\u001c@ｐｈﾴ","ᛜ㛛",-204431403>(
         1<"JNT",654839615,"）\ufeff\ufefe","斦曆","龈龢鿠鸚鹌龾",954806114>(),
         0<"JNT",-1537108594,"㷧㱧","ｄｈﾔL￨|￨＠\u0014￨\u001c@＠\ufff0t,H\u001c@ｐ","四훒",-204431406>(1<"JNT",619479023,"＇缈","摆攆","龈龢鿠鹆鸮龾",954806115>(this))
      );
      return (int)0<"JNT",-1766895272,"ẇặṇ","ｄﾴﾴﾴｈﾴ","雜囜훑",-204431408>(
         var1 + 80.0,
         600.0,
         (double)(
            0<"JNT",-1537108594,"㴗㶗㷧㴧㴷㳧‷㧧㧧㨧㧗","ｄｈ\uffc8","㛜ᛑ\uf6dc㛔ᛜ雑㛜ᛑ훒뛜雒㛑\uf6dc㛔훒\uf6d1雒훜훜囒雔盔\uf6d4雔",-204431407>(
                  0<"JNT",-1537108594,"㴗㶗㷧㴧㴷㳧‷㩇㩇㪇㨧㩷","ｄｈﾔ\u001c8t＠\u0018H\u001c80,￨<t＠0\u0014￨pp￠ＨＤｴＨｐ","㛜ᛑ\uf6dc㛔ᛜ雑㛜ᛑ훒뛜雒㛑\uf6dc㛔훒\uf6d1雒훜훜囒훔雔盔",-204431410>(
                     1<"JNT",619479023,"缄缇","曦斦暦","龈龢鿠鸜鸪鹐鿖鸚鸢鸜鸪鸮鹔鸲鸬鹐鿖鸮鸠鸲鹎鹎鸶鿎鿒龸龾",954806135>(1<"JNT",619479023,"缆缊","摆攆","龈龢鿠鹆鸚鹊龾",954806134>(this))
                  )
               )
               - 100
         )
      );
   }

   // $VF: renamed from: hc () int
   @Override
   public int method_2007() {
      return 120;
   }

   // $VF: renamed from: pn (RenderEngine_216, int, int, int, int, int, int, float) void
   @Override
   public void method_2010(RenderEngine_216 var1, int var2, int var3, int var4, int var5, int var6, int var7, float var8) {
      int var18 = -412312123;
      int var9 = var2 + 20;
      int var10 = var3 + 19;
      int var11 = var4 - 40;
      byte var12 = 30;
      0<"JNT",-1537108594,"㴇ẇ","ｄﾔ\u0018|ｐﾴﾴﾴﾴｈ￼","四훒",-204431306>(
         1<"JNT",619479023,"＇缈","摆攆","龈龢鿠鹆鸮龾",954805807>(this), var1, (double)var9, (double)var10, (double)var11, (double)var12
      );
      int var13 = 1<"JNT",619479023,"缂＂＆缀","摆攆","龈龢鿢",954805793>(this) + 0<"JNT",-1537108594,"㴧㵷","ｄｈ\uffc8","뛒监",-204431304>(this) - 30;
      byte var14 = 80;
      byte var15 = 25;
      int var16 = 1<"JNT",619479023,"缃缄缀","摆攆","龈龢鿢",954806147>(this) + 0<"JNT",-1537108594,"ṇẇ㳇","ｄｈ\uffc8","뛒监",-204431182>(this) - var14 - 20;
      int var17 = var16 - var14 - 10;
      Class_24 var10000 = this;
      RenderEngine_216 var10001 = var1;
      int var10002 = (-931074931 + -931074931 | 0) & 605430341;
      StringBuilder var10003 = (StringBuilder)0<"JNT",-1561585853,"㥧㳗㴇㳗㷧㨇","ｄﾔL￨|￨＠\u0014￨\u001c@＠\ufff0t,H\u001c@ｐｈ￼","뛑雒㛛雒㛔\uf6d1雒㛜囑㛔훐\uf6dc뛜雑㛜囑뛖ᛛ雑\uf6d1\uf6d2ᛑ뛜",-204431307>(
         "Ͼ⟾秾忾"
      );

      label41:
      while (true) {
         var18 = (1181404343 >>> 1181404343 | 1625091394) & -285348014;

         while (true) {
            label36: {
               StringBuilder var23;
               switch ((var18 + 1238117388 ^ 2080552415) - 1870980174 - 1742846691 - 1391182992 - 1582831329) {
                  case -1237488652:
                     var23 = var10003;
                     if (var10002 < (-478310445 - (1850513232 ^ 1850513232) ^ -478310443)) {
                        int var41 = 0<"JNT",-1537108594,"㵷㴧㵗ṇὗ㷧","ｄ\uffc8ｈﾰ","뛑雒㛛雒㛔\uf6d1雒㛜囑㛔훐\uf6dc뛜雑㛜囑뛖ᛛ雑\uf6d1\uf6d2ᛑ뛜",-204431389>(var10003, var10002)
                           + 'p'
                           - 241;
                        int var50 = (var41 & 65532) >> 2;
                        int var42 = ((var41 & 65532) >> 2 | var41 << 14) - 58;
                        int var51 = (((var41 & 65532) >> 2 | var41 << 14) - 58 & 32768) >> 15;
                        char var43 = (char)(((var50 | var41 << 14) - 58 & 32768) >> 15 | ((var41 & 65532) >> 2 | var41 << 14) - 58 << 1);
                        0<"JNT",-1537108594,"ṷ㶗㷧ί㴧㵗ṇὗ㷧","ｄ\uffc8ﾰｈ￼","뛑雒㛛雒㛔\uf6d1雒㛜囑㛔훐\uf6dc뛜雑㛜囑뛖ᛛ雑\uf6d1\uf6d2ᛑ뛜",-204431390>(
                           var10003, var10002, (char)(var51 | var42 << 1)
                        );
                        var10002 += 1385807388 ^ 1385807389;
                        break label36;
                     }

                     var18 = -429244099 >> -1473968643 ^ -1541650557;
                     break;
                  case 1308701167:
                  default:
                     var23 = var10003;
                     if (var10002 < (1044194434 >> -1021488340 ^ 254934)) {
                        char var34 = 0<"JNT",-1537108594,"㵷㴧㵗ṇὗ㷧","ｄ\uffc8ｈﾰ","뛑雒㛛雒㛔\uf6d1雒㛜囑㛔훐\uf6dc뛜雑㛜囑뛖ᛛ雑\uf6d1\uf6d2ᛑ뛜",-204431387>(var10003, var10002);
                        char var35 = (char)((((var34 & '︀') >> 9 | var34 << 7) ^ 48 ^ 126) + 166 + 94);
                        0<"JNT",-1537108594,"ṷ㶗㷧ί㴧㵗ṇὗ㷧","ｄ\uffc8ﾰｈ￼","뛑雒㛛雒㛔\uf6d1雒㛜囑㛔훐\uf6dc뛜雑㛜囑뛖ᛛ雑\uf6d1\uf6d2ᛑ뛜",-204431388>(
                           var10003, var10002, (char)((((var34 & '︀') >> 9 | var34 << 7) ^ 48 ^ 126) + 166 + 94)
                        );
                        var10002 += (1970281795 + (353726872 ^ 1970281795) | 1) & 537424289;
                        continue label41;
                     }

                     var18 = -876794049;
               }

               switch (((var18 ^ 843212091 ^ 1370106803) - 1523970057 + 833952520 ^ 1504871012) + 518883762) {
                  case 1165203588:
                     0<"JNT",-1537108594,"ṷ㴷㵗","ｄﾔ\u0018|ｐﾔL￨|￨＠\u0014￨\u001c@＠\ufff0t,H\u001c@ｐﾔ$\u0080ｐ\uffc8\uffc8\uffc8\uffc8ｈ￼","뛒监",-204431383>(
                        var10000,
                        var10001,
                        0<"JNT",-1537108594,"㷧㴷⁷㷧ṇ㳗㴇㶷","ｄｈﾔL￨|￨＠\u0014￨\u001c@＠\ufff0t,H\u001c@ｐ","뛑雒㛛雒㛔\uf6d1雒㛜囑㛔훐\uf6dc뛜雑㛜囑뛖ᛛ雑\uf6d1\uf6d2ᛑ뛜",-204431385>(
                           var23
                        ),
                        0<"JNT",-1537108594,"㷇㶗ầ","ｄｈﾔ$\u0080ｐ","뛒监",-204431386>(this),
                        var16,
                        var13,
                        var14,
                        var15
                     );
                     var10000 = this;
                     var10001 = var1;
                     var10002 = (-1569266250 | -1569266250 | 0) & 478218313;
                     var10003 = (StringBuilder)0<"JNT",-1561585853,"㥧㳗㴇㳗㷧㨇","ｄﾔL￨|￨＠\u0014￨\u001c@＠\ufff0t,H\u001c@ｐｈ￼","뛑雒㛛雒㛔\uf6d1雒㛜囑㛔훐\uf6dc뛜雑㛜囑뛖ᛛ雑\uf6d1\uf6d2ᛑ뛜",-204431384>(
                        "ǯȫɅȯȳɁ"
                     );
                     break;
                  case 1984376137:
                  default:
                     0<"JNT",-1537108594,"ṷ㴷㵗","ｄﾔ\u0018|ｐﾔL￨|￨＠\u0014￨\u001c@＠\ufff0t,H\u001c@ｐﾔ$\u0080ｐ\uffc8\uffc8\uffc8\uffc8ｈ￼","뛒监",-204431411>(
                        var10000,
                        var10001,
                        0<"JNT",-1537108594,"㷧㴷⁷㷧ṇ㳗㴇㶷","ｄｈﾔL￨|￨＠\u0014￨\u001c@＠\ufff0t,H\u001c@ｐ","뛑雒㛛雒㛔\uf6d1雒㛜囑㛔훐\uf6dc뛜雑㛜囑뛖ᛛ雑\uf6d1\uf6d2ᛑ뛜",-204431413>(
                           var23
                        ),
                        1<"JNT",654839615,"）\ufeff\uff00","摆攆","龈龢鿠鸸鹆龾",954806268>(),
                        var17,
                        var13,
                        var14,
                        var15
                     );
                     int var21 = 0;

                     for (var24 = (StringBuilder)0<"JNT",-1561585853,"㥧㳗㴇㳗㷧㨇","ｄﾔL￨|￨＠\u0014￨\u001c@＠\ufff0t,H\u001c@ｐｈ￼","뛑雒㛛雒㛔\uf6d1雒㛜囑㛔훐\uf6dc뛜雑㛜囑뛖ᛛ雑\uf6d1\uf6d2ᛑ뛜",-204431412>(
                           "\ufe53ﻛﺧﻟﻟﶓ︧ﻟﺟﺗﻓﺧﶓﻣﻏﶓﻟﺗﻫﺧﶓﺗﻋﺣﶓﺟﻃﻏﻟﺧ"
                        );
                        var21 < ((-596813001 * 1139033777 | 30) & 90203358);
                        var21 += (-492543566 | -492543566 | 1) & 424679425
                     ) {
                        char var29 = 0<"JNT",-1537108594,"㵷㴧㵗ṇὗ㷧","ｄ\uffc8ｈﾰ","뛑雒㛛雒㛔\uf6d1雒㛜囑㛔훐\uf6dc뛜雑㛜囑뛖ᛛ雑\uf6d1\uf6d2ᛑ뛜",-204431395>(var24, var21);
                        char var32 = (char)(
                           (
                                 (((((var29 & '\ufffe') >> 1 | var29 << 15) & 65472) >> 6 | ((var29 & '\ufffe') >> 1 | var29 << 15) << 10) & 63488) >> 11
                                    | ((((var29 & '\ufffe') >> 1 | var29 << 15) & 65472) >> 6 | ((var29 & '\ufffe') >> 1 | var29 << 15) << 10) << 5
                              )
                              - 45
                              + 233
                        );
                        0<"JNT",-1537108594,"ṷ㶗㷧ί㴧㵗ṇὗ㷧","ｄ\uffc8ﾰｈ￼","뛑雒㛛雒㛔\uf6d1雒㛜囑㛔훐\uf6dc뛜雑㛜囑뛖ᛛ雑\uf6d1\uf6d2ᛑ뛜",-204431396>(
                           var24,
                           var21,
                           (char)(
                              (
                                    (((((var29 & '\ufffe') >> 1 | var29 << 15) & 65472) >> 6 | ((var29 & '\ufffe') >> 1 | var29 << 15) << 10) & 63488) >> 11
                                       | ((((var29 & '\ufffe') >> 1 | var29 << 15) & 65472) >> 6 | ((var29 & '\ufffe') >> 1 | var29 << 15) << 10) << 5
                                 )
                                 - 45
                                 + 233
                           )
                        );
                     }

                     0<"JNT",-1537108594,"㶷㴧","ｄﾔL￨|￨＠\u0014￨\u001c@＠\ufff0t,H\u001c@ｐﾴﾴﾔ$\u0080ｐｈﾴ","ᛜ㛛",-204431398>(
                        var1,
                        0<"JNT",-1537108594,"㷧㴷⁷㷧ṇ㳗㴇㶷","ｄｈﾔL￨|￨＠\u0014￨\u001c@＠\ufff0t,H\u001c@ｐ","뛑雒㛛雒㛔\uf6d1雒㛜囑㛔훐\uf6dc뛜雑㛜囑뛖ᛛ雑\uf6d1\uf6d2ᛑ뛜",-204431393>(
                           var24
                        ),
                        (double)(1<"JNT",619479023,"缃缄缀","摆攆","龈龢鿢",954806232>(this) + 20),
                        (double)(1<"JNT",619479023,"缂＂＆缀","摆攆","龈龢鿢",954806233>(this) + 0<"JNT",-1537108594,"㴧㵷","ｄｈ\uffc8","뛒监",-204431392>(this) - 20),
                        (Class_262)0<"JNT",-1561585853,"㥧㳗㴇㳗㷧㨇","ｄ\uffc8\uffc8\uffc8\uffc8ｈ￼","盜四",-204431397>(150, 150, 150, 200)
                     );
                     return;
               }
            }

            var18 = 2008458260 & 2008458260 ^ -1901100247;
         }
      }
   }

   public void method_16014(double var1, double var3) {
      0<"JNT",2036716610,"㴗㶗㷧㴧㴷㳧‷㩗㪇㪧㩗㧧","ｄﾴﾴｈ￼","雜ᛛ盜",-204431308>(this, var1, var3);
      0<"JNT",-1537108594,"ṇṷ㳗㷧","ｄｈ￼","四훒",-204431186>(1<"JNT",619479023,"＇缈","摆攆","龈龢鿠鹆鸮龾",954806167>(this));
   }

   public boolean method_25402(class_11909 var1, boolean var2) {
      int var12 = 1146164623;
      int var3 = 0<"JNT",-1537108594,"ṇầ㸧","ｄﾴｈ\uffc8","뛒监",-204431184>(
         this, 0<"JNT",-1537108594,"㵷㴷㴗ầ‷㧧㪷㧗㨧","ｄｈﾴ","㛜ᛑ\uf6dc㛔ᛜ雑㛜ᛑ훒뛜雒㛑\uf6dc㛔훒\uf6d1雒훜훜囒雔雔雓盔雓",-204431183>(var1)
      );
      int var4 = 0<"JNT",-1537108594,"ṇầ㸧","ｄﾴｈ\uffc8","뛒监",-204431190>(
         this, 0<"JNT",-1537108594,"㵷㴷㴗ầ‷㧧㪷㧗㧗","ｄｈﾴ","㛜ᛑ\uf6dc㛔ᛜ雑㛜ᛑ훒뛜雒㛑\uf6dc㛔훒\uf6d1雒훜훜囒雔雔雓盔雓",-204431189>(var1)
      );
      int var5 = 0<"JNT",-1537108594,"ṇẇ㳇","ｄｈ\uffc8","뛒监",-204431187>(this);
      int var6 = 0<"JNT",-1537108594,"㴧㵷","ｄｈ\uffc8","뛒监",-204431188>(this);
      int var7 = 1<"JNT",619479023,"缂＂＆缀","摆攆","龈龢鿢",954805791>(this) + var6 - 30;
      byte var8 = 80;
      byte var9 = 25;
      int var10 = 1<"JNT",619479023,"缃缄缀","摆攆","龈龢鿢",954805776>(this) + var5 - var8 - 20;
      int var11 = var10 - var8 - 10;
      if (0<"JNT",-1537108594,"㳧㶷㳇","ｄﾴﾴ\uffc8\uffc8\uffc8\uffc8ｈ\f","뛒监",-204431287>(this, (double)var3, (double)var4, var10, var7, var8, var9)) {
         0<"JNT",-1537108594,"㷇㳧","ｄﾔL￨|￨＠\u0014￨\u001c@＠\ufff0t,H\u001c@ｐｈ￼","훑雜",-204431292>(
            1<"JNT",619479023,"＄缋\ufefe","摆攆","龈龢鿠鸞鹒龾",954806258>(this),
            0<"JNT",-1537108594,"㷧ṇ㳗㴗","ｄｈﾔL￨|￨＠\u0014￨\u001c@＠\ufff0t,H\u001c@ｐ","뛑雒㛛雒㛔\uf6d1雒㛜囑㛔훐\uf6dc뛜雑㛜囑",-204431291>(
               0<"JNT",-1537108594,"㷧㱧","ｄｈﾔL￨|￨＠\u0014￨\u001c@＠\ufff0t,H\u001c@ｐ","四훒",-204431294>(1<"JNT",619479023,"＇缈","摆攆","龈龢鿠鹆鸮龾",954806259>(this))
            )
         );
         0<"JNT",-1537108594,"㴗㶗㷧㴧㴷㳧‷㩗㪗㪧㪷","ｄﾔ\u001c8t＠\u0018H\u001c80,￨<t＠0\u0014￨pp￠ｴｰﾀｐｈ￼","㛜ᛑ\uf6dc㛔ᛜ雑㛜ᛑ훒뛜雒㛑\uf6dc㛔훒\uf6d1雒훜훜囒훔雔盔",-204431301>(
            1<"JNT",619479023,"缄缇","曦斦暦","龈龢鿠鸜鸪鹐鿖鸚鸢鸜鸪鸮鹔鸲鸬鹐鿖鸮鸠鸲鹎鹎鸶鿎鿒龸龾",954806264>(1<"JNT",619479023,"缆缊","摆攆","龈龢鿠鹆鸚鹊龾",954806151>(this)),
            (Class_359)1<"JNT",619479023,"\uff00\ufefe！","擆搦","龈龢鿠鸤鸲鹌鸲鿖鸠鸲鸜鸦鿖鸖鸴鸤鸪鸮鹐龾",954805786>(
               (ScreenUI_78)1<"JNT",654839615,"\uff00（＆","擆搦","龈龢鿠鸤鸲鹌鸲鿖鸠鸲鸜鸦鿖鸖鸴鸤鸪鸮鹐龾",954806265>()
            )
         );
         return true;
      } else {
         var12 = (-1340920969 ^ 2128435919 | 87067179) & -986075541;

         while (true) {
            switch ((var12 - 1447950562 - 1625547281 ^ 1041406165) + 1577658470 - 730921497 ^ 931314788) {
               case 1426995806:
                  if (0<"JNT",-1537108594,"㳧㶷㳇","ｄﾴﾴ\uffc8\uffc8\uffc8\uffc8ｈ\f","뛒监",-204431302>(this, (double)var3, (double)var4, var11, var7, var8, var9)) {
                     0<"JNT",-1537108594,"㴗㶗㷧㴧㴷㳧‷㩗㪗㪧㪷","ｄﾔ\u001c8t＠\u0018H\u001c80,￨<t＠0\u0014￨pp￠ｴｰﾀｐｈ￼","㛜ᛑ\uf6dc㛔ᛜ雑㛜ᛑ훒뛜雒㛑\uf6dc㛔훒\uf6d1雒훜훜囒훔雔盔",-204431335>(
                        1<"JNT",619479023,"缄缇","曦斦暦","龈龢鿠鸜鸪鹐鿖鸚鸢鸜鸪鸮鹔鸲鸬鹐鿖鸮鸠鸲鹎鹎鸶鿎鿒龸龾",954806222>(1<"JNT",619479023,"缆缊","摆攆","龈龢鿠鹆鸚鹊龾",954806221>(this)),
                        (Class_359)1<"JNT",619479023,"\uff00\ufefe！","擆搦","龈龢鿠鸤鸲鹌鸲鿖鸠鸲鸜鸦鿖鸖鸴鸤鸪鸮鹐龾",954806208>(
                           (ScreenUI_78)1<"JNT",654839615,"\uff00（＆","擆搦","龈龢鿠鸤鸲鹌鸲鿖鸠鸲鸜鸦鿖鸖鸴鸤鸪鸮鹐龾",954806223>()
                        )
                     );
                     return true;
                  }

                  var12 = -697602106;
                  break;
               case 1679918647:
               default:
                  return 0<"JNT",2036716610,"㴗㶗㷧㴧㴷㳧‷㩇㪗㧧㪧㩇","ｄﾔ\u001c8t＠\u0018H\u001c80,￨<t＠0\u0014￨pp￠ＨＨﾈＤﾈｐ\fｈ\f","雜ᛛ盜",-204431336>(this, var1, var2);
            }
         }
      }
   }

   public boolean method_25404(class_11908 var1) {
      int var2 = -688720124;
      if (0<"JNT",-1537108594,"㴗㶗㷧㴧㴷㳧‷㪷㧧㩇㩇㨧","ｄｈ\uffc8","㛜ᛑ\uf6dc㛔ᛜ雑㛜ᛑ훒뛜雒㛑\uf6dc㛔훒\uf6d1雒훜훜囒雔雔雓盔盓",-204431341>(var1) != 256
         && 0<"JNT",-1537108594,"㴗㶗㷧㴧㴷㳧‷㪷㧧㩇㩇㨧","ｄｈ\uffc8","㛜ᛑ\uf6dc㛔ᛜ雑㛜ᛑ훒뛜雒㛑\uf6dc㛔훒\uf6d1雒훜훜囒雔雔雓盔盓",-204431342>(var1) != 257) {
         var2 = 333624918;
      } else {
         var2 = 1327648035;
      }

      switch (((var2 ^ 1504440161) + 1970596649 ^ 134448595) - 141415604 + 5487691 + 95810374) {
         case -2120686699:
         default:
            0<"JNT",-1537108594,"㷇㳧","ｄﾔL￨|￨＠\u0014￨\u001c@＠\ufff0t,H\u001c@ｐｈ￼","훑雜",-204431349>(
               1<"JNT",619479023,"＄缋\ufefe","摆攆","龈龢鿠鸞鹒龾",954805815>(this),
               0<"JNT",-1537108594,"㷧ṇ㳗㴗","ｄｈﾔL￨|￨＠\u0014￨\u001c@＠\ufff0t,H\u001c@ｐ","뛑雒㛛雒㛔\uf6d1雒㛜囑㛔훐\uf6dc뛜雑㛜囑",-204431344>(
                  0<"JNT",-1537108594,"㷧㱧","ｄｈﾔL￨|￨＠\u0014￨\u001c@＠\ufff0t,H\u001c@ｐ","四훒",-204431343>(1<"JNT",619479023,"＇缈","摆攆","龈龢鿠鹆鸮龾",954805800>(this))
               )
            );
            0<"JNT",-1537108594,"㴗㶗㷧㴧㴷㳧‷㩗㪗㪧㪷","ｄﾔ\u001c8t＠\u0018H\u001c80,￨<t＠0\u0014￨pp￠ｴｰﾀｐｈ￼","㛜ᛑ\uf6dc㛔ᛜ雑㛜ᛑ훒뛜雒㛑\uf6dc㛔훒\uf6d1雒훜훜囒훔雔盔",-204431322>(
               1<"JNT",619479023,"缄缇","曦斦暦","龈龢鿠鸜鸪鹐鿖鸚鸢鸜鸪鸮鹔鸲鸬鹐鿖鸮鸠鸲鹎鹎鸶鿎鿒龸龾",954806205>(1<"JNT",619479023,"缆缊","摆攆","龈龢鿠鹆鸚鹊龾",954806204>(this)),
               (Class_359)1<"JNT",619479023,"\uff00\ufefe！","擆搦","龈龢鿠鸤鸲鹌鸲鿖鸠鸲鸜鸦鿖鸖鸴鸤鸪鸮鹐龾",954806207>(
                  (ScreenUI_78)1<"JNT",654839615,"\uff00（＆","擆搦","龈龢鿠鸤鸲鹌鸲鿖鸠鸲鸜鸦鿖鸖鸴鸤鸪鸮鹐龾",954806206>()
               )
            );
            return true;
         case -1252418416:
            return 0<"JNT",-1537108594,"㳧㶷","ｄﾔ\u001c8t＠\u0018H\u001c80,￨<t＠0\u0014￨pp￠ＨＨﾈＤﾄｐｈ\f","四훒",-204431340>(
               1<"JNT",619479023,"＇缈","摆攆","龈龢鿠鹆鸮龾",954805813>(this), var1
            );
      }
   }

   public boolean method_25400(class_11905 var1) {
      return 0<"JNT",-1537108594,"ặ㷧㴷","ｄﾔ\u001c8t＠\u0018H\u001c80,￨<t＠0\u0014￨pp￠ＨＨﾈＤｸｐｈ\f","四훒",-204431320>(
         1<"JNT",619479023,"＇缈","摆攆","龈龢鿠鹆鸮龾",954806193>(this), var1
      );
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_2015(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 + 653126007 - 1996319590 + 1667581243 ^ 311023038) - 255817782 + 770011911 - 1950795963 ^ 1651728933) + 2060410016;
      MethodHandle var10000 = field_2540[((var10 + 653126007 - 1996319590 + 1667581243 ^ 311023038) - 255817782 + 770011911 - 1950795963 ^ 1651728933)
            + 2060410016
         ^ 491579190];
      if (field_2540[var10001 ^ 491579190] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = (877631340 >>> 1286852365 | 0) & 597429635; var23 < var13.length(); var23 += (-1160149839 * -1072985347 | 1) & 23408897) {
            int var42 = var13.charAt(var23) + ']' + 28;
            int var10004 = (var42 & 65504) >> 5;
            int var43 = ((var42 & 65504) >> 5 | var42 << 11) - 246 ^ 125;
            int var87 = ((((var42 & 65504) >> 5 | var42 << 11) - 246 ^ 125) & 65408) >> 7;
            var42 = (((var10004 | var42 << 11) - 246 ^ 125) & 65408) >> 7 | (((var42 & 65504) >> 5 | var42 << 11) - 246 ^ 125) << 9;
            var10004 = ((var87 | var43 << 9) & 57344) >> 13;
            int var45 = ((var87 | var43 << 9) & 57344) >> 13 | var42 << 3;
            int var89 = ((((var87 | var43 << 9) & 57344) >> 13 | var42 << 3) & 63488) >> 11;
            char var46 = (char)((((var10004 | var42 << 3) & 63488) >> 11 | (((var87 | var43 << 9) & 57344) >> 13 | var42 << 3) << 5) - 217 ^ 83);
            var13.setCharAt(var23, (char)((var89 | var45 << 5) - 217 ^ 83));
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = -448186681 << -448186681 ^ -1533320320; var29 < var16.length(); var29 += (-1537353579 >>> -288785254 | 1) & 405018897) {
            int var51 = var16.charAt(var29) + '~' + 115 ^ 33;
            int var90 = (var51 & 65532) >> 2;
            int var52 = ((var51 & 65532) >> 2 | var51 << 14) + 51;
            int var91 = (((var51 & 65532) >> 2 | var51 << 14) + 51 & 32768) >> 15;
            var51 = ((var90 | var51 << 14) + 51 & 32768) >> 15 | ((var51 & 65532) >> 2 | var51 << 14) + 51 << 1;
            var90 = ((var91 | var52 << 1) & 0) >> 16;
            int var54 = ((var91 | var52 << 1) & 0) >> 16 | var51 << 0;
            int var93 = ((((var91 | var52 << 1) & 0) >> 16 | var51 << 0) & 65534) >> 1;
            char var55 = (char)((((var90 | var51 << 0) & 65534) >> 1 | (((var91 | var52 << 1) & 0) >> 16 | var51 << 0) << 15) - 180 + 164);
            var16.setCharAt(var29, (char)((var93 | var54 << 15) - 180 + 164));
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_24.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = (1424439236 >>> 208396578 | 0) & -905960950; var35 < var19.length(); var35 += (1141187486 + -103319520 | 1) & -1071513535) {
            char var60 = var19.charAt(var35);
            char var65 = (char)(
               (
                        (
                              (
                                       (
                                                (
                                                         (
                                                                  ((((var60 & 0) >> 16 | var60 << 0) - 63 ^ 165) & 0) >> 16
                                                                     | (((var60 & 0) >> 16 | var60 << 0) - 63 ^ 165) << 0
                                                               )
                                                               - 23
                                                               - 21
                                                            & 65024
                                                      )
                                                      >> 9
                                                   | (
                                                            ((((var60 & 0) >> 16 | var60 << 0) - 63 ^ 165) & 0) >> 16
                                                               | (((var60 & 0) >> 16 | var60 << 0) - 63 ^ 165) << 0
                                                         )
                                                         - 23
                                                         - 21
                                                      << 7
                                             )
                                             + 197
                                          & 65534
                                    )
                                    >> 1
                                 | (
                                          (
                                                   (
                                                            ((((var60 & 0) >> 16 | var60 << 0) - 63 ^ 165) & 0) >> 16
                                                               | (((var60 & 0) >> 16 | var60 << 0) - 63 ^ 165) << 0
                                                         )
                                                         - 23
                                                         - 21
                                                      & 65024
                                                )
                                                >> 9
                                             | (((((var60 & 0) >> 16 | var60 << 0) - 63 ^ 165) & 0) >> 16 | (((var60 & 0) >> 16 | var60 << 0) - 63 ^ 165) << 0)
                                                   - 23
                                                   - 21
                                                << 7
                                       )
                                       + 197
                                    << 15
                           )
                           & 65528
                     )
                     >> 3
                  | (
                        (
                                 (
                                          (
                                                   (
                                                            ((((var60 & 0) >> 16 | var60 << 0) - 63 ^ 165) & 0) >> 16
                                                               | (((var60 & 0) >> 16 | var60 << 0) - 63 ^ 165) << 0
                                                         )
                                                         - 23
                                                         - 21
                                                      & 65024
                                                )
                                                >> 9
                                             | (((((var60 & 0) >> 16 | var60 << 0) - 63 ^ 165) & 0) >> 16 | (((var60 & 0) >> 16 | var60 << 0) - 63 ^ 165) << 0)
                                                   - 23
                                                   - 21
                                                << 7
                                       )
                                       + 197
                                    & 65534
                              )
                              >> 1
                           | (
                                    (
                                             (((((var60 & 0) >> 16 | var60 << 0) - 63 ^ 165) & 0) >> 16 | (((var60 & 0) >> 16 | var60 << 0) - 63 ^ 165) << 0)
                                                   - 23
                                                   - 21
                                                & 65024
                                          )
                                          >> 9
                                       | (((((var60 & 0) >> 16 | var60 << 0) - 63 ^ 165) & 0) >> 16 | (((var60 & 0) >> 16 | var60 << 0) - 63 ^ 165) << 0)
                                             - 23
                                             - 21
                                          << 7
                                 )
                                 + 197
                              << 15
                     )
                     << 13
            );
            var19.setCharAt(
               var35,
               (char)(
                  (
                           (
                                 (
                                          (
                                                   (
                                                            (
                                                                     ((((var60 & 0) >> 16 | var60 << 0) - 63 ^ 165) & 0) >> 16
                                                                        | (((var60 & 0) >> 16 | var60 << 0) - 63 ^ 165) << 0
                                                                  )
                                                                  - 23
                                                                  - 21
                                                               & 65024
                                                         )
                                                         >> 9
                                                      | (
                                                               ((((var60 & 0) >> 16 | var60 << 0) - 63 ^ 165) & 0) >> 16
                                                                  | (((var60 & 0) >> 16 | var60 << 0) - 63 ^ 165) << 0
                                                            )
                                                            - 23
                                                            - 21
                                                         << 7
                                                )
                                                + 197
                                             & 65534
                                       )
                                       >> 1
                                    | (
                                             (
                                                      (
                                                               ((((var60 & 0) >> 16 | var60 << 0) - 63 ^ 165) & 0) >> 16
                                                                  | (((var60 & 0) >> 16 | var60 << 0) - 63 ^ 165) << 0
                                                            )
                                                            - 23
                                                            - 21
                                                         & 65024
                                                   )
                                                   >> 9
                                                | (
                                                         ((((var60 & 0) >> 16 | var60 << 0) - 63 ^ 165) & 0) >> 16
                                                            | (((var60 & 0) >> 16 | var60 << 0) - 63 ^ 165) << 0
                                                      )
                                                      - 23
                                                      - 21
                                                   << 7
                                          )
                                          + 197
                                       << 15
                              )
                              & 65528
                        )
                        >> 3
                     | (
                           (
                                    (
                                             (
                                                      (
                                                               ((((var60 & 0) >> 16 | var60 << 0) - 63 ^ 165) & 0) >> 16
                                                                  | (((var60 & 0) >> 16 | var60 << 0) - 63 ^ 165) << 0
                                                            )
                                                            - 23
                                                            - 21
                                                         & 65024
                                                   )
                                                   >> 9
                                                | (
                                                         ((((var60 & 0) >> 16 | var60 << 0) - 63 ^ 165) & 0) >> 16
                                                            | (((var60 & 0) >> 16 | var60 << 0) - 63 ^ 165) << 0
                                                      )
                                                      - 23
                                                      - 21
                                                   << 7
                                          )
                                          + 197
                                       & 65534
                                 )
                                 >> 1
                              | (
                                       (
                                                (((((var60 & 0) >> 16 | var60 << 0) - 63 ^ 165) & 0) >> 16 | (((var60 & 0) >> 16 | var60 << 0) - 63 ^ 165) << 0)
                                                      - 23
                                                      - 21
                                                   & 65024
                                             )
                                             >> 9
                                          | (((((var60 & 0) >> 16 | var60 << 0) - 63 ^ 165) & 0) >> 16 | (((var60 & 0) >> 16 | var60 << 0) - 63 ^ 165) << 0)
                                                - 23
                                                - 21
                                             << 7
                                    )
                                    + 197
                                 << 15
                        )
                        << 13
               )
            );
         }

         Class var7 = Class.forName(var19.toString(), false, Class_24.class.getClassLoader());
         switch (((var4 + 363842203 - 2117560731 ^ 1954308326) + 516852166 - 732693126 ^ 1808458821 ^ 617046075) + 1145567940 + 1551906018 + 1645230753) {
            case 88885191:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            case 278791197:
            case 943759643:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 286229986:
               var10000 = var0.findConstructor(var7, var6);
               break;
            case 463586017:
               var10000 = var0.findSpecial(var7, var5, var6, Class_24.class);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_2540[((var10 + 653126007 - 1996319590 + 1667581243 ^ 311023038) - 255817782 + 770011911 - 1950795963 ^ 1651728933) + 2060410016 ^ 491579190] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_2016(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = (((var10 ^ 655644986) + 1473839700 ^ 1137681438 ^ 1747374922) + 2117425910 ^ 1308852365) + 1138449518 + 1053870970 ^ 689285043;
      MethodHandle var10000 = field_2540[(
            (((var10 ^ 655644986) + 1473839700 ^ 1137681438 ^ 1747374922) + 2117425910 ^ 1308852365) + 1138449518 + 1053870970 ^ 689285043
         )
         - 1043445237];
      if (field_2540[var10001 - 1043445237] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = 86100762 + 547747712 ^ 633848474; var24 < var14.length(); var24 += -105320592 >>> 1227734367 ^ 0) {
            int var43 = var14.charAt(var24) - 198;
            int var10004 = (var43 & 65504) >> 5;
            int var44 = (var43 & 65504) >> 5 | var43 << 11;
            int var98 = (((var43 & 65504) >> 5 | var43 << 11) & 63488) >> 11;
            var43 = (((var10004 | var43 << 11) & 63488) >> 11 | ((var43 & 65504) >> 5 | var43 << 11) << 5) + 231;
            var10004 = ((var98 | var44 << 5) + 231 & 65504) >> 5;
            int var46 = ((var98 | var44 << 5) + 231 & 65504) >> 5 | var43 << 11;
            int var100 = ((((var98 | var44 << 5) + 231 & 65504) >> 5 | var43 << 11) & 61440) >> 12;
            var43 = (((var10004 | var43 << 11) & 61440) >> 12 | (((var98 | var44 << 5) + 231 & 65504) >> 5 | var43 << 11) << 4) + 87;
            var10004 = ((var100 | var46 << 4) + 87 & 49152) >> 14;
            int var48 = (((var100 | var46 << 4) + 87 & 49152) >> 14 | var43 << 2) + 198;
            int var102 = ((((var100 | var46 << 4) + 87 & 49152) >> 14 | var43 << 2) + 198 & 65535) >> 0;
            char var49 = (char)(((var10004 | var43 << 2) + 198 & 65535) >> 0 | (((var100 | var46 << 4) + 87 & 49152) >> 14 | var43 << 2) + 198 << 16);
            var14.setCharAt(var24, (char)(var102 | var48 << 16));
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = -54365480 - 1795494741 ^ -1849860221; var30 < var17.length(); var30 += (-1380377750 + 1706619119 | 1) & 1141666211) {
            int var54 = var17.charAt(var30);
            int var103 = (var54 & 65472) >> 6;
            int var55 = (var54 & 65472) >> 6 | var54 << 10;
            int var104 = (((var54 & 65472) >> 6 | var54 << 10) & 65535) >> 0;
            var54 = ((var103 | var54 << 10) & 65535) >> 0 | ((var54 & 65472) >> 6 | var54 << 10) << 16;
            var103 = ((var104 | var55 << 16) & 65532) >> 2;
            int var57 = ((var104 | var55 << 16) & 65532) >> 2 | var54 << 14;
            int var106 = ((((var104 | var55 << 16) & 65532) >> 2 | var54 << 14) & 65520) >> 4;
            var54 = ((var103 | var54 << 14) & 65520) >> 4 | (((var104 | var55 << 16) & 65532) >> 2 | var54 << 14) << 12;
            var103 = ((var106 | var57 << 12) & 63488) >> 11;
            int var59 = ((var106 | var57 << 12) & 63488) >> 11 | var54 << 5;
            int var108 = ((((var106 | var57 << 12) & 63488) >> 11 | var54 << 5) & 65532) >> 2;
            var54 = (((var103 | var54 << 5) & 65532) >> 2 | (((var106 | var57 << 12) & 63488) >> 11 | var54 << 5) << 14) - 236;
            var103 = ((var108 | var59 << 14) - 236 & 65472) >> 6;
            int var61 = (((var108 | var59 << 14) - 236 & 65472) >> 6 | var54 << 10) ^ 9;
            int var110 = (((((var108 | var59 << 14) - 236 & 65472) >> 6 | var54 << 10) ^ 9) & 65472) >> 6;
            char var62 = (char)((((var103 | var54 << 10) ^ 9) & 65472) >> 6 | ((((var108 | var59 << 14) - 236 & 65472) >> 6 | var54 << 10) ^ 9) << 10);
            var17.setCharAt(var30, (char)(var110 | var61 << 10));
         }

         Class var6 = Class.forName(var17.toString(), false, Class_24.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = (-1087167409 * (-1350996104 >>> 762803286) | 0) & 3506220; var36 < var20.length(); var36 += (-2130574057 >> -430742670 | 1) & 6583) {
            int var67 = var20.charAt(var36);
            int var111 = (var67 & 57344) >> 13;
            int var68 = (var67 & 57344) >> 13 | var67 << 3;
            int var112 = (((var67 & 57344) >> 13 | var67 << 3) & 32768) >> 15;
            var67 = ((((var111 | var67 << 3) & 32768) >> 15 | ((var67 & 57344) >> 13 | var67 << 3) << 1) + 119 ^ 227) - 140 + 200;
            var111 = (((var112 | var68 << 1) + 119 ^ 227) - 140 + 200 & 65024) >> 9;
            int var70 = (((var112 | var68 << 1) + 119 ^ 227) - 140 + 200 & 65024) >> 9 | var67 << 7;
            int var114 = (((((var112 | var68 << 1) + 119 ^ 227) - 140 + 200 & 65024) >> 9 | var67 << 7) & 61440) >> 12;
            char var71 = (char)(
               ((((var111 | var67 << 7) & 61440) >> 12 | ((((var112 | var68 << 1) + 119 ^ 227) - 140 + 200 & 65024) >> 9 | var67 << 7) << 4) ^ 137) + 207
            );
            var20.setCharAt(var36, (char)(((var114 | var70 << 4) ^ 137) + 207));
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_24.class.getClassLoader()).returnType();
         switch (((var4 - 1572942534 + 963390259 + 912819595 + 1659219379 + 690095463 ^ 749223784 ^ 1584446664) - 1862734882 ^ 1413454638) + 1560383472) {
            case 854567213:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            case 1093993605:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            case 1944655169:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            case 2043462865:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_2540[((((var10 ^ 655644986) + 1473839700 ^ 1137681438 ^ 1747374922) + 2117425910 ^ 1308852365) + 1138449518 + 1053870970 ^ 689285043)
            - 1043445237] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
