import com.google.gson.JsonElement;
import com.google.gson.JsonPrimitive;
import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;
import java.util.List;
import net.minecraft.class_1792;

public class Class_210 extends Class_271 {
   // $VF: renamed from: hgz net.minecraft.class_1792
   public class_1792 field_910;
   // $VF: renamed from: hpc java.util.List
   public List field_911;
   // $VF: renamed from: lp net.minecraft.class_1792
   public class_1792 field_912;
   // $VF: renamed from: gry java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_913 = new MethodHandle[(-740341468 >> -740341468 | 4) & 12716052];

   public Class_210(String var1, class_1792 var2) {
      this(var1, var2, null);
   }

   public Class_210(String var1, class_1792 var2, List var3) {
      super(var1);
      this.field_912 = var2;
      this.field_910 = var2;
      this.field_911 = var3;
   }

   // $VF: renamed from: sb () java.util.List
   public List method_1012() {
      return 1<"JNT",-1603499129,"␋␡\ue408","㸻䘻","┑║⸑ᖑፑₑፑ⻑⁑‑ᕑᘑ⻑⸑ᕑῑ‑㇑",1575096730>(this);
   }

   // $VF: renamed from: lpw () net.minecraft.class_1792
   public class_1792 method_1013() {
      return 1<"JNT",-1603499129,"␠␡","㸻䘻","┑║⸑ẑᑑ‑⻑ᙑᕑẑᑑᏑᾑፑᒑ‑⻑Ꮡᘑፑῑῑዑ⽑パㅑ⾑㇑",1575096723>(this);
   }

   // $VF: renamed from: bpr (net.minecraft.class_1792) void
   public void method_1014(class_1792 var1) {
      1<"JNT",-26909901,"␠␡","㸻䘻","┑║⸑ẑᑑ‑⻑ᙑᕑẑᑑᏑᾑፑᒑ‑⻑Ꮡᘑፑῑῑዑ⽑パㅑ⾑㇑",1575096724>(this, var1);
      0<"JNT",-1437648836,"䟌䑌䱌","ﱀ籁ﱫ","狨狈",-2118167868>(this);
   }

   // $VF: renamed from: rlg () net.minecraft.class_1792
   public class_1792 method_1015() {
      return 1<"JNT",-1603499129,"␋\ue409ꐟ","㸻䘻","┑║⸑ẑᑑ‑⻑ᙑᕑẑᑑᏑᾑፑᒑ‑⻑Ꮡᘑፑῑῑዑ⽑パㅑ⾑㇑",1575096726>(this);
   }

   // $VF: renamed from: l () void
   @Override
   public void method_926() {
      0<"JNT",-1437648836,"䓌䷌䳌","ﱀﱮ莟籣莚籼Ο籡莟籣籢莝籥ﱣ莚籼籢莞籥ΚΚ籤籽籸籹ﱽ籶籁ﱫ","狨狈",-2118167863>(
         this, 1<"JNT",-1603499129,"␋\ue409ꐟ","㸻䘻","┑║⸑ẑᑑ‑⻑ᙑᕑẑᑑᏑᾑፑᒑ‑⻑Ꮡᘑፑῑῑዑ⽑パㅑ⾑㇑",1575096703>(this)
      );
   }

   // $VF: renamed from: s () boolean
   @Override
   public boolean method_923() {
      return 1<"JNT",-1603499129,"␠␡","㸻䘻","┑║⸑ẑᑑ‑⻑ᙑᕑẑᑑᏑᾑፑᒑ‑⻑Ꮡᘑፑῑῑዑ⽑パㅑ⾑㇑",1575096705>(this)
         == 1<"JNT",-1603499129,"␋\ue409ꐟ","㸻䘻","┑║⸑ẑᑑ‑⻑ᙑᕑẑᑑᏑᾑፑᒑ‑⻑Ꮡᘑፑῑῑዑ⽑パㅑ⾑㇑",1575096706>(this);
   }

   // $VF: renamed from: r () com.google.gson.JsonElement
   @Override
   public JsonElement method_924() {
      return (JsonPrimitive)0<"JNT",1839584377,"毌䁌䋌䁌俌櫌","ﱀﱮﱡ籥莛籥籼莞籥莟籠籼籪莚莝籡莟籠籶籁ﱫ","焈狈狨绸煈狈狈煈犘煨绸煈瀈狈狸绸肸瀈狈狸胘瀸犨狨犨瀘犨灸煨",-2118167870>(
         0<"JNT",-1437648836,"俌䕌㽌俌䳌䁌䋌奌","ﱀ籁ﱮﱡ籥莛籥籼莞籥莟籠籼籪莚莝籡莟籠籶","狸煨瀘绸狨犨狸煨焈瀸焨煸瀘绸焈犘焨瀈瀈翈簸綨籸绘",-2118167885>(
            0<"JNT",1395811384,"䉌䙌俌䇌䕌䟌㵌汌淌泌泌汌","ﱀﱮﱡ籥莛籥籼莞籥莟籠籼籬ﱥﱡ籣籢莚籶籁ﱮ莟籣莚籼Ο籡莟籣籢莝籥ﱣ莚籼籢莞籥ΚΚ籤ﱽ籹ﱻﱼ籶","狸煨瀘绸狨犨狸煨焈瀸焨煸瀘绸焈犘焨瀈瀈翈籈綨簸簸",-2118167876>(
               1<"JNT",-1275264389,"ꐊ搋搊␠␊\ue40b␎搑搑\ue40d␏","䈻ḻ娻䈼㸻⸻䈻ḻᘻ刻\u0e3b∻娻䈼ᘻ㨻\u0e3b嘻嘻ػ昼渼刼嘼","┑║⸑ẑᑑ‑⻑ᙑᕑẑᑑᏑᾑፑᒑ‑⻑Ꮡᘑፑῑῑዑパㅑ⾑⾑㇑",1575096699>(),
               1<"JNT",-1603499129,"␠␡","㸻䘻","┑║⸑ẑᑑ‑⻑ᙑᕑẑᑑᏑᾑፑᒑ‑⻑Ꮡᘑፑῑῑዑ⽑パㅑ⾑㇑",1575096700>(this)
            )
         )
      );
   }

   // $VF: renamed from: vz (com.google.gson.JsonElement) void
   @Override
   public void method_925(JsonElement var1) {
      if (0<"JNT",-1437648836,"䁌佌ヌ佌䕌䋌㷌䳌䁌䉌䁌俌䁌仌䙌","ﱀ籁ﱩ","焈狈狨绸煈狈狈煈犘煨绸煈瀈狈狸绸肸瀈狈狸罨犘煨狨煨狸瀘",-2118167871>(var1)) {
         0<"JNT",-1437648836,"䓌䷌䳌","ﱀﱮ莟籣莚籼Ο籡莟籣籢莝籥ﱣ莚籼籢莞籥ΚΚ籤籽籸籹ﱽ籶籁ﱫ","狨狈",-2118167980>(
            this,
            (class_1792)0<"JNT",1395811384,"䉌䙌俌䇌䕌䟌㵌滌潌湌潌湌","ﱀﱮ莟籣莚籼Ο籡莟籣籢莝籥ﱣ莚籼籢莞籥ΚΚ籤ﱽ籹ﱻﱼ籶籁ﱮﱡ籥莛籥籼莞籥莟籠籼籬ﱥﱡ籣籢莚籶","狸煨瀘绸狨犨狸煨焈瀸焨煸瀘绸焈犘焨瀈瀈翈籈綨簸簸",-2118167979>(
               1<"JNT",-1275264389,"ꐊ搋搊␠␊\ue40b␎搑搑\ue40d␏","䈻ḻ娻䈼㸻⸻䈻ḻᘻ刻\u0e3b∻娻䈼ᘻ㨻\u0e3b嘻嘻ػ昼渼刼嘼","┑║⸑ẑᑑ‑⻑ᙑᕑẑᑑᏑᾑፑᒑ‑⻑Ꮡᘑፑῑῑዑパㅑ⾑⾑㇑",1575096713>(),
               0<"JNT",839699563,"䉌䙌俌䇌䕌䟌㵌滌淌滌湌濌","ﱀﱮﱡ籥莛籥籼莞籥莟籠籼籪莚莝籡莟籠籶籁ﱮ莟籣莚籼Ο籡莟籣籢莝籥ﱣ莚籼籢莞籥ΚΚ籤ﱽ籹ﱻﱼ籶","狸煨瀘绸狨犨狸煨焈瀸焨煸瀘绸焈犘焨瀈瀈翈簸綨籸绘",-2118167978>(
                  0<"JNT",-1437648836,"奌䙌俌㑌佌㽌俌䳌䁌䋌奌","ﱀ籁ﱮﱡ籥莛籥籼莞籥莟籠籼籪莚莝籡莟籠籶","焈狈狨绸煈狈狈煈犘煨绸煈瀈狈狸绸肸瀈狈狸罨犘煨狨煨狸瀘",-2118167977>(var1)
               )
            )
         );
      }
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_937(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 - 1268687171 + 1598596414 + 592218418 ^ 892928583) - 2023966260 + 1486067496 + 417809925 ^ 1189651596) - 1428429269;
      MethodHandle var10000 = field_913[((var10 - 1268687171 + 1598596414 + 592218418 ^ 892928583) - 2023966260 + 1486067496 + 417809925 ^ 1189651596)
         - 1428429269
         - 1802024523];
      if (field_913[var10001 - 1802024523] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = (-814608848 + 336870230 | 0) & 6829144; var23 < var13.length(); var23 += (-366091686 | 517288262) ^ -16911521) {
            int var42 = var13.charAt(var23) + 20;
            char var45 = (char)(
               (
                     (
                              (
                                    (
                                          ((((var42 & 65520) >> 4 | var42 << 12) ^ 42 ^ 191) + 129 + 120 & 65535) >> 0
                                             | (((var42 & 65520) >> 4 | var42 << 12) ^ 42 ^ 191) + 129 + 120 << 16
                                       )
                                       ^ 12
                                 )
                                 & 65528
                           )
                           >> 3
                        | (
                              (
                                    ((((var42 & 65520) >> 4 | var42 << 12) ^ 42 ^ 191) + 129 + 120 & 65535) >> 0
                                       | (((var42 & 65520) >> 4 | var42 << 12) ^ 42 ^ 191) + 129 + 120 << 16
                                 )
                                 ^ 12
                           )
                           << 13
                  )
                  ^ 217
            );
            var13.setCharAt(
               var23,
               (char)(
                  (
                        (
                                 (
                                       (
                                             ((((var42 & 65520) >> 4 | var42 << 12) ^ 42 ^ 191) + 129 + 120 & 65535) >> 0
                                                | (((var42 & 65520) >> 4 | var42 << 12) ^ 42 ^ 191) + 129 + 120 << 16
                                          )
                                          ^ 12
                                    )
                                    & 65528
                              )
                              >> 3
                           | (
                                 (
                                       ((((var42 & 65520) >> 4 | var42 << 12) ^ 42 ^ 191) + 129 + 120 & 65535) >> 0
                                          | (((var42 & 65520) >> 4 | var42 << 12) ^ 42 ^ 191) + 129 + 120 << 16
                                    )
                                    ^ 12
                              )
                              << 13
                     )
                     ^ 217
               )
            );
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = (1421587538 << 1373066885 | 0) & 671158444; var29 < var16.length(); var29 += (892789994 | 892789994 | 1) & -2000676863) {
            char var50 = var16.charAt(var29);
            char var57 = (char)(
               (
                     (
                              (
                                    (
                                             (
                                                   (
                                                            (
                                                                  (
                                                                           (
                                                                                 (
                                                                                       (
                                                                                                (
                                                                                                      ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                                         | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                                                   )
                                                                                                   & 65472
                                                                                             )
                                                                                             >> 6
                                                                                          | (
                                                                                                ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                                   | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                                             )
                                                                                             << 10
                                                                                    )
                                                                                    ^ 241
                                                                              )
                                                                              & 65472
                                                                        )
                                                                        >> 6
                                                                     | (
                                                                           (
                                                                                 (
                                                                                          (
                                                                                                ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                                   | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                                             )
                                                                                             & 65472
                                                                                       )
                                                                                       >> 6
                                                                                    | (
                                                                                          ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                             | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                                       )
                                                                                       << 10
                                                                              )
                                                                              ^ 241
                                                                        )
                                                                        << 10
                                                               )
                                                               & 65472
                                                         )
                                                         >> 6
                                                      | (
                                                            (
                                                                     (
                                                                           (
                                                                                 (
                                                                                          (
                                                                                                ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                                   | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                                             )
                                                                                             & 65472
                                                                                       )
                                                                                       >> 6
                                                                                    | (
                                                                                          ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                             | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                                       )
                                                                                       << 10
                                                                              )
                                                                              ^ 241
                                                                        )
                                                                        & 65472
                                                                  )
                                                                  >> 6
                                                               | (
                                                                     (
                                                                           (
                                                                                    (
                                                                                          ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                             | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                                       )
                                                                                       & 65472
                                                                                 )
                                                                                 >> 6
                                                                              | (
                                                                                    ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                       | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                                 )
                                                                                 << 10
                                                                        )
                                                                        ^ 241
                                                                  )
                                                                  << 10
                                                         )
                                                         << 10
                                                )
                                                & 65532
                                          )
                                          >> 2
                                       | (
                                             (
                                                      (
                                                            (
                                                                     (
                                                                           (
                                                                                 (
                                                                                          (
                                                                                                ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                                   | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                                             )
                                                                                             & 65472
                                                                                       )
                                                                                       >> 6
                                                                                    | (
                                                                                          ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                             | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                                       )
                                                                                       << 10
                                                                              )
                                                                              ^ 241
                                                                        )
                                                                        & 65472
                                                                  )
                                                                  >> 6
                                                               | (
                                                                     (
                                                                           (
                                                                                    (
                                                                                          ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                             | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                                       )
                                                                                       & 65472
                                                                                 )
                                                                                 >> 6
                                                                              | (
                                                                                    ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                       | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                                 )
                                                                                 << 10
                                                                        )
                                                                        ^ 241
                                                                  )
                                                                  << 10
                                                         )
                                                         & 65472
                                                   )
                                                   >> 6
                                                | (
                                                      (
                                                               (
                                                                     (
                                                                           (
                                                                                    (
                                                                                          ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                             | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                                       )
                                                                                       & 65472
                                                                                 )
                                                                                 >> 6
                                                                              | (
                                                                                    ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                       | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                                 )
                                                                                 << 10
                                                                        )
                                                                        ^ 241
                                                                  )
                                                                  & 65472
                                                            )
                                                            >> 6
                                                         | (
                                                               (
                                                                     (
                                                                              (
                                                                                    ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                       | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                                 )
                                                                                 & 65472
                                                                           )
                                                                           >> 6
                                                                        | (
                                                                              ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                 | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                           )
                                                                           << 10
                                                                  )
                                                                  ^ 241
                                                            )
                                                            << 10
                                                   )
                                                   << 10
                                          )
                                          << 14
                                 )
                                 & 32768
                           )
                           >> 15
                        | (
                              (
                                       (
                                             (
                                                      (
                                                            (
                                                                     (
                                                                           (
                                                                                 (
                                                                                          (
                                                                                                ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                                   | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                                             )
                                                                                             & 65472
                                                                                       )
                                                                                       >> 6
                                                                                    | (
                                                                                          ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                             | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                                       )
                                                                                       << 10
                                                                              )
                                                                              ^ 241
                                                                        )
                                                                        & 65472
                                                                  )
                                                                  >> 6
                                                               | (
                                                                     (
                                                                           (
                                                                                    (
                                                                                          ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                             | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                                       )
                                                                                       & 65472
                                                                                 )
                                                                                 >> 6
                                                                              | (
                                                                                    ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                       | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                                 )
                                                                                 << 10
                                                                        )
                                                                        ^ 241
                                                                  )
                                                                  << 10
                                                         )
                                                         & 65472
                                                   )
                                                   >> 6
                                                | (
                                                      (
                                                               (
                                                                     (
                                                                           (
                                                                                    (
                                                                                          ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                             | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                                       )
                                                                                       & 65472
                                                                                 )
                                                                                 >> 6
                                                                              | (
                                                                                    ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                       | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                                 )
                                                                                 << 10
                                                                        )
                                                                        ^ 241
                                                                  )
                                                                  & 65472
                                                            )
                                                            >> 6
                                                         | (
                                                               (
                                                                     (
                                                                              (
                                                                                    ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                       | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                                 )
                                                                                 & 65472
                                                                           )
                                                                           >> 6
                                                                        | (
                                                                              ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                 | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                           )
                                                                           << 10
                                                                  )
                                                                  ^ 241
                                                            )
                                                            << 10
                                                   )
                                                   << 10
                                          )
                                          & 65532
                                    )
                                    >> 2
                                 | (
                                       (
                                                (
                                                      (
                                                               (
                                                                     (
                                                                           (
                                                                                    (
                                                                                          ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                             | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                                       )
                                                                                       & 65472
                                                                                 )
                                                                                 >> 6
                                                                              | (
                                                                                    ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                       | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                                 )
                                                                                 << 10
                                                                        )
                                                                        ^ 241
                                                                  )
                                                                  & 65472
                                                            )
                                                            >> 6
                                                         | (
                                                               (
                                                                     (
                                                                              (
                                                                                    ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                       | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                                 )
                                                                                 & 65472
                                                                           )
                                                                           >> 6
                                                                        | (
                                                                              ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                 | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                           )
                                                                           << 10
                                                                  )
                                                                  ^ 241
                                                            )
                                                            << 10
                                                   )
                                                   & 65472
                                             )
                                             >> 6
                                          | (
                                                (
                                                         (
                                                               (
                                                                     (
                                                                              (
                                                                                    ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                       | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                                 )
                                                                                 & 65472
                                                                           )
                                                                           >> 6
                                                                        | (
                                                                              ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                 | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                           )
                                                                           << 10
                                                                  )
                                                                  ^ 241
                                                            )
                                                            & 65472
                                                      )
                                                      >> 6
                                                   | (
                                                         (
                                                               (
                                                                        (
                                                                              ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                 | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                           )
                                                                           & 65472
                                                                     )
                                                                     >> 6
                                                                  | (
                                                                        ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                           | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                     )
                                                                     << 10
                                                            )
                                                            ^ 241
                                                      )
                                                      << 10
                                             )
                                             << 10
                                    )
                                    << 14
                           )
                           << 1
                  )
                  + 107
            );
            var16.setCharAt(
               var29,
               (char)(
                  (
                        (
                                 (
                                       (
                                                (
                                                      (
                                                               (
                                                                     (
                                                                              (
                                                                                    (
                                                                                          (
                                                                                                   (
                                                                                                         ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440)
                                                                                                               >> 12
                                                                                                            | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                                                      )
                                                                                                      & 65472
                                                                                                )
                                                                                                >> 6
                                                                                             | (
                                                                                                   ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                                      | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                                                )
                                                                                                << 10
                                                                                       )
                                                                                       ^ 241
                                                                                 )
                                                                                 & 65472
                                                                           )
                                                                           >> 6
                                                                        | (
                                                                              (
                                                                                    (
                                                                                             (
                                                                                                   ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                                      | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                                                )
                                                                                                & 65472
                                                                                          )
                                                                                          >> 6
                                                                                       | (
                                                                                             ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                                | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                                          )
                                                                                          << 10
                                                                                 )
                                                                                 ^ 241
                                                                           )
                                                                           << 10
                                                                  )
                                                                  & 65472
                                                            )
                                                            >> 6
                                                         | (
                                                               (
                                                                        (
                                                                              (
                                                                                    (
                                                                                             (
                                                                                                   ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                                      | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                                                )
                                                                                                & 65472
                                                                                          )
                                                                                          >> 6
                                                                                       | (
                                                                                             ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                                | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                                          )
                                                                                          << 10
                                                                                 )
                                                                                 ^ 241
                                                                           )
                                                                           & 65472
                                                                     )
                                                                     >> 6
                                                                  | (
                                                                        (
                                                                              (
                                                                                       (
                                                                                             ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                                | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                                          )
                                                                                          & 65472
                                                                                    )
                                                                                    >> 6
                                                                                 | (
                                                                                       ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                          | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                                    )
                                                                                    << 10
                                                                           )
                                                                           ^ 241
                                                                     )
                                                                     << 10
                                                            )
                                                            << 10
                                                   )
                                                   & 65532
                                             )
                                             >> 2
                                          | (
                                                (
                                                         (
                                                               (
                                                                        (
                                                                              (
                                                                                    (
                                                                                             (
                                                                                                   ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                                      | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                                                )
                                                                                                & 65472
                                                                                          )
                                                                                          >> 6
                                                                                       | (
                                                                                             ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                                | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                                          )
                                                                                          << 10
                                                                                 )
                                                                                 ^ 241
                                                                           )
                                                                           & 65472
                                                                     )
                                                                     >> 6
                                                                  | (
                                                                        (
                                                                              (
                                                                                       (
                                                                                             ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                                | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                                          )
                                                                                          & 65472
                                                                                    )
                                                                                    >> 6
                                                                                 | (
                                                                                       ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                          | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                                    )
                                                                                    << 10
                                                                           )
                                                                           ^ 241
                                                                     )
                                                                     << 10
                                                            )
                                                            & 65472
                                                      )
                                                      >> 6
                                                   | (
                                                         (
                                                                  (
                                                                        (
                                                                              (
                                                                                       (
                                                                                             ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                                | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                                          )
                                                                                          & 65472
                                                                                    )
                                                                                    >> 6
                                                                                 | (
                                                                                       ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                          | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                                    )
                                                                                    << 10
                                                                           )
                                                                           ^ 241
                                                                     )
                                                                     & 65472
                                                               )
                                                               >> 6
                                                            | (
                                                                  (
                                                                        (
                                                                                 (
                                                                                       ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                          | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                                    )
                                                                                    & 65472
                                                                              )
                                                                              >> 6
                                                                           | (
                                                                                 ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                    | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                              )
                                                                              << 10
                                                                     )
                                                                     ^ 241
                                                               )
                                                               << 10
                                                      )
                                                      << 10
                                             )
                                             << 14
                                    )
                                    & 32768
                              )
                              >> 15
                           | (
                                 (
                                          (
                                                (
                                                         (
                                                               (
                                                                        (
                                                                              (
                                                                                    (
                                                                                             (
                                                                                                   ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                                      | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                                                )
                                                                                                & 65472
                                                                                          )
                                                                                          >> 6
                                                                                       | (
                                                                                             ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                                | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                                          )
                                                                                          << 10
                                                                                 )
                                                                                 ^ 241
                                                                           )
                                                                           & 65472
                                                                     )
                                                                     >> 6
                                                                  | (
                                                                        (
                                                                              (
                                                                                       (
                                                                                             ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                                | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                                          )
                                                                                          & 65472
                                                                                    )
                                                                                    >> 6
                                                                                 | (
                                                                                       ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                          | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                                    )
                                                                                    << 10
                                                                           )
                                                                           ^ 241
                                                                     )
                                                                     << 10
                                                            )
                                                            & 65472
                                                      )
                                                      >> 6
                                                   | (
                                                         (
                                                                  (
                                                                        (
                                                                              (
                                                                                       (
                                                                                             ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                                | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                                          )
                                                                                          & 65472
                                                                                    )
                                                                                    >> 6
                                                                                 | (
                                                                                       ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                          | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                                    )
                                                                                    << 10
                                                                           )
                                                                           ^ 241
                                                                     )
                                                                     & 65472
                                                               )
                                                               >> 6
                                                            | (
                                                                  (
                                                                        (
                                                                                 (
                                                                                       ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                          | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                                    )
                                                                                    & 65472
                                                                              )
                                                                              >> 6
                                                                           | (
                                                                                 ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                    | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                              )
                                                                              << 10
                                                                     )
                                                                     ^ 241
                                                               )
                                                               << 10
                                                      )
                                                      << 10
                                             )
                                             & 65532
                                       )
                                       >> 2
                                    | (
                                          (
                                                   (
                                                         (
                                                                  (
                                                                        (
                                                                              (
                                                                                       (
                                                                                             ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                                | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                                          )
                                                                                          & 65472
                                                                                    )
                                                                                    >> 6
                                                                                 | (
                                                                                       ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                          | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                                    )
                                                                                    << 10
                                                                           )
                                                                           ^ 241
                                                                     )
                                                                     & 65472
                                                               )
                                                               >> 6
                                                            | (
                                                                  (
                                                                        (
                                                                                 (
                                                                                       ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                          | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                                    )
                                                                                    & 65472
                                                                              )
                                                                              >> 6
                                                                           | (
                                                                                 ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                    | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                              )
                                                                              << 10
                                                                     )
                                                                     ^ 241
                                                               )
                                                               << 10
                                                      )
                                                      & 65472
                                                )
                                                >> 6
                                             | (
                                                   (
                                                            (
                                                                  (
                                                                        (
                                                                                 (
                                                                                       ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                          | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                                    )
                                                                                    & 65472
                                                                              )
                                                                              >> 6
                                                                           | (
                                                                                 ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                    | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                              )
                                                                              << 10
                                                                     )
                                                                     ^ 241
                                                               )
                                                               & 65472
                                                         )
                                                         >> 6
                                                      | (
                                                            (
                                                                  (
                                                                           (
                                                                                 ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                                    | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                              )
                                                                              & 65472
                                                                        )
                                                                        >> 6
                                                                     | (
                                                                           ((((var50 & 0) >> 16 | var50 << 0) ^ 90) & 61440) >> 12
                                                                              | (((var50 & 0) >> 16 | var50 << 0) ^ 90) << 4
                                                                        )
                                                                        << 10
                                                               )
                                                               ^ 241
                                                         )
                                                         << 10
                                                )
                                                << 10
                                       )
                                       << 14
                              )
                              << 1
                     )
                     + 107
               )
            );
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_210.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = 741710181 ^ 741710181 >>> -106562208 ^ 0; var35 < var19.length(); var35 += (1991447262 & 778093789 | 1) & -908244223) {
            int var62 = (var19.charAt(var35) ^ 197) - 134 ^ 104;
            int var98 = (var62 & 65472) >> 6;
            int var63 = (var62 & 65472) >> 6 | var62 << 10;
            int var99 = (((var62 & 65472) >> 6 | var62 << 10) & 65528) >> 3;
            var62 = ((((var98 | var62 << 10) & 65528) >> 3 | ((var62 & 65472) >> 6 | var62 << 10) << 13) ^ 212) + 151;
            var98 = (((var99 | var63 << 13) ^ 212) + 151 & 57344) >> 13;
            int var65 = (((var99 | var63 << 13) ^ 212) + 151 & 57344) >> 13 | var62 << 3;
            int var101 = (((((var99 | var63 << 13) ^ 212) + 151 & 57344) >> 13 | var62 << 3) & 49152) >> 14;
            char var66 = (char)((((var98 | var62 << 3) & 49152) >> 14 | ((((var99 | var63 << 13) ^ 212) + 151 & 57344) >> 13 | var62 << 3) << 2) ^ 16);
            var19.setCharAt(var35, (char)((var101 | var65 << 2) ^ 16));
         }

         Class var7 = Class.forName(var19.toString(), false, Class_210.class.getClassLoader());
         switch (((var4 + 627839738 - 649455184 ^ 1482165208) - 1990665373 + 1509285965 - 531133851 ^ 1353620597) + 1196937749 + 1264952651 ^ 1246140548) {
            case 841758722:
            case 2062773278:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 1173062515:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            case 1736322053:
               var10000 = var0.findSpecial(var7, var5, var6, Class_210.class);
               break;
            case 1938086977:
               var10000 = var0.findConstructor(var7, var6);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_913[((var10 - 1268687171 + 1598596414 + 592218418 ^ 892928583) - 2023966260 + 1486067496 + 417809925 ^ 1189651596) - 1428429269 - 1802024523] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_938(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = (var10 + 1196533220 + 667457393 ^ 1853050763) + 916924992 - 1847456759 + 354218113 + 449201801 + 780196145 + 1764106695;
      MethodHandle var10000 = field_913[(var10 + 1196533220 + 667457393 ^ 1853050763) + 916924992 - 1847456759 + 354218113 + 449201801 + 780196145 + 1764106695
         ^ 849504687];
      if (field_913[var10001 ^ 849504687] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = 1322383533 ^ -1604839013 ^ -292953802; var24 < var14.length(); var24 += -1830732713 >> 1599657259 ^ -893914) {
            int var43 = var14.charAt(var24);
            int var10004 = (var43 & 65472) >> 6;
            int var44 = ((var43 & 65472) >> 6 | var43 << 10) + 112;
            int var84 = (((var43 & 65472) >> 6 | var43 << 10) + 112 & 64512) >> 10;
            var43 = (((var10004 | var43 << 10) + 112 & 64512) >> 10 | ((var43 & 65472) >> 6 | var43 << 10) + 112 << 6) - 37 - 12;
            var10004 = ((var84 | var44 << 6) - 37 - 12 & 65528) >> 3;
            int var46 = ((var84 | var44 << 6) - 37 - 12 & 65528) >> 3 | var43 << 13;
            int var86 = ((((var84 | var44 << 6) - 37 - 12 & 65528) >> 3 | var43 << 13) & 63488) >> 11;
            char var47 = (char)(
               ((((var10004 | var43 << 13) & 63488) >> 11 | (((var84 | var44 << 6) - 37 - 12 & 65528) >> 3 | var43 << 13) << 5) + 45 ^ 40) + 171
            );
            var14.setCharAt(var24, (char)(((var86 | var46 << 5) + 45 ^ 40) + 171));
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = (-2124100421 + 1752392237 | 0) & 268566528; var30 < var17.length(); var30 += 848861388 >>> 2089360597 ^ 405) {
            int var52 = var17.charAt(var30) + 168 ^ 167;
            char var57 = (char)(
               (
                     (
                              (
                                    (
                                             (
                                                   (
                                                            (
                                                                  (((var52 & 65528) >> 3 | var52 << 13) - 161 - 167 & 65408) >> 7
                                                                     | ((var52 & 65528) >> 3 | var52 << 13) - 161 - 167 << 9
                                                               )
                                                               & 61440
                                                         )
                                                         >> 12
                                                      | (
                                                            (((var52 & 65528) >> 3 | var52 << 13) - 161 - 167 & 65408) >> 7
                                                               | ((var52 & 65528) >> 3 | var52 << 13) - 161 - 167 << 9
                                                         )
                                                         << 4
                                                )
                                                & 32768
                                          )
                                          >> 15
                                       | (
                                             (
                                                      (
                                                            (((var52 & 65528) >> 3 | var52 << 13) - 161 - 167 & 65408) >> 7
                                                               | ((var52 & 65528) >> 3 | var52 << 13) - 161 - 167 << 9
                                                         )
                                                         & 61440
                                                   )
                                                   >> 12
                                                | (
                                                      (((var52 & 65528) >> 3 | var52 << 13) - 161 - 167 & 65408) >> 7
                                                         | ((var52 & 65528) >> 3 | var52 << 13) - 161 - 167 << 9
                                                   )
                                                   << 4
                                          )
                                          << 1
                                 )
                                 & 65504
                           )
                           >> 5
                        | (
                              (
                                       (
                                             (
                                                      (
                                                            (((var52 & 65528) >> 3 | var52 << 13) - 161 - 167 & 65408) >> 7
                                                               | ((var52 & 65528) >> 3 | var52 << 13) - 161 - 167 << 9
                                                         )
                                                         & 61440
                                                   )
                                                   >> 12
                                                | (
                                                      (((var52 & 65528) >> 3 | var52 << 13) - 161 - 167 & 65408) >> 7
                                                         | ((var52 & 65528) >> 3 | var52 << 13) - 161 - 167 << 9
                                                   )
                                                   << 4
                                          )
                                          & 32768
                                    )
                                    >> 15
                                 | (
                                       (
                                                (
                                                      (((var52 & 65528) >> 3 | var52 << 13) - 161 - 167 & 65408) >> 7
                                                         | ((var52 & 65528) >> 3 | var52 << 13) - 161 - 167 << 9
                                                   )
                                                   & 61440
                                             )
                                             >> 12
                                          | (
                                                (((var52 & 65528) >> 3 | var52 << 13) - 161 - 167 & 65408) >> 7
                                                   | ((var52 & 65528) >> 3 | var52 << 13) - 161 - 167 << 9
                                             )
                                             << 4
                                    )
                                    << 1
                           )
                           << 11
                  )
                  - 160
            );
            var17.setCharAt(
               var30,
               (char)(
                  (
                        (
                                 (
                                       (
                                                (
                                                      (
                                                               (
                                                                     (((var52 & 65528) >> 3 | var52 << 13) - 161 - 167 & 65408) >> 7
                                                                        | ((var52 & 65528) >> 3 | var52 << 13) - 161 - 167 << 9
                                                                  )
                                                                  & 61440
                                                            )
                                                            >> 12
                                                         | (
                                                               (((var52 & 65528) >> 3 | var52 << 13) - 161 - 167 & 65408) >> 7
                                                                  | ((var52 & 65528) >> 3 | var52 << 13) - 161 - 167 << 9
                                                            )
                                                            << 4
                                                   )
                                                   & 32768
                                             )
                                             >> 15
                                          | (
                                                (
                                                         (
                                                               (((var52 & 65528) >> 3 | var52 << 13) - 161 - 167 & 65408) >> 7
                                                                  | ((var52 & 65528) >> 3 | var52 << 13) - 161 - 167 << 9
                                                            )
                                                            & 61440
                                                      )
                                                      >> 12
                                                   | (
                                                         (((var52 & 65528) >> 3 | var52 << 13) - 161 - 167 & 65408) >> 7
                                                            | ((var52 & 65528) >> 3 | var52 << 13) - 161 - 167 << 9
                                                      )
                                                      << 4
                                             )
                                             << 1
                                    )
                                    & 65504
                              )
                              >> 5
                           | (
                                 (
                                          (
                                                (
                                                         (
                                                               (((var52 & 65528) >> 3 | var52 << 13) - 161 - 167 & 65408) >> 7
                                                                  | ((var52 & 65528) >> 3 | var52 << 13) - 161 - 167 << 9
                                                            )
                                                            & 61440
                                                      )
                                                      >> 12
                                                   | (
                                                         (((var52 & 65528) >> 3 | var52 << 13) - 161 - 167 & 65408) >> 7
                                                            | ((var52 & 65528) >> 3 | var52 << 13) - 161 - 167 << 9
                                                      )
                                                      << 4
                                             )
                                             & 32768
                                       )
                                       >> 15
                                    | (
                                          (
                                                   (
                                                         (((var52 & 65528) >> 3 | var52 << 13) - 161 - 167 & 65408) >> 7
                                                            | ((var52 & 65528) >> 3 | var52 << 13) - 161 - 167 << 9
                                                      )
                                                      & 61440
                                                )
                                                >> 12
                                             | (
                                                   (((var52 & 65528) >> 3 | var52 << 13) - 161 - 167 & 65408) >> 7
                                                      | ((var52 & 65528) >> 3 | var52 << 13) - 161 - 167 << 9
                                                )
                                                << 4
                                       )
                                       << 1
                              )
                              << 11
                     )
                     - 160
               )
            );
         }

         Class var6 = Class.forName(var17.toString(), false, Class_210.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = (-1246679336 - -756790313 | 0) & 154146836; var36 < var20.length(); var36 += 1248471297 & 1248471297 - 1248471297 ^ 1) {
            int var62 = var20.charAt(var36) - 'R';
            int var92 = (var62 & 65408) >> 7;
            int var63 = ((var62 & 65408) >> 7 | var62 << 9) + 196 + 95 + 122 - 1 ^ 104;
            int var93 = ((((var62 & 65408) >> 7 | var62 << 9) + 196 + 95 + 122 - 1 ^ 104) & 32768) >> 15;
            char var64 = (char)(
               ((((var92 | var62 << 9) + 196 + 95 + 122 - 1 ^ 104) & 32768) >> 15 | (((var62 & 65408) >> 7 | var62 << 9) + 196 + 95 + 122 - 1 ^ 104) << 1)
                  + 34
                  + 236
            );
            var20.setCharAt(var36, (char)((var93 | var63 << 1) + 34 + 236));
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_210.class.getClassLoader()).returnType();
         switch (((var4 ^ 156476464 ^ 1781252556) - 618500823 ^ 1001994879 ^ 1909858216) - 1699421016 - 1460881482 + 811340825 - 784973957 - 412361716) {
            case 16271985:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            case 241745253:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            case 902884519:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            case 1592795693:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_913[(var10 + 1196533220 + 667457393 ^ 1853050763) + 916924992 - 1847456759 + 354218113 + 449201801 + 780196145 + 1764106695 ^ 849504687] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
