import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;
import net.minecraft.class_1792;
import net.minecraft.class_1811;

public class Class_157 extends Class_342 {
   // $VF: renamed from: mn Class_105
   public Class_105 field_2090;
   // $VF: renamed from: wb Class_49
   public Class_49 field_2091;
   // $VF: renamed from: rdi Class_49
   public Class_49 field_2092;
   // $VF: renamed from: jw Class_321
   public Class_321 field_2093;
   // $VF: renamed from: up long
   public long field_2094;
   // $VF: renamed from: fqs java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_2095 = new MethodHandle[122];

   public Class_157() {
      int var1 = 1807614015;
      int var10001 = (1023364497 | 1150614404) ^ 2097151893;

      StringBuilder var10002;
      for (var10002 = (StringBuilder)0<"JNT",944528297,"皺谺辺谺銺瞺","꼹꽋꽚⽕꽠⽕⼼꽛⽕꽜⽘⼼⽎꽟꽞⽙꽜⽘⽂⼹꽐","Ｅ缮Ｇ缮ﾋＨ缮Ｋ缯ﾋ缱ＤＡ缪Ｋ缯Ｙ缤缪ＨＬ缬Ａ",703204438>("\u001d! /|\u0013(53+1\"");
         var10001 < ((1593697416 ^ 1593697416 + 1593697416 | 4) & 7946798);
         var10001 += 1190924263 << -1641498213 ^ 939524097
      ) {
         int var34 = (0<"JNT",-35740848,"褺貺蠺醺砺銺","꼹⽉⼹⽆","Ｅ缮Ｇ缮ﾋＨ缮Ｋ缯ﾋ缱ＤＡ缪Ｋ缯Ｙ缤缪ＨＬ缬Ａ",703204436>(var10002, var10001) ^ 'Z') + 111;
         char var35 = (char)(((var34 & 0) >> 16 | var34 << 0) + 7 - 124);
         0<"JNT",-35740848,"鄺診銺示貺蠺醺砺銺","꼹⽉⽆⼹꽐","Ｅ缮Ｇ缮ﾋＨ缮Ｋ缯ﾋ缱ＤＡ缪Ｋ缯Ｙ缤缪ＨＬ缬Ａ",703204445>(var10002, var10001, (char)(((var34 & 0) >> 16 | var34 << 0) + 7 - 124));
      }

      String var5 = 0<"JNT",-35740848,"銺輺脺銺醺谺辺謺","꼹⼹꽋꽚⽕꽠⽕⼼꽛⽕꽜⽘⼼⽎꽟꽞⽙꽜⽘⽂","Ｅ缮Ｇ缮ﾋＨ缮Ｋ缯ﾋ缱ＤＡ缪Ｋ缯Ｙ缤缪ＨＬ缬Ａ",703204478>(var10002);
      int var18 = 1616662066 >> 1616662066 ^ 6167;

      StringBuilder var37;
      for (var37 = (StringBuilder)0<"JNT",944528297,"皺谺辺谺銺瞺","꼹꽋꽚⽕꽠⽕⼼꽛⽕꽜⽘⼼⽎꽟꽞⽙꽜⽘⽂⼹꽐","Ｅ缮Ｇ缮ﾋＨ缮Ｋ缯ﾋ缱ＤＡ缪Ｋ缯Ｙ缤缪ＨＬ缬Ａ",703204479>("Ȗ϶ΎΦζ̖Ύ͖̖͎͎̆ϖĮ͎͖̆̆͆ΆĮ;ΦΞĮϖΦ϶");
         var18 < ((-1829134348 >>> 1478781031 | 4) & -1294858084);
         var18 += (1261096248 | 434567662) ^ 1542389247
      ) {
         int var65 = 0<"JNT",-35740848,"褺貺蠺醺砺銺","꼹⽉⼹⽆","Ｅ缮Ｇ缮ﾋＨ缮Ｋ缯ﾋ缱ＤＡ缪Ｋ缯Ｙ缤缪ＨＬ缬Ａ",703204442>(var37, var18) - 2;
         int var10006 = (var65 & 49152) >> 14;
         int var66 = (((var65 & 49152) >> 14 | var65 << 2) ^ 197) - 117;
         int var111 = ((((var65 & 49152) >> 14 | var65 << 2) ^ 197) - 117 & 65504) >> 5;
         char var67 = (char)((((var10006 | var65 << 2) ^ 197) - 117 & 65504) >> 5 | (((var65 & 49152) >> 14 | var65 << 2) ^ 197) - 117 << 11);
         0<"JNT",-35740848,"鄺診銺示貺蠺醺砺銺","꼹⽉⽆⼹꽐","Ｅ缮Ｇ缮ﾋＨ缮Ｋ缯ﾋ缱ＤＡ缪Ｋ缯Ｙ缤缪ＨＬ缬Ａ",703204443>(var37, var18, (char)(var111 | var66 << 11));
      }

      super(
         var5,
         0<"JNT",-35740848,"銺輺脺銺醺谺辺謺","꼹⼹꽋꽚⽕꽠⽕⼼꽛⽕꽜⽘⼼⽎꽟꽞⽙꽜⽘⽂","Ｅ缮Ｇ缮ﾋＨ缮Ｋ缯ﾋ缱ＤＡ缪Ｋ缯Ｙ缤缪ＨＬ缬Ａ",703204416>(var37),
         -1,
         1<"JNT",1882289687,"櫑櫊\ueac5","ﴅﳮ","㚨뚨㛊뛠㛅뚱",-416211050>()
      );
      var10001 = -658632656 + -9766838 ^ -668399494;

      for (var10002 = (StringBuilder)0<"JNT",944528297,"皺谺辺谺銺瞺","꼹꽋꽚⽕꽠⽕⼼꽛⽕꽜⽘⼼⽎꽟꽞⽙꽜⽘⽂⼹꽐","Ｅ缮Ｇ缮ﾋＨ缮Ｋ缯ﾋ缱ＤＡ缪Ｋ缯Ｙ缤缪ＨＬ缬Ａ",703204450>("뺫纳ﺠ뺨ﺳ㺲뺰뺲");
         var10001 < ((1052498021 * -655427859 | 8) & 67211352);
         var10001 += (2119571968 >> -1084490509 | 1) & 703901717
      ) {
         int var40 = 0<"JNT",-35740848,"褺貺蠺醺砺銺","꼹⽉⼹⽆","Ｅ缮Ｇ缮ﾋＨ缮Ｋ缯ﾋ缱ＤＡ缪Ｋ缯Ｙ缤缪ＨＬ缬Ａ",703204466>(var10002, var10001) + 'n' + 240 + 16;
         char var41 = (char)(((var40 & 49152) >> 14 | var40 << 2) - 24);
         0<"JNT",-35740848,"鄺診銺示貺蠺醺砺銺","꼹⽉⽆⼹꽐","Ｅ缮Ｇ缮ﾋＨ缮Ｋ缯ﾋ缱ＤＡ缪Ｋ缯Ｙ缤缪ＨＬ缬Ａ",703204467>(var10002, var10001, (char)(((var40 & 49152) >> 14 | var40 << 2) - 24));
      }

      Class_105 var8 = (Class_105)0<"JNT",944528297,"皺谺辺谺銺瞺","꼹꽋꽚⽕꽠⽕⼼꽛⽕꽜⽘⼼⽎꽟꽞⽙꽜⽘⽂꽒⼹꽐","缯Ａ",703204426>(
         0<"JNT",-35740848,"銺輺脺銺醺谺辺謺","꼹⼹꽋꽚⽕꽠⽕⼼꽛⽕꽜⽘⼼⽎꽟꽞⽙꽜⽘⽂","Ｅ缮Ｇ缮ﾋＨ缮Ｋ缯ﾋ缱ＤＡ缪Ｋ缯Ｙ缤缪ＨＬ缬Ａ",703204417>(var10002), true
      );
      int var22 = 0;

      for (var37 = (StringBuilder)0<"JNT",944528297,"皺谺辺谺銺瞺","꼹꽋꽚⽕꽠⽕⼼꽛⽕꽜⽘⼼⽎꽟꽞⽙꽜⽘⽂⼹꽐","Ｅ缮Ｇ缮ﾋＨ缮Ｋ缯ﾋ缱ＤＡ缪Ｋ缯Ｙ缤缪ＨＬ缬Ａ",703204427>(
            "⛀⪠⩠Ⰰ⃠⥀⩠⨀⥀⩀⭀⃠⯀⧠⦀⪠⃠⪀⫀⮀⭀⦀⃠⤠⮀⭠⭠⫀⪠⃠⨀⭀⃠⧠⦀⩠⥠"
         );
         var22 < ((1846749411 | 1846749411 | 37) & -2115500251);
         var22 += (-1406983073 + -531918977 | 1) & 1132530689
      ) {
         char var71 = 0<"JNT",-35740848,"褺貺蠺醺砺銺","꼹⽉⼹⽆","Ｅ缮Ｇ缮ﾋＨ缮Ｋ缯ﾋ缱ＤＡ缪Ｋ缯Ｙ缤缪ＨＬ缬Ａ",703205286>(var37, var22);
         char var74 = (char)(
            (
                  (((((var71 & '\ufff8') >> 3 | var71 << '\r') & 65532) >> 2 | ((var71 & '\ufff8') >> 3 | var71 << '\r') << 14) & 0) >> 16
                     | ((((var71 & '\ufff8') >> 3 | var71 << '\r') & 65532) >> 2 | ((var71 & '\ufff8') >> 3 | var71 << '\r') << 14) << 0
               )
               - 65
               - 166
         );
         0<"JNT",-35740848,"鄺診銺示貺蠺醺砺銺","꼹⽉⽆⼹꽐","Ｅ缮Ｇ缮ﾋＨ缮Ｋ缯ﾋ缱ＤＡ缪Ｋ缯Ｙ缤缪ＨＬ缬Ａ",703205287>(
            var37,
            var22,
            (char)(
               (
                     (((((var71 & '\ufff8') >> 3 | var71 << '\r') & 65532) >> 2 | ((var71 & '\ufff8') >> 3 | var71 << '\r') << 14) & 0) >> 16
                        | ((((var71 & '\ufff8') >> 3 | var71 << '\r') & 65532) >> 2 | ((var71 & '\ufff8') >> 3 | var71 << '\r') << 14) << 0
                  )
                  - 65
                  - 166
            )
         );
      }

      this.field_2090 = 0<"JNT",-35740848,"蠺鈺誺","꼹꽋꽚⽕꽠⽕⼼꽛⽕꽜⽘⼼⽎꽟꽞⽙꽜⽘⽂⼹꽋⽘꽞⽂","缯Ａ",703204424>(
         var8, 0<"JNT",-35740848,"銺輺脺銺醺谺辺謺","꼹⼹꽋꽚⽕꽠⽕⼼꽛⽕꽜⽘⼼⽎꽟꽞⽙꽜⽘⽂","Ｅ缮Ｇ缮ﾋＨ缮Ｋ缯ﾋ缱ＤＡ缪Ｋ缯Ｙ缤缪ＨＬ缬Ａ",703204431>(var37)
      );
      Class_157 var10000 = this;
      var10001 = (-1373512718 * 917638207 | 0) & 285344352;

      for (var10002 = (StringBuilder)0<"JNT",944528297,"皺谺辺谺銺瞺","꼹꽋꽚⽕꽠⽕⼼꽛⽕꽜⽘⼼⽎꽟꽞⽙꽜⽘⽂⼹꽐","Ｅ缮Ｇ缮ﾋＨ缮Ｋ缯ﾋ缱ＤＡ缪Ｋ缯Ｙ缤缪ＨＬ缬Ａ",703205281>("Ƶʽ˵ʝ͝");
         var10001 < (1628220889 & (-764173456 | 1628220889) ^ 1628220892);
         var10001 += (-1450751863 & -1493413610 | 1) & 1527388391
      ) {
         int var46 = 0<"JNT",-35740848,"褺貺蠺醺砺銺","꼹⽉⼹⽆","Ｅ缮Ｇ缮ﾋＨ缮Ｋ缯ﾋ缱ＤＡ缪Ｋ缯Ｙ缤缪ＨＬ缬Ａ",703205280>(var10002, var10001) + 1 - 68;
         int var101 = (var46 & 65535) >> 0;
         int var47 = ((var46 & 65535) >> 0 | var46 << 16) + 174;
         int var102 = (((var46 & 65535) >> 0 | var46 << 16) + 174 & 65528) >> 3;
         char var48 = (char)(((var101 | var46 << 16) + 174 & 65528) >> 3 | ((var46 & 65535) >> 0 | var46 << 16) + 174 << 13);
         0<"JNT",-35740848,"鄺診銺示貺蠺醺砺銺","꼹⽉⽆⼹꽐","Ｅ缮Ｇ缮ﾋＨ缮Ｋ缯ﾋ缱ＤＡ缪Ｋ缯Ｙ缤缪ＨＬ缬Ａ",703204441>(var10002, var10001, (char)(var102 | var47 << 13));
      }

      Class_49 var11 = (Class_49)0<"JNT",944528297,"皺谺辺谺銺瞺","꼹꽋꽚⽕꽠⽕⼼꽛⽕꽜⽘⼼⽎꽟꽞⽙꽜⽘⽂꽇꽇꽇꽇⼹꽐","Ｌ缩",703204437>(
         0<"JNT",-35740848,"銺輺脺銺醺谺辺謺","꼹⼹꽋꽚⽕꽠⽕⼼꽛⽕꽜⽘⼼⽎꽟꽞⽙꽜⽘⽂","Ｅ缮Ｇ缮ﾋＨ缮Ｋ缯ﾋ缱ＤＡ缪Ｋ缯Ｙ缤缪ＨＬ缬Ａ",703204428>(var10002), 0.0, 1000.0, 0.0, 1.0
      );
      int var26 = -1375444615 * -507490179 ^ -900110315;
      var37 = (StringBuilder)0<"JNT",944528297,"皺谺辺谺銺瞺","꼹꽋꽚⽕꽠⽕⼼꽛⽕꽜⽘⼼⽎꽟꽞⽙꽜⽘⽂⼹꽐","Ｅ缮Ｇ缮ﾋＨ缮Ｋ缯ﾋ缱ＤＡ缪Ｋ缯Ｙ缤缪ＨＬ缬Ａ",703204430>("≕㋕㙕フ㳕ၕㅕ㋕㩕㯕㋕㋕㝕ၕ㇕㙕㓕㇕㗕㧕ၕ㓕㝕ၕ㛕㓕㙕㙕㓕㧕㋕㇕㟕㝕㉕㧕");

      label74:
      while (true) {
         var1 = (-1615810581 | -1615810581) ^ 1699291558;

         while (true) {
            label108: {
               switch (((var1 ^ 744184866) - 1986724259 + 876162359 ^ 1493276902) + 486867569 + 1812855757) {
                  case 440200517:
                     var10002 = var37;
                     if (var26 < ((1073714151 - -1408278610 | 23) & 68010591)) {
                        int var92 = (0<"JNT",-35740848,"褺貺蠺醺砺銺","꼹⽉⼹⽆","Ｅ缮Ｇ缮ﾋＨ缮Ｋ缯ﾋ缱ＤＡ缪Ｋ缯Ｙ缤缪ＨＬ缬Ａ",703204472>(var37, var26) ^ 1) + 18 + 106;
                        char var93 = (char)(((var92 & 57344) >> 13 | var92 << 3) + 66);
                        0<"JNT",-35740848,"鄺診銺示貺蠺醺砺銺","꼹⽉⽆⼹꽐","Ｅ缮Ｇ缮ﾋＨ缮Ｋ缯ﾋ缱ＤＡ缪Ｋ缯Ｙ缤缪ＨＬ缬Ａ",703204433>(
                           var37, var26, (char)(((var92 & 57344) >> 13 | var92 << 3) + 66)
                        );
                        var26 += (-554011127 + -1669097033 | 1) & -2080305095;
                        break label108;
                     }

                     var1 = (1580492418 ^ 1580492418 | 1175046593) & -22425631;
                     break;
                  case 1451517219:
                  default:
                     var10002 = var37;
                     if (var26 < 36) {
                        int var79 = (0<"JNT",-35740848,"褺貺蠺醺砺銺","꼹⽉⼹⽆","Ｅ缮Ｇ缮ﾋＨ缮Ｋ缯ﾋ缱ＤＡ缪Ｋ缯Ｙ缤缪ＨＬ缬Ａ",703204420>(var37, var26) - '3' - 110 ^ 90) + 18;
                        char var80 = (char)((var79 & 65408) >> 7 | var79 << 9);
                        0<"JNT",-35740848,"鄺診銺示貺蠺醺砺銺","꼹⽉⽆⼹꽐","Ｅ缮Ｇ缮ﾋＨ缮Ｋ缯ﾋ缱ＤＡ缪Ｋ缯Ｙ缤缪ＨＬ缬Ａ",703204429>(var37, var26, (char)((var79 & 65408) >> 7 | var79 << 9));
                        var26 += (-1403746384 & 873838535 | 1) & 17438771;
                        continue label74;
                     }

                     var1 = -878346480 & 1537656449 - 39589189 ^ -1683958167;
               }

               switch (((var1 + 627593542 ^ 1942609037 ^ 806627071) + 21505443 ^ 1044300726) - 128458511) {
                  case 270443935:
                     var10000.field_2092 = 0<"JNT",-35740848,"輺谺貺","꼹꽋꽚⽕꽠⽕⼼꽛⽕꽜⽘⼼⽎꽟꽞⽙꽜⽘⽂⼹꽋꽗⽖⽂","Ｌ缩",703204419>(
                        var11, 0<"JNT",-35740848,"銺輺脺銺醺谺辺謺","꼹⼹꽋꽚⽕꽠⽕⼼꽛⽕꽜⽘⼼⽎꽟꽞⽙꽜⽘⽂","Ｅ缮Ｇ缮ﾋＨ缮Ｋ缯ﾋ缱ＤＡ缪Ｋ缯Ｙ缤缪ＨＬ缬Ａ",703204418>(var10002)
                     );
                     var10001 = (1949134198 | 1108318076 >> 1949134198 | 0) & 152076800;

                     for (var10002 = (StringBuilder)0<"JNT",944528297,"皺谺辺谺銺瞺","꼹꽋꽚⽕꽠⽕⼼꽛⽕꽜⽘⼼⽎꽟꽞⽙꽜⽘⽂⼹꽐","Ｅ缮Ｇ缮ﾋＨ缮Ｋ缯ﾋ缱ＤＡ缪Ｋ缯Ｙ缤缪ＨＬ缬Ａ",703204444>("✖鼖ﬖ蜖輖錖\udf16");
                        var10001 < ((-940132937 + (-1823965829 ^ 1560422623) | 4) & 682648743);
                        var10001 += (1945217946 + 50279358 | 1) & 589861
                     ) {
                        char var58 = 0<"JNT",-35740848,"褺貺蠺醺砺銺","꼹⽉⼹⽆","Ｅ缮Ｇ缮ﾋＨ缮Ｋ缯ﾋ缱ＤＡ缪Ｋ缯Ｙ缤缪ＨＬ缬Ａ",703204422>(var10002, var10001);
                        int var105 = (var58 & 0) >> 16;
                        int var59 = ((var58 & 0) >> 16 | var58 << 0) + 160 + 75;
                        int var106 = (((var58 & 0) >> 16 | var58 << 0) + 160 + 75 & 64512) >> 10;
                        char var60 = (char)((((var105 | var58 << 0) + 160 + 75 & 64512) >> 10 | ((var58 & 0) >> 16 | var58 << 0) + 160 + 75 << 6) ^ 11);
                        0<"JNT",-35740848,"鄺診銺示貺蠺醺砺銺","꼹⽉⽆⼹꽐","Ｅ缮Ｇ缮ﾋＨ缮Ｋ缯ﾋ缱ＤＡ缪Ｋ缯Ｙ缤缪ＨＬ缬Ａ",703204423>(var10002, var10001, (char)((var106 | var59 << 6) ^ 11));
                     }

                     Class_321 var16 = (Class_321)0<"JNT",944528297,"皺谺辺谺銺瞺","꼹꽋꽚⽕꽠⽕⼼꽛⽕꽜⽘⼼⽎꽟꽞⽙꽜⽘⽂꽋꽚⽕꽠⽕⼼꽛⽕꽜⽘⼼⽇꽜⽟⽛⽂꽋꽚⽕꽠⽕⼼꽛⽕꽜⽘⼼⽆꽛⽕⽞⽞⽂⼹꽐","Ｄ缫",703205284>(
                        0<"JNT",-35740848,"銺輺脺銺醺谺辺謺","꼹⼹꽋꽚⽕꽠⽕⼼꽛⽕꽜⽘⼼⽎꽟꽞⽙꽜⽘⽂","Ｅ缮Ｇ缮ﾋＨ缮Ｋ缯ﾋ缱ＤＡ缪Ｋ缯Ｙ缤缪ＨＬ缬Ａ",703205290>(var10002),
                        1<"JNT",1882289687,"\ueac7櫈\ueace","ﳲﴁ","㚨뚨㛊㛇뛞뚱",-416211072>(),
                        Class_92.class
                     );
                     int var32 = 1042041080 >> -7989022 ^ 260510270;

                     for (var37 = (StringBuilder)0<"JNT",944528297,"皺谺辺谺銺瞺","꼹꽋꽚⽕꽠⽕⼼꽛⽕꽜⽘⼼⽎꽟꽞⽙꽜⽘⽂⼹꽐","Ｅ缮Ｇ缮ﾋＨ缮Ｋ缯ﾋ缱ＤＡ缪Ｋ缯Ｙ缤缪ＨＬ缬Ａ",703205293>(
                           "ᰂ怂搂䰂怂䀃琂簂鐂谂吂䀃䠂鐂适适簂砂谂䀃适簂䀃䐂鐂适簂球䰂瀂搂䰂氂"
                        );
                        var32 < (-439745302 - (-439745302 >>> -873867070) ^ -1403550831);
                        var32 += -2124550152 - -2081141332 ^ -43408819
                     ) {
                        int var87 = 0<"JNT",-35740848,"褺貺蠺醺砺銺","꼹⽉⼹⽆","Ｅ缮Ｇ缮ﾋＨ缮Ｋ缯ﾋ缱ＤＡ缪Ｋ缯Ｙ缤缪ＨＬ缬Ａ",703205300>(var37, var32) ^ 1;
                        char var90 = (char)(
                           (
                                 (((((var87 & 61440) >> 12 | var87 << 4) & 65504) >> 5 | ((var87 & 61440) >> 12 | var87 << 4) << 11) & 65024) >> 9
                                    | ((((var87 & 61440) >> 12 | var87 << 4) & 65504) >> 5 | ((var87 & 61440) >> 12 | var87 << 4) << 11) << 7
                              )
                              - 112
                        );
                        0<"JNT",-35740848,"鄺診銺示貺蠺醺砺銺","꼹⽉⽆⼹꽐","Ｅ缮Ｇ缮ﾋＨ缮Ｋ缯ﾋ缱ＤＡ缪Ｋ缯Ｙ缤缪ＨＬ缬Ａ",703205309>(
                           var37,
                           var32,
                           (char)(
                              (
                                    (((((var87 & 61440) >> 12 | var87 << 4) & 65504) >> 5 | ((var87 & 61440) >> 12 | var87 << 4) << 11) & 65024) >> 9
                                       | ((((var87 & 61440) >> 12 | var87 << 4) & 65504) >> 5 | ((var87 & 61440) >> 12 | var87 << 4) << 11) << 7
                                 )
                                 - 112
                           )
                        );
                     }

                     this.field_2093 = 0<"JNT",-35740848,"辺钺","꼹꽋꽚⽕꽠⽕⼼꽛⽕꽜⽘⼼⽎꽟꽞⽙꽜⽘⽂⼹꽋꽟⽜⽂","Ｄ缫",703204446>(
                        var16, 0<"JNT",-35740848,"銺輺脺銺醺谺辺謺","꼹⼹꽋꽚⽕꽠⽕⼼꽛⽕꽜⽘⼼⽎꽟꽞⽙꽜⽘⽂","Ｅ缮Ｇ缮ﾋＨ缮Ｋ缯ﾋ缱ＤＡ缪Ｋ缯Ｙ缤缪ＨＬ缬Ａ",703205285>(var37)
                     );
                     this.field_2094 = 0L;
                     0<"JNT",-35740848,"逺鈺","꼹⽒꽋⽝⽗⽗⽂⼹꽐","缥Ｌ",703205307>(
                        this,
                        new Class_271[]{
                           1<"JNT",1037518196,"櫌\ueacc","ﳷﳰ","㚨뚨㛊뛇㛝뚱",-416211060>(this),
                           1<"JNT",1037518196,"櫉\uead2","ﳷﳰ","㚨뚨㛊㛆뛅뚱",-416211059>(this),
                           1<"JNT",1037518196,"\ueaca\ueac7櫎","ﳷﳰ","㚨뚨㛊㛆뛅뚱",-416211058>(this),
                           1<"JNT",1037518196,"\ueace櫉","ﳷﳰ","㚨뚨㛊㛞뛛뚱",-416211217>(this)
                        }
                     );
                     return;
                  case 2071596215:
                  default:
                     var10000.field_2091 = 0<"JNT",-35740848,"輺谺貺","꼹꽋꽚⽕꽠⽕⼼꽛⽕꽜⽘⼼⽎꽟꽞⽙꽜⽘⽂⼹꽋꽗⽖⽂","Ｌ缩",703204476>(
                        var11, 0<"JNT",-35740848,"銺輺脺銺醺谺辺謺","꼹⼹꽋꽚⽕꽠⽕⼼꽛⽕꽜⽘⼼⽎꽟꽞⽙꽜⽘⽂","Ｅ缮Ｇ缮ﾋＨ缮Ｋ缯ﾋ缱ＤＡ缪Ｋ缯Ｙ缤缪ＨＬ缬Ａ",703204451>(var10002)
                     );
                     var10000 = this;
                     var10001 = (-488327628 + 563674944 | 0) & 8391176;
                     var10002 = (StringBuilder)0<"JNT",944528297,"皺谺辺谺銺瞺","꼹꽋꽚⽕꽠⽕⼼꽛⽕꽜⽘⼼⽎꽟꽞⽙꽜⽘⽂⼹꽐","Ｅ缮Ｇ缮ﾋＨ缮Ｋ缯ﾋ缱ＤＡ缪Ｋ缯Ｙ缤缪ＨＬ缬Ａ",703204421>("怛\u0010‗쀐怗ꀗ");
               }

               while (var10001 < (1473859407 >>> 12022921 ^ 2878625)) {
                  int var54 = (0<"JNT",-35740848,"褺貺蠺醺砺銺","꼹⽉⼹⽆","Ｅ缮Ｇ缮ﾋＨ缮Ｋ缯ﾋ缱ＤＡ缪Ｋ缯Ｙ缤缪ＨＬ缬Ａ",703205302>(var10002, var10001) ^ 140) + 139 - 43 - 239;
                  char var55 = (char)((var54 & 57344) >> 13 | var54 << 3);
                  0<"JNT",-35740848,"鄺診銺示貺蠺醺砺銺","꼹⽉⽆⼹꽐","Ｅ缮Ｇ缮ﾋＨ缮Ｋ缯ﾋ缱ＤＡ缪Ｋ缯Ｙ缤缪ＨＬ缬Ａ",703205303>(var10002, var10001, (char)((var54 & 57344) >> 13 | var54 << 3));
                  var10001 += (-319920848 ^ -1066835540 | 1) & 1114157345;
               }

               var11 = (Class_49)0<"JNT",944528297,"皺谺辺谺銺瞺","꼹꽋꽚⽕꽠⽕⼼꽛⽕꽜⽘⼼⽎꽟꽞⽙꽜⽘⽂꽇꽇꽇꽇⼹꽐","Ｌ缩",703204432>(
                  0<"JNT",-35740848,"銺輺脺銺醺谺辺謺","꼹⼹꽋꽚⽕꽠⽕⼼꽛⽕꽜⽘⼼⽎꽟꽞⽙꽜⽘⽂","Ｅ缮Ｇ缮ﾋＨ缮Ｋ缯ﾋ缱ＤＡ缪Ｋ缯Ｙ缤缪ＨＬ缬Ａ",703204439>(var10002), 0.0, 100.0, 100.0, 1.0
               );
               var26 = (1752887249 - (1752887249 | 1152943191) | 0) & 5;
               var37 = (StringBuilder)0<"JNT",944528297,"皺谺辺谺銺瞺","꼹꽋꽚⽕꽠⽕⼼꽛⽕꽜⽘⼼⽎꽟꽞⽙꽜⽘⽂⼹꽐","Ｅ缮Ｇ缮ﾋＨ缮Ｋ缯ﾋ缱ＤＡ缪Ｋ缯Ｙ缤缪ＨＬ缬Ａ",703204425>(
                  "ᾅ뾉\udf86羈ᾉ徉\udf7e龈羉\udf7eᾉ㾈\udf89ᾉᾈ\udf89羈龉\udf7e\udf81뾈徉ﾋᾉ徉羈㾋\udf86龉徉ﾁ"
               );
            }

            var1 = -530267109 & 1087991367 ^ 1715557484;
         }
      }
   }

   // $VF: renamed from: mg () void
   @Override
   public void method_1407() {
      1<"JNT",1943998413,"櫈\ueac9","ﳷﳰ","㚨뚨㛉",-416211226>(this, 0<"JNT",941627630,"褺鈺醺醺診辺銺芺谺踺診縺谺躺躺谺鄺","꼹⼹꽊","Ｅ缮Ｇ缮ﾋＨ缮Ｋ缯ﾋ缱缢缡Ｄ缬缨",703205296>());
      0<"JNT",518872864,"踺謺","꼹⼹꽐","缤缡Ｏ",703205330>(this);
   }

   // $VF: renamed from: q () void
   @Override
   public void method_1408() {
      0<"JNT",518872864,"逺","꼹⼹꽐","缤缡Ｏ",703205331>(this);
   }

   // $VF: renamed from: gd (Class_207) void
   @Class_21
   public void method_1809(Class_207 var1) {
      int var4 = -1634325609;
      if (1<"JNT",1037518196,"\uead0櫎櫐\uead3\ueac7櫕檪檩\ueaaa\ueadf","ﳺﳱﴀﲺﳹﳵﳺﳱﳯﳾﳭﳲﴀﲺﳯﳸﳭﳿﳿﳫﲿﲽﳌ","㚨뚨㛊㛛뛆㛞뚻뛚뛈㛛뛆뛅㛝뛄㛇㛞뚻뛅㛚뛄뛝뛝뛃뚿㚾㚿뚱",-416211221>(
            1<"JNT",1037518196,"\uead3\ueaca","ﳷﳰ","㚨뚨㛊㛛뛆㛞뚻뛚뛈㛛뛆뛅㛝뛄㛇㛞뚻뛅㛚뛄뛝뛝뛃뚽뚼㚼뚱",-416211238>(this)
         )
         != null) {
         var4 = -576479261 << 1881119230 ^ -1151353541;

         while (true) {
            switch ((var4 ^ 296877290 ^ 1319576303) - 1013457578 - 1261205402 ^ 432252398 ^ 1140913534) {
               case -1049126806:
                  if (1<"JNT",1037518196,"\uead0櫎櫐\uead3\ueac7櫕檪檩檨檨","ﳺﳱﴀﲺﳹﳵﳺﳱﳯﳾﳭﳲﴀﲺﳯﳸﳭﳿﳿﳫﲿﲽﳌ","㚨뚨㛊㛛뛆㛞뚻뛚뛈㛛뛆뛅㛝뛄㛇㛞뚻뛅㛚뛄뛝뛝뛃㚾뚽뚿뚱",-416211239>(
                        1<"JNT",1037518196,"\uead3\ueaca","ﳷﳰ","㚨뚨㛊㛛뛆㛞뚻뛚뛈㛛뛆뛅㛝뛄㛇㛞뚻뛅㛚뛄뛝뛝뛃뚽뚼㚼뚱",-416211240>(this)
                     )
                     != null) {
                     return;
                  }

                  var4 = -1732960850 & 1033613209 ^ 1991538250;
                  break;
               case -578538217:
               default:
                  long var2 = 0<"JNT",941627630,"褺鈺醺醺診辺銺芺谺踺診縺谺躺躺谺鄺","꼹⼹꽊","Ｅ缮Ｇ缮ﾋＨ缮Ｋ缯ﾋ缱缢缡Ｄ缬缨",703205292>();
                  if ((float)(var2 - 1<"JNT",1037518196,"櫈\ueac9","ﳷﳰ","㚨뚨㛉",-416211222>(this))
                     < 0<"JNT",-35740848,"蠺銺谺","꼹⼹꽈","Ｌ缩",703205295>(1<"JNT",1037518196,"櫉\uead2","ﳷﳰ","㚨뚨㛊㛆뛅뚱",-416211077>(this))) {
                     return;
                  } else {
                     var4 = 1337453859;

                     while (true) {
                        switch (((var4 ^ 227455684) - 1195020468 + 250466296 + 184945568 ^ 603606982) - 1568471066) {
                           case -1905806700:
                              if (0<"JNT",-35740848,"閺贺診","꼹꽋꽚⽕꽠⽕⼼꽛⽕꽜⽘⼼⽇꽜⽟⽛⽂⼹꽒","Ｄ缫",703205258>(
                                 1<"JNT",1037518196,"\ueace櫉","ﳷﳰ","㚨뚨㛊㛞뛛뚱",-416211075>(this), 1<"JNT",1882289687,"\ueac7櫈\ueace","ﳲﴁ","㚨뚨㛊㛇뛞뚱",-416211074>()
                              )) {
                                 0<"JNT",-35740848,"论褺躺","꼹⼹꽐","缥Ｌ",703205259>(this);
                              }

                              var4 = 1357235828;
                              break;
                           case -1235093448:
                              if (0<"JNT",-35740848,"閺贺診","꼹꽋꽚⽕꽠⽕⼼꽛⽕꽜⽘⼼⽇꽜⽟⽛⽂⼹꽒","Ｄ缫",703205254>(
                                 1<"JNT",1037518196,"\ueace櫉","ﳷﳰ","㚨뚨㛊㛞뛛뚱",-416211231>(this), 1<"JNT",1882289687,"櫋櫐\ueace","ﳲﴁ","㚨뚨㛊㛇뛞뚱",-416211230>()
                              )) {
                                 0<"JNT",-35740848,"趺銺鄺","꼹⼹꽐","缥Ｌ",703205255>(this);
                              }

                              var4 = (134069260 | 937441210 | 53875739) & 1530387483;
                              break;
                           case -645141261:
                              if (0<"JNT",-35740848,"论閺謺","꼹⼹⽉","Ｌ缩",703205305>(1<"JNT",1037518196,"\ueaca\ueac7櫎","ﳷﳰ","㚨뚨㛊㛆뛅뚱",-416211243>(this))
                                 < 0<"JNT",-35740848,"躺辺贺","꼹⽉⽉⼹⽉","缥Ｌ",703205282>(this, 1, 100)) {
                                 return;
                              }

                              var4 = (-580097161 + 279117030 | 283838464) & -117757856;
                              break;
                           case 1963671019:
                           default:
                              return;
                        }
                     }
                  }
               case -195273965:
                  if (1<"JNT",1037518196,"\uead0櫎櫐\uead3\ueac7櫕檪檩\ueaa8檨","ﳺﳱﴀﲺﳹﳵﳺﳱﳯﳾﳭﳲﴀﲺﳯﳸﳭﳿﳿﳫﲿﲽﳌ","㚨뚨㛊㛛뛆㛞뚻뛚뛈㛛뛆뛅㛝뛄㛇㛞뚻뛅㛚뛄뛝뛝뛃㚽뚽뛀뚱",-416211219>(
                        1<"JNT",1037518196,"\uead3\ueaca","ﳷﳰ","㚨뚨㛊㛛뛆㛞뚻뛚뛈㛛뛆뛅㛝뛄㛇㛞뚻뛅㛚뛄뛝뛝뛃뚽뚼㚼뚱",-416211220>(this)
                     )
                     == null) {
                     return;
                  }

                  var4 = (-1392138668 + -1392138668 + -1392138668 + -1392138668 | 1221140942) & 1540188142;
            }
         }
      }
   }

   // $VF: renamed from: jts () void
   public void method_1810() {
      int var3 = -1212072332;
      class_1792 var1 = 0<"JNT",-35740848,"踺診銺貺輺誺蜺猺琺為琺","꼹⼹꽋꽜⽗꽟⼼⽛⽙꽜⽗⽖꽞⽕꽘꽟⼼⽖꽛⽕⽞⽞⽔⼽⽀⽁꼾⽂","Ｋ缬Ｄﾋ缨缪Ｋ缬缩Ａ缮ＯＤﾋ缩Ｈ缮缡缡缳羆羇羂羂",703204586>(
         0<"JNT",-35740848,"踺診銺貺輺誺蜺玺為犺猺","꼹⼹꽋꽜⽗꽟⼼⽛⽙꽜⽗⽖꽞⽕꽘꽟⼼⽖꽛⽕⽞⽞⽔⼽⽀⽁⽁⽂","Ｋ缬Ｄﾋ缨缪Ｋ缬缩Ａ缮ＯＤﾋ缩Ｈ缮缡缡缳羇ﾄﾇ",703204577>(
            1<"JNT",1037518196,"\uead0櫎櫐\uead3\ueac7櫕檪檩\ueaaa\ueadf","ﳺﳱﴀﲺﳹﳵﳺﳱﳯﳾﳭﳲﴀﲺﳯﳸﳭﳿﳿﳫﲿﲽﳌ","㚨뚨㛊㛛뛆㛞뚻뛚뛈㛛뛆뛅㛝뛄㛇㛞뚻뛅㛚뛄뛝뛝뛃뚿㚾㚿뚱",-416211235>(
               1<"JNT",1037518196,"\uead3\ueaca","ﳷﳰ","㚨뚨㛊㛛뛆㛞뚻뛚뛈㛛뛆뛅㛝뛄㛇㛞뚻뛅㛚뛄뛝뛝뛃뚽뚼㚼뚱",-416211236>(this)
            )
         )
      );
      class_1792 var2 = 0<"JNT",-35740848,"踺診銺貺輺誺蜺猺琺為琺","꼹⼹꽋꽜⽗꽟⼼⽛⽙꽜⽗⽖꽞⽕꽘꽟⼼⽖꽛⽕⽞⽞⽔⼽⽀⽁꼾⽂","Ｋ缬Ｄﾋ缨缪Ｋ缬缩Ａ缮ＯＤﾋ缩Ｈ缮缡缡缳羆羇羂羂",703204582>(
         0<"JNT",-35740848,"踺診銺貺輺誺蜺玺為猺琺","꼹⼹꽋꽜⽗꽟⼼⽛⽙꽜⽗⽖꽞⽕꽘꽟⼼⽖꽛⽕⽞⽞⽔⼽⽀⽁⽁⽂","Ｋ缬Ｄﾋ缨缪Ｋ缬缩Ａ缮ＯＤﾋ缩Ｈ缮缡缡缳羇ﾄﾇ",703204589>(
            1<"JNT",1037518196,"\uead0櫎櫐\uead3\ueac7櫕檪檩\ueaaa\ueadf","ﳺﳱﴀﲺﳹﳵﳺﳱﳯﳾﳭﳲﴀﲺﳯﳸﳭﳿﳿﳫﲿﲽﳌ","㚨뚨㛊㛛뛆㛞뚻뛚뛈㛛뛆뛅㛝뛄㛇㛞뚻뛅㛚뛄뛝뛝뛃뚿㚾㚿뚱",-416211263>(
               1<"JNT",1037518196,"\uead3\ueaca","ﳷﳰ","㚨뚨㛊㛛뛆㛞뚻뛚뛈㛛뛆뛅㛝뛄㛇㛞뚻뛅㛚뛄뛝뛝뛃뚽뚼㚼뚱",-416211264>(this)
            )
         )
      );
      if (!0<"JNT",-79989565,"踺診銺貺輺誺蜺爺猺璺焺熺","꼹꽋꽜⽗꽟⼼⽛⽙꽜⽗⽖꽞⽕꽘꽟⼼⽖꽛⽕⽞⽞⽔⽁⼾⼾⼽⽂⼹꽒","Ｋ缬Ｄﾋ缨缪Ｋ缬缩Ａ缮ＯＤﾋ缩Ｈ缮缡缡缳羂羁ﾁ羁",703205273>(
         0<"JNT",-35740848,"踺診銺貺輺誺蜺爺猺焺犺猺","꼹⼹꽋꽜⽗꽟⼼⽛⽙꽜⽗⽖꽞⽕꽘꽟⼼⽖꽛⽕⽞⽞⽔⽁⼾꼾⼾⽂","Ｋ缬Ｄﾋ缨缪Ｋ缬缩Ａ缮ＯＤﾋ缩Ｈ缮缡缡缳羆羇羂ﾁ",703204583>(var1),
         1<"JNT",1882289687,"\uead0櫎櫐\uead3\ueac7櫕檨\ueaa9\ueaa9檩檨","ﳺﳱﴀﲺﳹﳵﳺﳱﳯﳾﳭﳲﴀﲺﳯﳸﳭﳿﳿﳫﳅﲿﲿﳀ","㚨뚨㛊㛛뛆㛞뚻뛚뛈㛛뛆뛅㛝뛄㛇㛞뚻뛅㛚뛄뛝뛝뛃뛀뚽뚽뚼뚱",-416211275>()
      )) {
         var3 = -1587517864 - -1587517864 ^ 1013735766;

         while (true) {
            switch ((var3 + 394303415 + 129519045 + 2144087833 ^ 955428343) + 1581328321 - 2038354585) {
               case -1507536332:
                  if (!(var1 instanceof class_1811) && !(var2 instanceof class_1811)) {
                     var3 = 556437900;
                     break;
                  }

                  var3 = (1417880226 * 1417880226 | 1233144025) & 1539398873;
                  break;
               case -1225317951:
               default:
                  return;
               case -934924988:
                  if (0<"JNT",-79989565,"踺診銺貺輺誺蜺爺猺璺焺熺","꼹꽋꽜⽗꽟⼼⽛⽙꽜⽗⽖꽞⽕꽘꽟⼼⽖꽛⽕⽞⽞⽔⽁⼾⼾⼽⽂⼹꽒","Ｋ缬Ｄﾋ缨缪Ｋ缬缩Ａ缮ＯＤﾋ缩Ｈ缮缡缡缳羂羁ﾁ羁",703205262>(
                     0<"JNT",-35740848,"踺診銺貺輺誺蜺爺猺焺犺猺","꼹⼹꽋꽜⽗꽟⼼⽛⽙꽜⽗⽖꽞⽕꽘꽟⼼⽖꽛⽕⽞⽞⽔⽁⼾꼾⼾⽂","Ｋ缬Ｄﾋ缨缪Ｋ缬缩Ａ缮ＯＤﾋ缩Ｈ缮缡缡缳羆羇羂ﾁ",703205260>(var2),
                     1<"JNT",1882289687,"\uead0櫎櫐\uead3\ueac7櫕檨\ueaa9\ueaa9檩檨","ﳺﳱﴀﲺﳹﳵﳺﳱﳯﳾﳭﳲﴀﲺﳯﳸﳭﳿﳿﳫﳅﲿﲿﳀ","㚨뚨㛊㛛뛆㛞뚻뛚뛈㛛뛆뛅㛝뛄㛇㛞뚻뛅㛚뛄뛝뛝뛃뛀뚽뚽뚼뚱",-416211254>()
                  )) {
                     return;
                  }

                  var3 = 1519107174;
                  break;
               case -576757506:
                  if (0<"JNT",-35740848,"蠺钺","꼹⼹꽒","缯Ａ",703205274>(1<"JNT",1037518196,"櫌\ueacc","ﳷﳰ","㚨뚨㛊뛇㛝뚱",-416211218>(this))
                     && 0<"JNT",941627630,"謺躺论錺笺診銺縺輺鈺鄺診禺鈺銺銺輺辺","꼹꽊⽉⼹⽉","缫Ａ缯ﾋＨ缧Ｅ缯Ｈﾋ缯ＨＯ缧ﾋ缿Ｘ＿缷",703205270>(
                           0<"JNT",-35740848,"踺診銺貺輺誺蜺犺犺琺為","꼹⼹꽊","Ｋ缬Ｄﾋ缨缪Ｋ缬缩Ａ缮ＯＤﾋ缩Ｈ缮缡缡缳羆ﾆﾄ羆",703205277>(
                              0<"JNT",-35740848,"踺診銺貺輺誺蜺熺熺玺璺焺","꼹⼹꽋꽜⽗꽟⼼⽛⽙꽜⽗⽖꽞⽕꽘꽟⼼⽖꽛⽕⽞⽞⽔⼽꼽꼿⼽⽂","Ｋ缬Ｄﾋ缨缪Ｋ缬缩Ａ缮ＯＤﾋ缩Ｈ缮缡缡缳羁羆ﾆ",703205268>(
                                 1<"JNT",1037518196,"\uead3\ueaca","ﳷﳰ","㚨뚨㛊㛛뛆㛞뚻뛚뛈㛛뛆뛅㛝뛄㛇㛞뚻뛅㛚뛄뛝뛝뛃뚽뚼㚼뚱",-416211248>(this)
                              )
                           ),
                           1
                        )
                        != 1) {
                     return;
                  }

                  var3 = -759894306 & -759894306 >> (-759894306 | -759894306) ^ 2029530151;
                  break;
               case 1449512865:
                  0<"JNT",941627630,"踺診銺貺輺誺蜺瀺犺熺為","꼹꽋꽜⽗꽟⼼⽛⽙꽜⽗⽖꽞⽕꽘꽟⼼⽖꽛⽕⽞⽞⽔⼾꽀⽀⼿꼷⽖꽛⽕⽞⽞⽔⼾꼽꽀⽂⼹꽐","Ｋ缬Ｄﾋ缨缪Ｋ缬缩Ａ缮ＯＤﾋ缩Ｈ缮缡缡缳羁ﾆﾄ",703205257>(
                     0<"JNT",-35740848,"踺診銺貺輺誺蜺瀺犺犺猺","꼹⽉⼹꽋꽜⽗꽟⼼⽛⽙꽜⽗⽖꽞⽕꽘꽟⼼⽖꽛⽕⽞⽞⽔⼾꽀⽀⼿꼷⽖꽛⽕⽞⽞⽔⼾꼽꽀⽂","Ｋ缬Ｄﾋ缨缪Ｋ缬缩Ａ缮ＯＤﾋ缩Ｈ缮缡缡缳羁ﾇ羇羄ﾌ缩Ｈ缮缡缡缳羁ﾆ羇",703205264>(
                        1<"JNT",1882289687,"\uead0櫎櫐\uead3\ueac7櫕檪\ueaa8檩\ueaaa","ﳺﳱﴀﲺﳹﳵﳺﳱﳯﳾﳭﳲﴀﲺﳯﳸﳭﳿﳿﳫﲿﳂﳃﳁﲰﳯﳸﳭﳿﳿﳫﲿﳌﳃ","㚨뚨㛊㛛뛆㛞뚻뛚뛈㛛뛆뛅㛝뛄㛇㛞뚻뛅㛚뛄뛝뛝뛃뚽㚿뚿뚾㚦뛅㛚뛄뛝뛝뛃뚽㚼뚿뚱",-416211260>(),
                        1
                     )
                  );
                  1<"JNT",1943998413,"櫈\ueac9","ﳷﳰ","㚨뚨㛉",-416211256>(this, 0<"JNT",941627630,"褺鈺醺醺診辺銺芺谺踺診縺谺躺躺谺鄺","꼹⼹꽊","Ｅ缮Ｇ缮ﾋＨ缮Ｋ缯ﾋ缱缢缡Ｄ缬缨",703205298>());
                  return;
            }
         }
      }
   }

   // $VF: renamed from: fcl () void
   public void method_1811() {
      int var1 = 432731071;
      if (0<"JNT",-35740848,"踺診銺貺輺誺蜺瀺猺猺璺焺","꼹⼹꽋꽜⽗꽟⼼⽛⽙꽜⽗⽖꽞⽕꽘꽟⼼⽖꽛⽕⽞⽞⽔꼾⼾⽁꼷⽖꽛⽕⽞⽞⽔꼾꼿꼽⽂","Ｋ缬Ｄﾋ缨缪Ｋ缬缩Ａ缮ＯＤﾋ缩Ｈ缮缡缡缳ﾁ羁羂",703204605>(
            1<"JNT",1037518196,"\uead0櫎櫐\uead3\ueac7櫕檪檩\ueaa8檨","ﳺﳱﴀﲺﳹﳵﳺﳱﳯﳾﳭﳲﴀﲺﳯﳸﳭﳿﳿﳫﲿﲽﳌ","㚨뚨㛊㛛뛆㛞뚻뛚뛈㛛뛆뛅㛝뛄㛇㛞뚻뛅㛚뛄뛝뛝뛃㚽뚽뛀뚱",-416211151>(
               1<"JNT",1037518196,"\uead3\ueaca","ﳷﳰ","㚨뚨㛊㛛뛆㛞뚻뛚뛈㛛뛆뛅㛝뛄㛇㛞뚻뛅㛚뛄뛝뛝뛃뚽뚼㚼뚱",-416211152>(this)
            )
         )
         != 1<"JNT",1882289687,"\uead0櫎櫐\uead3\ueac7櫕檪檫檫\ueaaa","ﳺﳱﴀﲺﳹﳵﳺﳱﳯﳾﳭﳲﴀﲺﳯﳸﳭﳿﳿﳫﲾﲿﳅﲰﳯﳸﳭﳿﳿﳫﲾﳀﳌ","㚨뚨㛊㛛뛆㛞뚻뛚뛈㛛뛆뛅㛝뛄㛇㛞뚻뛅㛚뛄뛝뛝뛃㚽뚽뛀㚦뛅㛚뛄뛝뛝뛃㚽㚾㚼뚱",-416211165>()) {
         var1 = -1364460049;

         while (true) {
            switch (((var1 ^ 1824343827) + 440976258 + 1451247281 ^ 1845994593) - 1857999742 - 215346669) {
               case -735838949:
                  if (0<"JNT",-35740848,"蠺钺","꼹⼹꽒","缯Ａ",703205251>(1<"JNT",1037518196,"櫌\ueacc","ﳷﳰ","㚨뚨㛊뛇㛝뚱",-416211273>(this))
                     && 0<"JNT",941627630,"謺躺论錺笺診銺縺輺鈺鄺診禺鈺銺銺輺辺","꼹꽊⽉⼹⽉","缫Ａ缯ﾋＨ缧Ｅ缯Ｈﾋ缯ＨＯ缧ﾋ缿Ｘ＿缷",703205279>(
                           0<"JNT",-35740848,"踺診銺貺輺誺蜺犺犺琺為","꼹⼹꽊","Ｋ缬Ｄﾋ缨缪Ｋ缬缩Ａ缮ＯＤﾋ缩Ｈ缮缡缡缳羆ﾆﾄ羆",703205278>(
                              0<"JNT",-35740848,"踺診銺貺輺誺蜺熺熺玺璺焺","꼹⼹꽋꽜⽗꽟⼼⽛⽙꽜⽗⽖꽞⽕꽘꽟⼼⽖꽛⽕⽞⽞⽔⼽꼽꼿⼽⽂","Ｋ缬Ｄﾋ缨缪Ｋ缬缩Ａ缮ＯＤﾋ缩Ｈ缮缡缡缳羁羆ﾆ",703204581>(
                                 1<"JNT",1037518196,"\uead3\ueaca","ﳷﳰ","㚨뚨㛊㛛뛆㛞뚻뛚뛈㛛뛆뛅㛝뛄㛇㛞뚻뛅㛚뛄뛝뛝뛃뚽뚼㚼뚱",-416211271>(this)
                              )
                           ),
                           0
                        )
                        != 1) {
                     return;
                  }

                  var1 = 1535356526;
                  break;
               case -515661853:
                  if (0<"JNT",-35740848,"踺診銺貺輺誺蜺玺瀺瀺爺","꼹⼹꽒","Ｋ缬Ｄﾋ缨缪Ｋ缬缩Ａ缮ＯＤﾋ缩Ｈ缮缡缡缳羇ﾄﾇ",703204585>(
                     1<"JNT",1037518196,"\uead0櫎櫐\uead3\ueac7櫕檪檩\ueaaa\ueadf","ﳺﳱﴀﲺﳹﳵﳺﳱﳯﳾﳭﳲﴀﲺﳯﳸﳭﳿﳿﳫﲿﲽﳌ","㚨뚨㛊㛛뛆㛞뚻뛚뛈㛛뛆뛅㛝뛄㛇㛞뚻뛅㛚뛄뛝뛝뛃뚿㚾㚿뚱",-416211163>(
                        1<"JNT",1037518196,"\uead3\ueaca","ﳷﳰ","㚨뚨㛊㛛뛆㛞뚻뛚뛈㛛뛆뛅㛝뛄㛇㛞뚻뛅㛚뛄뛝뛝뛃뚽뚼㚼뚱",-416211164>(this)
                     )
                  )) {
                     return;
                  }

                  var1 = (1440061941 | -1612498228 | -938847197) & -599042137;
                  break;
               case 1248564838:
               default:
                  0<"JNT",941627630,"踺診銺貺輺誺蜺瀺犺熺為","꼹꽋꽜⽗꽟⼼⽛⽙꽜⽗⽖꽞⽕꽘꽟⼼⽖꽛⽕⽞⽞⽔⼾꽀⽀⼿꼷⽖꽛⽕⽞⽞⽔⼾꼽꽀⽂⼹꽐","Ｋ缬Ｄﾋ缨缪Ｋ缬缩Ａ缮ＯＤﾋ缩Ｈ缮缡缡缳羁ﾆﾄ",703204602>(
                     0<"JNT",-35740848,"踺診銺貺輺誺蜺瀺犺犺猺","꼹⽉⼹꽋꽜⽗꽟⼼⽛⽙꽜⽗⽖꽞⽕꽘꽟⼼⽖꽛⽕⽞⽞⽔⼾꽀⽀⼿꼷⽖꽛⽕⽞⽞⽔⼾꼽꽀⽂","Ｋ缬Ｄﾋ缨缪Ｋ缬缩Ａ缮ＯＤﾋ缩Ｈ缮缡缡缳羁ﾇ羇羄ﾌ缩Ｈ缮缡缡缳羁ﾆ羇",703204593>(
                        1<"JNT",1882289687,"\uead0櫎櫐\uead3\ueac7櫕檪\ueaa8檩\ueaaa","ﳺﳱﴀﲺﳹﳵﳺﳱﳯﳾﳭﳲﴀﲺﳯﳸﳭﳿﳿﳫﲿﳂﳃﳁﲰﳯﳸﳭﳿﳿﳫﲿﳌﳃ","㚨뚨㛊㛛뛆㛞뚻뛚뛈㛛뛆뛅㛝뛄㛇㛞뚻뛅㛚뛄뛝뛝뛃뚽㚿뚿뚾㚦뛅㛚뛄뛝뛝뛃뚽㚼뚿뚱",-416211251>(),
                        0
                     )
                  );
                  return;
            }
         }
      }
   }

   // $VF: renamed from: lnk (int, int) int
   public int method_1812(int var1, int var2) {
      return var1 + (int)(0<"JNT",941627630,"醺蠺辺誺輺踺","꼹⼹꽇","Ｅ缮Ｇ缮ﾋＨ缮Ｋ缯ﾋ缸缮ＤＪ",703204370>() * (double)(var2 - var1 + 1));
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1413(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 ^ 983055694 ^ 753162460) - 1184412354 ^ 502824522) - 1077322710 + 566101237 + 674944838 + 1590715188 ^ 213172417;
      MethodHandle var10000 = field_2095[((var10 ^ 983055694 ^ 753162460) - 1184412354 ^ 502824522) - 1077322710 + 566101237 + 674944838 + 1590715188
         ^ 213172417
         ^ 1093444661];
      if (field_2095[var10001 ^ 1093444661] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = (-1443046697 >> 522857592 | 0) & 16; var23 < var13.length(); var23 += (1326443848 - -1799955831 | 1) & 1101399361) {
            int var42 = (var13.charAt(var23) ^ 'T') - 220 + 221 ^ 9 ^ 231;
            char var43 = (char)(((var42 & 65408) >> 7 | var42 << 9) - 185 - 188 - 86 - 229);
            var13.setCharAt(var23, (char)(((var42 & 65408) >> 7 | var42 << 9) - 185 - 188 - 86 - 229));
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = (1093785062 >>> -578991730 | 0) & 1217548336; var29 < var16.length(); var29 += -962500641 << -1503216161 ^ -2147483647) {
            char var48 = var16.charAt(var29);
            char var53 = (char)(
               (
                        (
                                 (
                                          (
                                                   (((((var48 & '耀') >> 15 | var48 << 1) & 49152) >> 14 | ((var48 & '耀') >> 15 | var48 << 1) << 2) + 42 & 32768)
                                                         >> 15
                                                      | ((((var48 & '耀') >> 15 | var48 << 1) & 49152) >> 14 | ((var48 & '耀') >> 15 | var48 << 1) << 2) + 42
                                                         << 1
                                                )
                                                + 112
                                                - 143
                                             & 65520
                                       )
                                       >> 4
                                    | (
                                             (((((var48 & '耀') >> 15 | var48 << 1) & 49152) >> 14 | ((var48 & '耀') >> 15 | var48 << 1) << 2) + 42 & 32768)
                                                   >> 15
                                                | ((((var48 & '耀') >> 15 | var48 << 1) & 49152) >> 14 | ((var48 & '耀') >> 15 | var48 << 1) << 2) + 42 << 1
                                          )
                                          + 112
                                          - 143
                                       << 12
                              )
                              - 20
                              + 236
                           & 32768
                     )
                     >> 15
                  | (
                           (
                                    (
                                             (((((var48 & '耀') >> 15 | var48 << 1) & 49152) >> 14 | ((var48 & '耀') >> 15 | var48 << 1) << 2) + 42 & 32768)
                                                   >> 15
                                                | ((((var48 & '耀') >> 15 | var48 << 1) & 49152) >> 14 | ((var48 & '耀') >> 15 | var48 << 1) << 2) + 42 << 1
                                          )
                                          + 112
                                          - 143
                                       & 65520
                                 )
                                 >> 4
                              | (
                                       (((((var48 & '耀') >> 15 | var48 << 1) & 49152) >> 14 | ((var48 & '耀') >> 15 | var48 << 1) << 2) + 42 & 32768) >> 15
                                          | ((((var48 & '耀') >> 15 | var48 << 1) & 49152) >> 14 | ((var48 & '耀') >> 15 | var48 << 1) << 2) + 42 << 1
                                    )
                                    + 112
                                    - 143
                                 << 12
                        )
                        - 20
                        + 236
                     << 1
            );
            var16.setCharAt(
               var29,
               (char)(
                  (
                           (
                                    (
                                             (
                                                      (
                                                               ((((var48 & '耀') >> 15 | var48 << 1) & 49152) >> 14 | ((var48 & '耀') >> 15 | var48 << 1) << 2)
                                                                     + 42
                                                                  & 32768
                                                            )
                                                            >> 15
                                                         | ((((var48 & '耀') >> 15 | var48 << 1) & 49152) >> 14 | ((var48 & '耀') >> 15 | var48 << 1) << 2) + 42
                                                            << 1
                                                   )
                                                   + 112
                                                   - 143
                                                & 65520
                                          )
                                          >> 4
                                       | (
                                                (((((var48 & '耀') >> 15 | var48 << 1) & 49152) >> 14 | ((var48 & '耀') >> 15 | var48 << 1) << 2) + 42 & 32768)
                                                      >> 15
                                                   | ((((var48 & '耀') >> 15 | var48 << 1) & 49152) >> 14 | ((var48 & '耀') >> 15 | var48 << 1) << 2) + 42 << 1
                                             )
                                             + 112
                                             - 143
                                          << 12
                                 )
                                 - 20
                                 + 236
                              & 32768
                        )
                        >> 15
                     | (
                              (
                                       (
                                                (((((var48 & '耀') >> 15 | var48 << 1) & 49152) >> 14 | ((var48 & '耀') >> 15 | var48 << 1) << 2) + 42 & 32768)
                                                      >> 15
                                                   | ((((var48 & '耀') >> 15 | var48 << 1) & 49152) >> 14 | ((var48 & '耀') >> 15 | var48 << 1) << 2) + 42 << 1
                                             )
                                             + 112
                                             - 143
                                          & 65520
                                    )
                                    >> 4
                                 | (
                                          (((((var48 & '耀') >> 15 | var48 << 1) & 49152) >> 14 | ((var48 & '耀') >> 15 | var48 << 1) << 2) + 42 & 32768) >> 15
                                             | ((((var48 & '耀') >> 15 | var48 << 1) & 49152) >> 14 | ((var48 & '耀') >> 15 | var48 << 1) << 2) + 42 << 1
                                       )
                                       + 112
                                       - 143
                                    << 12
                           )
                           - 20
                           + 236
                        << 1
               )
            );
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_157.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = (-1977768518 << -1977768518 | 0) & 289785398; var35 < var19.length(); var35 += (1243348968 >>> -1550979963 | 0) & 1770389505) {
            int var58 = (var19.charAt(var35) ^ 253) + 29 - 121 + 250;
            int var82 = (var58 & 65534) >> 1;
            int var59 = (var58 & 65534) >> 1 | var58 << 15;
            int var83 = (((var58 & 65534) >> 1 | var58 << 15) & 49152) >> 14;
            char var60 = (char)(((((var82 | var58 << 15) & 49152) >> 14 | ((var58 & 65534) >> 1 | var58 << 15) << 2) ^ 126) + 62 ^ 220 ^ 102);
            var19.setCharAt(var35, (char)(((var83 | var59 << 2) ^ 126) + 62 ^ 220 ^ 102));
         }

         Class var7 = Class.forName(var19.toString(), false, Class_157.class.getClassLoader());
         switch (((var4 ^ 1475596095 ^ 850023526) - 1839841771 ^ 1300047905 ^ 1864075406 ^ 849488575 ^ 560974717 ^ 552126273) + 781534648 ^ 568787645) {
            case 214339365:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            case 224050268:
               var10000 = var0.findConstructor(var7, var6);
               break;
            case 1272133463:
            case 1902703494:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 1815791847:
               var10000 = var0.findSpecial(var7, var5, var6, Class_157.class);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_2095[((var10 ^ 983055694 ^ 753162460) - 1184412354 ^ 502824522) - 1077322710 + 566101237 + 674944838 + 1590715188 ^ 213172417 ^ 1093444661] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1414(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 + 1998615361 - 541358367 + 971973547 ^ 129062327) - 463527258 + 805817067 - 723292205 ^ 1957070095) - 1110597883;
      MethodHandle var10000 = field_2095[((var10 + 1998615361 - 541358367 + 971973547 ^ 129062327) - 463527258 + 805817067 - 723292205 ^ 1957070095)
         - 1110597883
         + 352394700];
      if (field_2095[var10001 + 352394700] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = (-1656834518 | -1656834518 ^ (-1656834518 | -1656834518) | 0) & 12599365;
            var24 < var14.length();
            var24 += 2121636715 & 2103765386 ^ 2086963467
         ) {
            char var43 = var14.charAt(var24);
            char var48 = (char)(
               (
                     (
                              (
                                       (
                                             (
                                                      (
                                                            (
                                                                     (
                                                                           (
                                                                                    (((var43 & '\uffff') >> 0 | var43 << 16) & 65532) >> 2
                                                                                       | ((var43 & '\uffff') >> 0 | var43 << 16) << 14
                                                                                 )
                                                                                 + 7
                                                                              ^ 193
                                                                        )
                                                                        & 65532
                                                                  )
                                                                  >> 2
                                                               | (
                                                                     (
                                                                              (((var43 & '\uffff') >> 0 | var43 << 16) & 65532) >> 2
                                                                                 | ((var43 & '\uffff') >> 0 | var43 << 16) << 14
                                                                           )
                                                                           + 7
                                                                        ^ 193
                                                                  )
                                                                  << 14
                                                         )
                                                         & 65532
                                                   )
                                                   >> 2
                                                | (
                                                      (
                                                               (
                                                                     (
                                                                              (((var43 & '\uffff') >> 0 | var43 << 16) & 65532) >> 2
                                                                                 | ((var43 & '\uffff') >> 0 | var43 << 16) << 14
                                                                           )
                                                                           + 7
                                                                        ^ 193
                                                                  )
                                                                  & 65532
                                                            )
                                                            >> 2
                                                         | (
                                                               (
                                                                        (((var43 & '\uffff') >> 0 | var43 << 16) & 65532) >> 2
                                                                           | ((var43 & '\uffff') >> 0 | var43 << 16) << 14
                                                                     )
                                                                     + 7
                                                                  ^ 193
                                                            )
                                                            << 14
                                                   )
                                                   << 14
                                          )
                                          ^ 202
                                    )
                                    + 148
                                 & 65024
                           )
                           >> 9
                        | (
                                 (
                                       (
                                                (
                                                      (
                                                               (
                                                                     (
                                                                              (((var43 & '\uffff') >> 0 | var43 << 16) & 65532) >> 2
                                                                                 | ((var43 & '\uffff') >> 0 | var43 << 16) << 14
                                                                           )
                                                                           + 7
                                                                        ^ 193
                                                                  )
                                                                  & 65532
                                                            )
                                                            >> 2
                                                         | (
                                                               (
                                                                        (((var43 & '\uffff') >> 0 | var43 << 16) & 65532) >> 2
                                                                           | ((var43 & '\uffff') >> 0 | var43 << 16) << 14
                                                                     )
                                                                     + 7
                                                                  ^ 193
                                                            )
                                                            << 14
                                                   )
                                                   & 65532
                                             )
                                             >> 2
                                          | (
                                                (
                                                         (
                                                               (
                                                                        (((var43 & '\uffff') >> 0 | var43 << 16) & 65532) >> 2
                                                                           | ((var43 & '\uffff') >> 0 | var43 << 16) << 14
                                                                     )
                                                                     + 7
                                                                  ^ 193
                                                            )
                                                            & 65532
                                                      )
                                                      >> 2
                                                   | (
                                                         (
                                                                  (((var43 & '\uffff') >> 0 | var43 << 16) & 65532) >> 2
                                                                     | ((var43 & '\uffff') >> 0 | var43 << 16) << 14
                                                               )
                                                               + 7
                                                            ^ 193
                                                      )
                                                      << 14
                                             )
                                             << 14
                                    )
                                    ^ 202
                              )
                              + 148
                           << 7
                  )
                  ^ 180
            );
            var14.setCharAt(
               var24,
               (char)(
                  (
                        (
                                 (
                                          (
                                                (
                                                         (
                                                               (
                                                                        (
                                                                              (
                                                                                       (((var43 & '\uffff') >> 0 | var43 << 16) & 65532) >> 2
                                                                                          | ((var43 & '\uffff') >> 0 | var43 << 16) << 14
                                                                                    )
                                                                                    + 7
                                                                                 ^ 193
                                                                           )
                                                                           & 65532
                                                                     )
                                                                     >> 2
                                                                  | (
                                                                        (
                                                                                 (((var43 & '\uffff') >> 0 | var43 << 16) & 65532) >> 2
                                                                                    | ((var43 & '\uffff') >> 0 | var43 << 16) << 14
                                                                              )
                                                                              + 7
                                                                           ^ 193
                                                                     )
                                                                     << 14
                                                            )
                                                            & 65532
                                                      )
                                                      >> 2
                                                   | (
                                                         (
                                                                  (
                                                                        (
                                                                                 (((var43 & '\uffff') >> 0 | var43 << 16) & 65532) >> 2
                                                                                    | ((var43 & '\uffff') >> 0 | var43 << 16) << 14
                                                                              )
                                                                              + 7
                                                                           ^ 193
                                                                     )
                                                                     & 65532
                                                               )
                                                               >> 2
                                                            | (
                                                                  (
                                                                           (((var43 & '\uffff') >> 0 | var43 << 16) & 65532) >> 2
                                                                              | ((var43 & '\uffff') >> 0 | var43 << 16) << 14
                                                                        )
                                                                        + 7
                                                                     ^ 193
                                                               )
                                                               << 14
                                                      )
                                                      << 14
                                             )
                                             ^ 202
                                       )
                                       + 148
                                    & 65024
                              )
                              >> 9
                           | (
                                    (
                                          (
                                                   (
                                                         (
                                                                  (
                                                                        (
                                                                                 (((var43 & '\uffff') >> 0 | var43 << 16) & 65532) >> 2
                                                                                    | ((var43 & '\uffff') >> 0 | var43 << 16) << 14
                                                                              )
                                                                              + 7
                                                                           ^ 193
                                                                     )
                                                                     & 65532
                                                               )
                                                               >> 2
                                                            | (
                                                                  (
                                                                           (((var43 & '\uffff') >> 0 | var43 << 16) & 65532) >> 2
                                                                              | ((var43 & '\uffff') >> 0 | var43 << 16) << 14
                                                                        )
                                                                        + 7
                                                                     ^ 193
                                                               )
                                                               << 14
                                                      )
                                                      & 65532
                                                )
                                                >> 2
                                             | (
                                                   (
                                                            (
                                                                  (
                                                                           (((var43 & '\uffff') >> 0 | var43 << 16) & 65532) >> 2
                                                                              | ((var43 & '\uffff') >> 0 | var43 << 16) << 14
                                                                        )
                                                                        + 7
                                                                     ^ 193
                                                               )
                                                               & 65532
                                                         )
                                                         >> 2
                                                      | (
                                                            (
                                                                     (((var43 & '\uffff') >> 0 | var43 << 16) & 65532) >> 2
                                                                        | ((var43 & '\uffff') >> 0 | var43 << 16) << 14
                                                                  )
                                                                  + 7
                                                               ^ 193
                                                         )
                                                         << 14
                                                )
                                                << 14
                                       )
                                       ^ 202
                                 )
                                 + 148
                              << 7
                     )
                     ^ 180
               )
            );
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = (-1188719551 & -1188719551 - 89509626 | 0) & 147485196; var30 < var17.length(); var30 += (194303674 | 1927902141) ^ 2080241598) {
            int var53 = var17.charAt(var30) - 237;
            char var58 = (char)(
               (
                        (
                              (
                                       (
                                             (
                                                      ((((var53 & 65535) >> 0 | var53 << 16) & 65520) >> 4 | ((var53 & 65535) >> 0 | var53 << 16) << 12)
                                                            - 99
                                                            - 197
                                                            + 153
                                                            + 213
                                                         & 63488
                                                   )
                                                   >> 11
                                                | ((((var53 & 65535) >> 0 | var53 << 16) & 65520) >> 4 | ((var53 & 65535) >> 0 | var53 << 16) << 12)
                                                      - 99
                                                      - 197
                                                      + 153
                                                      + 213
                                                   << 5
                                          )
                                          & 63488
                                    )
                                    >> 11
                                 | (
                                       (
                                                ((((var53 & 65535) >> 0 | var53 << 16) & 65520) >> 4 | ((var53 & 65535) >> 0 | var53 << 16) << 12)
                                                      - 99
                                                      - 197
                                                      + 153
                                                      + 213
                                                   & 63488
                                             )
                                             >> 11
                                          | ((((var53 & 65535) >> 0 | var53 << 16) & 65520) >> 4 | ((var53 & 65535) >> 0 | var53 << 16) << 12)
                                                - 99
                                                - 197
                                                + 153
                                                + 213
                                             << 5
                                    )
                                    << 5
                           )
                           & 65472
                     )
                     >> 6
                  | (
                        (
                                 (
                                       (
                                                ((((var53 & 65535) >> 0 | var53 << 16) & 65520) >> 4 | ((var53 & 65535) >> 0 | var53 << 16) << 12)
                                                      - 99
                                                      - 197
                                                      + 153
                                                      + 213
                                                   & 63488
                                             )
                                             >> 11
                                          | ((((var53 & 65535) >> 0 | var53 << 16) & 65520) >> 4 | ((var53 & 65535) >> 0 | var53 << 16) << 12)
                                                - 99
                                                - 197
                                                + 153
                                                + 213
                                             << 5
                                    )
                                    & 63488
                              )
                              >> 11
                           | (
                                 (
                                          ((((var53 & 65535) >> 0 | var53 << 16) & 65520) >> 4 | ((var53 & 65535) >> 0 | var53 << 16) << 12)
                                                - 99
                                                - 197
                                                + 153
                                                + 213
                                             & 63488
                                       )
                                       >> 11
                                    | ((((var53 & 65535) >> 0 | var53 << 16) & 65520) >> 4 | ((var53 & 65535) >> 0 | var53 << 16) << 12) - 99 - 197 + 153 + 213
                                       << 5
                              )
                              << 5
                     )
                     << 10
            );
            var17.setCharAt(
               var30,
               (char)(
                  (
                           (
                                 (
                                          (
                                                (
                                                         ((((var53 & 65535) >> 0 | var53 << 16) & 65520) >> 4 | ((var53 & 65535) >> 0 | var53 << 16) << 12)
                                                               - 99
                                                               - 197
                                                               + 153
                                                               + 213
                                                            & 63488
                                                      )
                                                      >> 11
                                                   | ((((var53 & 65535) >> 0 | var53 << 16) & 65520) >> 4 | ((var53 & 65535) >> 0 | var53 << 16) << 12)
                                                         - 99
                                                         - 197
                                                         + 153
                                                         + 213
                                                      << 5
                                             )
                                             & 63488
                                       )
                                       >> 11
                                    | (
                                          (
                                                   ((((var53 & 65535) >> 0 | var53 << 16) & 65520) >> 4 | ((var53 & 65535) >> 0 | var53 << 16) << 12)
                                                         - 99
                                                         - 197
                                                         + 153
                                                         + 213
                                                      & 63488
                                                )
                                                >> 11
                                             | ((((var53 & 65535) >> 0 | var53 << 16) & 65520) >> 4 | ((var53 & 65535) >> 0 | var53 << 16) << 12)
                                                   - 99
                                                   - 197
                                                   + 153
                                                   + 213
                                                << 5
                                       )
                                       << 5
                              )
                              & 65472
                        )
                        >> 6
                     | (
                           (
                                    (
                                          (
                                                   ((((var53 & 65535) >> 0 | var53 << 16) & 65520) >> 4 | ((var53 & 65535) >> 0 | var53 << 16) << 12)
                                                         - 99
                                                         - 197
                                                         + 153
                                                         + 213
                                                      & 63488
                                                )
                                                >> 11
                                             | ((((var53 & 65535) >> 0 | var53 << 16) & 65520) >> 4 | ((var53 & 65535) >> 0 | var53 << 16) << 12)
                                                   - 99
                                                   - 197
                                                   + 153
                                                   + 213
                                                << 5
                                       )
                                       & 63488
                                 )
                                 >> 11
                              | (
                                    (
                                             ((((var53 & 65535) >> 0 | var53 << 16) & 65520) >> 4 | ((var53 & 65535) >> 0 | var53 << 16) << 12)
                                                   - 99
                                                   - 197
                                                   + 153
                                                   + 213
                                                & 63488
                                          )
                                          >> 11
                                       | ((((var53 & 65535) >> 0 | var53 << 16) & 65520) >> 4 | ((var53 & 65535) >> 0 | var53 << 16) << 12)
                                             - 99
                                             - 197
                                             + 153
                                             + 213
                                          << 5
                                 )
                                 << 5
                        )
                        << 10
               )
            );
         }

         Class var6 = Class.forName(var17.toString(), false, Class_157.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = -1271588581 - -1271588581 ^ 0; var36 < var20.length(); var36 += (1425843534 << 466060410 | 1) & 115713233) {
            int var63 = var20.charAt(var36) - 129 ^ 204;
            char var66 = (char)(
               (
                     (
                              (
                                       ((((var63 & 65532) >> 2 | var63 << 14) + 160 ^ 177) - 216 & 65024) >> 9
                                          | (((var63 & 65532) >> 2 | var63 << 14) + 160 ^ 177) - 216 << 7
                                    )
                                    - 247
                                 & 65520
                           )
                           >> 4
                        | (
                                 ((((var63 & 65532) >> 2 | var63 << 14) + 160 ^ 177) - 216 & 65024) >> 9
                                    | (((var63 & 65532) >> 2 | var63 << 14) + 160 ^ 177) - 216 << 7
                              )
                              - 247
                           << 12
                  )
                  - 103
            );
            var20.setCharAt(
               var36,
               (char)(
                  (
                        (
                                 (
                                          ((((var63 & 65532) >> 2 | var63 << 14) + 160 ^ 177) - 216 & 65024) >> 9
                                             | (((var63 & 65532) >> 2 | var63 << 14) + 160 ^ 177) - 216 << 7
                                       )
                                       - 247
                                    & 65520
                              )
                              >> 4
                           | (
                                    ((((var63 & 65532) >> 2 | var63 << 14) + 160 ^ 177) - 216 & 65024) >> 9
                                       | (((var63 & 65532) >> 2 | var63 << 14) + 160 ^ 177) - 216 << 7
                                 )
                                 - 247
                              << 12
                     )
                     - 103
               )
            );
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_157.class.getClassLoader()).returnType();
         switch (((var4 + 878396235 + 1750905499 - 1360986655 + 927076003 ^ 434289124 ^ 1250409664) + 1939313750 ^ 1413291980 ^ 2050550554) + 746301111) {
            case 548747945:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            case 1441188413:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            case 1676609142:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            case 1719700452:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_2095[((var10 + 1998615361 - 541358367 + 971973547 ^ 129062327) - 463527258 + 805817067 - 723292205 ^ 1957070095) - 1110597883 + 352394700] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
