import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;
import net.minecraft.class_1661;
import net.minecraft.class_1799;
import net.minecraft.class_3965;

public class Class_131 extends Class_342 {
   // $VF: renamed from: vi Class_115
   public Class_115 field_2115;
   // $VF: renamed from: duo Class_49
   public Class_49 field_2116;
   // $VF: renamed from: mt Class_49
   public Class_49 field_2117;
   // $VF: renamed from: ut int
   public int field_2118;
   // $VF: renamed from: pr int
   public int field_2119;
   // $VF: renamed from: qqh boolean
   public boolean field_2120;
   // $VF: renamed from: kye java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_2121 = new MethodHandle[671659051 + (689164723 | 671659051) ^ 1361357185];

   public Class_131() {
      int var10001 = (2081725710 * 1804776177 | 0) & 1080043648;

      StringBuilder var10002;
      for (var10002 = (StringBuilder)0<"JNT",-333403141,"Ἱ㖹㠹㖹㬹‹","༁ྥ࿃࿚࿏࿚༈࿅࿚࿇࿀༈ྫྷ\u0fcd࿋࿂࿇࿀ྴ༂ྯ","̵̵̬̀΄̵̻͂̈́΄̨̨̪̻̘̩̺̹̇̽̈́̽͂",1298946028>("焒鰒ꈒ輒餒鈒䴒渒鬒递锒鰒鼒");
         var10001 < ((1646124543 ^ 655532734 | 12) & 843055167);
         var10001 += (-1387078495 ^ -62032918 | 1) & 249577605
      ) {
         char var21 = 0<"JNT",1347504259,"㊹㔹ㆹ㨹↹㬹","༁ྡྷ༂ྼ","̵̵̬̀΄̵̻͂̈́΄̨̨̪̻̘̩̺̹̇̽̈́̽͂",1298945819>(var10002, var10001);
         int var10005 = (var21 & '\ufffe') >> 1;
         int var22 = ((var21 & '\ufffe') >> 1 | var21 << 15) ^ 9;
         int var53 = ((((var21 & '\ufffe') >> 1 | var21 << 15) ^ 9) & 65408) >> 7;
         var21 = (char)(((((var10005 | var21 << 15) ^ 9) & 65408) >> 7 | (((var21 & '\ufffe') >> 1 | var21 << 15) ^ 9) << 9) + 162 - 207);
         0<"JNT",1347504259,"㪹㎹㬹⊹㔹ㆹ㨹↹㬹","༁ྡྷྼ༂ྯ","̵̵̬̀΄̵̻͂̈́΄̨̨̪̻̘̩̺̹̇̽̈́̽͂",1298945976>(var10002, var10001, (char)((var53 | var22 << 9) + 162 - 207));
      }

      String var2 = 0<"JNT",1347504259,"㬹㢹⪹㬹㨹㖹㠹㒹","༁༂ྥ࿃࿚࿏࿚༈࿅࿚࿇࿀༈ྫྷ\u0fcd࿋࿂࿇࿀ྴ","̵̵̬̀΄̵̻͂̈́΄̨̨̪̻̘̩̺̹̇̽̈́̽͂",1298945953>(var10002);
      int var11 = (988034350 ^ 1419653586 | 0) & -2130358013;

      StringBuilder var25;
      for (var25 = (StringBuilder)0<"JNT",-333403141,"Ἱ㖹㠹㖹㬹‹","༁ྥ࿃࿚࿏࿚༈࿅࿚࿇࿀༈ྫྷ\u0fcd࿋࿂࿇࿀ྴ༂ྯ","̵̵̬̀΄̵̻͂̈́΄̨̨̪̻̘̩̺̹̇̽̈́̽͂",1298945958>(
            "ǬĠģľĸǌģĴĲǌĻĻĤƏǟĻǌĲİĢƏǽƏǌĹĲķľĽĢ"
         );
         var11 < ((1687378213 >> 1687378213 | 22) & 134881598);
         var11 += (1329549444 | 1329549444 | 1) & 281051411
      ) {
         int var44 = (0<"JNT",1347504259,"㊹㔹ㆹ㨹↹㬹","༁ྡྷ༂ྼ","̵̵̬̀΄̵̻͂̈́΄̨̨̪̻̘̩̺̹̇̽̈́̽͂",1298945813>(var25, var11) ^ 178) - 209 - 208;
         char var45 = (char)(((var44 & 0) >> 16 | var44 << 0) + 132);
         0<"JNT",1347504259,"㪹㎹㬹⊹㔹ㆹ㨹↹㬹","༁ྡྷྼ༂ྯ","̵̵̬̀΄̵̻͂̈́΄̨̨̪̻̘̩̺̹̇̽̈́̽͂",1298945818>(var25, var11, (char)(((var44 & 0) >> 16 | var44 << 0) + 132));
      }

      super(
         var2,
         0<"JNT",1347504259,"㬹㢹⪹㬹㨹㖹㠹㒹","༁༂ྥ࿃࿚࿏࿚༈࿅࿚࿇࿀༈ྫྷ\u0fcd࿋࿂࿇࿀ྴ","̵̵̬̀΄̵̻͂̈́΄̨̨̪̻̘̩̺̹̇̽̈́̽͂",1298945980>(var25),
         -1,
         1<"JNT",-390798931,"ৠ觞","㒁\udf80","\uf885拉ﴅʄ$\ufae5",-695533971>()
      );
      var10001 = (353278765 >>> -62640095 | 0) & -1066913760;

      for (var10002 = (StringBuilder)0<"JNT",-333403141,"Ἱ㖹㠹㖹㬹‹","༁ྥ࿃࿚࿏࿚༈࿅࿚࿇࿀༈ྫྷ\u0fcd࿋࿂࿇࿀ྴ༂ྯ","̵̵̬̀΄̵̻͂̈́΄̨̨̪̻̘̩̺̹̇̽̈́̽͂",1298945954>("쓿섿썟쇿쎟샿썟셿룟옿셿쏿");
         var10001 < 12;
         var10001 += 969081979 & 67388161
      ) {
         char var28 = 0<"JNT",1347504259,"㊹㔹ㆹ㨹↹㬹","༁ྡྷ༂ྼ","̵̵̬̀΄̵̻͂̈́΄̨̨̪̻̘̩̺̹̇̽̈́̽͂",1298945796>(var10002, var10001);
         char var29 = (char)((((var28 & '￠') >> 5 | var28 << 11) + 236 + 212 ^ 32) + 122);
         0<"JNT",1347504259,"㪹㎹㬹⊹㔹ㆹ㨹↹㬹","༁ྡྷྼ༂ྯ","̵̵̬̀΄̵̻͂̈́΄̨̨̪̻̘̩̺̹̇̽̈́̽͂",1298945797>(
            var10002, var10001, (char)((((var28 & '￠') >> 5 | var28 << 11) + 236 + 212 ^ 32) + 122)
         );
      }

      Class_115 var5 = (Class_115)0<"JNT",-333403141,"Ἱ㖹㠹㖹㬹‹","༁ྥ࿃࿚࿏࿚༈࿅࿚࿇࿀༈ྫྷ\u0fcd࿋࿂࿇࿀ྴྡྷ࿓༂ྯ","̥̾",1298946030>(
         0<"JNT",1347504259,"㬹㢹⪹㬹㨹㖹㠹㒹","༁༂ྥ࿃࿚࿏࿚༈࿅࿚࿇࿀༈ྫྷ\u0fcd࿋࿂࿇࿀ྴ","̵̵̬̀΄̵̻͂̈́΄̨̨̪̻̘̩̺̹̇̽̈́̽͂",1298946025>(var10002), 71, false
      );
      int var15 = (-290343105 | -290343105 | 0) & 273039424;

      for (var25 = (StringBuilder)0<"JNT",-333403141,"Ἱ㖹㠹㖹㬹‹","༁ྥ࿃࿚࿏࿚༈࿅࿚࿇࿀༈ྫྷ\u0fcd࿋࿂࿇࿀ྴ༂ྯ","̵̵̬̀΄̵̻͂̈́΄̨̨̪̻̘̩̺̹̇̽̈́̽͂",1298946031>(
            "ￄﾶﾲ﹫︇ﾣﾪ︇﹫︼︇ﾪ︽︇︼﹫ﾷﾠ︆ﾭﾯﾶ﹫ﾪﾡﾬﾣﾠ︽ﾢﾡﾨ"
         );
         var15 < ((1557272226 << 1557272226 | 32) & -2009979865);
         var15 += 1005869137 << 1005869137 ^ -1331560447
      ) {
         0<"JNT",1347504259,"㪹㎹㬹⊹㔹ㆹ㨹↹㬹","༁ྡྷྼ༂ྯ","̵̵̬̀΄̵̻͂̈́΄̨̨̪̻̘̩̺̹̇̽̈́̽͂",1298945799>(
            var25, var15, (char)(((0<"JNT",1347504259,"㊹㔹ㆹ㨹↹㬹","༁ྡྷ༂ྼ","̵̵̬̀΄̵̻͂̈́΄̨̨̪̻̘̩̺̹̇̽̈́̽͂",1298945798>(var25, var15) ^ 230) + 170 ^ 67) + 180 ^ 8)
         );
      }

      this.field_2115 = 0<"JNT",1347504259,"㊹㪹","༁ྥ࿃࿚࿏࿚༈࿅࿚࿇࿀༈ྫྷ\u0fcd࿋࿂࿇࿀ྴ༂ྥ࿁࿊ྴ","̥̾",1298945982>(
         var5, 0<"JNT",1347504259,"㬹㢹⪹㬹㨹㖹㠹㒹","༁༂ྥ࿃࿚࿏࿚༈࿅࿚࿇࿀༈ྫྷ\u0fcd࿋࿂࿇࿀ྴ","̵̵̬̀΄̵̻͂̈́΄̨̨̪̻̘̩̺̹̇̽̈́̽͂",1298945977>(var25)
      );
      var10001 = 273652048 & 681646286 ^ 71744;

      for (var10002 = (StringBuilder)0<"JNT",-333403141,"Ἱ㖹㠹㖹㬹‹","༁ྥ࿃࿚࿏࿚༈࿅࿚࿇࿀༈ྫྷ\u0fcd࿋࿂࿇࿀ྴ༂ྯ","̵̵̬̀΄̵̻͂̈́΄̨̨̪̻̘̩̺̹̇̽̈́̽͂",1298945983>("˽ϝ͍ϵͽ͕ĕɵͭε̍ύ");
         var10001 < (-755760518 >>> -740759609 ^ 27650056);
         var10001 += 147759569 >> 2128124171 ^ 72149
      ) {
         int var34 = (0<"JNT",1347504259,"㊹㔹ㆹ㨹↹㬹","༁ྡྷ༂ྼ","̵̵̬̀΄̵̻͂̈́΄̨̨̪̻̘̩̺̹̇̽̈́̽͂",1298945955>(var10002, var10001) - 197 ^ 10 ^ 55) + 147;
         char var35 = (char)((var34 & 65528) >> 3 | var34 << 13);
         0<"JNT",1347504259,"㪹㎹㬹⊹㔹ㆹ㨹↹㬹","༁ྡྷྼ༂ྯ","̵̵̬̀΄̵̻͂̈́΄̨̨̪̻̘̩̺̹̇̽̈́̽͂",1298945952>(var10002, var10001, (char)((var34 & 65528) >> 3 | var34 << 13));
      }

      this.field_2116 = (Class_49)0<"JNT",-333403141,"Ἱ㖹㠹㖹㬹‹","༁ྥ࿃࿚࿏࿚༈࿅࿚࿇࿀༈ྫྷ\u0fcd࿋࿂࿇࿀ྴ\u0fbd\u0fbd\u0fbd\u0fbd༂ྯ","̷̺",1298945803>(
         0<"JNT",1347504259,"㬹㢹⪹㬹㨹㖹㠹㒹","༁༂ྥ࿃࿚࿏࿚༈࿅࿚࿇࿀༈ྫྷ\u0fcd࿋࿂࿇࿀ྴ","̵̵̬̀΄̵̻͂̈́΄̨̨̪̻̘̩̺̹̇̽̈́̽͂",1298945802>(var10002), 0.0, 20.0, 0.0, 1.0
      );
      var10001 = 1186031158 * 80187184 ^ -1521134560;

      for (var10002 = (StringBuilder)0<"JNT",-333403141,"Ἱ㖹㠹㖹㬹‹","༁ྥ࿃࿚࿏࿚༈࿅࿚࿇࿀༈ྫྷ\u0fcd࿋࿂࿇࿀ྴ༂ྯ","̵̵̬̀΄̵̻͂̈́΄̨̨̪̻̘̩̺̹̇̽̈́̽͂",1298946024>("桱陱ꡱ艱鉱r幱顱陱ꡱ");
         var10001 < ((-372316834 | -372316834 | 2) & 268439563);
         var10001 += 1447725282 + 1447725282 ^ -1399516731
      ) {
         int var38 = (0<"JNT",1347504259,"㊹㔹ㆹ㨹↹㬹","༁ྡྷ༂ྼ","̵̵̬̀΄̵̻͂̈́΄̨̨̪̻̘̩̺̹̇̽̈́̽͂",1298945815>(var10002, var10001) ^ 191) - 210;
         int var57 = (var38 & 63488) >> 11;
         int var39 = ((var38 & 63488) >> 11 | var38 << 5) + 137;
         int var58 = (((var38 & 63488) >> 11 | var38 << 5) + 137 & 49152) >> 14;
         char var40 = (char)(((var57 | var38 << 5) + 137 & 49152) >> 14 | ((var38 & 63488) >> 11 | var38 << 5) + 137 << 2);
         0<"JNT",1347504259,"㪹㎹㬹⊹㔹ㆹ㨹↹㬹","༁ྡྷྼ༂ྯ","̵̵̬̀΄̵̻͂̈́΄̨̨̪̻̘̩̺̹̇̽̈́̽͂",1298945812>(var10002, var10001, (char)(var58 | var39 << 2));
      }

      this.field_2117 = (Class_49)0<"JNT",-333403141,"Ἱ㖹㠹㖹㬹‹","༁ྥ࿃࿚࿏࿚༈࿅࿚࿇࿀༈ྫྷ\u0fcd࿋࿂࿇࿀ྴ\u0fbd\u0fbd\u0fbd\u0fbd༂ྯ","̷̺",1298945810>(
         0<"JNT",1347504259,"㬹㢹⪹㬹㨹㖹㠹㒹","༁༂ྥ࿃࿚࿏࿚༈࿅࿚࿇࿀༈ྫྷ\u0fcd࿋࿂࿇࿀ྴ","̵̵̬̀΄̵̻͂̈́΄̨̨̪̻̘̩̺̹̇̽̈́̽͂",1298946029>(var10002), 1.0, 9.0, 1.0, 1.0
      );
      this.field_2118 = 0;
      this.field_2119 = 0;
      this.field_2120 = false;
      0<"JNT",1347504259,"㦹㮹","༁࿔ྥ࿊\u0fde\u0fdeྴ༂ྯ","̧̽",1298945814>(
         this,
         new Class_271[]{
            1<"JNT",112632341,"解ৢঢ়","⒁⺁","\uf885拉ﴅ￤D\ufae5",-695533981>(this),
            1<"JNT",112632341,"\u09de觋","⒁⺁","\uf885拉ﴅ￤D\ufae5",-695533982>(this),
            1<"JNT",112632341,"觢\u09d8","⒁⺁","\uf885拉ﴅdƄ\ufae5",-695533983>(this)
         }
      );
   }

   // $VF: renamed from: mg () void
   @Override
   public void method_1407() {
      0<"JNT",292638478,"㞹㒹","༁༂ྯ","̧̩̼",1298945959>(this);
   }

   // $VF: renamed from: q () void
   @Override
   public void method_1408() {
      0<"JNT",292638478,"㦹","༁༂ྯ","̧̩̼",1298945956>(this);
   }

   // $VF: renamed from: gd (Class_207) void
   @Class_21
   public void method_1823(Class_207 var1) {
      int var4 = 1768737824;
      if (1<"JNT",112632341,"觚\u09d8\u09da觗解ॵ়ুূূ","⮁\ue080ㆁ\ueb80⢁⒁⮁\ue080\ude80⾁\udc80\ue380ㆁ\ueb80\ude80⦁\udc80⺁⺁\uda80\uee80\uec80\ued80","\uf885拉ﴅƤ\u0004Ǥ便Ą\u0084Ƥ\u0004DȤﾄ¤Ǥ便DäﾄɄɄￄ洞痢贈\ufae5",-695533942>(
            1<"JNT",112632341,"觗觜","⒁⺁","\uf885拉ﴅƤ\u0004Ǥ便Ą\u0084Ƥ\u0004DȤﾄ¤Ǥ便DäﾄɄɄￄ痢逸礪\ufae5",-695533941>(this)
         )
         == null) {
         var4 = -692771045 ^ 1881894370 ^ 152355866;

         while (true) {
            switch ((var4 - 1072807893 ^ 970455569) - 1807492196 - 1304758189 ^ 912587702 ^ 1073098705) {
               case -1789076119:
               default:
                  if (1<"JNT",112632341,"觚\u09d8\u09da觗解ॵ়ু覼覫","⮁\ue080ㆁ\ueb80⢁⒁⮁\ue080\ude80⾁\udc80\ue380ㆁ\ueb80\ude80⦁\udc80⺁⺁\uda80\uee80\uec80\ued80","\uf885拉ﴅƤ\u0004Ǥ便Ą\u0084Ƥ\u0004DȤﾄ¤Ǥ便DäﾄɄɄￄ贈洞鉶\ufae5",-695534057>(
                        1<"JNT",112632341,"觗觜","⒁⺁","\uf885拉ﴅƤ\u0004Ǥ便Ą\u0084Ƥ\u0004DȤﾄ¤Ǥ便DäﾄɄɄￄ痢逸礪\ufae5",-695534056>(this)
                     )
                     == null) {
                     return;
                  }

                  var4 = -1642272533 + 108137295 ^ 997352913;
                  break;
               case -1446432879:
                  if (!0<"JNT",1347504259,"㮹㦹㢹","༁༂࿓","̧̽",1298945972>(this)) {
                     return;
                  }

                  var4 = 769073799 << -1493152108 ^ -325877208;
                  break;
               case -66044048:
                  if (1<"JNT",112632341,"觚\u09d8\u09da觗解ॵ়ু观ূ","⮁\ue080ㆁ\ueb80⢁⒁⮁\ue080\ude80⾁\udc80\ue380ㆁ\ueb80\ude80⦁\udc80⺁⺁\uda80\uee80\uec80\ued80","\uf885拉ﴅƤ\u0004Ǥ便Ą\u0084Ƥ\u0004DȤﾄ¤Ǥ便DäﾄɄɄￄ海痢ﬥ\ufae5",-695533967>(
                        1<"JNT",112632341,"觗觜","⒁⺁","\uf885拉ﴅƤ\u0004Ǥ便Ą\u0084Ƥ\u0004DȤﾄ¤Ǥ便DäﾄɄɄￄ痢逸礪\ufae5",-695533966>(this)
                     ) instanceof class_3965 var2
                     && !0<"JNT",-1461858233,"㸹㸹","༁ྥ࿇\u0fde\u0fcd༈࿆࿂࿇\u0fde\u0fdc࿋࿚\u0fdf\u0fcd༈\u0fdc࿅࿚࿌࿌࿘་༌༌ྱྴྥ࿇\u0fde\u0fcd༈࿆࿂࿇\u0fde\u0fdc࿋࿚\u0fdf\u0fcd༈\u0fdc࿅࿚࿌࿌࿘་་།ྱྴ༂࿓","̨̥",1298945988>(
                        0<"JNT",1347504259,"㞹㎹㬹㔹㢹㌹スᦹᲹᲹᲹᲹ","༁༂ྥ࿇\u0fde\u0fcd༈࿆࿂࿇\u0fde\u0fdc࿋࿚\u0fdf\u0fcd༈\u0fdc࿅࿚࿌࿌࿘་༌༌ྱྴ","̹̪̈́΄̷̵̨̹̼̪́̽̈́΄̷̵̧̧͂̓ͧͭͬͩ",1298945990>(
                           var2
                        ),
                        1<"JNT",-390798931,"觚\u09d8\u09da觗解ॵ়覽়覼覫","⮁\ue080ㆁ\ueb80⢁⒁⮁\ue080\ude80⾁\udc80\ue380ㆁ\ueb80\ude80⦁\udc80⺁⺁\uda80\uef80\uef80\uf180\uf380","\uf885拉ﴅƤ\u0004Ǥ便Ą\u0084Ƥ\u0004DȤﾄ¤Ǥ便DäﾄɄɄￄ海海洞徭\ufae5",-695534041>()
                     )) {
                     var4 = -467257030 * 182208244 ^ -1747186158;

                     while (true) {
                        switch (var4 + 295327463 + 1583513254 - 326073869 ^ 2063332371 ^ 1247313639 ^ 907698934) {
                           case -1057309047:
                              if (1<"JNT",112632341,"觝觜","⒁⺁","\uf885拉ﴥ",-695533947>(this) != 9) {
                                 var4 = (1144429855 >>> 238876013 | 181949409) & 2061360107;
                                 continue;
                              }

                              0<"JNT",-1461858233,"㊹㶹","༁ྥ࿇\u0fde\u0fcd༈࿆࿂࿇\u0fde\u0fdc࿋࿚\u0fdf\u0fcd༈\u0fdc࿅࿚࿌࿌࿘༌ྲ༏༎ྴ࿓༂ྯ","̨̥",1298945962>(var2, true);
                              break;
                           case -938366040:
                              if (1<"JNT",112632341,"觝觜","⒁⺁","\uf885拉ﴥ",-695534016>(this) != 5) {
                                 var4 = 1438645739 >> 586798669 ^ -888347776;
                                 continue;
                              }

                              0<"JNT",-1461858233,"㊹㶹","༁ྥ࿇\u0fde\u0fcd༈࿆࿂࿇\u0fde\u0fdc࿋࿚\u0fdf\u0fcd༈\u0fdc࿅࿚࿌࿌࿘༌ྲ༏༎ྴ࿓༂ྯ","̨̥",1298945967>(var2, true);
                              0<"JNT",-1461858233,"㊹㶹","༁ྥ࿇\u0fde\u0fcd༈࿆࿂࿇\u0fde\u0fdc࿋࿚\u0fdf\u0fcd༈\u0fdc࿅࿚࿌࿌࿘༌ྲ༏༎ྴ࿓༂ྯ","̨̥",1298945964>(var2, true);
                              break;
                           case -907348321:
                              if (1<"JNT",112632341,"觝觜","⒁⺁","\uf885拉ﴥ",-695534019>(this) != 0) {
                                 var4 = 1468470836 ^ 780505028 ^ -2136873059;
                                 continue;
                              }

                              0<"JNT",-1461858233,"㰹㸹㈹","༁ྥ࿇\u0fde\u0fcd༈࿆࿂࿇\u0fde\u0fdc࿋࿚\u0fdf\u0fcd༈\u0fdc࿅࿚࿌࿌࿘༊ྰྲ་ྴ༂࿓","̾",1298946003>(
                                 1<"JNT",-390798931,"觚\u09d8\u09da觗解ॵ覼ফ়覫়","⮁\ue080ㆁ\ueb80⢁⒁⮁\ue080\ude80⾁\udc80\ue380ㆁ\ueb80\ude80⦁\udc80⺁⺁\uda80\uec80\uf580\ued80\uef80","\uf885拉ﴅƤ\u0004Ǥ便Ą\u0084Ƥ\u0004DȤﾄ¤Ǥ便DäﾄɄɄￄ逸贈ﬥ海\ufae5",-695534044>()
                              );
                              break;
                           case -872574903:
                              if (1<"JNT",112632341,"觝觜","⒁⺁","\uf885拉ﴥ",-695534037>(this) != 4) {
                                 var4 = (424289219 | 424289219 | 1645931560) & -157291474;
                                 continue;
                              }

                              0<"JNT",-1461858233,"㰹㸹㈹","༁ྥ࿇\u0fde\u0fcd༈࿆࿂࿇\u0fde\u0fdc࿋࿚\u0fdf\u0fcd༈\u0fdc࿅࿚࿌࿌࿘༊ྰྲ་ྴ༂࿓","̾",1298945961>(
                                 1<"JNT",-390798931,"觚\u09d8\u09da觗解ॵ覼ফ়覫়","⮁\ue080ㆁ\ueb80⢁⒁⮁\ue080\ude80⾁\udc80\ue380ㆁ\ueb80\ude80⦁\udc80⺁⺁\uda80\uec80\uf580\ued80\uef80","\uf885拉ﴅƤ\u0004Ǥ便Ą\u0084Ƥ\u0004DȤﾄ¤Ǥ便DäﾄɄɄￄ逸贈ﬥ海\ufae5",-695534038>()
                              );
                              break;
                           case -843265946:
                           default:
                              if (1<"JNT",112632341,"觝觜","⒁⺁","\uf885拉ﴥ",-695533957>(this) != 2) {
                                 var4 = (886052372 + 886052372 | -692431868) & -134228074;
                                 continue;
                              }

                              0<"JNT",-1461858233,"㰹㸹㈹","༁ྥ࿇\u0fde\u0fcd༈࿆࿂࿇\u0fde\u0fdc࿋࿚\u0fdf\u0fcd༈\u0fdc࿅࿚࿌࿌࿘༊ྰྲ་ྴ༂࿓","̾",1298946009>(
                                 1<"JNT",-390798931,"觚\u09d8\u09da觗解ॵ见见覽়","⮁\ue080ㆁ\ueb80⢁⒁⮁\ue080\ude80⾁\udc80\ue380ㆁ\ueb80\ude80⦁\udc80⺁⺁\uda80\uec80\uf580\ued80\uef80","\uf885拉ﴅƤ\u0004Ǥ便Ą\u0084Ƥ\u0004DȤﾄ¤Ǥ便DäﾄɄɄￄ逸贈ﬥ海\ufae5",-695533958>()
                              );
                              break;
                           case -608220673:
                              1<"JNT",-918576282,"觝觜","⒁⺁","\uf885拉ﴥ",-695533956>(this, 1<"JNT",112632341,"觝觜","⒁⺁","\uf885拉ﴥ",-695533963>(this) + 1);
                              return;
                           case 413220133:
                              if (1<"JNT",112632341,"觝觜","⒁⺁","\uf885拉ﴥ",-695533949>(this) != 7) {
                                 var4 = (222028426 + 222028426 | -521479270) & -236191845;
                                 continue;
                              }

                              0<"JNT",-1461858233,"㊹㶹","༁ྥ࿇\u0fde\u0fcd༈࿆࿂࿇\u0fde\u0fdc࿋࿚\u0fdf\u0fcd༈\u0fdc࿅࿚࿌࿌࿘༌ྲ༏༎ྴ࿓༂ྯ","̨̥",1298945968>(var2, true);
                              break;
                           case 555896317:
                              if (1<"JNT",112632341,"觝觜","⒁⺁","\uf885拉ﴥ",-695533951>(this) != 6) {
                                 var4 = (1155089786 | -1926844153 | -1065207418) & -477397081;
                                 continue;
                              }

                              0<"JNT",-1461858233,"㰹㸹㈹","༁ྥ࿇\u0fde\u0fcd༈࿆࿂࿇\u0fde\u0fdc࿋࿚\u0fdf\u0fcd༈\u0fdc࿅࿚࿌࿌࿘༊ྰྲ་ྴ༂࿓","̾",1298945975>(
                                 1<"JNT",-390798931,"觚\u09d8\u09da觗解ॵ见见覽়","⮁\ue080ㆁ\ueb80⢁⒁⮁\ue080\ude80⾁\udc80\ue380ㆁ\ueb80\ude80⦁\udc80⺁⺁\uda80\uec80\uf580\ued80\uef80","\uf885拉ﴅƤ\u0004Ǥ便Ą\u0084Ƥ\u0004DȤﾄ¤Ǥ便DäﾄɄɄￄ逸贈ﬥ海\ufae5",-695533960>()
                              );
                              break;
                           case 738470104:
                              if (1<"JNT",112632341,"ৢ觋","⒁⺁","\uf885拉ﴥ",-695534058>(this)
                                 < 0<"JNT",1347504259,"㐹㸹㒹","༁༂ྡྷ","̷̺",1298946010>(1<"JNT",112632341,"解ৢঢ়","⒁⺁","\uf885拉ﴅ￤D\ufae5",-695534059>(this))) {
                                 1<"JNT",-918576282,"ৢ觋","⒁⺁","\uf885拉ﴥ",-695534054>(this, 1<"JNT",112632341,"ৢ觋","⒁⺁","\uf885拉ﴥ",-695534053>(this) + 1);
                                 return;
                              }

                              var4 = 2 ^ 1925564191;
                              continue;
                           case 1270931224:
                              if (1<"JNT",112632341,"觝觜","⒁⺁","\uf885拉ﴥ",-695533936>(this) != 8) {
                                 var4 = 256586939 ^ -132428168 ^ -1629125176;
                                 continue;
                              }

                              0<"JNT",-1461858233,"㰹㬹㘹","༁ྡྷ༂ྯ","̾",1298946013>(
                                 0<"JNT",1347504259,"㐹㸹㒹","༁༂ྡྷ","̷̺",1298946012>(1<"JNT",112632341,"\u09de觋","⒁⺁","\uf885拉ﴅ￤D\ufae5",-695533937>(this)) - 1
                              );
                              break;
                           case 1351171567:
                              if (1<"JNT",112632341,"觝觜","⒁⺁","\uf885拉ﴥ",-695533943>(this) != 1) {
                                 var4 = 1853343972;
                                 continue;
                              }

                              0<"JNT",-1461858233,"㊹㶹","༁ྥ࿇\u0fde\u0fcd༈࿆࿂࿇\u0fde\u0fdc࿋࿚\u0fdf\u0fcd༈\u0fdc࿅࿚࿌࿌࿘༌ྲ༏༎ྴ࿓༂ྯ","̨̥",1298945934>(var2, true);
                              break;
                           case 1392395142:
                              if (1<"JNT",112632341,"觝觜","⒁⺁","\uf885拉ﴥ",-695534043>(this) != 3) {
                                 var4 = (-1353425410 * -1633701285 | 1354178755) & -189304629;
                                 continue;
                              }

                              0<"JNT",-1461858233,"㊹㶹","༁ྥ࿇\u0fde\u0fcd༈࿆࿂࿇\u0fde\u0fdc࿋࿚\u0fdf\u0fcd༈\u0fdc࿅࿚࿌࿌࿘༌ྲ༏༎ྴ࿓༂ྯ","̨̥",1298945994>(var2, true);
                              break;
                           case 1641825123:
                              if (1<"JNT",112632341,"觝觜","⒁⺁","\uf885拉ﴥ",-695533921>(this) == 10) {
                                 1<"JNT",-918576282,"ড়ড়觙","⒁⺁","\uf885拉ｅ",-695533922>(this, false);
                                 1<"JNT",-918576282,"觝觜","⒁⺁","\uf885拉ﴥ",-695533923>(this, 0);
                                 0<"JNT",1347504259,"㠹㸹","༁༂ྯ","̧̽",1298945970>(this);
                                 return;
                              }
                        }

                        var4 = (1912548358 * 75749709 | -2139534731) & -1996927363;
                     }
                  }

                  1<"JNT",-918576282,"ড়ড়觙","⒁⺁","\uf885拉ｅ",-695534046>(this, false);
                  0<"JNT",1347504259,"㠹㸹","༁༂ྯ","̧̽",1298946001>(this);
                  return;
               case 171432022:
                  if (!1<"JNT",112632341,"ড়ড়觙","⒁⺁","\uf885拉ｅ",-695533964>(this) && !0<"JNT",1347504259,"㎹㘹","༁༂࿓","̧̽",1298945987>(this)) {
                     return;
                  }

                  var4 = (-1308648411 >>> 955383490 | -763286522) & -691683986;
            }
         }
      }
   }

   // $VF: renamed from: uqo () boolean
   public boolean method_1824() {
      int var6 = 1473069389;
      class_1661 var1 = 0<"JNT",1347504259,"㞹㎹㬹㔹㢹㌹ス᪹ᦹ᮹ᬹᴹ","༁༂ྥ࿇\u0fde\u0fcd༈࿆࿂࿇\u0fde\u0fdc࿋࿚\u0fdf\u0fcd༈\u0fdc࿅࿚࿌࿌࿘༊༏༏༊ྴ","̹̪̈́΄̷̵̨̹̼̪́̽̈́΄̷̵̧̧͂̓ͫͪͬ",1298945635>(
         1<"JNT",112632341,"觚\u09d8\u09da觗解ॵ়ু覼覫","⮁\ue080ㆁ\ueb80⢁⒁⮁\ue080\ude80⾁\udc80\ue380ㆁ\ueb80\ude80⦁\udc80⺁⺁\uda80\uee80\uec80\ued80","\uf885拉ﴅƤ\u0004Ǥ便Ą\u0084Ƥ\u0004DȤﾄ¤Ǥ便DäﾄɄɄￄ贈洞鉶\ufae5",-695534060>(
            1<"JNT",112632341,"觗觜","⒁⺁","\uf885拉ﴅƤ\u0004Ǥ便Ą\u0084Ƥ\u0004DȤﾄ¤Ǥ便DäﾄɄɄￄ痢逸礪\ufae5",-695534035>(this)
         )
      );
      boolean var2 = false;
      boolean var3 = false;
      int var4 = 0;

      label45:
      while (true) {
         var6 = -17 & 1032380382;

         while (true) {
            switch (((var6 + 1644996697 + 1397033684 ^ 703446504) + 627034945 ^ 2063351515) - 1353194569) {
               case -1299315112:
                  return false;
               case -931142918:
                  if (var2 && var3) {
                     return true;
                  }

                  var6 = -935970396;
                  break;
               case 700622918:
               default:
                  if (var4 < 9) {
                     class_1799 var5 = 0<"JNT",1347504259,"㞹㎹㬹㔹㢹㌹ス᮹ᬹ᪹ᴹ","༁ྡྷ༂ྥ࿇\u0fde\u0fcd༈࿆࿂࿇\u0fde\u0fdc࿋࿚\u0fdf\u0fcd༈\u0fdc࿅࿚࿌࿌࿘༊ྰྲྲྴ","̹̪̈́΄̷̵̨̹̼̪́̽̈́΄̷̵̧̧͂̓ͥͬͬͥ",1298945657>(
                        var1, var4
                     );
                     if (0<"JNT",1347504259,"㎹㦹㮹ㆹ㜹㪹","༁ྥ࿃࿚࿏࿚༈࿅࿚࿇࿀༈ྨ\u0fdb࿃\u0fde\u0fdc\u0fcdྴ༂࿓","̵̵̬̀΄̵̻͂̈́΄̸̷̣̹̪̀",1298945660>(
                        0<"JNT",1347504259,"㞹㎹㬹㔹㢹㌹スᲹᶹ᤹ᶹ","༁༂ྥ࿇\u0fde\u0fcd༈࿆࿂࿇\u0fde\u0fdc࿋࿚\u0fdf\u0fcd༈\u0fdc࿅࿚࿌࿌࿘༊ྰྲ་ྴ","̹̪̈́΄̷̵̨̹̼̪́̽̈́΄̷̵̧̧͂̓ͥͫͭͭ",1298945662>(
                           var5
                        ),
                        1<"JNT",-390798931,"觚\u09d8\u09da觗解ॵ覼ফ়覫়","⮁\ue080ㆁ\ueb80⢁⒁⮁\ue080\ude80⾁\udc80\ue380ㆁ\ueb80\ude80⦁\udc80⺁⺁\uda80\uec80\uf580\ued80\uef80","\uf885拉ﴅƤ\u0004Ǥ便Ą\u0084Ƥ\u0004DȤﾄ¤Ǥ便DäﾄɄɄￄ逸贈ﬥ海\ufae5",-695534033>()
                     )) {
                        var2 = true;
                     }

                     var6 = (156625627 | -2037567335 | 1309741228) & -569305364;

                     while (true) {
                        switch ((var6 ^ 1076211121) - 457073516 ^ 1120163664 ^ 271857013 ^ 493577734 ^ 56911394) {
                           case -1879387228:
                              var4++;
                              continue label45;
                           case 1040792048:
                           default:
                              if (0<"JNT",1347504259,"㎹㦹㮹ㆹ㜹㪹","༁ྥ࿃࿚࿏࿚༈࿅࿚࿇࿀༈ྨ\u0fdb࿃\u0fde\u0fdc\u0fcdྴ༂࿓","̵̵̬̀΄̵̻͂̈́΄̸̷̣̹̪̀",1298945638>(
                                 0<"JNT",1347504259,"㞹㎹㬹㔹㢹㌹スᲹᶹ᤹ᶹ","༁༂ྥ࿇\u0fde\u0fcd༈࿆࿂࿇\u0fde\u0fdc࿋࿚\u0fdf\u0fcd༈\u0fdc࿅࿚࿌࿌࿘༊ྰྲ་ྴ","̹̪̈́΄̷̵̨̹̼̪́̽̈́΄̷̵̧̧͂̓ͥͫͭͭ",1298945632>(
                                    var5
                                 ),
                                 1<"JNT",-390798931,"觚\u09d8\u09da觗解ॵ见见覽়","⮁\ue080ㆁ\ueb80⢁⒁⮁\ue080\ude80⾁\udc80\ue380ㆁ\ueb80\ude80⦁\udc80⺁⺁\uda80\uec80\uf580\ued80\uef80","\uf885拉ﴅƤ\u0004Ǥ便Ą\u0084Ƥ\u0004DȤﾄ¤Ǥ便DäﾄɄɄￄ逸贈ﬥ海\ufae5",-695534063>()
                              )) {
                                 var3 = true;
                              }

                              var6 = -1898965323 - -1898965323 ^ -1637762912;
                        }
                     }
                  }

                  var6 = (-543314211 - 1825115961 | 1610645650) & 1715919003;
            }
         }
      }
   }

   // $VF: renamed from: ej () boolean
   public boolean method_1825() {
      int var2 = 648911439;
      int var1 = 0<"JNT",1347504259,"㐹㔹","༁༂ྡྷ","̥̾",1298945637>(1<"JNT",112632341,"觢\u09d8","⒁⺁","\uf885拉ﴅdƄ\ufae5",-695534010>(this));
      if (var1 != -1 && 0<"JNT",-1461858233,"㞹㊹","༁ྡྷ༂࿓","̸͂",1298945642>(var1)) {
         var2 = -1945562462 & -1945562462 ^ 799566236;
      } else {
         var2 = 1723660848;
      }

      switch ((var2 + 331310046 + 470398259 + 1018649580 + 1459393106 ^ 1881821865) - 2051465487) {
         case -1662128363:
         default:
            1<"JNT",-918576282,"ড়ড়觙","⒁⺁","\uf885拉ｅ",-695534005>(this, true);
            return true;
         case -540446009:
            0<"JNT",1347504259,"㠹㸹","༁༂ྯ","̧̽",1298945639>(this);
            return false;
      }
   }

   // $VF: renamed from: nz () void
   public void method_1826() {
      1<"JNT",-918576282,"ৢ觋","⒁⺁","\uf885拉ﴥ",-695534006>(this, 0);
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1413(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 ^ 1201149293) - 1061330895 - 368955479 ^ 2142206702 ^ 2088191214 ^ 815877679) + 1210595550 + 663403966 - 1305590116;
      MethodHandle var10000 = field_2121[((var10 ^ 1201149293) - 1061330895 - 368955479 ^ 2142206702 ^ 2088191214 ^ 815877679)
         + 1210595550
         + 663403966
         - 1305590116
         + 1465131102];
      if (field_2121[var10001 + 1465131102] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = (641220594 >>> 1846138375 | 0) & -1422850688; var23 < var13.length(); var23 += (767883568 | 436394173 - 928571651 | 1) & 268566597) {
            int var42 = var13.charAt(var23) - 182;
            char var47 = (char)(
               (
                        (
                                 (
                                       (
                                                (
                                                      (
                                                               (
                                                                     ((((var42 & 65535) >> 0 | var42 << 16) ^ 31) - 123 & 64512) >> 10
                                                                        | (((var42 & 65535) >> 0 | var42 << 16) ^ 31) - 123 << 6
                                                                  )
                                                                  & 65532
                                                            )
                                                            >> 2
                                                         | (
                                                               ((((var42 & 65535) >> 0 | var42 << 16) ^ 31) - 123 & 64512) >> 10
                                                                  | (((var42 & 65535) >> 0 | var42 << 16) ^ 31) - 123 << 6
                                                            )
                                                            << 14
                                                   )
                                                   & 65532
                                             )
                                             >> 2
                                          | (
                                                (
                                                         (
                                                               ((((var42 & 65535) >> 0 | var42 << 16) ^ 31) - 123 & 64512) >> 10
                                                                  | (((var42 & 65535) >> 0 | var42 << 16) ^ 31) - 123 << 6
                                                            )
                                                            & 65532
                                                      )
                                                      >> 2
                                                   | (
                                                         ((((var42 & 65535) >> 0 | var42 << 16) ^ 31) - 123 & 64512) >> 10
                                                            | (((var42 & 65535) >> 0 | var42 << 16) ^ 31) - 123 << 6
                                                      )
                                                      << 14
                                             )
                                             << 14
                                    )
                                    ^ 139
                              )
                              - 15
                           & 65024
                     )
                     >> 9
                  | (
                           (
                                 (
                                          (
                                                (
                                                         (
                                                               ((((var42 & 65535) >> 0 | var42 << 16) ^ 31) - 123 & 64512) >> 10
                                                                  | (((var42 & 65535) >> 0 | var42 << 16) ^ 31) - 123 << 6
                                                            )
                                                            & 65532
                                                      )
                                                      >> 2
                                                   | (
                                                         ((((var42 & 65535) >> 0 | var42 << 16) ^ 31) - 123 & 64512) >> 10
                                                            | (((var42 & 65535) >> 0 | var42 << 16) ^ 31) - 123 << 6
                                                      )
                                                      << 14
                                             )
                                             & 65532
                                       )
                                       >> 2
                                    | (
                                          (
                                                   (
                                                         ((((var42 & 65535) >> 0 | var42 << 16) ^ 31) - 123 & 64512) >> 10
                                                            | (((var42 & 65535) >> 0 | var42 << 16) ^ 31) - 123 << 6
                                                      )
                                                      & 65532
                                                )
                                                >> 2
                                             | (
                                                   ((((var42 & 65535) >> 0 | var42 << 16) ^ 31) - 123 & 64512) >> 10
                                                      | (((var42 & 65535) >> 0 | var42 << 16) ^ 31) - 123 << 6
                                                )
                                                << 14
                                       )
                                       << 14
                              )
                              ^ 139
                        )
                        - 15
                     << 7
            );
            var13.setCharAt(
               var23,
               (char)(
                  (
                           (
                                    (
                                          (
                                                   (
                                                         (
                                                                  (
                                                                        ((((var42 & 65535) >> 0 | var42 << 16) ^ 31) - 123 & 64512) >> 10
                                                                           | (((var42 & 65535) >> 0 | var42 << 16) ^ 31) - 123 << 6
                                                                     )
                                                                     & 65532
                                                               )
                                                               >> 2
                                                            | (
                                                                  ((((var42 & 65535) >> 0 | var42 << 16) ^ 31) - 123 & 64512) >> 10
                                                                     | (((var42 & 65535) >> 0 | var42 << 16) ^ 31) - 123 << 6
                                                               )
                                                               << 14
                                                      )
                                                      & 65532
                                                )
                                                >> 2
                                             | (
                                                   (
                                                            (
                                                                  ((((var42 & 65535) >> 0 | var42 << 16) ^ 31) - 123 & 64512) >> 10
                                                                     | (((var42 & 65535) >> 0 | var42 << 16) ^ 31) - 123 << 6
                                                               )
                                                               & 65532
                                                         )
                                                         >> 2
                                                      | (
                                                            ((((var42 & 65535) >> 0 | var42 << 16) ^ 31) - 123 & 64512) >> 10
                                                               | (((var42 & 65535) >> 0 | var42 << 16) ^ 31) - 123 << 6
                                                         )
                                                         << 14
                                                )
                                                << 14
                                       )
                                       ^ 139
                                 )
                                 - 15
                              & 65024
                        )
                        >> 9
                     | (
                              (
                                    (
                                             (
                                                   (
                                                            (
                                                                  ((((var42 & 65535) >> 0 | var42 << 16) ^ 31) - 123 & 64512) >> 10
                                                                     | (((var42 & 65535) >> 0 | var42 << 16) ^ 31) - 123 << 6
                                                               )
                                                               & 65532
                                                         )
                                                         >> 2
                                                      | (
                                                            ((((var42 & 65535) >> 0 | var42 << 16) ^ 31) - 123 & 64512) >> 10
                                                               | (((var42 & 65535) >> 0 | var42 << 16) ^ 31) - 123 << 6
                                                         )
                                                         << 14
                                                )
                                                & 65532
                                          )
                                          >> 2
                                       | (
                                             (
                                                      (
                                                            ((((var42 & 65535) >> 0 | var42 << 16) ^ 31) - 123 & 64512) >> 10
                                                               | (((var42 & 65535) >> 0 | var42 << 16) ^ 31) - 123 << 6
                                                         )
                                                         & 65532
                                                   )
                                                   >> 2
                                                | (
                                                      ((((var42 & 65535) >> 0 | var42 << 16) ^ 31) - 123 & 64512) >> 10
                                                         | (((var42 & 65535) >> 0 | var42 << 16) ^ 31) - 123 << 6
                                                   )
                                                   << 14
                                          )
                                          << 14
                                 )
                                 ^ 139
                           )
                           - 15
                        << 7
               )
            );
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = (-815255532 >> -1641794280 | 0) & 0; var29 < var16.length(); var29 += (1932577929 ^ 654347108 | 1) & -2088556543) {
            char var52 = var16.charAt(var29);
            int var87 = (var52 & '\ufff0') >> 4;
            int var53 = ((((var52 & '\ufff0') >> 4 | var52 << '\f') ^ 169) - 226 ^ 244) + 219 - 89;
            int var88 = (((((var52 & '\ufff0') >> 4 | var52 << '\f') ^ 169) - 226 ^ 244) + 219 - 89 & 61440) >> 12;
            var52 = (char)(
               (
                     ((((var87 | var52 << '\f') ^ 169) - 226 ^ 244) + 219 - 89 & 61440) >> 12
                        | ((((var52 & '\ufff0') >> 4 | var52 << '\f') ^ 169) - 226 ^ 244) + 219 - 89 << 4
                  )
                  + 29
                  - 152
                  + 82
            );
            var16.setCharAt(var29, (char)((var88 | var53 << 4) + 29 - 152 + 82));
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_131.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = -1584552716 * -1584552716 ^ 118589584; var35 < var19.length(); var35 += (-1197545376 | 1153734153) ^ -52494744) {
            int var59 = var19.charAt(var35) + 144 + 113 + 170;
            int var89 = (var59 & 65520) >> 4;
            int var60 = ((var59 & 65520) >> 4 | var59 << 12) - 1;
            int var90 = (((var59 & 65520) >> 4 | var59 << 12) - 1 & 65534) >> 1;
            var59 = (((var89 | var59 << 12) - 1 & 65534) >> 1 | ((var59 & 65520) >> 4 | var59 << 12) - 1 << 15) - 33;
            var89 = ((var90 | var60 << 15) - 33 & 65472) >> 6;
            int var62 = ((var90 | var60 << 15) - 33 & 65472) >> 6 | var59 << 10;
            int var92 = ((((var90 | var60 << 15) - 33 & 65472) >> 6 | var59 << 10) & 65504) >> 5;
            char var63 = (char)((((var89 | var59 << 10) & 65504) >> 5 | (((var90 | var60 << 15) - 33 & 65472) >> 6 | var59 << 10) << 11) ^ 209);
            var19.setCharAt(var35, (char)((var92 | var62 << 11) ^ 209));
         }

         Class var7 = Class.forName(var19.toString(), false, Class_131.class.getClassLoader());
         switch ((((var4 ^ 717968437 ^ 1022706985) + 1898443345 - 47073509 ^ 943052262 ^ 1338726971) + 285404994 ^ 1557529755) + 698726758 - 1354401776) {
            case 268173885:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            case 490660746:
            case 1641523705:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 678929652:
               var10000 = var0.findSpecial(var7, var5, var6, Class_131.class);
               break;
            case 1162547137:
               var10000 = var0.findConstructor(var7, var6);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_2121[((var10 ^ 1201149293) - 1061330895 - 368955479 ^ 2142206702 ^ 2088191214 ^ 815877679) + 1210595550 + 663403966 - 1305590116 + 1465131102] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1414(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = (var10 - 1611263614 - 2100388092 + 36011225 ^ 1034181156 ^ 307729741 ^ 289862501) + 1943414235 - 1932810430 + 1995461871;
      MethodHandle var10000 = field_2121[(var10 - 1611263614 - 2100388092 + 36011225 ^ 1034181156 ^ 307729741 ^ 289862501)
            + 1943414235
            - 1932810430
            + 1995461871
         ^ 1028798935];
      if (field_2121[var10001 ^ 1028798935] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = (2134211938 + -737273269 | 0) & 680790016; var24 < var14.length(); var24 += 1479022206 << 1479022206 ^ -2147483647) {
            int var43 = var14.charAt(var24) + 21;
            char var46 = (char)(
               (
                     (
                           (
                                    (
                                             ((((var43 & 65535) >> 0 | var43 << 16) - 252 ^ 52) - 47 & 64512) >> 10
                                                | (((var43 & 65535) >> 0 | var43 << 16) - 252 ^ 52) - 47 << 6
                                          )
                                          - 130
                                       & 65504
                                 )
                                 >> 5
                              | (
                                       ((((var43 & 65535) >> 0 | var43 << 16) - 252 ^ 52) - 47 & 64512) >> 10
                                          | (((var43 & 65535) >> 0 | var43 << 16) - 252 ^ 52) - 47 << 6
                                    )
                                    - 130
                                 << 11
                        )
                        ^ 78
                  )
                  - 253
            );
            var14.setCharAt(
               var24,
               (char)(
                  (
                        (
                              (
                                       (
                                                ((((var43 & 65535) >> 0 | var43 << 16) - 252 ^ 52) - 47 & 64512) >> 10
                                                   | (((var43 & 65535) >> 0 | var43 << 16) - 252 ^ 52) - 47 << 6
                                             )
                                             - 130
                                          & 65504
                                    )
                                    >> 5
                                 | (
                                          ((((var43 & 65535) >> 0 | var43 << 16) - 252 ^ 52) - 47 & 64512) >> 10
                                             | (((var43 & 65535) >> 0 | var43 << 16) - 252 ^ 52) - 47 << 6
                                       )
                                       - 130
                                    << 11
                           )
                           ^ 78
                     )
                     - 253
               )
            );
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = (1785809338 >>> 1785809338 | 0) & -1888310208; var30 < var17.length(); var30 += (-980940441 | -955304881) ^ -946913938) {
            int var51 = var17.charAt(var30);
            int var86 = (var51 & 61440) >> 12;
            int var52 = (var51 & 61440) >> 12 | var51 << 4;
            int var87 = (((var51 & 61440) >> 12 | var51 << 4) & 57344) >> 13;
            var51 = ((var86 | var51 << 4) & 57344) >> 13 | ((var51 & 61440) >> 12 | var51 << 4) << 3;
            var86 = ((var87 | var52 << 3) & 65472) >> 6;
            int var54 = ((var87 | var52 << 3) & 65472) >> 6 | var51 << 10;
            int var89 = ((((var87 | var52 << 3) & 65472) >> 6 | var51 << 10) & 65408) >> 7;
            var51 = (((var86 | var51 << 10) & 65408) >> 7 | (((var87 | var52 << 3) & 65472) >> 6 | var51 << 10) << 9) + 177 - 194 ^ 133;
            var86 = (((var89 | var54 << 9) + 177 - 194 ^ 133) & 65472) >> 6;
            int var56 = (((var89 | var54 << 9) + 177 - 194 ^ 133) & 65472) >> 6 | var51 << 10;
            int var91 = (((((var89 | var54 << 9) + 177 - 194 ^ 133) & 65472) >> 6 | var51 << 10) & 61440) >> 12;
            char var57 = (char)((((var86 | var51 << 10) & 61440) >> 12 | ((((var89 | var54 << 9) + 177 - 194 ^ 133) & 65472) >> 6 | var51 << 10) << 4) - 152);
            var17.setCharAt(var30, (char)((var91 | var56 << 4) - 152));
         }

         Class var6 = Class.forName(var17.toString(), false, Class_131.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = (-951772582 & -703660522 | 0) & 952222949; var36 < var20.length(); var36 += 53244522 >> 1231456764 ^ 1) {
            int var62 = (var20.charAt(var36) - 0 + 136 - 108 ^ 83) + 238 + 59 - 188;
            int var92 = (var62 & 63488) >> 11;
            int var63 = (var62 & 63488) >> 11 | var62 << 5;
            int var93 = (((var62 & 63488) >> 11 | var62 << 5) & 64512) >> 10;
            char var64 = (char)((((var92 | var62 << 5) & 64512) >> 10 | ((var62 & 63488) >> 11 | var62 << 5) << 6) + 94);
            var20.setCharAt(var36, (char)((var93 | var63 << 6) + 94));
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_131.class.getClassLoader()).returnType();
         switch ((((var4 - 1871282210 ^ 1258604573 ^ 973643756) - 1373598818 ^ 1450082997) + 115748392 ^ 1002557938 ^ 1238493015 ^ 937067658) + 1954504199) {
            case 22503705:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            case 390413057:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            case 919626024:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            case 1903105403:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_2121[(var10 - 1611263614 - 2100388092 + 36011225 ^ 1034181156 ^ 307729741 ^ 289862501) + 1943414235 - 1932810430 + 1995461871 ^ 1028798935] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
