import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;
import net.minecraft.class_2846;

public class Class_128 extends Class_342 {
   // $VF: renamed from: oht Class_49
   public Class_49 field_2122;
   // $VF: renamed from: amj Class_49
   public Class_49 field_2123;
   // $VF: renamed from: ks Class_105
   public Class_105 field_2124;
   // $VF: renamed from: wva Class_105
   public Class_105 field_2125;
   // $VF: renamed from: nab Class_49
   public Class_49 field_2126;
   // $VF: renamed from: hb int
   public int field_2127;
   // $VF: renamed from: fd int
   public int field_2128;
   // $VF: renamed from: iqo boolean
   public boolean field_2129;
   // $VF: renamed from: at boolean
   public boolean field_2130;
   public boolean qpjn;
   // $VF: renamed from: xim java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_2131 = new MethodHandle[1671191545 >>> 1671191545 ^ 184];

   public Class_128() {
      int var1 = -1620438799;
      int var10001 = (1381286859 | -799798251) ^ -766193697;

      StringBuilder var10002;
      for (var10002 = (StringBuilder)0<"JNT",-877218642,"뽟㽫㽮㽫㾘뽝","ۨघ\u0890௴ࠠ௴ތ࢘௴ࢀ௬ތࢼ࠸࠰\u0894ࢀ௬ࣜޔࢠ","훿옿짿옿쟿쥿옿\ud7ff햿쟿삿쭿죿\ud83f\ud7ff햿糿쬿\ud83f쥿흿휿죿",-620973149>(
            "\ue80c\uf58c\uf80c\uf08c\uf48c츌\ue58c\uf10c\uf10c\uf20c\uee8c\uf50c\uf00c"
         );
         var10001 < ((-323951195 & -471512561 | 8) & 339969869);
         var10001 += 81449957 >> 81449957 ^ 2545310
      ) {
         char var40 = 0<"JNT",1478195639,"㽩㽬㾃㽲뽢㾘","ۨऔޔࡼ","훿옿짿옿쟿쥿옿\ud7ff햿쟿삿쭿죿\ud83f\ud7ff햿糿쬿\ud83f쥿흿휿죿",-620973142>(var10002, var10001);
         char var43 = (char)(
            (
                  (((((var40 & '\ufffe') >> 1 | var40 << 15) & 32768) >> 15 | ((var40 & '\ufffe') >> 1 | var40 << 15) << 1) - 141 & 65408) >> 7
                     | ((((var40 & '\ufffe') >> 1 | var40 << 15) & 32768) >> 15 | ((var40 & '\ufffe') >> 1 | var40 << 15) << 1) - 141 << 9
               )
               + 134
         );
         0<"JNT",1478195639,"㾙㽧㾘뽈㽬㾃㽲뽢㾘","ۨऔࡼޔࢠ","훿옿짿옿쟿쥿옿\ud7ff햿쟿삿쭿죿\ud83f\ud7ff햿糿쬿\ud83f쥿흿휿죿",-620973141>(
            var10002,
            var10001,
            (char)(
               (
                     (((((var40 & '\ufffe') >> 1 | var40 << 15) & 32768) >> 15 | ((var40 & '\ufffe') >> 1 | var40 << 15) << 1) - 141 & 65408) >> 7
                        | ((((var40 & '\ufffe') >> 1 | var40 << 15) & 32768) >> 15 | ((var40 & '\ufffe') >> 1 | var40 << 15) << 1) - 141 << 9
                  )
                  + 134
            )
         );
      }

      String var9 = 0<"JNT",1478195639,"㾘㽵㽹㾘㽲㽫㽮㽭","ۨޔघ\u0890௴ࠠ௴ތ࢘௴ࢀ௬ތࢼ࠸࠰\u0894ࢀ௬ࣜ","훿옿짿옿쟿쥿옿\ud7ff햿쟿삿쭿죿\ud83f\ud7ff햿糿쬿\ud83f쥿흿휿죿",-620973162>(var10002);
      int var24 = (484431195 & 1937967153 | 0) & -2142475700;

      StringBuilder var45;
      for (var45 = (StringBuilder)0<"JNT",-877218642,"뽟㽫㽮㽫㾘뽝","ۨघ\u0890௴ࠠ௴ތ࢘௴ࢀ௬ތࢼ࠸࠰\u0894ࢀ௬ࣜޔࢠ","훿옿짿옿쟿쥿옿\ud7ff햿쟿삿쭿죿\ud83f\ud7ff햿糿쬿\ud83f쥿흿휿죿",-620973241>(
            "㕼ᅼོቼռ\u0e7cͼᕼ䙼ቼॼ䙼ὼॼ፼ᑼ䙼ቼॼቼͼ\u0b7c䙼ᕼ\u0a7cॼቼ䙼ݼࡼɼ䙼ॼ||\u0e7cݼࡼɼᕼ䙼ݼ䙼ቼॼቼͼ\u0b7c䙼ོ|䙼ὼॼ፼䙼ɼॼࡼቼ䙼\u0e7cݼၼͼ䙼ॼࡼͼ䙼ݼ\u0a7cᑼͼݼɼὼ䙼ॼᑼ䙼ོ|䙼\u2e7c㙼䙼ོᕼ䙼\u0a7cॼᅼ"
         );
         var24 < (-1752839132 << -1752839132 ^ 2019344925);
         var24 += -1707859682 >>> -1707859682 ^ 3
      ) {
         int var83 = 0<"JNT",1478195639,"㽩㽬㾃㽲뽢㾘","ۨऔޔࡼ","훿옿짿옿쟿쥿옿\ud7ff햿쟿삿쭿죿\ud83f\ud7ff햿糿쬿\ud83f쥿흿휿죿",-620973148>(var45, var24) ^ '|';
         int var10006 = (var83 & 57344) >> 13;
         int var84 = (var83 & 57344) >> 13 | var83 << 3;
         int var142 = (((var83 & 57344) >> 13 | var83 << 3) & 63488) >> 11;
         char var85 = (char)((((var10006 | var83 << 3) & 63488) >> 11 | ((var83 & 57344) >> 13 | var83 << 3) << 5) ^ 128 ^ 230);
         0<"JNT",1478195639,"㾙㽧㾘뽈㽬㾃㽲뽢㾘","ۨऔࡼޔࢠ","훿옿짿옿쟿쥿옿\ud7ff햿쟿삿쭿죿\ud83f\ud7ff햿糿쬿\ud83f쥿흿휿죿",-620973147>(
            var45, var24, (char)((var142 | var84 << 5) ^ 128 ^ 230)
         );
      }

      super(
         var9,
         0<"JNT",1478195639,"㾘㽵㽹㾘㽲㽫㽮㽭","ۨޔघ\u0890௴ࠠ௴ތ࢘௴ࢀ௬ތࢼ࠸࠰\u0894ࢀ௬ࣜ","훿옿짿옿쟿쥿옿\ud7ff햿쟿삿쭿죿\ud83f\ud7ff햿糿쬿\ud83f쥿흿휿죿",-620973196>(var45),
         -1,
         1<"JNT",1810280517,"齬\udf69","侍䧍","㧛㯛臛\udbdb귛忛",830967456>()
      );
      Class_128 var10000 = this;
      var10001 = (-1960624373 * 110807147 | 0) & 543294018;

      for (var10002 = (StringBuilder)0<"JNT",-877218642,"뽟㽫㽮㽫㾘뽝","ۨघ\u0890௴ࠠ௴ތ࢘௴ࢀ௬ތࢼ࠸࠰\u0894ࢀ௬ࣜޔࢠ","훿옿짿옿쟿쥿옿\ud7ff햿쟿삿쭿죿\ud83f\ud7ff햿糿쬿\ud83f쥿흿휿죿",-620973194>(
            "噛\ue65b깛\uda5b陛\uaa5b詚ᩛ鹛멛蹛\uee5b"
         );
         var10001 < (1288901286 << 361528753 ^ 625737740);
         var10001 += (-330686918 - 1452914203 | 1) & 1615433729
      ) {
         int var48 = 0<"JNT",1478195639,"㽩㽬㾃㽲뽢㾘","ۨऔޔࡼ","훿옿짿옿쟿쥿옿\ud7ff햿쟿삿쭿죿\ud83f\ud7ff햿糿쬿\ud83f쥿흿휿죿",-620973146>(var10002, var10001) + 'D' ^ 222;
         int var123 = (var48 & 65520) >> 4;
         int var49 = ((var48 & 65520) >> 4 | var48 << 12) - 164;
         int var124 = (((var48 & 65520) >> 4 | var48 << 12) - 164 & 65472) >> 6;
         char var50 = (char)(((var123 | var48 << 12) - 164 & 65472) >> 6 | ((var48 & 65520) >> 4 | var48 << 12) - 164 << 10);
         0<"JNT",1478195639,"㾙㽧㾘뽈㽬㾃㽲뽢㾘","ۨऔࡼޔࢠ","훿옿짿옿쟿쥿옿\ud7ff햿쟿삿쭿죿\ud83f\ud7ff햿糿쬿\ud83f쥿흿휿죿",-620973161>(var10002, var10001, (char)(var124 | var49 << 10));
      }

      Class_49 var12 = (Class_49)0<"JNT",-877218642,"뽟㽫㽮㽫㾘뽝","ۨघ\u0890௴ࠠ௴ތ࢘௴ࢀ௬ތࢼ࠸࠰\u0894ࢀ௬ࣜࡸࡸࡸࡸޔࢠ","흿쒿",-620973169>(
         0<"JNT",1478195639,"㾘㽵㽹㾘㽲㽫㽮㽭","ۨޔघ\u0890௴ࠠ௴ތ࢘௴ࢀ௬ތࢼ࠸࠰\u0894ࢀ௬ࣜ","훿옿짿옿쟿쥿옿\ud7ff햿쟿삿쭿죿\ud83f\ud7ff햿糿쬿\ud83f쥿흿휿죿",-620973154>(var10002), 0.0, 5.0, 0.0, 1.0
      );
      int var28 = 689031022 << 564952291 ^ 1217280880;
      var45 = (StringBuilder)0<"JNT",-877218642,"뽟㽫㽮㽫㾘뽝","ۨघ\u0890௴ࠠ௴ތ࢘௴ࢀ௬ތࢼ࠸࠰\u0894ࢀ௬ࣜޔࢠ","훿옿짿옿쟿쥿옿\ud7ff햿쟿삿쭿죿\ud83f\ud7ff햿糿쬿\ud83f쥿흿휿죿",-620973168>(
         "鉠큠쉠\ud860\ue860婠\ude60큠홠쑠﹠큠婠ﱠ\uf460졠\uf260\udc60쩠졠왠푠婠\uf260쑠婠\uf260쑠\uf260큠쁠婠ﱠ쉠쑠\uf260"
      );

      label114:
      while (true) {
         var1 = 816341960 & 816341960 ^ -986624653;

         while (true) {
            label110:
            while (true) {
               label136: {
                  switch ((var1 - 1802087256 - 1569527017 - 1725592513 + 185144078 ^ 1956280123) - 192648279) {
                     case -1731205467:
                        var10002 = var45;
                        if (var28 < ((1958638388 | 361970496 + -1128224242 | 32) & 16777252)) {
                           char var114 = 0<"JNT",1478195639,"㽩㽬㾃㽲뽢㾘","ۨऔޔࡼ","훿옿짿옿쟿쥿옿\ud7ff햿쟿삿쭿죿\ud83f\ud7ff햿糿쬿\ud83f쥿흿휿죿",-620973188>(var45, var28);
                           char var117 = (char)(
                              ((((((var114 & 'ﾀ') >> 7 | var114 << '\t') & 49152) >> 14 | ((var114 & 'ﾀ') >> 7 | var114 << '\t') << 2) ^ 154 ^ 73) & 65520)
                                    >> 4
                                 | (((((var114 & 'ﾀ') >> 7 | var114 << '\t') & 49152) >> 14 | ((var114 & 'ﾀ') >> 7 | var114 << '\t') << 2) ^ 154 ^ 73) << 12
                           );
                           0<"JNT",1478195639,"㾙㽧㾘뽈㽬㾃㽲뽢㾘","ۨऔࡼޔࢠ","훿옿짿옿쟿쥿옿\ud7ff햿쟿삿쭿죿\ud83f\ud7ff햿糿쬿\ud83f쥿흿휿죿",-620973187>(
                              var45,
                              var28,
                              (char)(
                                 ((((((var114 & 'ﾀ') >> 7 | var114 << '\t') & 49152) >> 14 | ((var114 & 'ﾀ') >> 7 | var114 << '\t') << 2) ^ 154 ^ 73) & 65520)
                                       >> 4
                                    | (((((var114 & 'ﾀ') >> 7 | var114 << '\t') & 49152) >> 14 | ((var114 & 'ﾀ') >> 7 | var114 << '\t') << 2) ^ 154 ^ 73) << 12
                              )
                           );
                           var28 += -1935678477 >>> 98110517 ^ 1125;
                           continue label114;
                        }

                        var1 = (-1520881938 ^ -33284713 | 553840012) & -417075812;
                        break;
                     case -1574748628:
                     default:
                        var10002 = var45;
                        if (var28 < ((-564864480 | 1140985163) ^ -564732089)) {
                           0<"JNT",1478195639,"㾙㽧㾘뽈㽬㾃㽲뽢㾘","ۨऔࡼޔࢠ","훿옿짿옿쟿쥿옿\ud7ff햿쟿삿쭿죿\ud83f\ud7ff햿糿쬿\ud83f쥿흿휿죿",-620973174>(
                              var45,
                              var28,
                              (char)(
                                 (0<"JNT",1478195639,"㽩㽬㾃㽲뽢㾘","ۨऔޔࡼ","훿옿짿옿쟿쥿옿\ud7ff햿쟿삿쭿죿\ud83f\ud7ff햿糿쬿\ud83f쥿흿휿죿",-620973175>(var45, var28) ^ '\t' ^ 236)
                                    - 119
                                    + 152
                                    + 16
                              )
                           );
                           var28 += 1143600507 >> 1851559489 ^ 571800252;
                           break label110;
                        }

                        var1 = (1817629533 | 1506249397) ^ 2072148577;
                        break;
                     case -1101374216:
                        var10002 = var45;
                        if (var28 < ((527624617 - -751467970 | 6) & 276863143)) {
                           char var90 = 0<"JNT",1478195639,"㽩㽬㾃㽲뽢㾘","ۨऔޔࡼ","훿옿짿옿쟿쥿옿\ud7ff햿쟿삿쭿죿\ud83f\ud7ff햿糿쬿\ud83f쥿흿휿죿",-620973153>(var45, var28);
                           char var91 = (char)((((var90 & 'ﰀ') >> 10 | var90 << 6) ^ 161) + 97 + 213 ^ 159);
                           0<"JNT",1478195639,"㾙㽧㾘뽈㽬㾃㽲뽢㾘","ۨऔࡼޔࢠ","훿옿짿옿쟿쥿옿\ud7ff햿쟿삿쭿죿\ud83f\ud7ff햿糿쬿\ud83f쥿흿휿죿",-620973152>(
                              var45, var28, (char)((((var90 & 'ﰀ') >> 10 | var90 << 6) ^ 161) + 97 + 213 ^ 159)
                           );
                           var28 += -78348077 >>> -1542236770 ^ 2;
                           break label136;
                        }

                        var1 = 1613847651 + (1613847651 << 1613847651) ^ -1856266707;
                  }

                  switch ((var1 - 1325115515 ^ 1244011545 ^ 1574415248) - 2125710597 + 343748461 ^ 1268076763) {
                     case -766112309:
                        var10000.field_2122 = 0<"JNT",1478195639,"㽵㽫㽬","ۨघ\u0890௴ࠠ௴ތ࢘௴ࢀ௬ތࢼ࠸࠰\u0894ࢀ௬ࣜޔघ௸\u0bfcࣜ","흿쒿",-620973144>(
                           var12,
                           0<"JNT",1478195639,"㾘㽵㽹㾘㽲㽫㽮㽭","ۨޔघ\u0890௴ࠠ௴ތ࢘௴ࢀ௬ތࢼ࠸࠰\u0894ࢀ௬ࣜ","훿옿짿옿쟿쥿옿\ud7ff햿쟿삿쭿죿\ud83f\ud7ff햿糿쬿\ud83f쥿흿휿죿",-620973145>(var10002)
                        );
                        var10000 = this;
                        var10001 = (1001624329 * -234573620 | 0) & 696779857;

                        for (var10002 = (StringBuilder)0<"JNT",-877218642,"뽟㽫㽮㽫㾘뽝","ۨघ\u0890௴ࠠ௴ތ࢘௴ࢀ௬ތࢼ࠸࠰\u0894ࢀ௬ࣜޔࢠ","훿옿짿옿쟿쥿옿\ud7ff햿쟿삿쭿죿\ud83f\ud7ff햿糿쬿\ud83f쥿흿휿죿",-620973143>(
                              "͈ϨψШϰɰ͐шАѨΨ"
                           );
                           var10001 < ((-1661026342 ^ -1251442282 | 11) & 1409859723);
                           var10001 += (266011632 >>> (266011632 << -334972592) | 1) & 1881205763
                        ) {
                           int var76 = 0<"JNT",1478195639,"㽩㽬㾃㽲뽢㾘","ۨऔޔࡼ","훿옿짿옿쟿쥿옿\ud7ff햿쟿삿쭿죿\ud83f\ud7ff햿糿쬿\ud83f쥿흿휿죿",-620973240>(var10002, var10001)
                              - 'y'
                              - 15;
                           int var137 = (var76 & 65532) >> 2;
                           int var77 = (var76 & 65532) >> 2 | var76 << 14;
                           int var138 = (((var76 & 65532) >> 2 | var76 << 14) & 65534) >> 1;
                           char var78 = (char)((((var137 | var76 << 14) & 65534) >> 1 | ((var76 & 65532) >> 2 | var76 << 14) << 15) ^ 29);
                           0<"JNT",1478195639,"㾙㽧㾘뽈㽬㾃㽲뽢㾘","ۨऔࡼޔࢠ","훿옿짿옿쟿쥿옿\ud7ff햿쟿삿쭿죿\ud83f\ud7ff햿糿쬿\ud83f쥿흿휿죿",-620973239>(
                              var10002, var10001, (char)((var138 | var77 << 15) ^ 29)
                           );
                        }

                        var12 = (Class_49)0<"JNT",-877218642,"뽟㽫㽮㽫㾘뽝","ۨघ\u0890௴ࠠ௴ތ࢘௴ࢀ௬ތࢼ࠸࠰\u0894ࢀ௬ࣜࡸࡸࡸࡸޔࢠ","흿쒿",-620973156>(
                           0<"JNT",1478195639,"㾘㽵㽹㾘㽲㽫㽮㽭","ۨޔघ\u0890௴ࠠ௴ތ࢘௴ࢀ௬ތࢼ࠸࠰\u0894ࢀ௬ࣜ","훿옿짿옿쟿쥿옿\ud7ff햿쟿삿쭿죿\ud83f\ud7ff햿糿쬿\ud83f쥿흿휿죿",-620973157>(var10002),
                           1.0,
                           5.0,
                           1.0,
                           1.0
                        );
                        var28 = (790334397 << -1725947016 | 0) & 48896898;
                        var45 = (StringBuilder)0<"JNT",-877218642,"뽟㽫㽮㽫㾘뽝","ۨघ\u0890௴ࠠ௴ތ࢘௴ࢀ௬ތࢼ࠸࠰\u0894ࢀ௬ࣜޔࢠ","훿옿짿옿쟿쥿옿\ud7ff햿쟿삿쭿죿\ud83f\ud7ff햿糿쬿\ud83f쥿흿휿죿",-620973155>(
                           "ᏼ韽珼ꟽ䟼ꏼ鯽韽诽濼导韽ꏼ韽柼埼蟽揼揼蟽毼追ꏼ叼濼叼韽矼ꏼ叼濼ꏼ濼诽诽菽ꟽ毼鏽"
                        );
                        break;
                     case 7792993:
                        var10000.field_2123 = 0<"JNT",1478195639,"㽵㽫㽬","ۨघ\u0890௴ࠠ௴ތ࢘௴ࢀ௬ތࢼ࠸࠰\u0894ࢀ௬ࣜޔघ௸\u0bfcࣜ","흿쒿",-620973159>(
                           var12,
                           0<"JNT",1478195639,"㾘㽵㽹㾘㽲㽫㽮㽭","ۨޔघ\u0890௴ࠠ௴ތ࢘௴ࢀ௬ތࢼ࠸࠰\u0894ࢀ௬ࣜ","훿옿짿옿쟿쥿옿\ud7ff햿쟿삿쭿죿\ud83f\ud7ff햿糿쬿\ud83f쥿흿휿죿",-620973160>(var10002)
                        );
                        var10000 = this;
                        var10001 = -1920862569 & -1920862569 + -1920862569 ^ 151118854;

                        for (var10002 = (StringBuilder)0<"JNT",-877218642,"뽟㽫㽮㽫㾘뽝","ۨघ\u0890௴ࠠ௴ތ࢘௴ࢀ௬ތࢼ࠸࠰\u0894ࢀ௬ࣜޔࢠ","훿옿짿옿쟿쥿옿\ud7ff햿쟿삿쭿죿\ud83f\ud7ff햿糿쬿\ud83f쥿흿휿죿",-620973158>(
                              "᧘ᵘᲘ᷸ᯘ᭸ቸីᮘᯘ᳘"
                           );
                           var10001 < (-198493212 + 1453355420 ^ 1254862219);
                           var10001 += (1622773610 + -247724392 | 1) & 738861297
                        ) {
                           int var57 = 0<"JNT",1478195639,"㽩㽬㾃㽲뽢㾘","ۨऔޔࡼ","훿옿짿옿쟿쥿옿\ud7ff햿쟿삿쭿죿\ud83f\ud7ff햿糿쬿\ud83f쥿흿휿죿",-620973164>(var10002, var10001)
                              ^ ' '
                              ^ 38
                              ^ 158;
                           char var58 = (char)(((var57 & 65504) >> 5 | var57 << 11) - 119);
                           0<"JNT",1478195639,"㾙㽧㾘뽈㽬㾃㽲뽢㾘","ۨऔࡼޔࢠ","훿옿짿옿쟿쥿옿\ud7ff햿쟿삿쭿죿\ud83f\ud7ff햿糿쬿\ud83f쥿흿휿죿",-620973163>(
                              var10002, var10001, (char)(((var57 & 65504) >> 5 | var57 << 11) - 119)
                           );
                        }

                        Class_105 var16 = (Class_105)0<"JNT",-877218642,"뽟㽫㽮㽫㾘뽝","ۨघ\u0890௴ࠠ௴ތ࢘௴ࢀ௬ތࢼ࠸࠰\u0894ࢀ௬ࣜࡐޔࢠ","햿죿",-620973139>(
                           0<"JNT",1478195639,"㾘㽵㽹㾘㽲㽫㽮㽭","ۨޔघ\u0890௴ࠠ௴ތ࢘௴ࢀ௬ތࢼ࠸࠰\u0894ࢀ௬ࣜ","훿옿짿옿쟿쥿옿\ud7ff햿쟿삿쭿죿\ud83f\ud7ff햿糿쬿\ud83f쥿흿휿죿",-620973140>(var10002),
                           false
                        );
                        int var32 = (-1837205768 >> -1837205768 | 0) & 37;
                        var45 = (StringBuilder)0<"JNT",-877218642,"뽟㽫㽮㽫㾘뽝","ۨघ\u0890௴ࠠ௴ތ࢘௴ࢀ௬ތࢼ࠸࠰\u0894ࢀ௬ࣜޔࢠ","훿옿짿옿쟿쥿옿\ud7ff햿쟿삿쭿죿\ud83f\ud7ff햿糿쬿\ud83f쥿흿휿죿",-620973138>(
                           "Ⱥɖɴəɪɵȭɫɬɪɲȭəɮȭɝɛɨɗɴɮɘɚȭɚɱɮəȭɬɧəɨɛȭɨɜɘɴɝɝɴɯɦ"
                        );

                        label88:
                        while (true) {
                           var1 = (428904703 - (-1357060249 | -1871157764) | -1270273382) & -185864481;

                           while (true) {
                              label139: {
                                 switch ((var1 + 1513984946 + 1671613009 - 405810032 + 1158743210 ^ 31560067) + 254854028) {
                                    case -300010528:
                                       var10002 = var45;
                                       if (var32 < (1649490582 & 1311277972 ^ 1107296952)) {
                                          0<"JNT",1478195639,"㾙㽧㾘뽈㽬㾃㽲뽢㾘","ۨऔࡼޔࢠ","훿옿짿옿쟿쥿옿\ud7ff햿쟿삿쭿죿\ud83f\ud7ff햿糿쬿\ud83f쥿흿휿죿",-620973237>(
                                             var45,
                                             var32,
                                             (char)(
                                                0<"JNT",1478195639,"㽩㽬㾃㽲뽢㾘","ۨऔޔࡼ","훿옿짿옿쟿쥿옿\ud7ff햿쟿삿쭿죿\ud83f\ud7ff햿糿쬿\ud83f쥿흿휿죿",-620973238>(var45, var32)
                                                      - 'y'
                                                      + 19
                                                      - 56
                                                      - 216
                                                   ^ 151
                                             )
                                          );
                                          var32 += (-1626005090 >>> (1085374157 | 1211851891) | 0) & -1660379691;
                                          continue label88;
                                       }

                                       var1 = -297444884 - -1957845423 ^ 1185868456;
                                       break;
                                    case -194167226:
                                    default:
                                       var10002 = var45;
                                       if (var32 < (-2002148531 >> -251611985 + 229371138 ^ -15242)) {
                                          int var98 = 0<"JNT",1478195639,"㽩㽬㾃㽲뽢㾘","ۨऔޔࡼ","훿옿짿옿쟿쥿옿\ud7ff햿쟿삿쭿죿\ud83f\ud7ff햿糿쬿\ud83f쥿흿휿죿",-620973173>(var45, var32);
                                          int var144 = (var98 & 65534) >> 1;
                                          int var99 = (var98 & 65534) >> 1 | var98 << 15;
                                          int var145 = (((var98 & 65534) >> 1 | var98 << 15) & 65472) >> 6;
                                          var98 = (((var144 | var98 << 15) & 65472) >> 6 | ((var98 & 65534) >> 1 | var98 << 15) << 10) + 113;
                                          var144 = ((var145 | var99 << 10) + 113 & 65520) >> 4;
                                          int var101 = ((var145 | var99 << 10) + 113 & 65520) >> 4 | var98 << 12;
                                          int var147 = ((((var145 | var99 << 10) + 113 & 65520) >> 4 | var98 << 12) & 49152) >> 14;
                                          char var102 = (char)(
                                             ((var144 | var98 << 12) & 49152) >> 14 | (((var145 | var99 << 10) + 113 & 65520) >> 4 | var98 << 12) << 2
                                          );
                                          0<"JNT",1478195639,"㾙㽧㾘뽈㽬㾃㽲뽢㾘","ۨऔࡼޔࢠ","훿옿짿옿쟿쥿옿\ud7ff햿쟿삿쭿죿\ud83f\ud7ff햿糿쬿\ud83f쥿흿휿죿",-620973172>(
                                             var45, var32, (char)(var147 | var101 << 2)
                                          );
                                          var32 += (810733026 ^ -165836862 | 1) & 671131089;
                                          break label139;
                                       }

                                       var1 = -320998769 << -320998769 * -320998769 ^ -1666745665;
                                 }

                                 switch (var1 - 1141463661 - 188153989 + 1298962126 - 1647811747 - 2040349005 ^ 1310416473) {
                                    case 145484102:
                                    default:
                                       var10000.field_2124 = 0<"JNT",1478195639,"㾃㾗㽨","ۨघ\u0890௴ࠠ௴ތ࢘௴ࢀ௬ތࢼ࠸࠰\u0894ࢀ௬ࣜޔघ௬࠰ࣜ","햿죿",-620973198>(
                                          var16,
                                          0<"JNT",1478195639,"㾘㽵㽹㾘㽲㽫㽮㽭","ۨޔघ\u0890௴ࠠ௴ތ࢘௴ࢀ௬ތࢼ࠸࠰\u0894ࢀ௬ࣜ","훿옿짿옿쟿쥿옿\ud7ff햿쟿삿쭿죿\ud83f\ud7ff햿糿쬿\ud83f쥿흿휿죿",-620973199>(
                                             var10002
                                          )
                                       );
                                       var10000 = this;
                                       var10001 = (-739224356 << -1742526675 | 0) & 1627652365;

                                       for (var10002 = (StringBuilder)0<"JNT",-877218642,"뽟㽫㽮㽫㾘뽝","ۨघ\u0890௴ࠠ௴ތ࢘௴ࢀ௬ތࢼ࠸࠰\u0894ࢀ௬ࣜޔࢠ","훿옿짿옿쟿쥿옿\ud7ff햿쟿삿쭿죿\ud83f\ud7ff햿糿쬿\ud83f쥿흿휿죿",-620973197>(
                                             "ीೠౠවເീрࢠീೠಠච"
                                          );
                                          var10001 < ((629067259 << 629067259 | 12) & 10951149);
                                          var10001 += 1
                                       ) {
                                          char var70 = 0<"JNT",1478195639,"㽩㽬㾃㽲뽢㾘","ۨऔޔࡼ","훿옿짿옿쟿쥿옿\ud7ff햿쟿삿쭿죿\ud83f\ud7ff햿糿쬿\ud83f쥿흿휿죿",-620973177>(
                                             var10002, var10001
                                          );
                                          char var73 = (char)(
                                             (
                                                   (
                                                            (
                                                                     (((var70 & '\ufffe') >> 1 | var70 << 15) & 65535) >> 0
                                                                        | ((var70 & '\ufffe') >> 1 | var70 << 15) << 16
                                                                  )
                                                                  - 192
                                                               & 65520
                                                         )
                                                         >> 4
                                                      | ((((var70 & '\ufffe') >> 1 | var70 << 15) & 65535) >> 0 | ((var70 & '\ufffe') >> 1 | var70 << 15) << 16)
                                                            - 192
                                                         << 12
                                                )
                                                + 10
                                          );
                                          0<"JNT",1478195639,"㾙㽧㾘뽈㽬㾃㽲뽢㾘","ۨऔࡼޔࢠ","훿옿짿옿쟿쥿옿\ud7ff햿쟿삿쭿죿\ud83f\ud7ff햿糿쬿\ud83f쥿흿휿죿",-620973176>(
                                             var10002,
                                             var10001,
                                             (char)(
                                                (
                                                      (
                                                               (
                                                                        (((var70 & '\ufffe') >> 1 | var70 << 15) & 65535) >> 0
                                                                           | ((var70 & '\ufffe') >> 1 | var70 << 15) << 16
                                                                     )
                                                                     - 192
                                                                  & 65520
                                                            )
                                                            >> 4
                                                         | (
                                                                  (((var70 & '\ufffe') >> 1 | var70 << 15) & 65535) >> 0
                                                                     | ((var70 & '\ufffe') >> 1 | var70 << 15) << 16
                                                               )
                                                               - 192
                                                            << 12
                                                   )
                                                   + 10
                                             )
                                          );
                                       }

                                       var16 = (Class_105)0<"JNT",-877218642,"뽟㽫㽮㽫㾘뽝","ۨघ\u0890௴ࠠ௴ތ࢘௴ࢀ௬ތࢼ࠸࠰\u0894ࢀ௬ࣜࡐޔࢠ","햿죿",-620973190>(
                                          0<"JNT",1478195639,"㾘㽵㽹㾘㽲㽫㽮㽭","ۨޔघ\u0890௴ࠠ௴ތ࢘௴ࢀ௬ތࢼ࠸࠰\u0894ࢀ௬ࣜ","훿옿짿옿쟿쥿옿\ud7ff햿쟿삿쭿죿\ud83f\ud7ff햿糿쬿\ud83f쥿흿휿죿",-620973191>(
                                             var10002
                                          ),
                                          false
                                       );
                                       var32 = 1023490589 ^ 1880331549 + -14894067 ^ 1378970423;
                                       var45 = (StringBuilder)0<"JNT",-877218642,"뽟㽫㽮㽫㾘뽝","ۨघ\u0890௴ࠠ௴ތ࢘௴ࢀ௬ތࢼ࠸࠰\u0894ࢀ௬ࣜޔࢠ","훿옿짿옿쟿쥿옿\ud7ff햿쟿삿쭿죿\ud83f\ud7ff햿糿쬿\ud83f쥿흿휿죿",-620973189>(
                                          "䦀趀꾀馀뎀覀꾀醀ހ讀覀궀醀辀ހꖀꎀހ鞀醀覀龀꾀鞀ހ꾀鞀ꮀ醀궀鞀ꖀ龀辀"
                                       );
                                       break;
                                    case 694723540:
                                       var10000.field_2125 = 0<"JNT",1478195639,"㾃㾗㽨","ۨघ\u0890௴ࠠ௴ތ࢘௴ࢀ௬ތࢼ࠸࠰\u0894ࢀ௬ࣜޔघ௬࠰ࣜ","햿죿",-620973166>(
                                          var16,
                                          0<"JNT",1478195639,"㾘㽵㽹㾘㽲㽫㽮㽭","ۨޔघ\u0890௴ࠠ௴ތ࢘௴ࢀ௬ތࢼ࠸࠰\u0894ࢀ௬ࣜ","훿옿짿옿쟿쥿옿\ud7ff햿쟿삿쭿죿\ud83f\ud7ff햿糿쬿\ud83f쥿흿휿죿",-620973167>(
                                             var10002
                                          )
                                       );
                                       var10000 = this;
                                       var10001 = (-2120377661 >> (-2120377661 | -1472849685) | 0) & 885836;

                                       for (var10002 = (StringBuilder)0<"JNT",-877218642,"뽟㽫㽮㽫㾘뽝","ۨघ\u0890௴ࠠ௴ތ࢘௴ࢀ௬ތࢼ࠸࠰\u0894ࢀ௬ࣜޔࢠ","훿옿짿옿쟿쥿옿\ud7ff햿쟿삿쭿죿\ud83f\ud7ff햿糿쬿\ud83f쥿흿휿죿",-620973165>(
                                             "าୢ\u0ba2௲\u0c72ల\u07b2\u0e72ల\u0cd2ୢೂలం௲୲"
                                          );
                                          var10001 < (1654913524 - -1106322204 ^ -1533731584);
                                          var10001 += (-6743619 + -2091856067 | 1) & 1879054081
                                       ) {
                                          char var64 = 0<"JNT",1478195639,"㽩㽬㾃㽲뽢㾘","ۨऔޔࡼ","훿옿짿옿쟿쥿옿\ud7ff햿쟿삿쭿죿\ud83f\ud7ff햿糿쬿\ud83f쥿흿휿죿",-620973151>(
                                             var10002, var10001
                                          );
                                          char var67 = (char)(
                                             (
                                                   (
                                                            (
                                                                  (((var64 & 0) >> 16 | var64 << 0) + 158 & 49152) >> 14
                                                                     | ((var64 & 0) >> 16 | var64 << 0) + 158 << 2
                                                               )
                                                               & 65472
                                                         )
                                                         >> 6
                                                      | ((((var64 & 0) >> 16 | var64 << 0) + 158 & 49152) >> 14 | ((var64 & 0) >> 16 | var64 << 0) + 158 << 2)
                                                         << 10
                                                )
                                                ^ 165
                                          );
                                          0<"JNT",1478195639,"㾙㽧㾘뽈㽬㾃㽲뽢㾘","ۨऔࡼޔࢠ","훿옿짿옿쟿쥿옿\ud7ff햿쟿삿쭿죿\ud83f\ud7ff햿糿쬿\ud83f쥿흿휿죿",-620973150>(
                                             var10002,
                                             var10001,
                                             (char)(
                                                (
                                                      (
                                                               (
                                                                     (((var64 & 0) >> 16 | var64 << 0) + 158 & 49152) >> 14
                                                                        | ((var64 & 0) >> 16 | var64 << 0) + 158 << 2
                                                                  )
                                                                  & 65472
                                                            )
                                                            >> 6
                                                         | (
                                                               (((var64 & 0) >> 16 | var64 << 0) + 158 & 49152) >> 14
                                                                  | ((var64 & 0) >> 16 | var64 << 0) + 158 << 2
                                                            )
                                                            << 10
                                                   )
                                                   ^ 165
                                             )
                                          );
                                       }

                                       var12 = (Class_49)0<"JNT",-877218642,"뽟㽫㽮㽫㾘뽝","ۨघ\u0890௴ࠠ௴ތ࢘௴ࢀ௬ތࢼ࠸࠰\u0894ࢀ௬ࣜࡸࡸࡸࡸޔࢠ","흿쒿",-620973201>(
                                          0<"JNT",1478195639,"㾘㽵㽹㾘㽲㽫㽮㽭","ۨޔघ\u0890௴ࠠ௴ތ࢘௴ࢀ௬ތࢼ࠸࠰\u0894ࢀ௬ࣜ","훿옿짿옿쟿쥿옿\ud7ff햿쟿삿쭿죿\ud83f\ud7ff햿糿쬿\ud83f쥿흿휿죿",-620973186>(
                                             var10002
                                          ),
                                          2.0,
                                          20.0,
                                          1.0,
                                          0.5
                                       );
                                       var28 = (1216678662 >>> -1937700152 + -1182856350 | 0) & -304005116;
                                       var45 = (StringBuilder)0<"JNT",-877218642,"뽟㽫㽮㽫㾘뽝","ۨघ\u0890௴ࠠ௴ތ࢘௴ࢀ௬ތࢼ࠸࠰\u0894ࢀ௬ࣜޔࢠ","훿옿짿옿쟿쥿옿\ud7ff햿쟿삿쭿죿\ud83f\ud7ff햿糿쬿\ud83f쥿흿휿죿",-620973200>(
                                          "òÑÕÞ¦Ò＊¦Ò¤Ñ§ÒÛÞÖ＊¦Û＊Õ×¦Ý Õ¦Ñ＊¦Û¦ÑÙ＊Ñ¥¡ÝÚÚÝØÓ"
                                       );
                                       break label110;
                                 }
                              }

                              var1 = (1410585980 & -1883992384 | -98815044) & -96551940;
                           }
                        }
                     case 2112154059:
                     default:
                        var10000.field_2126 = 0<"JNT",1478195639,"㽵㽫㽬","ۨघ\u0890௴ࠠ௴ތ࢘௴ࢀ௬ތࢼ࠸࠰\u0894ࢀ௬ࣜޔघ௸\u0bfcࣜ","흿쒿",-620973170>(
                           var12,
                           0<"JNT",1478195639,"㾘㽵㽹㾘㽲㽫㽮㽭","ۨޔघ\u0890௴ࠠ௴ތ࢘௴ࢀ௬ތࢼ࠸࠰\u0894ࢀ௬ࣜ","훿옿짿옿쟿쥿옿\ud7ff햿쟿삿쭿죿\ud83f\ud7ff햿糿쬿\ud83f쥿흿휿죿",-620973171>(var10002)
                        );
                        this.field_2127 = 0;
                        this.field_2128 = -1;
                        this.qpjn = false;
                        Class_49 var6 = 1<"JNT",-1956985303,"\udf69齦\udf66","䮍䵍","㧛㯛臛뇛꿛忛",830967410>(this);
                        Class_105 var13 = 1<"JNT",-1956985303,"Ὤ\udf6b齦","䮍䵍","㧛㯛臛럛췛忛",830967407>(this);
                        0<"JNT",1488428968,"㽲㽧㽳㾗㽫㽲㽧뽍㽵㽮뽍㾗㽰㽰","ۨघ\u0890௴ࠠ௴ތ࢘௴ࢀ௬ތऌ௰\u0890\u0be4\u0bfc࠸ࣜޔघ\u0890௴ࠠ௴ތ࢘௴ࢀ௬ތऌ௰\u0890\u0be4\u0bfc࠸ࣜ","훿옿짿옿쟿쬿쭿\ud83f쥿쟿쾿쓿훿휿쒿쭿좿",-620973183>(
                           var13
                        );
                        0<"JNT",1478195639,"㽮㾚㾙","ۨघ\u0890௴ࠠ௴ތࠤ࠸\u0894࢘ތ\u0be0ࠤࢀ\u0bfc࠸\u0894ࢌࢀތࢼࠤ࢈࢈࢘\u0894\u0be4࠰ࣜޔघ࠴\u0be4\u0be4ࣜ","흿쒿",-620973182>(
                           var6, var13::ax
                        );
                        0<"JNT",1478195639,"㽳㾗","ۨ\u085cघ࠴\u0be4\u0be4ࣜޔࢠ","\ud83f쩿",-620973192>(
                           this,
                           new Class_271[]{
                              1<"JNT",-1956985303,"Ὢ彨彫","䮍䵍","㧛㯛臛뇛꿛忛",830967414>(this),
                              1<"JNT",-1956985303,"齦齩\udf68","䮍䵍","㧛㯛臛뇛꿛忛",830967411>(this),
                              1<"JNT",-1956985303,"ὩὫ","䮍䵍","㧛㯛臛럛췛忛",830967408>(this),
                              1<"JNT",-1956985303,"Ὤ\udf6b齦","䮍䵍","㧛㯛臛럛췛忛",830967405>(this),
                              1<"JNT",-1956985303,"\udf69齦\udf66","䮍䵍","㧛㯛臛뇛꿛忛",830967418>(this)
                           }
                        );
                        return;
                  }
               }

               var1 = (865398049 << 278255949 | -501774488) & -501223446;
            }

            var1 = -2163028 & -36845844;
         }
      }
   }

   // $VF: renamed from: mg () void
   @Override
   public void method_1407() {
      0<"JNT",1478195639,"㾖㾝","ۨޔࢠ","\ud83f쩿",-620973236>(this);
      0<"JNT",-1843844684,"㽯㽭","ۨޔࢠ","쬿좿헿",-620973235>(this);
   }

   // $VF: renamed from: q () void
   @Override
   public void method_1408() {
      0<"JNT",-1843844684,"㽳","ۨޔࢠ","쬿좿헿",-620973234>(this);
   }

   // $VF: renamed from: gd (Class_207) void
   @Class_21
   public void method_1827(Class_207 var1) {
      int var2 = -1722296809;
      if (1<"JNT",-1956985303,"\udf67齨齧彩彧ὦ齺ὼ齻齻","䳍䪍乍㳍䲍䮍䳍䪍䨍䷍䦍䫍乍㳍䨍䱍䦍不不䤍㸍㶍㵍","㧛㯛臛엛돛퇛䟛쏛믛엛돛꿛췛ꯛ뗛퇛䟛꿛쇛ꯛ쿛쿛\ua7db凛俛埛忛",830967510>(
            1<"JNT",-1956985303,"彩\udf6a","䮍䵍","㧛㯛臛엛돛퇛䟛쏛믛엛돛꿛췛ꯛ뗛퇛䟛꿛쇛ꯛ쿛쿛\ua7db俛䯛䧛忛",830967593>(this)
         )
         == null) {
         var2 = -327622377 >> 1829621537 ^ 1205792956;

         while (true) {
            switch (var2 - 147688037 + 1324693948 - 219672572 - 1864608927 ^ 1541342830 ^ 2125889072) {
               case -2109425060:
               default:
                  if (!1<"JNT",-1956985303,"齦彫","䮍䵍","㧛㯛鷛",830967503>(this)) {
                     if (!0<"JNT",1478195639,"㾚㽵㽦","ۨޔࡐ","\ud83f쩿",-620972191>(this)) {
                        return;
                     }

                     var2 = (123757920 & 123757920 >> 123757920 | 604899332) & 1686085254;
                  } else {
                     var2 = (-595986671 >> -15504146 | 1960431140) & -153493580;
                  }
                  break;
               case -1704832703:
                  0<"JNT",1478195639,"㾖㾝","ۨޔࢠ","\ud83f쩿",-620972236>(this);
                  return;
               case -885823842:
                  0<"JNT",1478195639,"㾖㾝","ۨޔࢠ","\ud83f쩿",-620972235>(this);
                  1<"JNT",-829255209,"齦彫","䮍䵍","㧛㯛鷛",830967133>(this, true);
                  1<"JNT",-829255209,"彨\udf66","䮍䵍","㧛㯛篛",830967588>(
                     this, 0<"JNT",1478195639,"㽦㾚㽭","ۨޔऔ","흿쒿",-620972184>(1<"JNT",-1956985303,"Ὢ彨彫","䮍䵍","㧛㯛臛뇛꿛忛",830967594>(this))
                  );
                  return;
               case -494251083:
                  if (!1<"JNT",-1956985303,"齨齪Ὢ","䮍䵍","㧛㯛鷛",830967090>(this)) {
                     0<"JNT",1478195639,"㽯㽧㾘㽬㽵㽨㾅뼲뼳뽜뽗뽘","ۨघࢀ\u0be4࠸ތࢄ\u0894ࢀ\u0be4\u0bfc࠰௴\u0be0࠸ތ\u0bfc࢘௴࠼࠼ࡌܰܤࣔܠࣜޔࢠ","\ud7ff휿쭿쟿줿\ud83f\ud7ff휿쒿죿옿헿쭿쟿쒿쥿옿좿좿쎿磿笿碿笿",-620972233>(
                        0<"JNT",1478195639,"㽯㽧㾘㽬㽵㽨㾅뽗뽛뼱뽚뽕","ۨޔघࢀ\u0be4࠸ތࢄ\u0894ࢀ\u0be4\u0bfc࠰௴\u0be0࠸ތ\u0bfc࢘௴࠼࠼ࡌܰܤܼܤࣜ","\ud7ff휿쭿쟿줿\ud83f\ud7ff휿쒿죿옿헿쭿쟿쒿쥿옿좿좿쎿秿碿筿",-620972222>(
                           0<"JNT",1478195639,"㽯㽧㾘㽬㽵㽨㾅뼲뽖뽕뼱","ۨޔघࢀ\u0be4࠸ތࢄ\u0894ࢀ\u0be4\u0bfc࠰௴\u0be0࠸ތ\u0bfc࢘௴࠼࠼ࡌܠܼܸࣜ","\ud7ff휿쭿쟿줿\ud83f\ud7ff휿쒿죿옿헿쭿쟿쒿쥿옿좿좿쎿碿稿穿",-620972223>(
                              1<"JNT",-1956985303,"彩\udf6a","䮍䵍","㧛㯛臛엛돛퇛䟛쏛믛엛돛꿛췛ꯛ뗛퇛䟛꿛쇛ꯛ쿛쿛\ua7db俛䯛䧛忛",830967087>(this)
                           )
                        ),
                        (class_2846)0<"JNT",-877218642,"뽟㽫㽮㽫㾘뽝","ۨघࢀ\u0be4࠸ތࢄ\u0894ࢀ\u0be4\u0bfc࠰௴\u0be0࠸ތ\u0bfc࢘௴࠼࠼ࡌܰܨܸܠ۸\u0bfc࢘௴࠼࠼ࡌܰܨܸܬࣜघࢀ\u0be4࠸ތࢄ\u0894ࢀ\u0be4\u0bfc࠰௴\u0be0࠸ތ\u0bfc࢘௴࠼࠼ࡌܼܼܰܨࣜघࢀ\u0be4࠸ތࢄ\u0894ࢀ\u0be4\u0bfc࠰௴\u0be0࠸ތ\u0bfc࢘௴࠼࠼ࡌܼܰܤވࣜޔࢠ","\ud7ff휿쭿쟿줿\ud83f\ud7ff휿쒿죿옿헿쭿쟿쒿쥿옿좿좿쎿磿籿筿秿",-620972218>(
                           1<"JNT",1810280517,"\udf67齨齧彩彧ὦ齺\udf7a齼\udf7b齼","䳍䪍乍㳍䲍䮍䳍䪍䨍䷍䦍䫍乍㳍䨍䱍䦍不不䤍㷍㽍㹍㻍㩍䨍䱍䦍不不䤍㷍㽍㹍㼍","㧛㯛臛엛돛퇛䟛쏛믛엛돛꿛췛ꯛ뗛퇛䟛꿛쇛ꯛ쿛쿛\ua7db䷛姛凛嗛㇛꿛쇛ꯛ쿛쿛\ua7db䷛姛凛埛忛",830967094>(),
                           1<"JNT",1810280517,"\udf67齨齧彩彧ὦ齺彺齼彼彺","䳍䪍乍㳍䲍䮍䳍䪍䨍䷍䦍䫍乍㳍䨍䱍䦍不不䤍㷍㸍㸍㽍","㧛㯛臛엛돛퇛䟛쏛믛엛돛꿛췛ꯛ뗛퇛䟛꿛쇛ꯛ쿛쿛\ua7db䷛俛俛姛忛",830967091>(),
                           1<"JNT",1810280517,"\udf67齨齧彩彧ὦ齺齺彺ύύ","䳍䪍乍㳍䲍䮍䳍䪍䨍䷍䦍䫍乍㳍䨍䱍䦍不不䤍㷍㸍㺍㵍","㧛㯛臛엛돛퇛䟛쏛믛엛돛꿛췛ꯛ뗛퇛䟛꿛쇛ꯛ쿛쿛\ua7db䷛俛叛䧛忛",830967088>()
                        )
                     );
                     1<"JNT",-829255209,"齨齪Ὢ","䮍䵍","㧛㯛鷛",830967095>(this, true);
                     if (0<"JNT",1478195639,"㾃㾜","ۨޔࡐ","햿죿",-620972230>(1<"JNT",-1956985303,"ὩὫ","䮍䵍","㧛㯛臛럛췛忛",830967092>(this))) {
                        1<"JNT",-829255209,"彨\udf66","䮍䵍","㧛㯛篛",830967096>(
                           this, 0<"JNT",1478195639,"㽦㾚㽭","ۨޔऔ","흿쒿",-620972228>(1<"JNT",-1956985303,"Ὢ彨彫","䮍䵍","㧛㯛臛뇛꿛忛",830967134>(this))
                        );
                        return;
                     }

                     var2 = 619256520 - -1076518575 ^ -1878233324;
                  } else {
                     var2 = 1968345816;
                  }
                  break;
               case -441677250:
                  if (1<"JNT",-1956985303,"\udf67彧","䮍䵍","㧛㯛篛",830967514>(this) == -1) {
                     1<"JNT",-829255209,"\udf67彧","䮍䵍","㧛㯛篛",830967515>(
                        this,
                        0<"JNT",1478195639,"㽯㽧㾘㽬㽵㽨㾅뽕뽜뽖뽘뼱","ۨޔऔ","\ud7ff휿쭿쟿줿\ud83f\ud7ff휿쒿죿옿헿쭿쟿쒿쥿옿좿좿쎿稿秿秿稿",-620972197>(
                           0<"JNT",1478195639,"㽯㽧㾘㽬㽵㽨㾅뽘뼲뽖뽗뽛","ۨޔघࢀ\u0be4࠸ތࢄ\u0894ࢀ\u0be4\u0bfc࠰௴\u0be0࠸ތ\u0bfc࢘௴࠼࠼ࡌܴܠܠܴࣜ","\ud7ff휿쭿쟿줿\ud83f\ud7ff휿쒿죿옿헿쭿쟿쒿쥿옿좿좿쎿禿筿秿",-620972198>(
                              1<"JNT",-1956985303,"\udf67齨齧彩彧ὦ齺ὼ\udf7a彻","䳍䪍乍㳍䲍䮍䳍䪍䨍䷍䦍䫍乍㳍䨍䱍䦍不不䤍㸍㶍㵍","㧛㯛臛엛돛퇛䟛쏛믛엛돛꿛췛ꯛ뗛퇛䟛꿛쇛ꯛ쿛쿛\ua7db埛凛嗛忛",830967508>(
                                 1<"JNT",-1956985303,"彩\udf6a","䮍䵍","㧛㯛臛엛돛퇛䟛쏛믛엛돛꿛췛ꯛ뗛퇛䟛꿛쇛ꯛ쿛쿛\ua7db俛䯛䧛忛",830967511>(this)
                              )
                           )
                        )
                     );
                  }

                  var2 = 1002993945 - (-655481434 | 1829078779) ^ 1627518632;
                  break;
               case 61620784:
                  if (!0<"JNT",1488428968,"㾖㾚㾂","ۨघࢀ\u0be4࠸ތࢄ\u0894ࢀ\u0be4\u0bfc࠰௴\u0be0࠸ތ\u0bfc࢘௴࠼࠼ࡌܴܬࣔܰࣜޔࡐ","\ud87f",-620972181>(
                     1<"JNT",1810280517,"\udf67齨齧彩彧ὦ彼\udf7a彼彼","䳍䪍乍㳍䲍䮍䳍䪍䨍䷍䦍䫍乍㳍䨍䱍䦍不不䤍㶍㽍㵍㷍","㧛㯛臛엛돛퇛䟛쏛믛엛돛꿛췛ꯛ뗛퇛䟛꿛쇛ꯛ쿛쿛\ua7db䯛埛寛䷛忛",830967585>()
                  )) {
                     0<"JNT",1478195639,"㾖㾝","ۨޔࢠ","\ud83f쩿",-620972180>(this);
                     return;
                  }

                  var2 = (1656402242 << (1656402242 >> -2126317913) | 536889874) & -249533766;
                  break;
               case 441966026:
                  if (1<"JNT",-1956985303,"\udf67彧","䮍䵍","㧛㯛篛",830967507>(this) != -1) {
                     0<"JNT",1488428968,"㾖㾘㽪","ۨऔޔࢠ","\ud87f",-620972186>(1<"JNT",-1956985303,"\udf67彧","䮍䵍","㧛㯛篛",830967504>(this));
                  }

                  var2 = 1763727619 >>> 1763727619 ^ 1197017769;
                  break;
               case 822111259:
                  0<"JNT",1478195639,"㾖㾝","ۨޔࢠ","\ud83f쩿",-620972226>(this);
                  return;
               case 1332028552:
                  if (!1<"JNT",-1956985303,"齪彪\udf68\udf69","䮍䵍","㧛㯛鷛",830967138>(this)) {
                     1<"JNT",-829255209,"彨\udf66","䮍䵍","㧛㯛篛",830967097>(
                        this, 0<"JNT",1478195639,"㽦㾚㽭","ۨޔऔ","흿쒿",-620972239>(1<"JNT",-1956985303,"齦齩\udf68","䮍䵍","㧛㯛臛뇛꿛忛",830967135>(this))
                     );
                     1<"JNT",-829255209,"齪彪\udf68\udf69","䮍䵍","㧛㯛鷛",830967142>(this, true);
                     return;
                  }

                  var2 = -1932160189 ^ 1898089068;
                  break;
               case 1588062893:
                  if (1<"JNT",-1956985303,"彨\udf66","䮍䵍","㧛㯛篛",830967592>(this) > 0) {
                     1<"JNT",-829255209,"彨\udf66","䮍䵍","㧛㯛篛",830967506>(this, 1<"JNT",-1956985303,"彨\udf66","䮍䵍","㧛㯛篛",830967589>(this) - 1);
                     return;
                  }

                  var2 = 1728244855 + 727626831 ^ 1327501184;
            }
         }
      }
   }

   // $VF: renamed from: zof () boolean
   public boolean method_1828() {
      int var3 = 980977914;
      boolean var1 = 0<"JNT",1478195639,"㽯㽧㾘㽬㽵㽨㾅뽜뽚뼳뽚","ۨޔघࢀ\u0be4࠸ތࢄ\u0894ࢀ\u0be4\u0bfc࠰௴\u0be0࠸ތ\u0bfc࢘௴࠼࠼ࡌܴܬࣔܰࣜ","\ud7ff휿쭿쟿줿\ud83f\ud7ff휿쒿죿옿헿쭿쟿쒿쥿옿좿좿쎿稿禿簿簿",-620972208>(
            0<"JNT",1478195639,"㽯㽧㾘㽬㽵㽨㾅뽕뼳뽜뽚","ۨޔघࢀ\u0be4࠸ތࢄ\u0894ࢀ\u0be4\u0bfc࠰௴\u0be0࠸ތ\u0bfc࢘௴࠼࠼ࡌܴܬࣔࣔࣜ","\ud7ff휿쭿쟿줿\ud83f\ud7ff휿쒿죿옿헿쭿쟿쒿쥿옿좿좿쎿禿筿秿",-620972209>(
               1<"JNT",-1956985303,"\udf67齨齧彩彧ὦ齺ὼ\udf7a彻","䳍䪍乍㳍䲍䮍䳍䪍䨍䷍䦍䫍乍㳍䨍䱍䦍不不䤍㸍㶍㵍","㧛㯛臛엛돛퇛䟛쏛믛엛돛꿛췛ꯛ뗛퇛䟛꿛쇛ꯛ쿛쿛\ua7db埛凛嗛忛",830967509>(
                  1<"JNT",-1956985303,"彩\udf6a","䮍䵍","㧛㯛臛엛돛퇛䟛쏛믛엛돛꿛췛ꯛ뗛퇛䟛꿛쇛ꯛ쿛쿛\ua7db俛䯛䧛忛",830967512>(this)
               )
            )
         )
         != 1<"JNT",1810280517,"\udf67齨齧彩彧ὦ彼\udf7a彼彼","䳍䪍乍㳍䲍䮍䳍䪍䨍䷍䦍䫍乍㳍䨍䱍䦍不不䤍㶍㽍㵍㷍","㧛㯛臛엛돛퇛䟛쏛믛엛돛꿛췛ꯛ뗛퇛䟛꿛쇛ꯛ쿛쿛\ua7db䯛埛寛䷛忛",830967516>();
      boolean var2 = var1
         && 0<"JNT",1478195639,"㾃㾜","ۨޔࡐ","햿죿",-620972203>(1<"JNT",-1956985303,"Ὤ\udf6b齦","䮍䵍","㧛㯛臛럛췛忛",830967555>(this))
         && (double)0<"JNT",1478195639,"㽯㽧㾘㽬㽵㽨㾅뽕뼳뽘뼱","ۨޔࡠ","\ud7ff휿쭿쟿줿\ud83f\ud7ff휿쒿죿옿헿쭿쟿쒿쥿옿좿좿쎿禿筿秿",-620972536>(
               1<"JNT",-1956985303,"\udf67齨齧彩彧ὦ齺ὼ\udf7a彻","䳍䪍乍㳍䲍䮍䳍䪍䨍䷍䦍䫍乍㳍䨍䱍䦍不不䤍㸍㶍㵍","㧛㯛臛엛돛퇛䟛쏛믛엛돛꿛췛ꯛ뗛퇛䟛꿛쇛ꯛ쿛쿛\ua7db埛凛嗛忛",830967498>(
                  1<"JNT",-1956985303,"彩\udf6a","䮍䵍","㧛㯛臛엛돛퇛䟛쏛믛엛돛꿛췛ꯛ뗛퇛䟛꿛쇛ꯛ쿛쿛\ua7db俛䯛䧛忛",830967549>(this)
               )
            )
            <= 0<"JNT",1478195639,"㾃㽴㽮","ۨޔࡸ","흿쒿",-620972534>(1<"JNT",-1956985303,"\udf69齦\udf66","䮍䵍","㧛㯛臛뇛꿛忛",830967492>(this));
      if (var2 || var1 && !0<"JNT",1478195639,"㾃㾜","ۨޔࡐ","햿죿",-620972205>(1<"JNT",-1956985303,"Ὤ\udf6b齦","䮍䵍","㧛㯛臛럛췛忛",830967513>(this))) {
         var3 = 1627688394;
      } else {
         var3 = 1192664510;
      }
      return switch ((var3 - 24441315 - 1000005304 ^ 167233091) - 1303919337 - 75751840 - 1314500378) {
         case -1989300279 -> true;
         default -> false;
      };
   }

   // $VF: renamed from: vw () void
   public void method_1829() {
      1<"JNT",-829255209,"彨\udf66","䮍䵍","㧛㯛篛",830967470>(this, 0);
      1<"JNT",-829255209,"\udf67彧","䮍䵍","㧛㯛篛",830967499>(this, -1);
      1<"JNT",-829255209,"齨齪Ὢ","䮍䵍","㧛㯛鷛",830967496>(this, false);
      1<"JNT",-829255209,"齦彫","䮍䵍","㧛㯛鷛",830967493>(this, false);
      1<"JNT",-829255209,"齪彪\udf68\udf69","䮍䵍","㧛㯛鷛",830967282>(this, false);
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1413(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 + 1243438084 + 632286600 - 1028050598 - 1268494997 ^ 431607857 ^ 325626007) + 852098250 ^ 1819470334) - 1083942454;
      MethodHandle var10000 = field_2131[((var10 + 1243438084 + 632286600 - 1028050598 - 1268494997 ^ 431607857 ^ 325626007) + 852098250 ^ 1819470334)
         - 1083942454
         - 1373062016];
      if (field_2131[var10001 - 1373062016] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = (832933725 >> 1457434986 | 0) & 1608516240; var23 < var13.length(); var23 += 172174153 >> -56674816 ^ 172174152) {
            int var42 = var13.charAt(var23) + 155;
            int var10004 = (var42 & 0) >> 16;
            int var43 = (var42 & 0) >> 16 | var42 << 0;
            int var79 = (((var42 & 0) >> 16 | var42 << 0) & 57344) >> 13;
            var42 = (((var10004 | var42 << 0) & 57344) >> 13 | ((var42 & 0) >> 16 | var42 << 0) << 3) - 179 + 175 ^ 158;
            var10004 = (((var79 | var43 << 3) - 179 + 175 ^ 158) & 49152) >> 14;
            int var45 = (((var79 | var43 << 3) - 179 + 175 ^ 158) & 49152) >> 14 | var42 << 2;
            int var81 = (((((var79 | var43 << 3) - 179 + 175 ^ 158) & 49152) >> 14 | var42 << 2) & 65504) >> 5;
            char var46 = (char)(
               (((var10004 | var42 << 2) & 65504) >> 5 | ((((var79 | var43 << 3) - 179 + 175 ^ 158) & 49152) >> 14 | var42 << 2) << 11) - 51 + 134
            );
            var13.setCharAt(var23, (char)((var81 | var45 << 11) - 51 + 134));
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = (552965225 >> 552965225 * 552965225 | 0) & 458212353;
            var29 < var16.length();
            var29 += 1626579103 << -1266140452 - -730561101 ^ -415154687
         ) {
            int var51 = var16.charAt(var29);
            int var82 = (var51 & 65532) >> 2;
            int var52 = ((var51 & 65532) >> 2 | var51 << 14) ^ 126;
            int var83 = ((((var51 & 65532) >> 2 | var51 << 14) ^ 126) & 65472) >> 6;
            var51 = (((var82 | var51 << 14) ^ 126) & 65472) >> 6 | (((var51 & 65532) >> 2 | var51 << 14) ^ 126) << 10;
            var82 = ((var83 | var52 << 10) & 65024) >> 9;
            int var54 = ((var83 | var52 << 10) & 65024) >> 9 | var51 << 7;
            int var85 = ((((var83 | var52 << 10) & 65024) >> 9 | var51 << 7) & 65534) >> 1;
            char var55 = (char)(
               (((((var82 | var51 << 7) & 65534) >> 1 | (((var83 | var52 << 10) & 65024) >> 9 | var51 << 7) << 15) - 216 ^ 246) + 40 ^ 173) - 199
            );
            var16.setCharAt(var29, (char)((((var85 | var54 << 15) - 216 ^ 246) + 40 ^ 173) - 199));
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_128.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = (2122407132 - 1121716474 | 0) & 72885249; var35 < var19.length(); var35 += -637297089 * -1469221629 ^ -298801732) {
            char var60 = var19.charAt(var35);
            char var61 = (char)(((((var60 & '\uffc0') >> 6 | var60 << '\n') + 226 + 156 ^ 157) - 228 + 172 + 206 ^ 250 ^ 102) + 36);
            var19.setCharAt(var35, (char)(((((var60 & '\uffc0') >> 6 | var60 << '\n') + 226 + 156 ^ 157) - 228 + 172 + 206 ^ 250 ^ 102) + 36));
         }

         Class var7 = Class.forName(var19.toString(), false, Class_128.class.getClassLoader());
         switch (((var4 - 1509466145 ^ 15515434) - 332478188 - 1459680958 + 1337583700 + 483715476 ^ 569239002) - 1739392749 + 597167798 + 724229792) {
            case 41624982:
               var10000 = var0.findSpecial(var7, var5, var6, Class_128.class);
               break;
            case 142398857:
            case 1068413029:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 150529946:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            case 972591272:
               var10000 = var0.findConstructor(var7, var6);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_2131[((var10 + 1243438084 + 632286600 - 1028050598 - 1268494997 ^ 431607857 ^ 325626007) + 852098250 ^ 1819470334) - 1083942454 - 1373062016] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1414(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 - 1532455469 ^ 1964394257) + 307398570 + 1852968741 ^ 1907659613) - 881134572 - 801028374 - 2089405416 ^ 1804400033;
      MethodHandle var10000 = field_2131[((var10 - 1532455469 ^ 1964394257) + 307398570 + 1852968741 ^ 1907659613) - 881134572 - 801028374 - 2089405416
         ^ 1804400033
         ^ 438054205];
      if (field_2131[var10001 ^ 438054205] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = (-1365883333 | -1365883333) ^ -1365883333; var24 < var14.length(); var24 += -1642981194 + -1642981194 ^ 1009004909) {
            char var43 = var14.charAt(var24);
            char var48 = (char)(
               (
                        (
                                 (
                                       (
                                                (
                                                      (
                                                               (
                                                                        (
                                                                              (((var43 & '\uf000') >> 12 | var43 << 4) - 85 & 64512) >> 10
                                                                                 | ((var43 & '\uf000') >> 12 | var43 << 4) - 85 << 6
                                                                           )
                                                                           ^ 23
                                                                     )
                                                                     + 214
                                                                  & 61440
                                                            )
                                                            >> 12
                                                         | (
                                                                  (
                                                                        (((var43 & '\uf000') >> 12 | var43 << 4) - 85 & 64512) >> 10
                                                                           | ((var43 & '\uf000') >> 12 | var43 << 4) - 85 << 6
                                                                     )
                                                                     ^ 23
                                                               )
                                                               + 214
                                                            << 4
                                                   )
                                                   & 61440
                                             )
                                             >> 12
                                          | (
                                                (
                                                         (
                                                                  (
                                                                        (((var43 & '\uf000') >> 12 | var43 << 4) - 85 & 64512) >> 10
                                                                           | ((var43 & '\uf000') >> 12 | var43 << 4) - 85 << 6
                                                                     )
                                                                     ^ 23
                                                               )
                                                               + 214
                                                            & 61440
                                                      )
                                                      >> 12
                                                   | (
                                                            (
                                                                  (((var43 & '\uf000') >> 12 | var43 << 4) - 85 & 64512) >> 10
                                                                     | ((var43 & '\uf000') >> 12 | var43 << 4) - 85 << 6
                                                               )
                                                               ^ 23
                                                         )
                                                         + 214
                                                      << 4
                                             )
                                             << 4
                                    )
                                    ^ 64
                              )
                              - 101
                           & 65535
                     )
                     >> 0
                  | (
                           (
                                 (
                                          (
                                                (
                                                         (
                                                                  (
                                                                        (((var43 & '\uf000') >> 12 | var43 << 4) - 85 & 64512) >> 10
                                                                           | ((var43 & '\uf000') >> 12 | var43 << 4) - 85 << 6
                                                                     )
                                                                     ^ 23
                                                               )
                                                               + 214
                                                            & 61440
                                                      )
                                                      >> 12
                                                   | (
                                                            (
                                                                  (((var43 & '\uf000') >> 12 | var43 << 4) - 85 & 64512) >> 10
                                                                     | ((var43 & '\uf000') >> 12 | var43 << 4) - 85 << 6
                                                               )
                                                               ^ 23
                                                         )
                                                         + 214
                                                      << 4
                                             )
                                             & 61440
                                       )
                                       >> 12
                                    | (
                                          (
                                                   (
                                                            (
                                                                  (((var43 & '\uf000') >> 12 | var43 << 4) - 85 & 64512) >> 10
                                                                     | ((var43 & '\uf000') >> 12 | var43 << 4) - 85 << 6
                                                               )
                                                               ^ 23
                                                         )
                                                         + 214
                                                      & 61440
                                                )
                                                >> 12
                                             | (
                                                      (
                                                            (((var43 & '\uf000') >> 12 | var43 << 4) - 85 & 64512) >> 10
                                                               | ((var43 & '\uf000') >> 12 | var43 << 4) - 85 << 6
                                                         )
                                                         ^ 23
                                                   )
                                                   + 214
                                                << 4
                                       )
                                       << 4
                              )
                              ^ 64
                        )
                        - 101
                     << 16
            );
            var14.setCharAt(
               var24,
               (char)(
                  (
                           (
                                    (
                                          (
                                                   (
                                                         (
                                                                  (
                                                                           (
                                                                                 (((var43 & '\uf000') >> 12 | var43 << 4) - 85 & 64512) >> 10
                                                                                    | ((var43 & '\uf000') >> 12 | var43 << 4) - 85 << 6
                                                                              )
                                                                              ^ 23
                                                                        )
                                                                        + 214
                                                                     & 61440
                                                               )
                                                               >> 12
                                                            | (
                                                                     (
                                                                           (((var43 & '\uf000') >> 12 | var43 << 4) - 85 & 64512) >> 10
                                                                              | ((var43 & '\uf000') >> 12 | var43 << 4) - 85 << 6
                                                                        )
                                                                        ^ 23
                                                                  )
                                                                  + 214
                                                               << 4
                                                      )
                                                      & 61440
                                                )
                                                >> 12
                                             | (
                                                   (
                                                            (
                                                                     (
                                                                           (((var43 & '\uf000') >> 12 | var43 << 4) - 85 & 64512) >> 10
                                                                              | ((var43 & '\uf000') >> 12 | var43 << 4) - 85 << 6
                                                                        )
                                                                        ^ 23
                                                                  )
                                                                  + 214
                                                               & 61440
                                                         )
                                                         >> 12
                                                      | (
                                                               (
                                                                     (((var43 & '\uf000') >> 12 | var43 << 4) - 85 & 64512) >> 10
                                                                        | ((var43 & '\uf000') >> 12 | var43 << 4) - 85 << 6
                                                                  )
                                                                  ^ 23
                                                            )
                                                            + 214
                                                         << 4
                                                )
                                                << 4
                                       )
                                       ^ 64
                                 )
                                 - 101
                              & 65535
                        )
                        >> 0
                     | (
                              (
                                    (
                                             (
                                                   (
                                                            (
                                                                     (
                                                                           (((var43 & '\uf000') >> 12 | var43 << 4) - 85 & 64512) >> 10
                                                                              | ((var43 & '\uf000') >> 12 | var43 << 4) - 85 << 6
                                                                        )
                                                                        ^ 23
                                                                  )
                                                                  + 214
                                                               & 61440
                                                         )
                                                         >> 12
                                                      | (
                                                               (
                                                                     (((var43 & '\uf000') >> 12 | var43 << 4) - 85 & 64512) >> 10
                                                                        | ((var43 & '\uf000') >> 12 | var43 << 4) - 85 << 6
                                                                  )
                                                                  ^ 23
                                                            )
                                                            + 214
                                                         << 4
                                                )
                                                & 61440
                                          )
                                          >> 12
                                       | (
                                             (
                                                      (
                                                               (
                                                                     (((var43 & '\uf000') >> 12 | var43 << 4) - 85 & 64512) >> 10
                                                                        | ((var43 & '\uf000') >> 12 | var43 << 4) - 85 << 6
                                                                  )
                                                                  ^ 23
                                                            )
                                                            + 214
                                                         & 61440
                                                   )
                                                   >> 12
                                                | (
                                                         (
                                                               (((var43 & '\uf000') >> 12 | var43 << 4) - 85 & 64512) >> 10
                                                                  | ((var43 & '\uf000') >> 12 | var43 << 4) - 85 << 6
                                                            )
                                                            ^ 23
                                                      )
                                                      + 214
                                                   << 4
                                          )
                                          << 4
                                 )
                                 ^ 64
                           )
                           - 101
                        << 16
               )
            );
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = (-1154295163 | -693639853) ^ -4718633; var30 < var17.length(); var30 += (-857888854 >> 1197176112 | 1) & 8995) {
            int var53 = var17.charAt(var30) - 'M';
            int var100 = (var53 & 32768) >> 15;
            int var54 = (var53 & 32768) >> 15 | var53 << 1;
            int var101 = (((var53 & 32768) >> 15 | var53 << 1) & 32768) >> 15;
            var53 = ((var100 | var53 << 1) & 32768) >> 15 | ((var53 & 32768) >> 15 | var53 << 1) << 1;
            var100 = ((var101 | var54 << 1) & 0) >> 16;
            int var56 = ((var101 | var54 << 1) & 0) >> 16 | var53 << 0;
            int var103 = ((((var101 | var54 << 1) & 0) >> 16 | var53 << 0) & 65472) >> 6;
            var53 = ((var100 | var53 << 0) & 65472) >> 6 | (((var101 | var54 << 1) & 0) >> 16 | var53 << 0) << 10;
            var100 = ((var103 | var56 << 10) & 65528) >> 3;
            int var58 = (((var103 | var56 << 10) & 65528) >> 3 | var53 << 13) + 158 - 105 - 151;
            int var105 = ((((var103 | var56 << 10) & 65528) >> 3 | var53 << 13) + 158 - 105 - 151 & 32768) >> 15;
            char var59 = (char)(
               ((var100 | var53 << 13) + 158 - 105 - 151 & 32768) >> 15 | (((var103 | var56 << 10) & 65528) >> 3 | var53 << 13) + 158 - 105 - 151 << 1
            );
            var17.setCharAt(var30, (char)(var105 | var58 << 1));
         }

         Class var6 = Class.forName(var17.toString(), false, Class_128.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = (-1796993435 >>> 758996255 | 0) & 559943262; var36 < var20.length(); var36 += -474066519 << (-1259669757 | -1842201953) ^ -2147483647) {
            int var64 = var20.charAt(var36);
            int var106 = (var64 & 65472) >> 6;
            int var65 = ((var64 & 65472) >> 6 | var64 << 10) - 39;
            int var107 = (((var64 & 65472) >> 6 | var64 << 10) - 39 & 65504) >> 5;
            var64 = (((var106 | var64 << 10) - 39 & 65504) >> 5 | ((var64 & 65472) >> 6 | var64 << 10) - 39 << 11) + 13 - 73;
            var106 = ((var107 | var65 << 11) + 13 - 73 & 65520) >> 4;
            int var67 = (((var107 | var65 << 11) + 13 - 73 & 65520) >> 4 | var64 << 12) ^ 50;
            int var109 = (((((var107 | var65 << 11) + 13 - 73 & 65520) >> 4 | var64 << 12) ^ 50) & 65504) >> 5;
            var64 = (((var106 | var64 << 12) ^ 50) & 65504) >> 5 | ((((var107 | var65 << 11) + 13 - 73 & 65520) >> 4 | var64 << 12) ^ 50) << 11;
            var106 = ((var109 | var67 << 11) & 61440) >> 12;
            int var69 = ((var109 | var67 << 11) & 61440) >> 12 | var64 << 4;
            int var111 = ((((var109 | var67 << 11) & 61440) >> 12 | var64 << 4) & 65024) >> 9;
            char var70 = (char)(((var106 | var64 << 4) & 65024) >> 9 | (((var109 | var67 << 11) & 61440) >> 12 | var64 << 4) << 7);
            var20.setCharAt(var36, (char)(var111 | var69 << 7));
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_128.class.getClassLoader()).returnType();
         switch ((var4 ^ 529666423) + 1580338143 + 1072943233 - 1002982659 + 439454206 + 1357914652 - 367062583 - 720168738 ^ 31006429 ^ 1984075466) {
            case 585639904:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            case 707423913:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            case 1457632619:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            case 1992134471:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_2131[((var10 - 1532455469 ^ 1964394257) + 307398570 + 1852968741 ^ 1907659613) - 881134572 - 801028374 - 2089405416 ^ 1804400033 ^ 438054205] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
