import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;

public enum Class_101 {
   // $VF: renamed from: hja Class_101
   field_1163,
   // $VF: renamed from: yck Class_101
   field_1164;

   // $VF: renamed from: wfl java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_1166 = new MethodHandle[15];

   // $VF: Failed to inline enum fields
   // Please report this to the Vineflower issue tracker, at https://github.com/Vineflower/vineflower/issues with a copy of the class file (if you have the rights to distribute it!)
   static {
      int var10000 = 284434737 + 894753465 ^ 1179188202;

      StringBuilder var10001;
      for (var10001 = (StringBuilder)0<"JNT",1876843143,"뛮쨮쭮쨮쓮띮","种㇌\uf5cdௌ᷌ௌ濍\uf1cdௌ\uedcdￍ濍柌⇌◌\ufbcd\uedcdￍ韍篍巌","ꚼ誼횼誼뚽뺼誼뚼銼뚽䊼\udebc욼ꪼ뚼銼ڼ\udabcꪼ뺼麼骼욼",-1681028727>(
            "舻頻긻舻눻\ua63b"
         );
         var10000 < ((-1333335876 >>> -1048375801 | 6) & 840704038);
         var10000 += (-518952900 + -518952900 | 1) & 366019329
      ) {
         int var6 = 0<"JNT",-560337091,"좮짮젮쑮퀮쓮","种㯌篍䟌","ꚼ誼횼誼뚽뺼誼뚼銼뚽䊼\udebc욼ꪼ뚼銼ڼ\udabcꪼ뺼麼骼욼",-1681028772>(var10001, var10000) ^ 'H' ^ 115;
         char var9 = (char)(
            (((((var6 & 65504) >> 5 | var6 << 11) & 65535) >> 0 | ((var6 & 65504) >> 5 | var6 << 11) << 16) & 65520) >> 4
               | ((((var6 & 65504) >> 5 | var6 << 11) & 65535) >> 0 | ((var6 & 65504) >> 5 | var6 << 11) << 16) << 12
         );
         0<"JNT",-560337091,"쒮줮쓮킮짮젮쑮퀮쓮","种㯌䟌篍巌","ꚼ誼횼誼뚽뺼誼뚼銼뚽䊼\udebc욼ꪼ뚼銼ڼ\udabcꪼ뺼麼骼욼",-1681028773>(
            var10001,
            var10000,
            (char)(
               (((((var6 & 65504) >> 5 | var6 << 11) & 65535) >> 0 | ((var6 & 65504) >> 5 | var6 << 11) << 16) & 65520) >> 4
                  | ((((var6 & 65504) >> 5 | var6 << 11) & 65535) >> 0 | ((var6 & 65504) >> 5 | var6 << 11) << 16) << 12
            )
         );
      }

      field_1163 = (Class_101)0<"JNT",1876843143,"뛮쨮쭮쨮쓮띮","种㇌\uf5cdௌ᷌ௌ濍\uf1cdௌ\uedcdￍ濍柌⇌◌\ufbcd\uedcdￍ韍㯌篍巌","銼ꊼ",-1681028732>(
         0<"JNT",-560337091,"쓮쮮첮쓮쑮쨮쭮즮","种篍㇌\uf5cdௌ᷌ௌ濍\uf1cdௌ\uedcdￍ濍柌⇌◌\ufbcd\uedcdￍ韍","ꚼ誼횼誼뚽뺼誼뚼銼뚽䊼\udebc욼ꪼ뚼銼ڼ\udabcꪼ뺼麼骼욼",-1681028719>(var10001), 0
      );
      var10000 = (-536305404 * (-203572920 - (-536305404 & -203572920)) | 0) & 35934411;

      for (var10001 = (StringBuilder)0<"JNT",1876843143,"뛮쨮쭮쨮쓮띮","种㇌\uf5cdௌ᷌ௌ濍\uf1cdௌ\uedcdￍ濍柌⇌◌\ufbcd\uedcdￍ韍篍巌","ꚼ誼횼誼뚽뺼誼뚼銼뚽䊼\udebc욼ꪼ뚼銼ڼ\udabcꪼ뺼麼骼욼",-1681028733>(
            "ꡳ桳꡷\ue873ꡳ\ue873"
         );
         var10000 < (-379681402 >> -379681402 ^ -5932528);
         var10000 += 1
      ) {
         int var12 = 0<"JNT",-560337091,"좮짮젮쑮퀮쓮","种㯌篍䟌","ꚼ誼횼誼뚽뺼誼뚼銼뚽䊼\udebc욼ꪼ뚼銼ڼ\udabcꪼ뺼麼骼욼",-1681028730>(var10001, var10000);
         int var26 = (var12 & 65024) >> 9;
         int var13 = (var12 & 65024) >> 9 | var12 << 7;
         int var27 = (((var12 & 65024) >> 9 | var12 << 7) & 61440) >> 12;
         var12 = (((var26 | var12 << 7) & 61440) >> 12 | ((var12 & 65024) >> 9 | var12 << 7) << 4) + 189;
         var26 = ((var27 | var13 << 4) + 189 & 0) >> 16;
         int var15 = ((var27 | var13 << 4) + 189 & 0) >> 16 | var12 << 0;
         int var29 = ((((var27 | var13 << 4) + 189 & 0) >> 16 | var12 << 0) & 65024) >> 9;
         char var16 = (char)(((var26 | var12 << 0) & 65024) >> 9 | (((var27 | var13 << 4) + 189 & 0) >> 16 | var12 << 0) << 7);
         0<"JNT",-560337091,"쒮줮쓮킮짮젮쑮퀮쓮","种㯌䟌篍巌","ꚼ誼횼誼뚽뺼誼뚼銼뚽䊼\udebc욼ꪼ뚼銼ڼ\udabcꪼ뺼麼骼욼",-1681028731>(var10001, var10000, (char)(var29 | var15 << 7));
      }

      field_1164 = (Class_101)0<"JNT",1876843143,"뛮쨮쭮쨮쓮띮","种㇌\uf5cdௌ᷌ௌ濍\uf1cdௌ\uedcdￍ濍柌⇌◌\ufbcd\uedcdￍ韍㯌篍巌","銼ꊼ",-1681028729>(
         0<"JNT",-560337091,"쓮쮮첮쓮쑮쨮쭮즮","种篍㇌\uf5cdௌ᷌ௌ濍\uf1cdௌ\uedcdￍ濍柌⇌◌\ufbcd\uedcdￍ韍","ꚼ誼횼誼뚽뺼誼뚼銼뚽䊼\udebc욼ꪼ뚼銼ڼ\udabcꪼ뺼麼骼욼",-1681028728>(var10001), 1
      );
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1227(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = (var10 - 1021405277 + 491699068 + 1464828587 + 2143753699 ^ 1152075732) - 120688076 + 877926552 ^ 514923173 ^ 436874744;
      MethodHandle var10000 = field_1166[(
            (var10 - 1021405277 + 491699068 + 1464828587 + 2143753699 ^ 1152075732) - 120688076 + 877926552 ^ 514923173 ^ 436874744
         )
         - 1101499111];
      if (field_1166[var10001 - 1101499111] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = (1988343722 | -1386511151 | 0) & 2375684; var23 < var13.length(); var23 += (-1983799408 - (-1758022153 - 2125463251) | 1) & 247727107) {
            char var42 = var13.charAt(var23);
            char var47 = (char)(
               (
                        (
                              (
                                       (
                                                (
                                                         (
                                                                  (
                                                                        (((var42 & '\uffc0') >> 6 | var42 << '\n') - 222 & 65534) >> 1
                                                                           | ((var42 & '\uffc0') >> 6 | var42 << '\n') - 222 << 15
                                                                     )
                                                                     & 65408
                                                               )
                                                               >> 7
                                                            | (
                                                                  (((var42 & '\uffc0') >> 6 | var42 << '\n') - 222 & 65534) >> 1
                                                                     | ((var42 & '\uffc0') >> 6 | var42 << '\n') - 222 << 15
                                                               )
                                                               << 9
                                                      )
                                                      - 246
                                                      - 194
                                                   & 61440
                                             )
                                             >> 12
                                          | (
                                                   (
                                                            (
                                                                  (((var42 & '\uffc0') >> 6 | var42 << '\n') - 222 & 65534) >> 1
                                                                     | ((var42 & '\uffc0') >> 6 | var42 << '\n') - 222 << 15
                                                               )
                                                               & 65408
                                                         )
                                                         >> 7
                                                      | (
                                                            (((var42 & '\uffc0') >> 6 | var42 << '\n') - 222 & 65534) >> 1
                                                               | ((var42 & '\uffc0') >> 6 | var42 << '\n') - 222 << 15
                                                         )
                                                         << 9
                                                )
                                                - 246
                                                - 194
                                             << 4
                                    )
                                    + 105
                                 ^ 139
                           )
                           & 61440
                     )
                     >> 12
                  | (
                        (
                                 (
                                          (
                                                   (
                                                            (
                                                                  (((var42 & '\uffc0') >> 6 | var42 << '\n') - 222 & 65534) >> 1
                                                                     | ((var42 & '\uffc0') >> 6 | var42 << '\n') - 222 << 15
                                                               )
                                                               & 65408
                                                         )
                                                         >> 7
                                                      | (
                                                            (((var42 & '\uffc0') >> 6 | var42 << '\n') - 222 & 65534) >> 1
                                                               | ((var42 & '\uffc0') >> 6 | var42 << '\n') - 222 << 15
                                                         )
                                                         << 9
                                                )
                                                - 246
                                                - 194
                                             & 61440
                                       )
                                       >> 12
                                    | (
                                             (
                                                      (
                                                            (((var42 & '\uffc0') >> 6 | var42 << '\n') - 222 & 65534) >> 1
                                                               | ((var42 & '\uffc0') >> 6 | var42 << '\n') - 222 << 15
                                                         )
                                                         & 65408
                                                   )
                                                   >> 7
                                                | (
                                                      (((var42 & '\uffc0') >> 6 | var42 << '\n') - 222 & 65534) >> 1
                                                         | ((var42 & '\uffc0') >> 6 | var42 << '\n') - 222 << 15
                                                   )
                                                   << 9
                                          )
                                          - 246
                                          - 194
                                       << 4
                              )
                              + 105
                           ^ 139
                     )
                     << 4
            );
            var13.setCharAt(
               var23,
               (char)(
                  (
                           (
                                 (
                                          (
                                                   (
                                                            (
                                                                     (
                                                                           (((var42 & '\uffc0') >> 6 | var42 << '\n') - 222 & 65534) >> 1
                                                                              | ((var42 & '\uffc0') >> 6 | var42 << '\n') - 222 << 15
                                                                        )
                                                                        & 65408
                                                                  )
                                                                  >> 7
                                                               | (
                                                                     (((var42 & '\uffc0') >> 6 | var42 << '\n') - 222 & 65534) >> 1
                                                                        | ((var42 & '\uffc0') >> 6 | var42 << '\n') - 222 << 15
                                                                  )
                                                                  << 9
                                                         )
                                                         - 246
                                                         - 194
                                                      & 61440
                                                )
                                                >> 12
                                             | (
                                                      (
                                                               (
                                                                     (((var42 & '\uffc0') >> 6 | var42 << '\n') - 222 & 65534) >> 1
                                                                        | ((var42 & '\uffc0') >> 6 | var42 << '\n') - 222 << 15
                                                                  )
                                                                  & 65408
                                                            )
                                                            >> 7
                                                         | (
                                                               (((var42 & '\uffc0') >> 6 | var42 << '\n') - 222 & 65534) >> 1
                                                                  | ((var42 & '\uffc0') >> 6 | var42 << '\n') - 222 << 15
                                                            )
                                                            << 9
                                                   )
                                                   - 246
                                                   - 194
                                                << 4
                                       )
                                       + 105
                                    ^ 139
                              )
                              & 61440
                        )
                        >> 12
                     | (
                           (
                                    (
                                             (
                                                      (
                                                               (
                                                                     (((var42 & '\uffc0') >> 6 | var42 << '\n') - 222 & 65534) >> 1
                                                                        | ((var42 & '\uffc0') >> 6 | var42 << '\n') - 222 << 15
                                                                  )
                                                                  & 65408
                                                            )
                                                            >> 7
                                                         | (
                                                               (((var42 & '\uffc0') >> 6 | var42 << '\n') - 222 & 65534) >> 1
                                                                  | ((var42 & '\uffc0') >> 6 | var42 << '\n') - 222 << 15
                                                            )
                                                            << 9
                                                   )
                                                   - 246
                                                   - 194
                                                & 61440
                                          )
                                          >> 12
                                       | (
                                                (
                                                         (
                                                               (((var42 & '\uffc0') >> 6 | var42 << '\n') - 222 & 65534) >> 1
                                                                  | ((var42 & '\uffc0') >> 6 | var42 << '\n') - 222 << 15
                                                            )
                                                            & 65408
                                                      )
                                                      >> 7
                                                   | (
                                                         (((var42 & '\uffc0') >> 6 | var42 << '\n') - 222 & 65534) >> 1
                                                            | ((var42 & '\uffc0') >> 6 | var42 << '\n') - 222 << 15
                                                      )
                                                      << 9
                                             )
                                             - 246
                                             - 194
                                          << 4
                                 )
                                 + 105
                              ^ 139
                        )
                        << 4
               )
            );
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = (-1048575821 - 1935750089 | 0) & -1610604015; var29 < var16.length(); var29 += (1181808700 & 1181808700 | 1) & 696582723) {
            int var52 = var16.charAt(var29) ^ 'M';
            char var57 = (char)(
               (
                        (
                              (
                                       (
                                             (
                                                      (
                                                               (
                                                                     (((var52 & 49152) >> 14 | var52 << 2) & 64512) >> 10
                                                                        | ((var52 & 49152) >> 14 | var52 << 2) << 6
                                                                  )
                                                                  & 32768
                                                            )
                                                            >> 15
                                                         | ((((var52 & 49152) >> 14 | var52 << 2) & 64512) >> 10 | ((var52 & 49152) >> 14 | var52 << 2) << 6)
                                                            << 1
                                                   )
                                                   - 100
                                                   - 116
                                                ^ 155
                                                ^ 32
                                          )
                                          & 57344
                                    )
                                    >> 13
                                 | (
                                       (
                                                (((((var52 & 49152) >> 14 | var52 << 2) & 64512) >> 10 | ((var52 & 49152) >> 14 | var52 << 2) << 6) & 32768)
                                                      >> 15
                                                   | ((((var52 & 49152) >> 14 | var52 << 2) & 64512) >> 10 | ((var52 & 49152) >> 14 | var52 << 2) << 6) << 1
                                             )
                                             - 100
                                             - 116
                                          ^ 155
                                          ^ 32
                                    )
                                    << 3
                           )
                           & 65504
                     )
                     >> 5
                  | (
                        (
                                 (
                                       (
                                                (((((var52 & 49152) >> 14 | var52 << 2) & 64512) >> 10 | ((var52 & 49152) >> 14 | var52 << 2) << 6) & 32768)
                                                      >> 15
                                                   | ((((var52 & 49152) >> 14 | var52 << 2) & 64512) >> 10 | ((var52 & 49152) >> 14 | var52 << 2) << 6) << 1
                                             )
                                             - 100
                                             - 116
                                          ^ 155
                                          ^ 32
                                    )
                                    & 57344
                              )
                              >> 13
                           | (
                                 (
                                          (((((var52 & 49152) >> 14 | var52 << 2) & 64512) >> 10 | ((var52 & 49152) >> 14 | var52 << 2) << 6) & 32768) >> 15
                                             | ((((var52 & 49152) >> 14 | var52 << 2) & 64512) >> 10 | ((var52 & 49152) >> 14 | var52 << 2) << 6) << 1
                                       )
                                       - 100
                                       - 116
                                    ^ 155
                                    ^ 32
                              )
                              << 3
                     )
                     << 11
            );
            var16.setCharAt(
               var29,
               (char)(
                  (
                           (
                                 (
                                          (
                                                (
                                                         (
                                                                  (
                                                                        (((var52 & 49152) >> 14 | var52 << 2) & 64512) >> 10
                                                                           | ((var52 & 49152) >> 14 | var52 << 2) << 6
                                                                     )
                                                                     & 32768
                                                               )
                                                               >> 15
                                                            | ((((var52 & 49152) >> 14 | var52 << 2) & 64512) >> 10 | ((var52 & 49152) >> 14 | var52 << 2) << 6)
                                                               << 1
                                                      )
                                                      - 100
                                                      - 116
                                                   ^ 155
                                                   ^ 32
                                             )
                                             & 57344
                                       )
                                       >> 13
                                    | (
                                          (
                                                   (((((var52 & 49152) >> 14 | var52 << 2) & 64512) >> 10 | ((var52 & 49152) >> 14 | var52 << 2) << 6) & 32768)
                                                         >> 15
                                                      | ((((var52 & 49152) >> 14 | var52 << 2) & 64512) >> 10 | ((var52 & 49152) >> 14 | var52 << 2) << 6) << 1
                                                )
                                                - 100
                                                - 116
                                             ^ 155
                                             ^ 32
                                       )
                                       << 3
                              )
                              & 65504
                        )
                        >> 5
                     | (
                           (
                                    (
                                          (
                                                   (((((var52 & 49152) >> 14 | var52 << 2) & 64512) >> 10 | ((var52 & 49152) >> 14 | var52 << 2) << 6) & 32768)
                                                         >> 15
                                                      | ((((var52 & 49152) >> 14 | var52 << 2) & 64512) >> 10 | ((var52 & 49152) >> 14 | var52 << 2) << 6) << 1
                                                )
                                                - 100
                                                - 116
                                             ^ 155
                                             ^ 32
                                       )
                                       & 57344
                                 )
                                 >> 13
                              | (
                                    (
                                             (((((var52 & 49152) >> 14 | var52 << 2) & 64512) >> 10 | ((var52 & 49152) >> 14 | var52 << 2) << 6) & 32768) >> 15
                                                | ((((var52 & 49152) >> 14 | var52 << 2) & 64512) >> 10 | ((var52 & 49152) >> 14 | var52 << 2) << 6) << 1
                                          )
                                          - 100
                                          - 116
                                       ^ 155
                                       ^ 32
                                 )
                                 << 3
                        )
                        << 11
               )
            );
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_101.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = 1789665747 & 1789665747 ^ 1789665747; var35 < var19.length(); var35 += (-432251368 ^ 1070331368 | 1) & 524299) {
            int var62 = var19.charAt(var35) - 'l' - 128 - 87 + 135;
            int var98 = (var62 & 32768) >> 15;
            int var63 = (var62 & 32768) >> 15 | var62 << 1;
            int var99 = (((var62 & 32768) >> 15 | var62 << 1) & 65024) >> 9;
            var62 = (((var98 | var62 << 1) & 65024) >> 9 | ((var62 & 32768) >> 15 | var62 << 1) << 7) ^ 190;
            var98 = (((var99 | var63 << 7) ^ 190) & 65532) >> 2;
            int var65 = (((var99 | var63 << 7) ^ 190) & 65532) >> 2 | var62 << 14;
            int var101 = (((((var99 | var63 << 7) ^ 190) & 65532) >> 2 | var62 << 14) & 0) >> 16;
            char var66 = (char)((((var98 | var62 << 14) & 0) >> 16 | ((((var99 | var63 << 7) ^ 190) & 65532) >> 2 | var62 << 14) << 0) ^ 108);
            var19.setCharAt(var35, (char)((var101 | var65 << 0) ^ 108));
         }

         Class var7 = Class.forName(var19.toString(), false, Class_101.class.getClassLoader());
         switch ((((var4 + 1219911370 - 1756841252 ^ 1199057321) - 2023454327 ^ 1287477633 ^ 553156008) + 901144860 ^ 1554936347) + 990722830 + 1497305639) {
            case 49914768:
               var10000 = var0.findConstructor(var7, var6);
               break;
            case 271184821:
               var10000 = var0.findSpecial(var7, var5, var6, Class_101.class);
               break;
            case 308596546:
            case 1179147960:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 517539801:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_1166[((var10 - 1021405277 + 491699068 + 1464828587 + 2143753699 ^ 1152075732) - 120688076 + 877926552 ^ 514923173 ^ 436874744) - 1101499111] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1228(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = (var10 - 1556805665 - 1415520500 ^ 2101887569 ^ 1077976734 ^ 1256300181) - 218491798 - 525498012 - 1855513719 - 1578869482;
      MethodHandle var10000 = field_1166[(var10 - 1556805665 - 1415520500 ^ 2101887569 ^ 1077976734 ^ 1256300181)
         - 218491798
         - 525498012
         - 1855513719
         - 1578869482
         + 1095440404];
      if (field_1166[var10001 + 1095440404] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = (1003413155 * (87295414 >> 514722806) | 0) & 1112545858; var24 < var14.length(); var24 += 1138935841 & 1151076198 ^ 1082130465) {
            int var43 = var14.charAt(var24) ^ 247;
            char var48 = (char)(
               (
                     (
                              (
                                    (
                                             (
                                                   (
                                                            (
                                                                     (
                                                                           (((var43 & 32768) >> 15 | var43 << 1) & 65534) >> 1
                                                                              | ((var43 & 32768) >> 15 | var43 << 1) << 15
                                                                        )
                                                                        ^ 73
                                                                  )
                                                                  - 247
                                                                  - 8
                                                               & 61440
                                                         )
                                                         >> 12
                                                      | (
                                                               (
                                                                     (((var43 & 32768) >> 15 | var43 << 1) & 65534) >> 1
                                                                        | ((var43 & 32768) >> 15 | var43 << 1) << 15
                                                                  )
                                                                  ^ 73
                                                            )
                                                            - 247
                                                            - 8
                                                         << 4
                                                )
                                                & 32768
                                          )
                                          >> 15
                                       | (
                                             (
                                                      (((((var43 & 32768) >> 15 | var43 << 1) & 65534) >> 1 | ((var43 & 32768) >> 15 | var43 << 1) << 15) ^ 73)
                                                            - 247
                                                            - 8
                                                         & 61440
                                                   )
                                                   >> 12
                                                | (((((var43 & 32768) >> 15 | var43 << 1) & 65534) >> 1 | ((var43 & 32768) >> 15 | var43 << 1) << 15) ^ 73)
                                                      - 247
                                                      - 8
                                                   << 4
                                          )
                                          << 1
                                 )
                                 & 65504
                           )
                           >> 5
                        | (
                              (
                                       (
                                             (
                                                      (((((var43 & 32768) >> 15 | var43 << 1) & 65534) >> 1 | ((var43 & 32768) >> 15 | var43 << 1) << 15) ^ 73)
                                                            - 247
                                                            - 8
                                                         & 61440
                                                   )
                                                   >> 12
                                                | (((((var43 & 32768) >> 15 | var43 << 1) & 65534) >> 1 | ((var43 & 32768) >> 15 | var43 << 1) << 15) ^ 73)
                                                      - 247
                                                      - 8
                                                   << 4
                                          )
                                          & 32768
                                    )
                                    >> 15
                                 | (
                                       (
                                                (((((var43 & 32768) >> 15 | var43 << 1) & 65534) >> 1 | ((var43 & 32768) >> 15 | var43 << 1) << 15) ^ 73)
                                                      - 247
                                                      - 8
                                                   & 61440
                                             )
                                             >> 12
                                          | (((((var43 & 32768) >> 15 | var43 << 1) & 65534) >> 1 | ((var43 & 32768) >> 15 | var43 << 1) << 15) ^ 73) - 247 - 8
                                             << 4
                                    )
                                    << 1
                           )
                           << 11
                  )
                  - 222
            );
            var14.setCharAt(
               var24,
               (char)(
                  (
                        (
                                 (
                                       (
                                                (
                                                      (
                                                               (
                                                                        (
                                                                              (((var43 & 32768) >> 15 | var43 << 1) & 65534) >> 1
                                                                                 | ((var43 & 32768) >> 15 | var43 << 1) << 15
                                                                           )
                                                                           ^ 73
                                                                     )
                                                                     - 247
                                                                     - 8
                                                                  & 61440
                                                            )
                                                            >> 12
                                                         | (
                                                                  (
                                                                        (((var43 & 32768) >> 15 | var43 << 1) & 65534) >> 1
                                                                           | ((var43 & 32768) >> 15 | var43 << 1) << 15
                                                                     )
                                                                     ^ 73
                                                               )
                                                               - 247
                                                               - 8
                                                            << 4
                                                   )
                                                   & 32768
                                             )
                                             >> 15
                                          | (
                                                (
                                                         (
                                                                  (
                                                                        (((var43 & 32768) >> 15 | var43 << 1) & 65534) >> 1
                                                                           | ((var43 & 32768) >> 15 | var43 << 1) << 15
                                                                     )
                                                                     ^ 73
                                                               )
                                                               - 247
                                                               - 8
                                                            & 61440
                                                      )
                                                      >> 12
                                                   | (((((var43 & 32768) >> 15 | var43 << 1) & 65534) >> 1 | ((var43 & 32768) >> 15 | var43 << 1) << 15) ^ 73)
                                                         - 247
                                                         - 8
                                                      << 4
                                             )
                                             << 1
                                    )
                                    & 65504
                              )
                              >> 5
                           | (
                                 (
                                          (
                                                (
                                                         (
                                                                  (
                                                                        (((var43 & 32768) >> 15 | var43 << 1) & 65534) >> 1
                                                                           | ((var43 & 32768) >> 15 | var43 << 1) << 15
                                                                     )
                                                                     ^ 73
                                                               )
                                                               - 247
                                                               - 8
                                                            & 61440
                                                      )
                                                      >> 12
                                                   | (((((var43 & 32768) >> 15 | var43 << 1) & 65534) >> 1 | ((var43 & 32768) >> 15 | var43 << 1) << 15) ^ 73)
                                                         - 247
                                                         - 8
                                                      << 4
                                             )
                                             & 32768
                                       )
                                       >> 15
                                    | (
                                          (
                                                   (((((var43 & 32768) >> 15 | var43 << 1) & 65534) >> 1 | ((var43 & 32768) >> 15 | var43 << 1) << 15) ^ 73)
                                                         - 247
                                                         - 8
                                                      & 61440
                                                )
                                                >> 12
                                             | (((((var43 & 32768) >> 15 | var43 << 1) & 65534) >> 1 | ((var43 & 32768) >> 15 | var43 << 1) << 15) ^ 73)
                                                   - 247
                                                   - 8
                                                << 4
                                       )
                                       << 1
                              )
                              << 11
                     )
                     - 222
               )
            );
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = -1444454789 << -1505476406 ^ -1652954112; var30 < var17.length(); var30 += -276510272 - -1655252654 ^ 1378742383) {
            int var53 = var17.charAt(var30) + 208;
            int var88 = (var53 & 65504) >> 5;
            int var54 = (var53 & 65504) >> 5 | var53 << 11;
            int var89 = (((var53 & 65504) >> 5 | var53 << 11) & 32768) >> 15;
            var53 = ((var88 | var53 << 11) & 32768) >> 15 | ((var53 & 65504) >> 5 | var53 << 11) << 1;
            var88 = ((var89 | var54 << 1) & 65408) >> 7;
            int var56 = (((var89 | var54 << 1) & 65408) >> 7 | var53 << 9) - 195;
            int var91 = ((((var89 | var54 << 1) & 65408) >> 7 | var53 << 9) - 195 & 32768) >> 15;
            char var57 = (char)(
               ((((var88 | var53 << 9) - 195 & 32768) >> 15 | (((var89 | var54 << 1) & 65408) >> 7 | var53 << 9) - 195 << 1) - 12 + 223 ^ 122) - 223
            );
            var17.setCharAt(var30, (char)(((var91 | var56 << 1) - 12 + 223 ^ 122) - 223));
         }

         Class var6 = Class.forName(var17.toString(), false, Class_101.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = 850187331 * 850187331 ^ 369559945; var36 < var20.length(); var36 += 1923311181 >> (119070177 << -575568018) ^ 1923311180) {
            int var62 = ((var20.charAt(var36) ^ 142) + 20 + 23 ^ 234) - 40;
            int var92 = (var62 & 65504) >> 5;
            int var63 = ((var62 & 65504) >> 5 | var62 << 11) - 115;
            int var93 = (((var62 & 65504) >> 5 | var62 << 11) - 115 & 65535) >> 0;
            char var64 = (char)(((((var92 | var62 << 11) - 115 & 65535) >> 0 | ((var62 & 65504) >> 5 | var62 << 11) - 115 << 16) ^ 78) - 132);
            var20.setCharAt(var36, (char)(((var93 | var63 << 16) ^ 78) - 132));
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_101.class.getClassLoader()).returnType();
         switch ((var4 + 1412256564 + 927722410 + 1827157703 ^ 1848453807) - 1555827395 + 1218398097 + 2020077996 - 1908109889 + 383985973 + 179720004) {
            case 306570297:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            case 365286602:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            case 1081172926:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            case 1142201776:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_1166[(var10 - 1556805665 - 1415520500 ^ 2101887569 ^ 1077976734 ^ 1256300181) - 218491798 - 525498012 - 1855513719 - 1578869482 + 1095440404] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
