import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;
import net.minecraft.class_1799;

public class Class_398 extends Class_342 {
   // $VF: renamed from: pc boolean
   public boolean field_1564;
   // $VF: renamed from: von boolean
   public boolean field_1565;
   // $VF: renamed from: gxc boolean
   public boolean field_1566;
   // $VF: renamed from: xvc java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_1567 = new MethodHandle[(651727247 ^ 651727247 | 79) & 2143079679];

   public Class_398() {
      int var10001 = (2070078482 - -1654239738 | 0) & 570501488;

      StringBuilder var10002;
      for (var10002 = (StringBuilder)0<"JNT",-93023532,"胸薨藘薨葸胘","縂ฃ蘃戃똃戃騂踃戃阃稃騂⨃긃ꘃ舃阃稃쨂舂㘃","ƹ膼Ʒ膼ƛƺ膼ƻ膿ƛ膥ƶƵ膸ƻ膿ƭ膶膸ƺƾ膾Ƶ",-365155402>(
            "\ue1cb\uef8b\ueccb\ued8b\uee0b\ueacb\uda8b\ue14b\uef8b\ue8cb\ue98b\ue9cb"
         );
         var10001 < ((-1123309139 >>> 1890621868 | 4) & -808451764);
         var10001 += (286732436 ^ 286732436 | 1) & -680451435
      ) {
         char var6 = 0<"JNT",309746032,"蔈薸蔨萘蜨葸","縂ȃ舂\uea02","ƹ膼Ʒ膼ƛƺ膼ƻ膿ƛ膥ƶƵ膸ƻ膿ƭ膶膸ƺƾ膾Ƶ",-365155392>(var10002, var10001);
         char var9 = (char)(
            (
                  ((((((var6 & '￼') >> 2 | var6 << 14) ^ 237) & 65520) >> 4 | (((var6 & '￼') >> 2 | var6 << 14) ^ 237) << 12) & 65535) >> 0
                     | (((((var6 & '￼') >> 2 | var6 << 14) ^ 237) & 65520) >> 4 | (((var6 & '￼') >> 2 | var6 << 14) ^ 237) << 12) << 16
               )
               + 188
         );
         0<"JNT",309746032,"萈蕨葸蜈薸蔨萘蜨葸","縂ȃ\uea02舂㘃","ƹ膼Ʒ膼ƛƺ膼ƻ膿ƛ膥ƶƵ膸ƻ膿ƭ膶膸ƺƾ膾Ƶ",-365155393>(
            var10002,
            var10001,
            (char)(
               (
                     ((((((var6 & '￼') >> 2 | var6 << 14) ^ 237) & 65520) >> 4 | (((var6 & '￼') >> 2 | var6 << 14) ^ 237) << 12) & 65535) >> 0
                        | (((((var6 & '￼') >> 2 | var6 << 14) ^ 237) & 65520) >> 4 | (((var6 & '￼') >> 2 | var6 << 14) ^ 237) << 12) << 16
                  )
                  + 188
            )
         );
      }

      String var2 = 0<"JNT",309746032,"葸藈蘈葸萘薨藘蕈","縂舂ฃ蘃戃똃戃騂踃戃阃稃騂⨃긃ꘃ舃阃稃쨂","ƹ膼Ʒ膼ƛƺ膼ƻ膿ƛ膥ƶƵ膸ƻ膿ƭ膶膸ƺƾ膾Ƶ",-365180460>(var10002);
      int var4 = 921143502 >>> 921143502 ^ 56222;

      StringBuilder var11;
      for (var11 = (StringBuilder)0<"JNT",-93023532,"胸薨藘薨葸胘","縂ฃ蘃戃똃戃騂踃戃阃稃騂⨃긃ꘃ舃阃稃쨂舂㘃","ƹ膼Ʒ膼ƛƺ膼ƻ膿ƛ膥ƶƵ膸ƻ膿ƭ膶膸ƺƾ膾Ƶ",-365180461>(
            "胋¼胂»¼肻âµ¸肮肶¹肵â肭¶胄¹â胂¼¼胄肸º¼肶¹肵â¼肹â肼肻胄â胂âµ肶»胄肭肹»肷"
         );
         var4 < 47;
         var4 += 1
      ) {
         int var16 = (0<"JNT",309746032,"蔈薸蔨萘蜨葸","縂ȃ舂\uea02","ƹ膼Ʒ膼ƛƺ膼ƻ膿ƛ膥ƶƵ膸ƻ膿ƭ膶膸ƺƾ膾Ƶ",-365155398>(var11, var4) - 133 ^ 120) - 21;
         int var10006 = (var16 & 65534) >> 1;
         int var17 = (var16 & 65534) >> 1 | var16 << 15;
         int var24 = (((var16 & 65534) >> 1 | var16 << 15) & 49152) >> 14;
         char var18 = (char)(((var10006 | var16 << 15) & 49152) >> 14 | ((var16 & 65534) >> 1 | var16 << 15) << 2);
         0<"JNT",309746032,"萈蕨葸蜈薸蔨萘蜨葸","縂ȃ\uea02舂㘃","ƹ膼Ʒ膼ƛƺ膼ƻ膿ƛ膥ƶƵ膸ƻ膿ƭ膶膸ƺƾ膾Ƶ",-365155399>(var11, var4, (char)(var24 | var17 << 2));
      }

      super(
         var2,
         0<"JNT",309746032,"葸藈蘈葸萘薨藘蕈","縂舂ฃ蘃戃똃戃騂踃戃阃稃騂⨃긃ꘃ舃阃稃쨂","ƹ膼Ʒ膼ƛƺ膼ƻ膿ƛ膥ƶƵ膸ƻ膿ƭ膶膸ƺƾ膾Ƶ",-365155403>(var11),
         -1,
         1<"JNT",1380431716,"饹굹뭹","⼕霔","âÚςɚ̲j",1420015706>()
      );
   }

   // $VF: renamed from: mg () void
   @Override
   public void method_1407() {
      0<"JNT",-506224179,"藨蕈","縂舂㘃","膶膵ƿ",-365155397>(this);
   }

   // $VF: renamed from: q () void
   @Override
   public void method_1408() {
      0<"JNT",-506224179,"萨","縂舂㘃","膶膵ƿ",-365155422>(this);
   }

   // $VF: renamed from: gd (Class_207) void
   @Class_21
   public void method_1442(Class_207 var1) {
      int var3 = -1360543874;
      if (1<"JNT",-1526705086,"靹鵹镹ꍹ鍹襹\u2d79㥹㕹㕹","\uf714輔ܕ\uf716켔꼔\uf714輔鼔᜕演뜔ܕ\uf716鼔윔演ἕἕ缔\u1f17\uef16\ue716","âÚς˒˺ʂÊʺ˚˒˺̪ʲ̒̚ʂÊ̪˂̚ʪʪ͊\u0082ª\u008aj",1420016023>(
            1<"JNT",-1526705086,"ꍹ꽹","✕⼕","âÚς˒˺ʂÊʺ˚˒˺̪ʲ̒̚ʂÊ̪˂̚ʪʪ͊ª\u009a¢j",1420016020>(this)
         )
         == null) {
         var3 = (-1910038693 + -1910038693 | 1199672446) & 1202048638;

         while (true) {
            switch (((var3 ^ 594673056 ^ 439949917) + 583313194 ^ 671140904) - 1098644322 ^ 1590295115) {
               case -131449322:
                  if (1<"JNT",-1526705086,"ꭹ酹","✕⼕","âÚͲ",1420015668>(this)) {
                     if (1<"JNT",-1526705086,"띹ꥹꝹ","✕⼕","âÚͲ",1420015671>(this)) {
                        int var2 = 0<"JNT",309746032,"藨蕨葸薸藈蕸蛈聘聈聨耈耘","縂舂ȃ","ƻ膾ƶƛ膺膸ƻ膾膽Ƶ膼ƿƶƛ膽ƺ膼膵膵膣膔ƗƗ膔",-365180443>(
                           0<"JNT",309746032,"藨蕨葸薸藈蕸蛈耈耨聨聸肸","縂舂ฃ阃爃긃騂鈃舃阃爃樃ꘃ戃瘃긃騂樃踃戃ꨃꨃ娃ꈂ똂똂ꈂ쨂","ƻ膾ƶƛ膺膸ƻ膾膽Ƶ膼ƿƶƛ膽ƺ膼膵膵膣膗ƖƗ",-365180442>(
                              1<"JNT",-1526705086,"靹鵹镹ꍹ鍹襹\u2d79㥹⽹㍹","\uf714輔ܕ\uf716켔꼔\uf714輔鼔᜕演뜔ܕ\uf716鼔윔演ἕἕ缔\u1f17\uef16\ue716","âÚς˒˺ʂÊʺ˚˒˺̪ʲ̒̚ʂÊ̪˂̚ʪʪ͊\u008a\u0082\u0092j",1420015617>(
                                 1<"JNT",-1526705086,"ꍹ꽹","✕⼕","âÚς˒˺ʂÊʺ˚˒˺̪ʲ̒̚ʂÊ̪˂̚ʪʪ͊ª\u009a¢j",1420015670>(this)
                              )
                           )
                        );
                        if (!0<"JNT",309746032,"藨蕨葸薸藈蕸蛈耈耨聨聈聸","縂ฃ阃爃긃騂鈃舃阃爃樃ꘃ戃瘃긃騂樃踃戃ꨃꨃ娃ꈂ먂숂ꘂ쨂舂䘃","ƻ膾ƶƛ膺膸ƻ膾膽Ƶ膼ƿƶƛ膽ƺ膼膵膵膣膔膗膐膐",-365180392>(
                              0<"JNT",309746032,"藨蕨葸薸藈蕸蛈聘耸聸聈","縂舂ฃ阃爃긃騂鈃舃阃爃樃ꘃ戃瘃긃騂樃踃戃ꨃꨃ娃ꈂ먂숂숂쨂","ƻ膾ƶƛ膺膸ƻ膾膽Ƶ膼ƿƶƛ膽ƺ膼膵膵膣膗ƖƗ",-365180398>(
                                 1<"JNT",-1526705086,"靹鵹镹ꍹ鍹襹\u2d79㥹⽹㍹","\uf714輔ܕ\uf716켔꼔\uf714輔鼔᜕演뜔ܕ\uf716鼔윔演ἕἕ缔\u1f17\uef16\ue716","âÚς˒˺ʂÊʺ˚˒˺̪ʲ̒̚ʂÊ̪˂̚ʪʪ͊\u008a\u0082\u0092j",1420016117>(
                                    1<"JNT",-1526705086,"ꍹ꽹","✕⼕","âÚς˒˺ʂÊʺ˚˒˺̪ʲ̒̚ʂÊ̪˂̚ʪʪ͊ª\u009a¢j",1420016074>(this)
                                 )
                              ),
                              1<"JNT",1380431716,"靹鵹镹ꍹ鍹襹㭹㝹ㅹ㵹","\uf714輔ܕ\uf716켔꼔\uf714輔鼔᜕演뜔ܕ\uf716鼔윔演ἕἕ缔\uef16✗\ue716\u1717","âÚς˒˺ʂÊʺ˚˒˺̪ʲ̒̚ʂÊ̪˂̚ʪʪ͊\u009a\u008aZ²j",1420016079>()
                           )
                           && !0<"JNT",-592855333,"葘蒘蔘","縂ฃ阃爃긃騂鈃舃阃爃樃ꘃ戃瘃긃騂樃踃戃ꨃꨃ娃ꈂ먂숂ꘂ쨂舂䘃","Ƹ",-365180434>(
                              1<"JNT",1380431716,"靹鵹镹ꍹ鍹襹㭹㝹ㅹ㵹","\uf714輔ܕ\uf716켔꼔\uf714輔鼔᜕演뜔ܕ\uf716鼔윔演ἕἕ缔\uef16✗\ue716\u1717","âÚς˒˺ʂÊʺ˚˒˺̪ʲ̒̚ʂÊ̪˂̚ʪʪ͊\u009a\u008aZ²j",1420015641>()
                           )) {
                           return;
                        }

                        0<"JNT",309746032,"藨蕨葸薸藈蕸蛈耘肨耨肨","縂ฃ阃爃긃騂鈃舃阃爃樃ꘃ戃瘃긃騂樃踃戃ꨃꨃ娃ꈂ똂눂먂쨂ฃ阃爃긃騂鈃舃阃爃樃ꘃ戃瘃긃騂樃踃戃ꨃꨃ娃ꈂꘂ똂븂쨂舂ฃ阃爃긃騂鈃舃阃爃樃ꘃ戃瘃긃騂樃踃戃ꨃꨃ娃ꈂꘂ똂숂쨂","ƻ膾ƶƛ膺膸ƻ膾膽Ƶ膼ƿƶƛ膽ƺ膼膵膵膣Ɨ膕Ɨ",-365180390>(
                           1<"JNT",-1526705086,"靹鵹镹ꍹ鍹襹\u2d79㥹㝹\u2d79","\uf714輔ܕ\uf716켔꼔\uf714輔鼔᜕演뜔ܕ\uf716鼔윔演ἕἕ缔\u1f17\uef16\ue716","âÚς˒˺ʂÊʺ˚˒˺̪ʲ̒̚ʂÊ̪˂̚ʪʪ͊\u0092ª\u0092j",1420015662>(
                              1<"JNT",-1526705086,"ꍹ꽹","✕⼕","âÚς˒˺ʂÊʺ˚˒˺̪ʲ̒̚ʂÊ̪˂̚ʪʪ͊ª\u009a¢j",1420015663>(this)
                           ),
                           1<"JNT",-1526705086,"靹鵹镹ꍹ鍹襹\u2d79㥹⽹㍹","\uf714輔ܕ\uf716켔꼔\uf714輔鼔᜕演뜔ܕ\uf716鼔윔演ἕἕ缔\u1f17\uef16\ue716","âÚς˒˺ʂÊʺ˚˒˺̪ʲ̒̚ʂÊ̪˂̚ʪʪ͊\u008a\u0082\u0092j",1420016112>(
                              1<"JNT",-1526705086,"ꍹ꽹","✕⼕","âÚς˒˺ʂÊʺ˚˒˺̪ʲ̒̚ʂÊ̪˂̚ʪʪ͊ª\u009a¢j",1420016121>(this)
                           ),
                           0<"JNT",309746032,"藨蕨葸薸藈蕸蛈聘耸聨肸","縂舂ฃ阃爃긃騂鈃舃阃爃樃ꘃ戃瘃긃騂樃踃戃ꨃꨃ娃ꈂꘂ똂븂쨂","ƻ膾ƶƛ膺膸ƻ膾膽Ƶ膼ƿƶƛ膽ƺ膼膵膵膣膗ƖƗ",-365155405>(
                              1<"JNT",-1526705086,"靹鵹镹ꍹ鍹襹\u2d79㥹⽹㍹","\uf714輔ܕ\uf716켔꼔\uf714輔鼔᜕演뜔ܕ\uf716鼔윔演ἕἕ缔\u1f17\uef16\ue716","âÚς˒˺ʂÊʺ˚˒˺̪ʲ̒̚ʂÊ̪˂̚ʪʪ͊\u008a\u0082\u0092j",1420016066>(
                                 1<"JNT",-1526705086,"ꍹ꽹","✕⼕","âÚς˒˺ʂÊʺ˚˒˺̪ʲ̒̚ʂÊ̪˂̚ʪʪ͊ª\u009a¢j",1420016115>(this)
                              )
                           )
                        );
                        0<"JNT",309746032,"藨蕨葸薸藈蕸蛈聘耨聸肨聘","縂ȃ舂㘃","ƻ膾ƶƛ膺膸ƻ膾膽Ƶ膼ƿƶƛ膽ƺ膼膵膵膣膔ƗƗ膔",-365180394>(
                           0<"JNT",309746032,"藨蕨葸薸藈蕸蛈耈耨聨聸肸","縂舂ฃ阃爃긃騂鈃舃阃爃樃ꘃ戃瘃긃騂樃踃戃ꨃꨃ娃ꈂ똂똂ꈂ쨂","ƻ膾ƶƛ膺膸ƻ膾膽Ƶ膼ƿƶƛ膽ƺ膼膵膵膣膗ƖƗ",-365180385>(
                              1<"JNT",-1526705086,"靹鵹镹ꍹ鍹襹\u2d79㥹⽹㍹","\uf714輔ܕ\uf716켔꼔\uf714輔鼔᜕演뜔ܕ\uf716鼔윔演ἕἕ缔\u1f17\uef16\ue716","âÚς˒˺ʂÊʺ˚˒˺̪ʲ̒̚ʂÊ̪˂̚ʪʪ͊\u008a\u0082\u0092j",1420016102>(
                                 1<"JNT",-1526705086,"ꍹ꽹","✕⼕","âÚς˒˺ʂÊʺ˚˒˺̪ʲ̒̚ʂÊ̪˂̚ʪʪ͊ª\u009a¢j",1420016103>(this)
                              )
                           ),
                           var2
                        );
                        1<"JNT",1284316227,"띹ꥹꝹ","✕⼕","âÚͲ",1420016075>(this, false);
                        1<"JNT",1284316227,"ꭹ酹","✕⼕","âÚͲ",1420016122>(this, false);
                        return;
                     }

                     var3 = (2051292227 >> 12368049 | 1360789844) & 1461464407;
                     continue;
                  }
                  break;
               case 56150417:
                  0<"JNT",-592855333,"藨蕨葸薸藈蕸蛈耨聸耨聘","縂ฃ阃爃긃騂鈃舃阃爃樃ꘃ戃瘃긃騂樃踃戃ꨃꨃ娃ꨂ똂먂눂渂樃踃戃ꨃꨃ娃ꨂ鸂똂쨂䘃舂㘃","ƻ膾ƶƛ膺膸ƻ膾膽Ƶ膼ƿƶƛ膽ƺ膼膵膵膣膕ƔƖ",-365155395>(
                     0<"JNT",309746032,"藨蕨葸薸藈蕸蛈耨聸耘肨","縂舂ฃ阃爃긃騂鈃舃阃爃樃ꘃ戃瘃긃騂樃踃戃ꨃꨃ娃ꨂ똂먂눂渂樃踃戃ꨃꨃ娃ꨂ鸂똂쨂","ƻ膾ƶƛ膺膸ƻ膾膽Ƶ膼ƿƶƛ膽ƺ膼膵膵膣膕ƔƖ",-365155394>(
                        1<"JNT",-1526705086,"靹鵹镹ꍹ鍹襹\u2d79㵹⭹ㅹ","\uf714輔ܕ\uf716켔꼔\uf714輔鼔᜕演뜔ܕ\uf716鼔윔演ἕἕ缔\u1f17\uef16༗","âÚς˒˺ʂÊʺ˚˒˺̪ʲ̒̚ʂÊ̪˂̚ʪʪ͊ª¢\u0082j",1420015657>(
                           1<"JNT",-1526705086,"靹鵹镹ꍹ鍹襹\u2d79㝹㵹⭹","\uf714輔ܕ\uf716켔꼔\uf714輔鼔᜕演뜔ܕ\uf716鼔윔演ἕἕ缔\u1f17\uef16\ue716","âÚς˒˺ʂÊʺ˚˒˺̪ʲ̒̚ʂÊ̪˂̚ʪʪ͊ª\u009azj",1420015710>(
                              1<"JNT",-1526705086,"ꍹ꽹","✕⼕","âÚς˒˺ʂÊʺ˚˒˺̪ʲ̒̚ʂÊ̪˂̚ʪʪ͊ª\u009a¢j",1420015711>(this)
                           )
                        )
                     ),
                     true
                  );
                  1<"JNT",1284316227,"饹뭹酹","✕⼕","âÚͲ",1420016114>(this, true);
                  1<"JNT",1284316227,"띹ꥹꝹ","✕⼕","âÚͲ",1420016125>(this, true);
                  break;
               case 383720296:
                  if (1<"JNT",-1526705086,"饹뭹酹","✕⼕","âÚͲ",1420016022>(this)) {
                     1<"JNT",1284316227,"饹뭹酹","✕⼕","âÚͲ",1420016097>(this, false);
                     0<"JNT",-592855333,"藨蕨葸薸藈蕸蛈耨聸耨聘","縂ฃ阃爃긃騂鈃舃阃爃樃ꘃ戃瘃긃騂樃踃戃ꨃꨃ娃ꨂ똂먂눂渂樃踃戃ꨃꨃ娃ꨂ鸂똂쨂䘃舂㘃","ƻ膾ƶƛ膺膸ƻ膾膽Ƶ膼ƿƶƛ膽ƺ膼膵膵膣膕ƔƖ",-365155406>(
                        0<"JNT",309746032,"藨蕨葸薸藈蕸蛈耨聸耘肨","縂舂ฃ阃爃긃騂鈃舃阃爃樃ꘃ戃瘃긃騂樃踃戃ꨃꨃ娃ꨂ똂먂눂渂樃踃戃ꨃꨃ娃ꨂ鸂똂쨂","ƻ膾ƶƛ膺膸ƻ膾膽Ƶ膼ƿƶƛ膽ƺ膼膵膵膣膕ƔƖ",-365155445>(
                           1<"JNT",-1526705086,"靹鵹镹ꍹ鍹襹\u2d79㵹⭹ㅹ","\uf714輔ܕ\uf716켔꼔\uf714輔鼔᜕演뜔ܕ\uf716鼔윔演ἕἕ缔\u1f17\uef16༗","âÚς˒˺ʂÊʺ˚˒˺̪ʲ̒̚ʂÊ̪˂̚ʪʪ͊ª¢\u0082j",1420015658>(
                              1<"JNT",-1526705086,"靹鵹镹ꍹ鍹襹\u2d79㝹㵹⭹","\uf714輔ܕ\uf716켔꼔\uf714輔鼔᜕演뜔ܕ\uf716鼔윔演ἕἕ缔\u1f17\uef16\ue716","âÚς˒˺ʂÊʺ˚˒˺̪ʲ̒̚ʂÊ̪˂̚ʪʪ͊ª\u009azj",1420016123>(
                                 1<"JNT",-1526705086,"ꍹ꽹","✕⼕","âÚς˒˺ʂÊʺ˚˒˺̪ʲ̒̚ʂÊ̪˂̚ʪʪ͊ª\u009a¢j",1420016120>(this)
                              )
                           )
                        ),
                        false
                     );
                     return;
                  }

                  var3 = -1529730160;
                  continue;
               case 1062484176:
               default:
                  if (!0<"JNT",309746032,"藨蕨葸薸藈蕸蛈耘聸肸耘肸","縂舂䘃","ƻ膾ƶƛ膺膸ƻ膾膽Ƶ膼ƿƶƛ膽ƺ膼膵膵膣膗ƖƗ",-365180415>(
                     1<"JNT",-1526705086,"靹鵹镹ꍹ鍹襹\u2d79㥹⽹㍹","\uf714輔ܕ\uf716켔꼔\uf714輔鼔᜕演뜔ܕ\uf716鼔윔演ἕἕ缔\u1f17\uef16\ue716","âÚς˒˺ʂÊʺ˚˒˺̪ʲ̒̚ʂÊ̪˂̚ʪʪ͊\u008a\u0082\u0092j",1420016124>(
                        1<"JNT",-1526705086,"ꍹ꽹","✕⼕","âÚς˒˺ʂÊʺ˚˒˺̪ʲ̒̚ʂÊ̪˂̚ʪʪ͊ª\u009a¢j",1420016101>(this)
                     )
                  )) {
                     var3 = -1392387049;
                     continue;
                  }

                  0<"JNT",-592855333,"藨蕨葸薸藈蕸蛈耨聸耨聘","縂ฃ阃爃긃騂鈃舃阃爃樃ꘃ戃瘃긃騂樃踃戃ꨃꨃ娃ꨂ똂먂눂渂樃踃戃ꨃꨃ娃ꨂ鸂똂쨂䘃舂㘃","ƻ膾ƶƛ膺膸ƻ膾膽Ƶ膼ƿƶƛ膽ƺ膼膵膵膣膕ƔƖ",-365180412>(
                     0<"JNT",309746032,"藨蕨葸薸藈蕸蛈耨聸耘肨","縂舂ฃ阃爃긃騂鈃舃阃爃樃ꘃ戃瘃긃騂樃踃戃ꨃꨃ娃ꨂ똂먂눂渂樃踃戃ꨃꨃ娃ꨂ鸂똂쨂","ƻ膾ƶƛ膺膸ƻ膾膽Ƶ膼ƿƶƛ膽ƺ膼膵膵膣膕ƔƖ",-365180387>(
                        1<"JNT",-1526705086,"靹鵹镹ꍹ鍹襹\u2d79㵹⭹ㅹ","\uf714輔ܕ\uf716켔꼔\uf714輔鼔᜕演뜔ܕ\uf716鼔윔演ἕἕ缔\u1f17\uef16༗","âÚς˒˺ʂÊʺ˚˒˺̪ʲ̒̚ʂÊ̪˂̚ʪʪ͊ª¢\u0082j",1420016064>(
                           1<"JNT",-1526705086,"靹鵹镹ꍹ鍹襹\u2d79㝹㵹⭹","\uf714輔ܕ\uf716켔꼔\uf714輔鼔᜕演뜔ܕ\uf716鼔윔演ἕἕ缔\u1f17\uef16\ue716","âÚς˒˺ʂÊʺ˚˒˺̪ʲ̒̚ʂÊ̪˂̚ʪʪ͊ª\u009azj",1420016073>(
                              1<"JNT",-1526705086,"ꍹ꽹","✕⼕","âÚς˒˺ʂÊʺ˚˒˺̪ʲ̒̚ʂÊ̪˂̚ʪʪ͊ª\u009a¢j",1420016126>(this)
                           )
                        )
                     ),
                     true
                  );
                  1<"JNT",1284316227,"饹뭹酹","✕⼕","âÚͲ",1420015645>(this, true);
                  break;
               case 1906845433:
                  return;
            }

            var3 = (736687420 * -1814511271 | 201362155) & -1890546961;
         }
      }
   }

   // $VF: renamed from: lrl (Class_256) void
   @Class_21
   public void method_1443(Class_256 var1) {
      class_1799 var2 = 0<"JNT",309746032,"藨蕨葸薸藈蕸蛈聘耸聸聈","縂舂ฃ阃爃긃騂鈃舃阃爃樃ꘃ戃瘃긃騂樃踃戃ꨃꨃ娃ꈂ먂숂숂쨂","ƻ膾ƶƛ膺膸ƻ膾膽Ƶ膼ƿƶƛ膽ƺ膼膵膵膣膗ƖƗ",-365180397>(
         1<"JNT",-1526705086,"靹鵹镹ꍹ鍹襹\u2d79㥹⽹㍹","\uf714輔ܕ\uf716켔꼔\uf714輔鼔᜕演뜔ܕ\uf716鼔윔演ἕἕ缔\u1f17\uef16\ue716","âÚς˒˺ʂÊʺ˚˒˺̪ʲ̒̚ʂÊ̪˂̚ʪʪ͊\u008a\u0082\u0092j",1420015714>(
            1<"JNT",-1526705086,"ꍹ꽹","✕⼕","âÚς˒˺ʂÊʺ˚˒˺̪ʲ̒̚ʂÊ̪˂̚ʪʪ͊ª\u009a¢j",1420015635>(this)
         )
      );
      if (0<"JNT",309746032,"蕨萨葨蔨藸萈","縂ฃ蘃戃똃戃騂踃戃阃稃騂ᨃ昃蘃爃樃긃쨂舂䘃","ƹ膼Ʒ膼ƛƺ膼ƻ膿ƛ膫ƽƹ膾膽ƶ",-365180416>(
            0<"JNT",309746032,"藨蕨葸薸藈蕸蛈聈肨耸肨","縂舂ฃ阃爃긃騂鈃舃阃爃樃ꘃ戃瘃긃騂樃踃戃ꨃꨃ娃ꈂ먂숂ꘂ쨂","ƻ膾ƶƛ膺膸ƻ膾膽Ƶ膼ƿƶƛ膽ƺ膼膵膵膣膔膗膐膐",-365180422>(var2),
            1<"JNT",1380431716,"靹鵹镹ꍹ鍹襹㭹㝹ㅹ㵹","\uf714輔ܕ\uf716켔꼔\uf714輔鼔᜕演뜔ܕ\uf716鼔윔演ἕἕ缔\uef16✗\ue716\u1717","âÚς˒˺ʂÊʺ˚˒˺̪ʲ̒̚ʂÊ̪˂̚ʪʪ͊\u009a\u008aZ²j",1420015751>()
         )
         && 0<"JNT",309746032,"藨蕨葸薸藈蕸蛈耈耨聨聈聸","縂ฃ阃爃긃騂鈃舃阃爃樃ꘃ戃瘃긃騂樃踃戃ꨃꨃ娃ꈂ먂숂ꘂ쨂舂䘃","ƻ膾ƶƛ膺膸ƻ膾膽Ƶ膼ƿƶƛ膽ƺ膼膵膵膣膔膗膐膐",-365180446>(
            0<"JNT",309746032,"藨蕨葸薸藈蕸蛈聘耨耨肸","縂ฃ阃爃긃騂鈃舃阃爃樃ꘃ戃瘃긃騂樃踃戃ꨃꨃ娃ꈂꨂ鸂긂쨂舂ฃ阃爃긃騂鈃舃阃爃樃ꘃ戃瘃긃騂樃踃戃ꨃꨃ娃ꈂ먂숂숂쨂","ƻ膾ƶƛ膺膸ƻ膾膽Ƶ膼ƿƶƛ膽ƺ膼膵膵膣膗ƖƗ",-365180420>(
               1<"JNT",-1526705086,"靹鵹镹ꍹ鍹襹\u2d79㥹⽹㍹","\uf714輔ܕ\uf716켔꼔\uf714輔鼔᜕演뜔ܕ\uf716鼔윔演ἕἕ缔\u1f17\uef16\ue716","âÚς˒˺ʂÊʺ˚˒˺̪ʲ̒̚ʂÊ̪˂̚ʪʪ͊\u008a\u0082\u0092j",1420015720>(
                  1<"JNT",-1526705086,"ꍹ꽹","✕⼕","âÚς˒˺ʂÊʺ˚˒˺̪ʲ̒̚ʂÊ̪˂̚ʪʪ͊ª\u009a¢j",1420015633>(this)
               ),
               1<"JNT",1380431716,"靹鵹镹ꍹ鍹襹㝹\u2d79㥹㍹","\uf714輔ܕ\uf716켔꼔\uf714輔鼔᜕演뜔ܕ\uf716鼔윔演ἕἕ缔\uef16\u1f17\ue716ܗ","âÚς˒˺ʂÊʺ˚˒˺̪ʲ̒̚ʂÊ̪˂̚ʪʪ͊\u009aª¢\u0082j",1420015723>()
            ),
            1<"JNT",1380431716,"靹鵹镹ꍹ鍹襹㭹㭹ㅹㅹ","\uf714輔ܕ\uf716켔꼔\uf714輔鼔᜕演뜔ܕ\uf716鼔윔演ἕἕ缔\uef16✗\ue716\u1717","âÚς˒˺ʂÊʺ˚˒˺̪ʲ̒̚ʂÊ̪˂̚ʪʪ͊\u009a\u008aZ²j",1420015749>()
         )
         && !0<"JNT",309746032,"藨蕨葸薸藈蕸蛈聘耨耘肸","縂舂䘃","ƻ膾ƶƛ膺膸ƻ膾膽Ƶ膼ƿƶƛ膽ƺ膼膵膵膣膗ƖƗ",-365180441>(
            1<"JNT",-1526705086,"靹鵹镹ꍹ鍹襹\u2d79㥹⽹㍹","\uf714輔ܕ\uf716켔꼔\uf714輔鼔᜕演뜔ܕ\uf716鼔윔演ἕἕ缔\u1f17\uef16\ue716","âÚς˒˺ʂÊʺ˚˒˺̪ʲ̒̚ʂÊ̪˂̚ʪʪ͊\u008a\u0082\u0092j",1420015774>(
               1<"JNT",-1526705086,"ꍹ꽹","✕⼕","âÚς˒˺ʂÊʺ˚˒˺̪ʲ̒̚ʂÊ̪˂̚ʪʪ͊ª\u009a¢j",1420015775>(this)
            )
         )) {
         1<"JNT",1284316227,"ꭹ酹","✕⼕","âÚͲ",1420015712>(this, true);
      }
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1413(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = (var10 - 1995789524 + 536021708 + 940085063 ^ 954151149) - 875882302 - 1006231532 ^ 825252446 ^ 470054980 ^ 2060975184;
      MethodHandle var10000 = field_1567[(
            (var10 - 1995789524 + 536021708 + 940085063 ^ 954151149) - 875882302 - 1006231532 ^ 825252446 ^ 470054980 ^ 2060975184
         )
         + 728914274];
      if (field_1567[var10001 + 728914274] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = (1131145654 & -1846779251 << 1131145654 | 0) & 881532343;
            var23 < var13.length();
            var23 += (1119573252 * -1361388130 | 1) & -360447867
         ) {
            int var42 = var13.charAt(var23);
            int var10004 = (var42 & 57344) >> 13;
            int var43 = (var42 & 57344) >> 13 | var42 << 3;
            int var101 = (((var42 & 57344) >> 13 | var42 << 3) & 65534) >> 1;
            var42 = (((var10004 | var42 << 3) & 65534) >> 1 | ((var42 & 57344) >> 13 | var42 << 3) << 15) - 18;
            var10004 = ((var101 | var43 << 15) - 18 & 65520) >> 4;
            int var45 = (((var101 | var43 << 15) - 18 & 65520) >> 4 | var42 << 12) ^ 205;
            int var103 = (((((var101 | var43 << 15) - 18 & 65520) >> 4 | var42 << 12) ^ 205) & 49152) >> 14;
            var42 = (((var10004 | var42 << 12) ^ 205) & 49152) >> 14 | ((((var101 | var43 << 15) - 18 & 65520) >> 4 | var42 << 12) ^ 205) << 2;
            var10004 = ((var103 | var45 << 2) & 65532) >> 2;
            int var47 = ((var103 | var45 << 2) & 65532) >> 2 | var42 << 14;
            int var105 = ((((var103 | var45 << 2) & 65532) >> 2 | var42 << 14) & 63488) >> 11;
            var42 = ((var10004 | var42 << 14) & 63488) >> 11 | (((var103 | var45 << 2) & 65532) >> 2 | var42 << 14) << 5;
            var10004 = ((var105 | var47 << 5) & 65408) >> 7;
            int var49 = ((var105 | var47 << 5) & 65408) >> 7 | var42 << 9;
            int var107 = ((((var105 | var47 << 5) & 65408) >> 7 | var42 << 9) & 65535) >> 0;
            char var50 = (char)(((var10004 | var42 << 9) & 65535) >> 0 | (((var105 | var47 << 5) & 65408) >> 7 | var42 << 9) << 16);
            var13.setCharAt(var23, (char)(var107 | var49 << 16));
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = -2050049793 ^ 107037783 ^ -2085618520; var29 < var16.length(); var29 += 549820011 >>> -1025445884 ^ 34363751) {
            int var55 = var16.charAt(var29);
            int var108 = (var55 & 65504) >> 5;
            int var56 = ((var55 & 65504) >> 5 | var55 << 11) - 101 ^ 11;
            int var109 = ((((var55 & 65504) >> 5 | var55 << 11) - 101 ^ 11) & 32768) >> 15;
            var55 = (((var108 | var55 << 11) - 101 ^ 11) & 32768) >> 15 | (((var55 & 65504) >> 5 | var55 << 11) - 101 ^ 11) << 1;
            var108 = ((var109 | var56 << 1) & 65024) >> 9;
            int var58 = ((var109 | var56 << 1) & 65024) >> 9 | var55 << 7;
            int var111 = ((((var109 | var56 << 1) & 65024) >> 9 | var55 << 7) & 63488) >> 11;
            var55 = ((var108 | var55 << 7) & 63488) >> 11 | (((var109 | var56 << 1) & 65024) >> 9 | var55 << 7) << 5;
            var108 = ((var111 | var58 << 5) & 57344) >> 13;
            int var60 = ((var111 | var58 << 5) & 57344) >> 13 | var55 << 3;
            int var113 = ((((var111 | var58 << 5) & 57344) >> 13 | var55 << 3) & 65504) >> 5;
            char var61 = (char)((((var108 | var55 << 3) & 65504) >> 5 | (((var111 | var58 << 5) & 57344) >> 13 | var55 << 3) << 11) - 146 + 30);
            var16.setCharAt(var29, (char)((var113 | var60 << 11) - 146 + 30));
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_398.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = -639410295 >>> 1516454550 ^ 871; var35 < var19.length(); var35 += (95294674 - (-690223707 - 722150384) | 1) & -2145368959) {
            int var66 = var19.charAt(var35);
            int var114 = (var66 & 32768) >> 15;
            int var67 = (var66 & 32768) >> 15 | var66 << 1;
            int var115 = (((var66 & 32768) >> 15 | var66 << 1) & 64512) >> 10;
            var66 = ((var114 | var66 << 1) & 64512) >> 10 | ((var66 & 32768) >> 15 | var66 << 1) << 6;
            var114 = ((var115 | var67 << 6) & 65532) >> 2;
            int var69 = ((var115 | var67 << 6) & 65532) >> 2 | var66 << 14;
            int var117 = ((((var115 | var67 << 6) & 65532) >> 2 | var66 << 14) & 65472) >> 6;
            var66 = ((var114 | var66 << 14) & 65472) >> 6 | (((var115 | var67 << 6) & 65532) >> 2 | var66 << 14) << 10;
            var114 = ((var117 | var69 << 10) & 65534) >> 1;
            int var71 = ((((var117 | var69 << 10) & 65534) >> 1 | var66 << 15) ^ 188) - 155 + 123 ^ 191;
            int var119 = ((((((var117 | var69 << 10) & 65534) >> 1 | var66 << 15) ^ 188) - 155 + 123 ^ 191) & 57344) >> 13;
            char var72 = (char)(
               ((((var114 | var66 << 15) ^ 188) - 155 + 123 ^ 191) & 57344) >> 13
                  | (((((var117 | var69 << 10) & 65534) >> 1 | var66 << 15) ^ 188) - 155 + 123 ^ 191) << 3
            );
            var19.setCharAt(var35, (char)(var119 | var71 << 3));
         }

         Class var7 = Class.forName(var19.toString(), false, Class_398.class.getClassLoader());
         switch ((var4 + 1695442944 + 457733683 + 1635494274 ^ 289321547) - 1876983530 - 1071824034 + 425924309 + 2059239213 + 882049313 + 1873175936) {
            case 686141510:
            case 1846350981:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 937014770:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            case 1443916249:
               var10000 = var0.findConstructor(var7, var6);
               break;
            case 1529830624:
               var10000 = var0.findSpecial(var7, var5, var6, Class_398.class);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_1567[((var10 - 1995789524 + 536021708 + 940085063 ^ 954151149) - 875882302 - 1006231532 ^ 825252446 ^ 470054980 ^ 2060975184) + 728914274] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1414(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = (((var10 ^ 1638724394) + 723749967 - 1175441177 + 1875250639 ^ 1670056908) - 39847277 ^ 1742786343) - 1498727467 ^ 1187326770;
      MethodHandle var10000 = field_1567[(((var10 ^ 1638724394) + 723749967 - 1175441177 + 1875250639 ^ 1670056908) - 39847277 ^ 1742786343) - 1498727467
         ^ 1187326770
         ^ 1883977850];
      if (field_1567[var10001 ^ 1883977850] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = -1110696357 ^ -612415448 ^ 1723029107; var24 < var14.length(); var24 += (-331365748 & 229366606 | 1) & -1034933791) {
            int var43 = var14.charAt(var24) ^ 170;
            char var48 = (char)(
               (
                     (
                              (
                                       (
                                                (
                                                      (
                                                               (
                                                                     (((var43 & 63488) >> 11 | var43 << 5) & 65520) >> 4
                                                                        | ((var43 & 63488) >> 11 | var43 << 5) << 12
                                                                  )
                                                                  & 65024
                                                            )
                                                            >> 9
                                                         | ((((var43 & 63488) >> 11 | var43 << 5) & 65520) >> 4 | ((var43 & 63488) >> 11 | var43 << 5) << 12)
                                                            << 7
                                                   )
                                                   & 61440
                                             )
                                             >> 12
                                          | (
                                                (((((var43 & 63488) >> 11 | var43 << 5) & 65520) >> 4 | ((var43 & 63488) >> 11 | var43 << 5) << 12) & 65024)
                                                      >> 9
                                                   | ((((var43 & 63488) >> 11 | var43 << 5) & 65520) >> 4 | ((var43 & 63488) >> 11 | var43 << 5) << 12) << 7
                                             )
                                             << 4
                                    )
                                    - 118
                                    - 7
                                 & 65504
                           )
                           >> 5
                        | (
                                 (
                                          (
                                                (((((var43 & 63488) >> 11 | var43 << 5) & 65520) >> 4 | ((var43 & 63488) >> 11 | var43 << 5) << 12) & 65024)
                                                      >> 9
                                                   | ((((var43 & 63488) >> 11 | var43 << 5) & 65520) >> 4 | ((var43 & 63488) >> 11 | var43 << 5) << 12) << 7
                                             )
                                             & 61440
                                       )
                                       >> 12
                                    | (
                                          (((((var43 & 63488) >> 11 | var43 << 5) & 65520) >> 4 | ((var43 & 63488) >> 11 | var43 << 5) << 12) & 65024) >> 9
                                             | ((((var43 & 63488) >> 11 | var43 << 5) & 65520) >> 4 | ((var43 & 63488) >> 11 | var43 << 5) << 12) << 7
                                       )
                                       << 4
                              )
                              - 118
                              - 7
                           << 11
                  )
                  - 253
                  - 101
            );
            var14.setCharAt(
               var24,
               (char)(
                  (
                        (
                                 (
                                          (
                                                   (
                                                         (
                                                                  (
                                                                        (((var43 & 63488) >> 11 | var43 << 5) & 65520) >> 4
                                                                           | ((var43 & 63488) >> 11 | var43 << 5) << 12
                                                                     )
                                                                     & 65024
                                                               )
                                                               >> 9
                                                            | ((((var43 & 63488) >> 11 | var43 << 5) & 65520) >> 4 | ((var43 & 63488) >> 11 | var43 << 5) << 12)
                                                               << 7
                                                      )
                                                      & 61440
                                                )
                                                >> 12
                                             | (
                                                   (((((var43 & 63488) >> 11 | var43 << 5) & 65520) >> 4 | ((var43 & 63488) >> 11 | var43 << 5) << 12) & 65024)
                                                         >> 9
                                                      | ((((var43 & 63488) >> 11 | var43 << 5) & 65520) >> 4 | ((var43 & 63488) >> 11 | var43 << 5) << 12) << 7
                                                )
                                                << 4
                                       )
                                       - 118
                                       - 7
                                    & 65504
                              )
                              >> 5
                           | (
                                    (
                                             (
                                                   (((((var43 & 63488) >> 11 | var43 << 5) & 65520) >> 4 | ((var43 & 63488) >> 11 | var43 << 5) << 12) & 65024)
                                                         >> 9
                                                      | ((((var43 & 63488) >> 11 | var43 << 5) & 65520) >> 4 | ((var43 & 63488) >> 11 | var43 << 5) << 12) << 7
                                                )
                                                & 61440
                                          )
                                          >> 12
                                       | (
                                             (((((var43 & 63488) >> 11 | var43 << 5) & 65520) >> 4 | ((var43 & 63488) >> 11 | var43 << 5) << 12) & 65024) >> 9
                                                | ((((var43 & 63488) >> 11 | var43 << 5) & 65520) >> 4 | ((var43 & 63488) >> 11 | var43 << 5) << 12) << 7
                                          )
                                          << 4
                                 )
                                 - 118
                                 - 7
                              << 11
                     )
                     - 253
                     - 101
               )
            );
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = 1222061639 + 1222061639 ^ -1850844018; var30 < var17.length(); var30 += (251901104 | 251901104 | 1) & 1352665097) {
            char var53 = var17.charAt(var30);
            char var58 = (char)(
               (
                        (
                                 (
                                          (
                                                (
                                                         (
                                                                  (
                                                                        (((var53 & '쀀') >> 14 | var53 << 2) - 93 & 61440) >> 12
                                                                           | ((var53 & '쀀') >> 14 | var53 << 2) - 93 << 4
                                                                     )
                                                                     ^ 133
                                                               )
                                                               + 162
                                                               + 77
                                                            & 61440
                                                      )
                                                      >> 12
                                                   | (
                                                            (
                                                                  (((var53 & '쀀') >> 14 | var53 << 2) - 93 & 61440) >> 12
                                                                     | ((var53 & '쀀') >> 14 | var53 << 2) - 93 << 4
                                                               )
                                                               ^ 133
                                                         )
                                                         + 162
                                                         + 77
                                                      << 4
                                             )
                                             & 65535
                                       )
                                       >> 0
                                    | (
                                          (
                                                   (
                                                            (
                                                                  (((var53 & '쀀') >> 14 | var53 << 2) - 93 & 61440) >> 12
                                                                     | ((var53 & '쀀') >> 14 | var53 << 2) - 93 << 4
                                                               )
                                                               ^ 133
                                                         )
                                                         + 162
                                                         + 77
                                                      & 61440
                                                )
                                                >> 12
                                             | (((((var53 & '쀀') >> 14 | var53 << 2) - 93 & 61440) >> 12 | ((var53 & '쀀') >> 14 | var53 << 2) - 93 << 4) ^ 133)
                                                   + 162
                                                   + 77
                                                << 4
                                       )
                                       << 16
                              )
                              + 68
                           & 65504
                     )
                     >> 5
                  | (
                           (
                                    (
                                          (
                                                   (
                                                            (
                                                                  (((var53 & '쀀') >> 14 | var53 << 2) - 93 & 61440) >> 12
                                                                     | ((var53 & '쀀') >> 14 | var53 << 2) - 93 << 4
                                                               )
                                                               ^ 133
                                                         )
                                                         + 162
                                                         + 77
                                                      & 61440
                                                )
                                                >> 12
                                             | (((((var53 & '쀀') >> 14 | var53 << 2) - 93 & 61440) >> 12 | ((var53 & '쀀') >> 14 | var53 << 2) - 93 << 4) ^ 133)
                                                   + 162
                                                   + 77
                                                << 4
                                       )
                                       & 65535
                                 )
                                 >> 0
                              | (
                                    (
                                             (((((var53 & '쀀') >> 14 | var53 << 2) - 93 & 61440) >> 12 | ((var53 & '쀀') >> 14 | var53 << 2) - 93 << 4) ^ 133)
                                                   + 162
                                                   + 77
                                                & 61440
                                          )
                                          >> 12
                                       | (((((var53 & '쀀') >> 14 | var53 << 2) - 93 & 61440) >> 12 | ((var53 & '쀀') >> 14 | var53 << 2) - 93 << 4) ^ 133)
                                             + 162
                                             + 77
                                          << 4
                                 )
                                 << 16
                        )
                        + 68
                     << 11
            );
            var17.setCharAt(
               var30,
               (char)(
                  (
                           (
                                    (
                                             (
                                                   (
                                                            (
                                                                     (
                                                                           (((var53 & '쀀') >> 14 | var53 << 2) - 93 & 61440) >> 12
                                                                              | ((var53 & '쀀') >> 14 | var53 << 2) - 93 << 4
                                                                        )
                                                                        ^ 133
                                                                  )
                                                                  + 162
                                                                  + 77
                                                               & 61440
                                                         )
                                                         >> 12
                                                      | (
                                                               (
                                                                     (((var53 & '쀀') >> 14 | var53 << 2) - 93 & 61440) >> 12
                                                                        | ((var53 & '쀀') >> 14 | var53 << 2) - 93 << 4
                                                                  )
                                                                  ^ 133
                                                            )
                                                            + 162
                                                            + 77
                                                         << 4
                                                )
                                                & 65535
                                          )
                                          >> 0
                                       | (
                                             (
                                                      (
                                                               (
                                                                     (((var53 & '쀀') >> 14 | var53 << 2) - 93 & 61440) >> 12
                                                                        | ((var53 & '쀀') >> 14 | var53 << 2) - 93 << 4
                                                                  )
                                                                  ^ 133
                                                            )
                                                            + 162
                                                            + 77
                                                         & 61440
                                                   )
                                                   >> 12
                                                | (
                                                         (
                                                               (((var53 & '쀀') >> 14 | var53 << 2) - 93 & 61440) >> 12
                                                                  | ((var53 & '쀀') >> 14 | var53 << 2) - 93 << 4
                                                            )
                                                            ^ 133
                                                      )
                                                      + 162
                                                      + 77
                                                   << 4
                                          )
                                          << 16
                                 )
                                 + 68
                              & 65504
                        )
                        >> 5
                     | (
                              (
                                       (
                                             (
                                                      (
                                                               (
                                                                     (((var53 & '쀀') >> 14 | var53 << 2) - 93 & 61440) >> 12
                                                                        | ((var53 & '쀀') >> 14 | var53 << 2) - 93 << 4
                                                                  )
                                                                  ^ 133
                                                            )
                                                            + 162
                                                            + 77
                                                         & 61440
                                                   )
                                                   >> 12
                                                | (
                                                         (
                                                               (((var53 & '쀀') >> 14 | var53 << 2) - 93 & 61440) >> 12
                                                                  | ((var53 & '쀀') >> 14 | var53 << 2) - 93 << 4
                                                            )
                                                            ^ 133
                                                      )
                                                      + 162
                                                      + 77
                                                   << 4
                                          )
                                          & 65535
                                    )
                                    >> 0
                                 | (
                                       (
                                                (((((var53 & '쀀') >> 14 | var53 << 2) - 93 & 61440) >> 12 | ((var53 & '쀀') >> 14 | var53 << 2) - 93 << 4) ^ 133)
                                                      + 162
                                                      + 77
                                                   & 61440
                                             )
                                             >> 12
                                          | (((((var53 & '쀀') >> 14 | var53 << 2) - 93 & 61440) >> 12 | ((var53 & '쀀') >> 14 | var53 << 2) - 93 << 4) ^ 133)
                                                + 162
                                                + 77
                                             << 4
                                    )
                                    << 16
                           )
                           + 68
                        << 11
               )
            );
         }

         Class var6 = Class.forName(var17.toString(), false, Class_398.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = 719130002 ^ 864313993 << 864313993 ^ 572006290; var36 < var20.length(); var36 += (2090801695 + 1394563220 | 0) & 536970249) {
            int var63 = var20.charAt(var36) - 16;
            char var68 = (char)(
               (
                     (
                              (
                                    (
                                             (
                                                   (
                                                            (
                                                                  (
                                                                        (((var63 & 0) >> 16 | var63 << 0) + 213 - 254 & 0) >> 16
                                                                           | ((var63 & 0) >> 16 | var63 << 0) + 213 - 254 << 0
                                                                     )
                                                                     ^ 161
                                                               )
                                                               & 65504
                                                         )
                                                         >> 5
                                                      | (
                                                            (
                                                                  (((var63 & 0) >> 16 | var63 << 0) + 213 - 254 & 0) >> 16
                                                                     | ((var63 & 0) >> 16 | var63 << 0) + 213 - 254 << 0
                                                               )
                                                               ^ 161
                                                         )
                                                         << 11
                                                )
                                                & 65535
                                          )
                                          >> 0
                                       | (
                                             (
                                                      (
                                                            (
                                                                  (((var63 & 0) >> 16 | var63 << 0) + 213 - 254 & 0) >> 16
                                                                     | ((var63 & 0) >> 16 | var63 << 0) + 213 - 254 << 0
                                                               )
                                                               ^ 161
                                                         )
                                                         & 65504
                                                   )
                                                   >> 5
                                                | (
                                                      (
                                                            (((var63 & 0) >> 16 | var63 << 0) + 213 - 254 & 0) >> 16
                                                               | ((var63 & 0) >> 16 | var63 << 0) + 213 - 254 << 0
                                                         )
                                                         ^ 161
                                                   )
                                                   << 11
                                          )
                                          << 16
                                 )
                                 & 49152
                           )
                           >> 14
                        | (
                              (
                                       (
                                             (
                                                      (
                                                            (
                                                                  (((var63 & 0) >> 16 | var63 << 0) + 213 - 254 & 0) >> 16
                                                                     | ((var63 & 0) >> 16 | var63 << 0) + 213 - 254 << 0
                                                               )
                                                               ^ 161
                                                         )
                                                         & 65504
                                                   )
                                                   >> 5
                                                | (
                                                      (
                                                            (((var63 & 0) >> 16 | var63 << 0) + 213 - 254 & 0) >> 16
                                                               | ((var63 & 0) >> 16 | var63 << 0) + 213 - 254 << 0
                                                         )
                                                         ^ 161
                                                   )
                                                   << 11
                                          )
                                          & 65535
                                    )
                                    >> 0
                                 | (
                                       (
                                                (
                                                      (
                                                            (((var63 & 0) >> 16 | var63 << 0) + 213 - 254 & 0) >> 16
                                                               | ((var63 & 0) >> 16 | var63 << 0) + 213 - 254 << 0
                                                         )
                                                         ^ 161
                                                   )
                                                   & 65504
                                             )
                                             >> 5
                                          | (
                                                ((((var63 & 0) >> 16 | var63 << 0) + 213 - 254 & 0) >> 16 | ((var63 & 0) >> 16 | var63 << 0) + 213 - 254 << 0)
                                                   ^ 161
                                             )
                                             << 11
                                    )
                                    << 16
                           )
                           << 2
                  )
                  ^ 41
            );
            var20.setCharAt(
               var36,
               (char)(
                  (
                        (
                                 (
                                       (
                                                (
                                                      (
                                                               (
                                                                     (
                                                                           (((var63 & 0) >> 16 | var63 << 0) + 213 - 254 & 0) >> 16
                                                                              | ((var63 & 0) >> 16 | var63 << 0) + 213 - 254 << 0
                                                                        )
                                                                        ^ 161
                                                                  )
                                                                  & 65504
                                                            )
                                                            >> 5
                                                         | (
                                                               (
                                                                     (((var63 & 0) >> 16 | var63 << 0) + 213 - 254 & 0) >> 16
                                                                        | ((var63 & 0) >> 16 | var63 << 0) + 213 - 254 << 0
                                                                  )
                                                                  ^ 161
                                                            )
                                                            << 11
                                                   )
                                                   & 65535
                                             )
                                             >> 0
                                          | (
                                                (
                                                         (
                                                               (
                                                                     (((var63 & 0) >> 16 | var63 << 0) + 213 - 254 & 0) >> 16
                                                                        | ((var63 & 0) >> 16 | var63 << 0) + 213 - 254 << 0
                                                                  )
                                                                  ^ 161
                                                            )
                                                            & 65504
                                                      )
                                                      >> 5
                                                   | (
                                                         (
                                                               (((var63 & 0) >> 16 | var63 << 0) + 213 - 254 & 0) >> 16
                                                                  | ((var63 & 0) >> 16 | var63 << 0) + 213 - 254 << 0
                                                            )
                                                            ^ 161
                                                      )
                                                      << 11
                                             )
                                             << 16
                                    )
                                    & 49152
                              )
                              >> 14
                           | (
                                 (
                                          (
                                                (
                                                         (
                                                               (
                                                                     (((var63 & 0) >> 16 | var63 << 0) + 213 - 254 & 0) >> 16
                                                                        | ((var63 & 0) >> 16 | var63 << 0) + 213 - 254 << 0
                                                                  )
                                                                  ^ 161
                                                            )
                                                            & 65504
                                                      )
                                                      >> 5
                                                   | (
                                                         (
                                                               (((var63 & 0) >> 16 | var63 << 0) + 213 - 254 & 0) >> 16
                                                                  | ((var63 & 0) >> 16 | var63 << 0) + 213 - 254 << 0
                                                            )
                                                            ^ 161
                                                      )
                                                      << 11
                                             )
                                             & 65535
                                       )
                                       >> 0
                                    | (
                                          (
                                                   (
                                                         (
                                                               (((var63 & 0) >> 16 | var63 << 0) + 213 - 254 & 0) >> 16
                                                                  | ((var63 & 0) >> 16 | var63 << 0) + 213 - 254 << 0
                                                            )
                                                            ^ 161
                                                      )
                                                      & 65504
                                                )
                                                >> 5
                                             | (
                                                   (
                                                         (((var63 & 0) >> 16 | var63 << 0) + 213 - 254 & 0) >> 16
                                                            | ((var63 & 0) >> 16 | var63 << 0) + 213 - 254 << 0
                                                      )
                                                      ^ 161
                                                )
                                                << 11
                                       )
                                       << 16
                              )
                              << 2
                     )
                     ^ 41
               )
            );
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_398.class.getClassLoader()).returnType();
         switch ((((var4 - 1831938478 ^ 9038108 ^ 431475259) + 1108206683 ^ 1575237572) - 588025510 - 1299533131 - 391674711 ^ 863018943) + 1984800765) {
            case 209569082:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            case 968173572:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            case 1591114332:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            case 1964727611:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_1567[(((var10 ^ 1638724394) + 723749967 - 1175441177 + 1875250639 ^ 1670056908) - 39847277 ^ 1742786343) - 1498727467 ^ 1187326770 ^ 1883977850] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
