import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;

public class Class_163 extends Class_342 {
   // $VF: renamed from: jai java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_2075 = new MethodHandle[20];

   public Class_163() {
      int var10001 = (1550272984 & -459766112 | 0) & -1323778948;

      StringBuilder var10002;
      for (var10002 = (StringBuilder)0<"JNT",-1824028920,"ī脱Ⅎ脱\ue132䄬","惓\ue0d6⃛ÜꃑÜ䃒\ue0daÜꃚ䃛䃒생\ue0d1⃚Ûꃚ䃛샨Óꃝ","窈廙窎廙穪窉廙窊惘穪塚窍窌慎窊惘穴揄慎窉窅徭窌",-965359245>(
            "֘،ؔװ\u0604\u061c"
         );
         var10001 < ((991611040 << 991611040 | 6) & -2136919201);
         var10001 += -264417325 ^ -264417326
      ) {
         char var6 = 0<"JNT",-208473812,"섰愱脰ꄲꄬ\ue132","惓×Ó샗","窈廙窎廙穪窉廙窊惘穪塚窍窌慎窊惘穴揄慎窉窅徭窌",-965359289>(var10002, var10001);
         int var10005 = (var6 & '\uffff') >> 0;
         int var7 = ((var6 & '\uffff') >> 0 | var6 << 16) - 240;
         int var17 = (((var6 & '\uffff') >> 0 | var6 << 16) - 240 & 65532) >> 2;
         var6 = (char)((((var10005 | var6 << 16) - 240 & 65532) >> 2 | ((var6 & '\uffff') >> 0 | var6 << 16) - 240 << 14) - 132 - 83);
         0<"JNT",-208473812,"섲ı\ue132\ue12c愱脰ꄲꄬ\ue132","惓×샗Óꃝ","窈廙窎廙穪窉廙窊惘穪塚窍窌慎窊惘穴揄慎窉窅徭窌",-965359248>(
            var10002, var10001, (char)((var17 | var7 << 14) - 132 - 83)
         );
      }

      String var2 = 0<"JNT",-208473812,"\ue132䄲\ue12e\ue132ꄲ脱Ⅎ䄱","惓Ó\ue0d6⃛ÜꃑÜ䃒\ue0daÜꃚ䃛䃒생\ue0d1⃚Ûꃚ䃛샨","窈廙窎廙穪窉廙窊惘穪塚窍窌慎窊惘穴揄慎窉窅徭窌",-965359287>(var10002);
      int var4 = 0;

      StringBuilder var10;
      for (var10 = (StringBuilder)0<"JNT",-1824028920,"ī脱Ⅎ脱\ue132䄬","惓\ue0d6⃛ÜꃑÜ䃒\ue0daÜꃚ䃛䃒생\ue0d1⃚Ûꃚ䃛샨Óꃝ","窈廙窎廙穪窉廙窊惘穪塚窍窌慎窊惘穴揄慎窉窅徭窌",-965359294>(
            "ᙺݺૺɺۺ\u0a7a⳺˺ࣺ౺˺⳺౺ɺ˺ݺٺ౺˺ࡺൺ౺ۺۺz⳺պӺ\u05faࡺߺ˺պ⳺௺ݺ\u05fa⳺zݺɺ"
         );
         var4 < ((-506224115 ^ 1086674103 | 33) & 241764713);
         var4 += (-67505294 << -67505294 | 1) & 840257367
      ) {
         int var14 = 0<"JNT",-208473812,"섰愱脰ꄲꄬ\ue132","惓×Ó샗","窈廙窎廙穪窉廙窊惘穪塚窍窌慎窊惘穴揄慎窉窅徭窌",-965359253>(var10, var4) + 234 + 156;
         char var15 = (char)(((var14 & 65408) >> 7 | var14 << 9) ^ 114 ^ 15);
         0<"JNT",-208473812,"섲ı\ue132\ue12c愱脰ꄲꄬ\ue132","惓×샗Óꃝ","窈廙窎廙穪窉廙窊惘穪塚窍窌慎窊惘穴揄慎窉窅徭窌",-965359292>(
            var10, var4, (char)(((var14 & 65408) >> 7 | var14 << 9) ^ 114 ^ 15)
         );
      }

      super(
         var2,
         0<"JNT",-208473812,"\ue132䄲\ue12e\ue132ꄲ脱Ⅎ䄱","惓Ó\ue0d6⃛ÜꃑÜ䃒\ue0daÜꃚ䃛䃒생\ue0d1⃚Ûꃚ䃛샨","窈廙窎廙穪窉廙窊惘穪塚窍窌慎窊惘穴揄慎窉窅徭窌",-965359291>(var10),
         -1,
         1<"JNT",783173136,"銛ኞ튟","⠞萟","\u001c\u0014ϼʔɌ\u0084",2136604565>()
      );
   }

   // $VF: renamed from: mg () void
   @Override
   public void method_1407() {
      0<"JNT",1091302478,"Ĳ䄱","惓Óꃝ","揄戴窆",-965359348>(this);
   }

   // $VF: renamed from: q () void
   @Override
   public void method_1408() {
      0<"JNT",1091302478,"脲","惓Óꃝ","揄戴窆",-965359247>(this);
   }

   // $VF: renamed from: gd (Class_207) void
   @Class_21
   public void method_1781(Class_207 var1) {
      int var2 = -1620206844;
      if (1<"JNT",1238350476,"力ኜኛ튜튚銙\u128e銏劎튎","琞頟尞琟砞栞琞頟耟䐞蠟鐟尞琟耟簞蠟䀞䀞뀟䀟䠟氟","\u001c\u0014ϼˬȴʼä˴ȔˬȴɄˌɔȬʼäɄ˼ɔ˄˄ɤ¤¼¬\u0084",2136604592>(
            1<"JNT",1238350476,"튜办","怞簞","\u001c\u0014ϼˬȴʼä˴ȔˬȴɄˌɔȬʼäɄ˼ɔ˄˄ɤÄÔÜ\u0084",2136604593>(this)
         )
         != null) {
         var2 = -152115471 & 1539945824;

         while (true) {
            switch (((var2 + 1913772935 ^ 998811523) - 1753141241 + 1146224954 ^ 1706901810) + 2049210285) {
               case -72522983:
               default:
                  return;
               case 952090692:
            }

            if (1<"JNT",1238350476,"力ኜኛ튜튚銙劏劎\u128f튍","琞頟尞琟砞栞琞頟耟䐞蠟鐟尞琟耟簞蠟䀞䀞뀟借尟吟","\u001c\u0014̬",2136604573>(
                  1<"JNT",1238350476,"力ኜኛ튜튚銙\u128e銏劎튎","琞頟尞琟砞栞琞頟耟䐞蠟鐟尞琟耟簞蠟䀞䀞뀟䀟䠟氟","\u001c\u0014ϼˬȴʼä˴ȔˬȴɄˌɔȬʼäɄ˼ɔ˄˄ɤ¤¼¬\u0084",2136604566>(
                     1<"JNT",1238350476,"튜办","怞簞","\u001c\u0014ϼˬȴʼä˴ȔˬȴɄˌɔȬʼäɄ˼ɔ˄˄ɤÄÔÜ\u0084",2136604575>(this)
                  )
               )
               > 0.0F) {
               0<"JNT",-208473812,"Ĳı\ue132愱䄲\ue130䄰섪\ue12aĪ脫ꄪ","惓⃝Óꃝ","窊徭窍穪憎慎窊徭彩窌廙窆窍穪彩窉廙戴戴廒𤋮穫穭",-965359342>(
                  1<"JNT",1238350476,"力ኜኛ튜튚銙\u128e튏劏銏","琞頟尞琟砞栞琞頟耟䐞蠟鐟尞琟耟簞蠟䀞䀞뀟䀟䠟堟","\u001c\u0014ϼˬȴʼä˴ȔˬȴɄˌɔȬʼäɄ˼ɔ˄˄ɤÄÜ¼\u0084",2136604578>(
                     1<"JNT",1238350476,"力ኜኛ튜튚銙\u128e劏ነ튍","琞頟尞琟砞栞琞頟耟䐞蠟鐟尞琟耟簞蠟䀞䀞뀟䀟䠟氟","\u001c\u0014ϼˬȴʼä˴ȔˬȴɄˌɔȬʼäɄ˼ɔ˄˄ɤÄÔ´\u0084",2136604571>(
                        1<"JNT",1238350476,"튜办","怞簞","\u001c\u0014ϼˬȴʼä˴ȔˬȴɄˌɔȬʼäɄ˼ɔ˄˄ɤÄÔÜ\u0084",2136604572>(this)
                     )
                  ),
                  true
               );
            }

            var2 = -1042742505;
         }
      }
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1413(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = (((var10 ^ 519680078) - 1320087004 - 938463289 + 1619340949 + 1052035195 ^ 1880336742) - 608941413 ^ 339124654) + 1301270738;
      MethodHandle var10000 = field_2075[(((var10 ^ 519680078) - 1320087004 - 938463289 + 1619340949 + 1052035195 ^ 1880336742) - 608941413 ^ 339124654)
         + 1301270738
         + 1771137759];
      if (field_2075[var10001 + 1771137759] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = (-1804654655 & 158626669 | 0) & 1267878054; var23 < var13.length(); var23 += (891551589 << 301409823 | 1) & 1869693639) {
            int var42 = var13.charAt(var23) - 'u' - 208 + 22;
            char var45 = (char)(
               (
                     (((((var42 & 65528) >> 3 | var42 << 13) & 57344) >> 13 | ((var42 & 65528) >> 3 | var42 << 13) << 3) & 57344) >> 13
                        | ((((var42 & 65528) >> 3 | var42 << 13) & 57344) >> 13 | ((var42 & 65528) >> 3 | var42 << 13) << 3) << 3
                  )
                  + 6
                  + 11
                  + 69
                  - 1
            );
            var13.setCharAt(
               var23,
               (char)(
                  (
                        (((((var42 & 65528) >> 3 | var42 << 13) & 57344) >> 13 | ((var42 & 65528) >> 3 | var42 << 13) << 3) & 57344) >> 13
                           | ((((var42 & 65528) >> 3 | var42 << 13) & 57344) >> 13 | ((var42 & 65528) >> 3 | var42 << 13) << 3) << 3
                     )
                     + 6
                     + 11
                     + 69
                     - 1
               )
            );
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = 1089142331 + 929598078 ^ 2018740409; var29 < var16.length(); var29 += 605586028 << -961793335 ^ 822401025) {
            int var50 = (var16.charAt(var29) ^ 'H') - 138;
            char var53 = (char)(
               (
                     (
                           (((((var50 & 65534) >> 1 | var50 << 15) + 151 - 155 & 32768) >> 15 | ((var50 & 65534) >> 1 | var50 << 15) + 151 - 155 << 1) & 57344)
                                 >> 13
                              | ((((var50 & 65534) >> 1 | var50 << 15) + 151 - 155 & 32768) >> 15 | ((var50 & 65534) >> 1 | var50 << 15) + 151 - 155 << 1) << 3
                        )
                        ^ 216
                        ^ 134
                  )
                  + 19
            );
            var16.setCharAt(
               var29,
               (char)(
                  (
                        (
                              (
                                       (
                                             (((var50 & 65534) >> 1 | var50 << 15) + 151 - 155 & 32768) >> 15
                                                | ((var50 & 65534) >> 1 | var50 << 15) + 151 - 155 << 1
                                          )
                                          & 57344
                                    )
                                    >> 13
                                 | ((((var50 & 65534) >> 1 | var50 << 15) + 151 - 155 & 32768) >> 15 | ((var50 & 65534) >> 1 | var50 << 15) + 151 - 155 << 1)
                                    << 3
                           )
                           ^ 216
                           ^ 134
                     )
                     + 19
               )
            );
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_163.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = (1831868448 >>> -283235528 | 0) & 657714448; var35 < var19.length(); var35 += (1904656824 | 1904656824) ^ 1904656825) {
            char var58 = var19.charAt(var35);
            char var65 = (char)(
               (
                        (
                                 (
                                          (
                                                   (
                                                            (
                                                                  (
                                                                           (
                                                                                    (
                                                                                             (
                                                                                                   (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                                      | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                                                )
                                                                                                & 65504
                                                                                          )
                                                                                          >> 5
                                                                                       | (
                                                                                             (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                                | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                                          )
                                                                                          << 11
                                                                                 )
                                                                                 + 23
                                                                              & 65534
                                                                        )
                                                                        >> 1
                                                                     | (
                                                                              (
                                                                                       (
                                                                                             (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                                | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                                          )
                                                                                          & 65504
                                                                                    )
                                                                                    >> 5
                                                                                 | (
                                                                                       (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                          | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                                    )
                                                                                    << 11
                                                                           )
                                                                           + 23
                                                                        << 15
                                                               )
                                                               & 32768
                                                         )
                                                         >> 15
                                                      | (
                                                            (
                                                                     (
                                                                              (
                                                                                       (
                                                                                             (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                                | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                                          )
                                                                                          & 65504
                                                                                    )
                                                                                    >> 5
                                                                                 | (
                                                                                       (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                          | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                                    )
                                                                                    << 11
                                                                           )
                                                                           + 23
                                                                        & 65534
                                                                  )
                                                                  >> 1
                                                               | (
                                                                        (
                                                                                 (
                                                                                       (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                          | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                                    )
                                                                                    & 65504
                                                                              )
                                                                              >> 5
                                                                           | (
                                                                                 (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                    | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                              )
                                                                              << 11
                                                                     )
                                                                     + 23
                                                                  << 15
                                                         )
                                                         << 1
                                                )
                                                + 68
                                             & 64512
                                       )
                                       >> 10
                                    | (
                                             (
                                                      (
                                                            (
                                                                     (
                                                                              (
                                                                                       (
                                                                                             (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                                | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                                          )
                                                                                          & 65504
                                                                                    )
                                                                                    >> 5
                                                                                 | (
                                                                                       (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                          | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                                    )
                                                                                    << 11
                                                                           )
                                                                           + 23
                                                                        & 65534
                                                                  )
                                                                  >> 1
                                                               | (
                                                                        (
                                                                                 (
                                                                                       (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                          | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                                    )
                                                                                    & 65504
                                                                              )
                                                                              >> 5
                                                                           | (
                                                                                 (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                    | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                              )
                                                                              << 11
                                                                     )
                                                                     + 23
                                                                  << 15
                                                         )
                                                         & 32768
                                                   )
                                                   >> 15
                                                | (
                                                      (
                                                               (
                                                                        (
                                                                                 (
                                                                                       (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                          | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                                    )
                                                                                    & 65504
                                                                              )
                                                                              >> 5
                                                                           | (
                                                                                 (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                    | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                              )
                                                                              << 11
                                                                     )
                                                                     + 23
                                                                  & 65534
                                                            )
                                                            >> 1
                                                         | (
                                                                  (
                                                                           (
                                                                                 (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                    | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                              )
                                                                              & 65504
                                                                        )
                                                                        >> 5
                                                                     | (
                                                                           (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                              | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                        )
                                                                        << 11
                                                               )
                                                               + 23
                                                            << 15
                                                   )
                                                   << 1
                                          )
                                          + 68
                                       << 6
                              )
                              - 14
                           & 65534
                     )
                     >> 1
                  | (
                           (
                                    (
                                             (
                                                      (
                                                            (
                                                                     (
                                                                              (
                                                                                       (
                                                                                             (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                                | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                                          )
                                                                                          & 65504
                                                                                    )
                                                                                    >> 5
                                                                                 | (
                                                                                       (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                          | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                                    )
                                                                                    << 11
                                                                           )
                                                                           + 23
                                                                        & 65534
                                                                  )
                                                                  >> 1
                                                               | (
                                                                        (
                                                                                 (
                                                                                       (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                          | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                                    )
                                                                                    & 65504
                                                                              )
                                                                              >> 5
                                                                           | (
                                                                                 (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                    | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                              )
                                                                              << 11
                                                                     )
                                                                     + 23
                                                                  << 15
                                                         )
                                                         & 32768
                                                   )
                                                   >> 15
                                                | (
                                                      (
                                                               (
                                                                        (
                                                                                 (
                                                                                       (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                          | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                                    )
                                                                                    & 65504
                                                                              )
                                                                              >> 5
                                                                           | (
                                                                                 (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                    | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                              )
                                                                              << 11
                                                                     )
                                                                     + 23
                                                                  & 65534
                                                            )
                                                            >> 1
                                                         | (
                                                                  (
                                                                           (
                                                                                 (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                    | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                              )
                                                                              & 65504
                                                                        )
                                                                        >> 5
                                                                     | (
                                                                           (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                              | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                        )
                                                                        << 11
                                                               )
                                                               + 23
                                                            << 15
                                                   )
                                                   << 1
                                          )
                                          + 68
                                       & 64512
                                 )
                                 >> 10
                              | (
                                       (
                                                (
                                                      (
                                                               (
                                                                        (
                                                                                 (
                                                                                       (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                          | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                                    )
                                                                                    & 65504
                                                                              )
                                                                              >> 5
                                                                           | (
                                                                                 (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                    | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                              )
                                                                              << 11
                                                                     )
                                                                     + 23
                                                                  & 65534
                                                            )
                                                            >> 1
                                                         | (
                                                                  (
                                                                           (
                                                                                 (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                    | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                              )
                                                                              & 65504
                                                                        )
                                                                        >> 5
                                                                     | (
                                                                           (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                              | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                        )
                                                                        << 11
                                                               )
                                                               + 23
                                                            << 15
                                                   )
                                                   & 32768
                                             )
                                             >> 15
                                          | (
                                                (
                                                         (
                                                                  (
                                                                           (
                                                                                 (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                    | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                              )
                                                                              & 65504
                                                                        )
                                                                        >> 5
                                                                     | (
                                                                           (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                              | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                        )
                                                                        << 11
                                                               )
                                                               + 23
                                                            & 65534
                                                      )
                                                      >> 1
                                                   | (
                                                            (
                                                                     (
                                                                           (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                              | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                        )
                                                                        & 65504
                                                                  )
                                                                  >> 5
                                                               | ((((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1 | ((var58 & '쀀') >> 14 | var58 << 2) << 15)
                                                                  << 11
                                                         )
                                                         + 23
                                                      << 15
                                             )
                                             << 1
                                    )
                                    + 68
                                 << 6
                        )
                        - 14
                     << 15
            );
            var19.setCharAt(
               var35,
               (char)(
                  (
                           (
                                    (
                                             (
                                                      (
                                                               (
                                                                     (
                                                                              (
                                                                                       (
                                                                                                (
                                                                                                      (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                                         | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                                                   )
                                                                                                   & 65504
                                                                                             )
                                                                                             >> 5
                                                                                          | (
                                                                                                (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                                   | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                                             )
                                                                                             << 11
                                                                                    )
                                                                                    + 23
                                                                                 & 65534
                                                                           )
                                                                           >> 1
                                                                        | (
                                                                                 (
                                                                                          (
                                                                                                (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                                   | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                                             )
                                                                                             & 65504
                                                                                       )
                                                                                       >> 5
                                                                                    | (
                                                                                          (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                             | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                                       )
                                                                                       << 11
                                                                              )
                                                                              + 23
                                                                           << 15
                                                                  )
                                                                  & 32768
                                                            )
                                                            >> 15
                                                         | (
                                                               (
                                                                        (
                                                                                 (
                                                                                          (
                                                                                                (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                                   | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                                             )
                                                                                             & 65504
                                                                                       )
                                                                                       >> 5
                                                                                    | (
                                                                                          (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                             | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                                       )
                                                                                       << 11
                                                                              )
                                                                              + 23
                                                                           & 65534
                                                                     )
                                                                     >> 1
                                                                  | (
                                                                           (
                                                                                    (
                                                                                          (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                             | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                                       )
                                                                                       & 65504
                                                                                 )
                                                                                 >> 5
                                                                              | (
                                                                                    (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                       | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                                 )
                                                                                 << 11
                                                                        )
                                                                        + 23
                                                                     << 15
                                                            )
                                                            << 1
                                                   )
                                                   + 68
                                                & 64512
                                          )
                                          >> 10
                                       | (
                                                (
                                                         (
                                                               (
                                                                        (
                                                                                 (
                                                                                          (
                                                                                                (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                                   | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                                             )
                                                                                             & 65504
                                                                                       )
                                                                                       >> 5
                                                                                    | (
                                                                                          (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                             | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                                       )
                                                                                       << 11
                                                                              )
                                                                              + 23
                                                                           & 65534
                                                                     )
                                                                     >> 1
                                                                  | (
                                                                           (
                                                                                    (
                                                                                          (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                             | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                                       )
                                                                                       & 65504
                                                                                 )
                                                                                 >> 5
                                                                              | (
                                                                                    (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                       | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                                 )
                                                                                 << 11
                                                                        )
                                                                        + 23
                                                                     << 15
                                                            )
                                                            & 32768
                                                      )
                                                      >> 15
                                                   | (
                                                         (
                                                                  (
                                                                           (
                                                                                    (
                                                                                          (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                             | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                                       )
                                                                                       & 65504
                                                                                 )
                                                                                 >> 5
                                                                              | (
                                                                                    (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                       | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                                 )
                                                                                 << 11
                                                                        )
                                                                        + 23
                                                                     & 65534
                                                               )
                                                               >> 1
                                                            | (
                                                                     (
                                                                              (
                                                                                    (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                       | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                                 )
                                                                                 & 65504
                                                                           )
                                                                           >> 5
                                                                        | (
                                                                              (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                 | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                           )
                                                                           << 11
                                                                  )
                                                                  + 23
                                                               << 15
                                                      )
                                                      << 1
                                             )
                                             + 68
                                          << 6
                                 )
                                 - 14
                              & 65534
                        )
                        >> 1
                     | (
                              (
                                       (
                                                (
                                                         (
                                                               (
                                                                        (
                                                                                 (
                                                                                          (
                                                                                                (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                                   | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                                             )
                                                                                             & 65504
                                                                                       )
                                                                                       >> 5
                                                                                    | (
                                                                                          (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                             | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                                       )
                                                                                       << 11
                                                                              )
                                                                              + 23
                                                                           & 65534
                                                                     )
                                                                     >> 1
                                                                  | (
                                                                           (
                                                                                    (
                                                                                          (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                             | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                                       )
                                                                                       & 65504
                                                                                 )
                                                                                 >> 5
                                                                              | (
                                                                                    (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                       | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                                 )
                                                                                 << 11
                                                                        )
                                                                        + 23
                                                                     << 15
                                                            )
                                                            & 32768
                                                      )
                                                      >> 15
                                                   | (
                                                         (
                                                                  (
                                                                           (
                                                                                    (
                                                                                          (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                             | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                                       )
                                                                                       & 65504
                                                                                 )
                                                                                 >> 5
                                                                              | (
                                                                                    (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                       | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                                 )
                                                                                 << 11
                                                                        )
                                                                        + 23
                                                                     & 65534
                                                               )
                                                               >> 1
                                                            | (
                                                                     (
                                                                              (
                                                                                    (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                       | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                                 )
                                                                                 & 65504
                                                                           )
                                                                           >> 5
                                                                        | (
                                                                              (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                 | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                           )
                                                                           << 11
                                                                  )
                                                                  + 23
                                                               << 15
                                                      )
                                                      << 1
                                             )
                                             + 68
                                          & 64512
                                    )
                                    >> 10
                                 | (
                                          (
                                                   (
                                                         (
                                                                  (
                                                                           (
                                                                                    (
                                                                                          (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                             | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                                       )
                                                                                       & 65504
                                                                                 )
                                                                                 >> 5
                                                                              | (
                                                                                    (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                       | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                                 )
                                                                                 << 11
                                                                        )
                                                                        + 23
                                                                     & 65534
                                                               )
                                                               >> 1
                                                            | (
                                                                     (
                                                                              (
                                                                                    (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                       | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                                 )
                                                                                 & 65504
                                                                           )
                                                                           >> 5
                                                                        | (
                                                                              (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                 | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                           )
                                                                           << 11
                                                                  )
                                                                  + 23
                                                               << 15
                                                      )
                                                      & 32768
                                                )
                                                >> 15
                                             | (
                                                   (
                                                            (
                                                                     (
                                                                              (
                                                                                    (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                       | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                                 )
                                                                                 & 65504
                                                                           )
                                                                           >> 5
                                                                        | (
                                                                              (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                 | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                           )
                                                                           << 11
                                                                  )
                                                                  + 23
                                                               & 65534
                                                         )
                                                         >> 1
                                                      | (
                                                               (
                                                                        (
                                                                              (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                                 | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                           )
                                                                           & 65504
                                                                     )
                                                                     >> 5
                                                                  | (
                                                                        (((var58 & '쀀') >> 14 | var58 << 2) & 65534) >> 1
                                                                           | ((var58 & '쀀') >> 14 | var58 << 2) << 15
                                                                     )
                                                                     << 11
                                                            )
                                                            + 23
                                                         << 15
                                                )
                                                << 1
                                       )
                                       + 68
                                    << 6
                           )
                           - 14
                        << 15
               )
            );
         }

         Class var7 = Class.forName(var19.toString(), false, Class_163.class.getClassLoader());
         switch ((((var4 ^ 55623343) - 445996010 ^ 1424706826) - 518949784 ^ 1500272260 ^ 155069437) - 1778830385 - 988492842 + 110150514 - 1268991235) {
            case 437117744:
               var10000 = var0.findSpecial(var7, var5, var6, Class_163.class);
               break;
            case 539681271:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            case 1233571222:
            case 1519596941:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 1747580538:
               var10000 = var0.findConstructor(var7, var6);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_2075[(((var10 ^ 519680078) - 1320087004 - 938463289 + 1619340949 + 1052035195 ^ 1880336742) - 608941413 ^ 339124654) + 1301270738 + 1771137759] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1414(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = (((var10 - 927282323 ^ 302076068) + 2014272260 - 552872675 ^ 698793548 ^ 559038680) - 932912414 ^ 125467479) - 1877417480;
      MethodHandle var10000 = field_2075[(((var10 - 927282323 ^ 302076068) + 2014272260 - 552872675 ^ 698793548 ^ 559038680) - 932912414 ^ 125467479)
         - 1877417480
         - 359417171];
      if (field_2075[var10001 - 359417171] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = -89580321 ^ -89580321 ^ 0; var24 < var14.length(); var24 += 1182877441 * -1217592268 ^ 1238069301) {
            int var43 = var14.charAt(var24) - 211;
            char var50 = (char)(
               (
                        (
                              (
                                       (
                                                (
                                                         (
                                                               (
                                                                        (
                                                                                 (
                                                                                          (
                                                                                                (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                                                   | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                                             )
                                                                                             & 57344
                                                                                       )
                                                                                       >> 13
                                                                                    | (
                                                                                          (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                                             | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                                       )
                                                                                       << 3
                                                                              )
                                                                              + 145
                                                                           & 65024
                                                                     )
                                                                     >> 9
                                                                  | (
                                                                           (
                                                                                    (
                                                                                          (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                                             | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                                       )
                                                                                       & 57344
                                                                                 )
                                                                                 >> 13
                                                                              | (
                                                                                    (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                                       | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                                 )
                                                                                 << 3
                                                                        )
                                                                        + 145
                                                                     << 7
                                                            )
                                                            & 65532
                                                      )
                                                      >> 2
                                                   | (
                                                         (
                                                                  (
                                                                           (
                                                                                    (
                                                                                          (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                                             | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                                       )
                                                                                       & 57344
                                                                                 )
                                                                                 >> 13
                                                                              | (
                                                                                    (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                                       | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                                 )
                                                                                 << 3
                                                                        )
                                                                        + 145
                                                                     & 65024
                                                               )
                                                               >> 9
                                                            | (
                                                                     (
                                                                              (
                                                                                    (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                                       | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                                 )
                                                                                 & 57344
                                                                           )
                                                                           >> 13
                                                                        | (
                                                                              (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                                 | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                           )
                                                                           << 3
                                                                  )
                                                                  + 145
                                                               << 7
                                                      )
                                                      << 14
                                             )
                                             + 197
                                          & 65408
                                    )
                                    >> 7
                                 | (
                                          (
                                                   (
                                                         (
                                                                  (
                                                                           (
                                                                                    (
                                                                                          (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                                             | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                                       )
                                                                                       & 57344
                                                                                 )
                                                                                 >> 13
                                                                              | (
                                                                                    (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                                       | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                                 )
                                                                                 << 3
                                                                        )
                                                                        + 145
                                                                     & 65024
                                                               )
                                                               >> 9
                                                            | (
                                                                     (
                                                                              (
                                                                                    (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                                       | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                                 )
                                                                                 & 57344
                                                                           )
                                                                           >> 13
                                                                        | (
                                                                              (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                                 | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                           )
                                                                           << 3
                                                                  )
                                                                  + 145
                                                               << 7
                                                      )
                                                      & 65532
                                                )
                                                >> 2
                                             | (
                                                   (
                                                            (
                                                                     (
                                                                              (
                                                                                    (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                                       | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                                 )
                                                                                 & 57344
                                                                           )
                                                                           >> 13
                                                                        | (
                                                                              (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                                 | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                           )
                                                                           << 3
                                                                  )
                                                                  + 145
                                                               & 65024
                                                         )
                                                         >> 9
                                                      | (
                                                               (
                                                                        (
                                                                              (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                                 | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                           )
                                                                           & 57344
                                                                     )
                                                                     >> 13
                                                                  | (
                                                                        (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                           | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                     )
                                                                     << 3
                                                            )
                                                            + 145
                                                         << 7
                                                )
                                                << 14
                                       )
                                       + 197
                                    << 9
                           )
                           & 65528
                     )
                     >> 3
                  | (
                        (
                                 (
                                          (
                                                   (
                                                         (
                                                                  (
                                                                           (
                                                                                    (
                                                                                          (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                                             | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                                       )
                                                                                       & 57344
                                                                                 )
                                                                                 >> 13
                                                                              | (
                                                                                    (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                                       | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                                 )
                                                                                 << 3
                                                                        )
                                                                        + 145
                                                                     & 65024
                                                               )
                                                               >> 9
                                                            | (
                                                                     (
                                                                              (
                                                                                    (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                                       | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                                 )
                                                                                 & 57344
                                                                           )
                                                                           >> 13
                                                                        | (
                                                                              (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                                 | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                           )
                                                                           << 3
                                                                  )
                                                                  + 145
                                                               << 7
                                                      )
                                                      & 65532
                                                )
                                                >> 2
                                             | (
                                                   (
                                                            (
                                                                     (
                                                                              (
                                                                                    (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                                       | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                                 )
                                                                                 & 57344
                                                                           )
                                                                           >> 13
                                                                        | (
                                                                              (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                                 | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                           )
                                                                           << 3
                                                                  )
                                                                  + 145
                                                               & 65024
                                                         )
                                                         >> 9
                                                      | (
                                                               (
                                                                        (
                                                                              (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                                 | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                           )
                                                                           & 57344
                                                                     )
                                                                     >> 13
                                                                  | (
                                                                        (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                           | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                     )
                                                                     << 3
                                                            )
                                                            + 145
                                                         << 7
                                                )
                                                << 14
                                       )
                                       + 197
                                    & 65408
                              )
                              >> 7
                           | (
                                    (
                                             (
                                                   (
                                                            (
                                                                     (
                                                                              (
                                                                                    (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                                       | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                                 )
                                                                                 & 57344
                                                                           )
                                                                           >> 13
                                                                        | (
                                                                              (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                                 | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                           )
                                                                           << 3
                                                                  )
                                                                  + 145
                                                               & 65024
                                                         )
                                                         >> 9
                                                      | (
                                                               (
                                                                        (
                                                                              (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                                 | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                           )
                                                                           & 57344
                                                                     )
                                                                     >> 13
                                                                  | (
                                                                        (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                           | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                     )
                                                                     << 3
                                                            )
                                                            + 145
                                                         << 7
                                                )
                                                & 65532
                                          )
                                          >> 2
                                       | (
                                             (
                                                      (
                                                               (
                                                                        (
                                                                              (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                                 | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                           )
                                                                           & 57344
                                                                     )
                                                                     >> 13
                                                                  | (
                                                                        (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                           | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                     )
                                                                     << 3
                                                            )
                                                            + 145
                                                         & 65024
                                                   )
                                                   >> 9
                                                | (
                                                         (
                                                                  (
                                                                        (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                           | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                     )
                                                                     & 57344
                                                               )
                                                               >> 13
                                                            | ((((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3 | ((var43 & 65024) >> 9 | var43 << 7) << 13)
                                                               << 3
                                                      )
                                                      + 145
                                                   << 7
                                          )
                                          << 14
                                 )
                                 + 197
                              << 9
                     )
                     << 13
            );
            var14.setCharAt(
               var24,
               (char)(
                  (
                           (
                                 (
                                          (
                                                   (
                                                            (
                                                                  (
                                                                           (
                                                                                    (
                                                                                             (
                                                                                                   (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                                                      | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                                                )
                                                                                                & 57344
                                                                                          )
                                                                                          >> 13
                                                                                       | (
                                                                                             (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                                                | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                                          )
                                                                                          << 3
                                                                                 )
                                                                                 + 145
                                                                              & 65024
                                                                        )
                                                                        >> 9
                                                                     | (
                                                                              (
                                                                                       (
                                                                                             (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                                                | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                                          )
                                                                                          & 57344
                                                                                    )
                                                                                    >> 13
                                                                                 | (
                                                                                       (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                                          | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                                    )
                                                                                    << 3
                                                                           )
                                                                           + 145
                                                                        << 7
                                                               )
                                                               & 65532
                                                         )
                                                         >> 2
                                                      | (
                                                            (
                                                                     (
                                                                              (
                                                                                       (
                                                                                             (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                                                | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                                          )
                                                                                          & 57344
                                                                                    )
                                                                                    >> 13
                                                                                 | (
                                                                                       (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                                          | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                                    )
                                                                                    << 3
                                                                           )
                                                                           + 145
                                                                        & 65024
                                                                  )
                                                                  >> 9
                                                               | (
                                                                        (
                                                                                 (
                                                                                       (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                                          | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                                    )
                                                                                    & 57344
                                                                              )
                                                                              >> 13
                                                                           | (
                                                                                 (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                                    | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                              )
                                                                              << 3
                                                                     )
                                                                     + 145
                                                                  << 7
                                                         )
                                                         << 14
                                                )
                                                + 197
                                             & 65408
                                       )
                                       >> 7
                                    | (
                                             (
                                                      (
                                                            (
                                                                     (
                                                                              (
                                                                                       (
                                                                                             (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                                                | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                                          )
                                                                                          & 57344
                                                                                    )
                                                                                    >> 13
                                                                                 | (
                                                                                       (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                                          | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                                    )
                                                                                    << 3
                                                                           )
                                                                           + 145
                                                                        & 65024
                                                                  )
                                                                  >> 9
                                                               | (
                                                                        (
                                                                                 (
                                                                                       (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                                          | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                                    )
                                                                                    & 57344
                                                                              )
                                                                              >> 13
                                                                           | (
                                                                                 (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                                    | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                              )
                                                                              << 3
                                                                     )
                                                                     + 145
                                                                  << 7
                                                         )
                                                         & 65532
                                                   )
                                                   >> 2
                                                | (
                                                      (
                                                               (
                                                                        (
                                                                                 (
                                                                                       (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                                          | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                                    )
                                                                                    & 57344
                                                                              )
                                                                              >> 13
                                                                           | (
                                                                                 (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                                    | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                              )
                                                                              << 3
                                                                     )
                                                                     + 145
                                                                  & 65024
                                                            )
                                                            >> 9
                                                         | (
                                                                  (
                                                                           (
                                                                                 (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                                    | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                              )
                                                                              & 57344
                                                                        )
                                                                        >> 13
                                                                     | (
                                                                           (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                              | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                        )
                                                                        << 3
                                                               )
                                                               + 145
                                                            << 7
                                                   )
                                                   << 14
                                          )
                                          + 197
                                       << 9
                              )
                              & 65528
                        )
                        >> 3
                     | (
                           (
                                    (
                                             (
                                                      (
                                                            (
                                                                     (
                                                                              (
                                                                                       (
                                                                                             (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                                                | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                                          )
                                                                                          & 57344
                                                                                    )
                                                                                    >> 13
                                                                                 | (
                                                                                       (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                                          | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                                    )
                                                                                    << 3
                                                                           )
                                                                           + 145
                                                                        & 65024
                                                                  )
                                                                  >> 9
                                                               | (
                                                                        (
                                                                                 (
                                                                                       (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                                          | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                                    )
                                                                                    & 57344
                                                                              )
                                                                              >> 13
                                                                           | (
                                                                                 (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                                    | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                              )
                                                                              << 3
                                                                     )
                                                                     + 145
                                                                  << 7
                                                         )
                                                         & 65532
                                                   )
                                                   >> 2
                                                | (
                                                      (
                                                               (
                                                                        (
                                                                                 (
                                                                                       (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                                          | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                                    )
                                                                                    & 57344
                                                                              )
                                                                              >> 13
                                                                           | (
                                                                                 (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                                    | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                              )
                                                                              << 3
                                                                     )
                                                                     + 145
                                                                  & 65024
                                                            )
                                                            >> 9
                                                         | (
                                                                  (
                                                                           (
                                                                                 (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                                    | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                              )
                                                                              & 57344
                                                                        )
                                                                        >> 13
                                                                     | (
                                                                           (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                              | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                        )
                                                                        << 3
                                                               )
                                                               + 145
                                                            << 7
                                                   )
                                                   << 14
                                          )
                                          + 197
                                       & 65408
                                 )
                                 >> 7
                              | (
                                       (
                                                (
                                                      (
                                                               (
                                                                        (
                                                                                 (
                                                                                       (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                                          | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                                    )
                                                                                    & 57344
                                                                              )
                                                                              >> 13
                                                                           | (
                                                                                 (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                                    | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                              )
                                                                              << 3
                                                                     )
                                                                     + 145
                                                                  & 65024
                                                            )
                                                            >> 9
                                                         | (
                                                                  (
                                                                           (
                                                                                 (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                                    | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                              )
                                                                              & 57344
                                                                        )
                                                                        >> 13
                                                                     | (
                                                                           (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                              | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                        )
                                                                        << 3
                                                               )
                                                               + 145
                                                            << 7
                                                   )
                                                   & 65532
                                             )
                                             >> 2
                                          | (
                                                (
                                                         (
                                                                  (
                                                                           (
                                                                                 (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                                    | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                              )
                                                                              & 57344
                                                                        )
                                                                        >> 13
                                                                     | (
                                                                           (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                              | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                        )
                                                                        << 3
                                                               )
                                                               + 145
                                                            & 65024
                                                      )
                                                      >> 9
                                                   | (
                                                            (
                                                                     (
                                                                           (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                              | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                        )
                                                                        & 57344
                                                                  )
                                                                  >> 13
                                                               | (
                                                                     (((var43 & 65024) >> 9 | var43 << 7) & 65528) >> 3
                                                                        | ((var43 & 65024) >> 9 | var43 << 7) << 13
                                                                  )
                                                                  << 3
                                                         )
                                                         + 145
                                                      << 7
                                             )
                                             << 14
                                    )
                                    + 197
                                 << 9
                        )
                        << 13
               )
            );
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = -162117517 << 1590586677 * 601351391 ^ -1304193024;
            var30 < var17.length();
            var30 += -1710289175 << (-1799223309 ^ -1710289175 & -1799223309) ^ 1000603649
         ) {
            int var55 = var17.charAt(var30);
            int var102 = (var55 & 65408) >> 7;
            int var56 = (var55 & 65408) >> 7 | var55 << 9;
            int var103 = (((var55 & 65408) >> 7 | var55 << 9) & 65528) >> 3;
            var55 = ((var102 | var55 << 9) & 65528) >> 3 | ((var55 & 65408) >> 7 | var55 << 9) << 13;
            var102 = ((var103 | var56 << 13) & 65535) >> 0;
            int var58 = (((var103 | var56 << 13) & 65535) >> 0 | var55 << 16) ^ 91;
            int var105 = (((((var103 | var56 << 13) & 65535) >> 0 | var55 << 16) ^ 91) & 65504) >> 5;
            var55 = ((((var102 | var55 << 16) ^ 91) & 65504) >> 5 | ((((var103 | var56 << 13) & 65535) >> 0 | var55 << 16) ^ 91) << 11) ^ 52;
            var102 = (((var105 | var58 << 11) ^ 52) & 49152) >> 14;
            int var60 = ((((var105 | var58 << 11) ^ 52) & 49152) >> 14 | var55 << 2) - 45;
            int var107 = (((((var105 | var58 << 11) ^ 52) & 49152) >> 14 | var55 << 2) - 45 & 57344) >> 13;
            char var61 = (char)((((var102 | var55 << 2) - 45 & 57344) >> 13 | ((((var105 | var58 << 11) ^ 52) & 49152) >> 14 | var55 << 2) - 45 << 3) + 145);
            var17.setCharAt(var30, (char)((var107 | var60 << 3) + 145));
         }

         Class var6 = Class.forName(var17.toString(), false, Class_163.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = 263746421 & -411325022 ^ 121119008; var36 < var20.length(); var36 += 120940290 >>> (-84671150 ^ -84671150) ^ 120940291) {
            int var66 = var20.charAt(var36);
            int var108 = (var66 & 0) >> 16;
            int var67 = (var66 & 0) >> 16 | var66 << 0;
            int var109 = (((var66 & 0) >> 16 | var66 << 0) & 65534) >> 1;
            var66 = (((var108 | var66 << 0) & 65534) >> 1 | ((var66 & 0) >> 16 | var66 << 0) << 15) ^ 132;
            var108 = (((var109 | var67 << 15) ^ 132) & 0) >> 16;
            int var69 = (((((var109 | var67 << 15) ^ 132) & 0) >> 16 | var66 << 0) ^ 199 ^ 120 ^ 132) - 168 + 151;
            int var111 = ((((((var109 | var67 << 15) ^ 132) & 0) >> 16 | var66 << 0) ^ 199 ^ 120 ^ 132) - 168 + 151 & 65532) >> 2;
            char var70 = (char)(
               (((var108 | var66 << 0) ^ 199 ^ 120 ^ 132) - 168 + 151 & 65532) >> 2
                  | (((((var109 | var67 << 15) ^ 132) & 0) >> 16 | var66 << 0) ^ 199 ^ 120 ^ 132) - 168 + 151 << 14
            );
            var20.setCharAt(var36, (char)(var111 | var69 << 14));
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_163.class.getClassLoader()).returnType();
         switch ((var4 - 587058307 ^ 951809085) - 1954395618 + 2030088006 + 132589786 - 51919784 - 743758090 + 1698220402 ^ 1830463544 ^ 1710025546) {
            case 273829172:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            case 757720924:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            case 1750479424:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            case 2109122524:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_2075[(((var10 - 927282323 ^ 302076068) + 2014272260 - 552872675 ^ 698793548 ^ 559038680) - 932912414 ^ 125467479) - 1877417480 - 359417171] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
