import java.io.PrintStream;
import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;
import net.minecraft.class_642;

public class Class_279 extends Class_342 {
   // $VF: renamed from: awl Class_42
   public static Class_42 field_1873 = (Class_42)0<"JNT",-486620083,"鳕绕ࣕ绕ೕ꣕","郊释뻊","äѼ",1920758662>();
   // $VF: renamed from: oi Class_105
   public Class_105 field_1874;
   // $VF: renamed from: jre java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_1875 = new MethodHandle[113];

   public Class_279() {
      int var10001 = (-2109986066 & -833894826 | 0) & 1342686257;

      StringBuilder var10002;
      for (var10002 = (StringBuilder)0<"JNT",-486620083,"鳕绕ࣕ绕ೕ꣕","郊듊틊짊\udeca짊韊퓊짊훊쿊韊믊\udcca\udaca퇊훊쿊ꏊ释뻊","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920762130>(
            "뼺弾ἽἿ鼹＼뼾㼧㼹＼\udf3eἽ\udf3e缹Ἷ\udf3e"
         );
         var10001 < ((-814935796 | -814935796 | 16) & 268567699);
         var10001 += -839229844 >>> (-1133031901 | -839229844) ^ 105461
      ) {
         int var13 = 0<"JNT",-824628863,"櫕瓕滕ვ껕ೕ","郊뇊释ꯊ","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920762021>(var10002, var10001) ^ 156 ^ 86;
         char var14 = (char)(((var13 & 57344) >> 13 | var13 << 3) + 197 ^ 14);
         0<"JNT",-824628863,"\u0ad5盕ೕ\uaad5瓕滕ვ껕ೕ","郊뇊ꯊ释뻊","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920762020>(
            var10002, var10001, (char)(((var13 & 57344) >> 13 | var13 << 3) + 197 ^ 14)
         );
      }

      String var2 = 0<"JNT",-824628863,"ೕ˕䫕ೕვ绕ࣕ狕","郊释듊틊짊\udeca짊韊퓊짊훊쿊韊믊\udcca\udaca퇊훊쿊ꏊ","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920762134>(var10002);
      int var7 = 0;

      StringBuilder var16;
      for (var16 = (StringBuilder)0<"JNT",-486620083,"鳕绕ࣕ绕ೕ꣕","郊듊틊짊\udeca짊韊퓊짊훊쿊韊믊\udcca\udaca퇊훊쿊ꏊ释뻊","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920762137>(
            "者\u0013\u001e耟耑\u0017\u001b\u001e耷\u0002耞\u001b耟耝\u0010耐耷\u0017\u001e耷\u001b\u0010\u001d耞耷耟耞\u0015\u001e\u0015耐\u0016\u0015耷\u0010耐耷者\u0013\u001e\u0016\u0010耞耕耰"
         );
         var7 < ((-1943797225 & -1943797225 | 41) & 1347439085);
         var7 += (-676185263 << 953671334 | 1) & 287312413
      ) {
         char var26 = 0<"JNT",-824628863,"櫕瓕滕ვ껕ೕ","郊뇊释ꯊ","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920762128>(var16, var7);
         char var29 = (char)(
            (
                  (((((var26 & '쀀') >> 14 | var26 << 2) & 64512) >> 10 | ((var26 & '쀀') >> 14 | var26 << 2) << 6) & 65408) >> 7
                     | ((((var26 & '쀀') >> 14 | var26 << 2) & 64512) >> 10 | ((var26 & '쀀') >> 14 | var26 << 2) << 6) << 9
               )
               ^ 183
               ^ 248
         );
         0<"JNT",-824628863,"\u0ad5盕ೕ\uaad5瓕滕ვ껕ೕ","郊뇊ꯊ释뻊","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920762131>(
            var16,
            var7,
            (char)(
               (
                     (((((var26 & '쀀') >> 14 | var26 << 2) & 64512) >> 10 | ((var26 & '쀀') >> 14 | var26 << 2) << 6) & 65408) >> 7
                        | ((((var26 & '쀀') >> 14 | var26 << 2) & 64512) >> 10 | ((var26 & '쀀') >> 14 | var26 << 2) << 6) << 9
                  )
                  ^ 183
                  ^ 248
            )
         );
      }

      super(
         var2,
         0<"JNT",-824628863,"ೕ˕䫕ೕვ绕ࣕ狕","郊释듊틊짊\udeca짊韊퓊짊훊쿊韊믊\udcca\udaca퇊훊쿊ꏊ","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920762025>(var16),
         -1,
         1<"JNT",632072613,"ȑǹř","ꄀ\uddff","ؕߕᄕᯕᢕ๕",737924363>()
      );
      var10001 = 1307204701 << -697560201 * 955809079 ^ -1195769856;

      for (var10002 = (StringBuilder)0<"JNT",-486620083,"鳕绕ࣕ绕ೕ꣕","郊듊틊짊\udeca짊韊퓊짊훊쿊韊믊\udcca\udaca퇊훊쿊ꏊ释뻊","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920762027>("КժךٚêКԺ؊يԺ؊");
         var10001 < ((1201545462 - (1118856099 ^ 589005100) | 9) & 134217755);
         var10001 += -886319806 << -866042419 ^ 2057846785
      ) {
         int var19 = 0<"JNT",-824628863,"櫕瓕滕ვ껕ೕ","郊뇊释ꯊ","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920762023>(var10002, var10001) + 253 + 146 - 121;
         int var38 = (var19 & 65024) >> 9;
         int var20 = (var19 & 65024) >> 9 | var19 << 7;
         int var39 = (((var19 & 65024) >> 9 | var19 << 7) & 63488) >> 11;
         char var21 = (char)(((var38 | var19 << 7) & 63488) >> 11 | ((var19 & 65024) >> 9 | var19 << 7) << 5);
         0<"JNT",-824628863,"\u0ad5盕ೕ\uaad5瓕滕ვ껕ೕ","郊뇊ꯊ释뻊","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920762022>(var10002, var10001, (char)(var39 | var20 << 5));
      }

      Class_105 var5 = (Class_105)0<"JNT",-486620083,"鳕绕ࣕ绕ೕ꣕","郊듊틊짊\udeca짊韊퓊짊훊쿊韊믊\udcca\udaca퇊훊쿊ꏊ싊释뻊","҄Ѽ",1920762126>(
         0<"JNT",-824628863,"ೕ˕䫕ೕვ绕ࣕ狕","郊释듊틊짊\udeca짊韊퓊짊훊쿊韊믊\udcca\udaca퇊훊쿊ꏊ","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920762127>(var10002), true
      );
      int var11 = 2 & 373126349;

      for (var16 = (StringBuilder)0<"JNT",-486620083,"鳕绕ࣕ绕ೕ꣕","郊듊틊짊\udeca짊韊퓊짊훊쿊韊믊\udcca\udaca퇊훊쿊ꏊ释뻊","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920762129>(
            "ﴝ\ufde0ﷹﷱ﷽ﴨ\ufded﷿ﷺﷺ\ufdef\ufde6﷼ﴨ﷽\ufdefﷺ﷾\ufdefﷺﴨ\ufde3\ufde6ﴨﷸﷺ\ufdef﷽\ufdef\ufde6\ufded\ufdef"
         );
         var11 < (1046515295 * 1168236610 ^ -1237920674);
         var11 += -1745969914 - -1727525306 ^ -18444607
      ) {
         0<"JNT",-824628863,"\u0ad5盕ೕ\uaad5瓕滕ვ껕ೕ","郊뇊ꯊ释뻊","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920762013>(
            var16, var11, (char)((0<"JNT",-824628863,"櫕瓕滕ვ껕ೕ","郊뇊释ꯊ","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920762026>(var16, var11) ^ 'i') + 235 + 106 + 153 + 241)
         );
      }

      this.field_1874 = 0<"JNT",-824628863,"滕ᛕ法","郊듊틊짊\udeca짊韊퓊짊훊쿊韊믊\udcca\udaca퇊훊쿊ꏊ释듊쿊\udacaꏊ","҄Ѽ",1920762139>(
         var5, 0<"JNT",-824628863,"ೕ˕䫕ೕვ绕ࣕ狕","郊释듊틊짊\udeca짊韊퓊짊훊쿊韊믊\udcca\udaca퇊훊쿊ꏊ","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920762136>(var16)
      );
      0<"JNT",-824628863,"໕ᛕ","郊쏊듊\ud9ca췊췊ꏊ释뻊","ѴьҜ",1920762125>(this, new Class_271[]{1<"JNT",2020854725,"ȩǹ","ꔀꚀ\udbff","ؕߕᄕ\u1755Ვ๕",737924281>(this)});
      0<"JNT",-824628863,"ەዕ","郊뇊释뻊","ѴьҜ",1920762124>(this, -1);
   }

   // $VF: renamed from: mg () void
   // $VF: Irreducible bytecode was duplicated to produce valid code
   @Override
   public void method_1407() {
      int var2 = 47240538;
      0<"JNT",-1913844505,"ە狕","郊释뻊","ДѤҜ",1920758705>(this);
      0<"JNT",-1710224333,"狕ᓕ狕","郊닊듊틊짊\udeca짊韊퓊짊훊쿊韊뫊\uddca훊훊짊쫊퓊췊ꏊ释싊","ҬЌ",1920758704>(1353730467924414574L, null);
      0<"JNT",-824628863,"\u0ad5ዕ","郊닊释뻊","äѼ",1920758725>(
         1<"JNT",632072613,"ƹũȡ","ꔀꚀ\udbff","ؕߕᄕᡕᲕ๕",737924802>(), 0<"JNT",-1710224333,"櫕ᛕვვ盕ࣕೕ䳕绕ە盕䛕绕糕糕绕\u0ad5","郊释닊","ҼôМôɜҬôќ҄ɜŤдѤѬҔє",1920758706>() / 1000L
      );
      Class_42 var10000 = 1<"JNT",632072613,"ƹũȡ","ꔀꚀ\udbff","ؕߕᄕᡕᲕ๕",737924767>();
      int var10001 = 49179396 ^ 592600233 ^ 565983149;
      StringBuilder var10002 = (StringBuilder)0<"JNT",-486620083,"鳕绕ࣕ绕ೕ꣕","郊듊틊짊\udeca짊韊퓊짊훊쿊韊믊\udcca\udaca퇊훊쿊ꏊ释뻊","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920758727>(
         "Ƨŕȃőȉşŝƙşůş"
      );

      label93:
      while (true) {
         var2 = 1647291783 ^ 1433132497 ^ 94598711;

         while (true) {
            label89:
            while (true) {
               label97: {
                  StringBuilder var8;
                  switch (var2 - 1028855216 + 798065949 + 221589169 + 789335333 ^ 627641680 ^ 952048953) {
                     case -80340302:
                        var8 = var10002;
                        if (var10001 < (1607663354 - -687447419 ^ -1999856526)) {
                           int var34 = 0<"JNT",-824628863,"櫕瓕滕ვ껕ೕ","郊뇊释ꯊ","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920758722>(var10002, var10001) + 197;
                           char var37 = (char)(
                              (
                                    (((((var34 & 32768) >> 15 | var34 << 1) & 61440) >> 12 | ((var34 & 32768) >> 15 | var34 << 1) << 4) & 61440) >> 12
                                       | ((((var34 & 32768) >> 15 | var34 << 1) & 61440) >> 12 | ((var34 & 32768) >> 15 | var34 << 1) << 4) << 4
                                 )
                                 - 211
                           );
                           0<"JNT",-824628863,"\u0ad5盕ೕ\uaad5瓕滕ვ껕ೕ","郊뇊ꯊ释뻊","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920758741>(
                              var10002,
                              var10001,
                              (char)(
                                 (
                                       (((((var34 & 32768) >> 15 | var34 << 1) & 61440) >> 12 | ((var34 & 32768) >> 15 | var34 << 1) << 4) & 61440) >> 12
                                          | ((((var34 & 32768) >> 15 | var34 << 1) & 61440) >> 12 | ((var34 & 32768) >> 15 | var34 << 1) << 4) << 4
                                    )
                                    - 211
                              )
                           );
                           var10001 += 1312163103 >> -1520232213 ^ 640705;
                           break label97;
                        }

                        var2 = (-1670772843 + -1879851065 * -1058792628 | -303904316) & -35468348;
                        break;
                     case 459873526:
                        var8 = var10002;
                        if (var10001 < 7) {
                           char var23 = 0<"JNT",-824628863,"櫕瓕滕ვ껕ೕ","郊뇊释ꯊ","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920762012>(var10002, var10001);
                           int var65 = (var23 & '\ufff8') >> 3;
                           int var24 = (var23 & '\ufff8') >> 3 | var23 << '\r';
                           int var66 = (((var23 & '\ufff8') >> 3 | var23 << '\r') & 65024) >> 9;
                           var23 = (char)((((var65 | var23 << '\r') & 65024) >> 9 | ((var23 & '\ufff8') >> 3 | var23 << '\r') << 7) - 51 ^ 56 ^ 239);
                           0<"JNT",-824628863,"\u0ad5盕ೕ\uaad5瓕滕ვ껕ೕ","郊뇊ꯊ释뻊","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920762015>(
                              var10002, var10001, (char)((var66 | var24 << 7) - 51 ^ 56 ^ 239)
                           );
                           var10001 += (-2090314336 >>> (-265884516 >> -2090314336) | 1) & 1983688197;
                           break label89;
                        }

                        var2 = 169832024;
                        break;
                     case 2091966925:
                     default:
                        var8 = var10002;
                        if (var10001 < (-1086131379 & -791103302 ^ -1874808829)) {
                           int var18 = (0<"JNT",-824628863,"櫕瓕滕ვ껕ೕ","郊뇊释ꯊ","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920758720>(var10002, var10001) - 176 ^ 88) - 25;
                           int var10005 = (var18 & 49152) >> 14;
                           int var19 = (var18 & 49152) >> 14 | var18 << 2;
                           int var64 = (((var18 & 49152) >> 14 | var18 << 2) & 65528) >> 3;
                           char var20 = (char)(((var10005 | var18 << 2) & 65528) >> 3 | ((var18 & 49152) >> 14 | var18 << 2) << 13);
                           0<"JNT",-824628863,"\u0ad5盕ೕ\uaad5瓕滕ვ껕ೕ","郊뇊ꯊ释뻊","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920758723>(
                              var10002, var10001, (char)(var64 | var19 << 13)
                           );
                           var10001 += 1098898236 << 1098898236 ^ -1073741823;
                           continue label93;
                        }

                        var2 = (1335910063 | -1964172484 | -2108676032) & -1284292791;
                  }

                  String var9;
                  int var14;
                  StringBuilder var28;
                  switch ((var2 - 510651736 + 1076074869 + 594821529 ^ 404470805) + 1894661199 - 2010365316) {
                     case -912453707:
                     default:
                        var9 = 0<"JNT",-824628863,"ೕ˕䫕ೕვ绕ࣕ狕","郊释듊틊짊\udeca짊韊퓊짊훊쿊韊믊\udcca\udaca퇊훊쿊ꏊ","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920762014>(var8);
                        var14 = 1149611334 ^ 1149611334 ^ 0;
                        var28 = (StringBuilder)0<"JNT",-486620083,"鳕绕ࣕ绕ೕ꣕","郊듊틊짊\udeca짊韊퓊짊훊쿊韊믊\udcca\udaca퇊훊쿊ꏊ释뻊","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920762017>(
                           "桅쁄뱄채쁄灅葄⡅책\ue045쑅푅롅뱅葄ࡅ둅ꁅ遅뱅푅"
                        );
                        var2 = (-856227223 * -1905137489 | -1567016678) & -153535622;
                        break;
                     case 1350000358:
                        var9 = 0<"JNT",-824628863,"ೕ˕䫕ೕვ绕ࣕ狕","郊释듊틊짊\udeca짊韊퓊짊훊쿊韊믊\udcca\udaca퇊훊쿊ꏊ","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920758728>(var8);
                        var14 = (-96279719 + 720208697 | 0) & 310872108;
                        var28 = (StringBuilder)0<"JNT",-486620083,"鳕绕ࣕ绕ೕ꣕","郊듊틊짊\udeca짊韊퓊짊훊쿊韊믊\udcca\udaca퇊훊쿊ꏊ释뻊","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920758731>(
                           "肤肧肧肦䂧\u0099䂖䂖肣삤䂧䂣䂦§肣\u0096䂤䂤䂖䂥§삨肦肧䂦¦䂣肥삤삣¦肧"
                        );
                        var2 = (942263392 + 2072964930 | 93427410) & -843581730;
                        break;
                     case 1412138042:
                        var9 = 0<"JNT",-824628863,"ೕ˕䫕ೕვ绕ࣕ狕","郊释듊틊짊\udeca짊韊퓊짊훊쿊韊믊\udcca\udaca퇊훊쿊ꏊ","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920758726>(var8);
                        var14 = (-218691347 ^ -338912114 | 0) & -2038421368;
                        var28 = (StringBuilder)0<"JNT",-486620083,"鳕绕ࣕ绕ೕ꣕","郊듊틊짊\udeca짊韊퓊짊훊쿊韊믊\udcca\udaca퇊훊쿊ꏊ释뻊","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920758729>(
                           "ÌüüìøƔǨǨØô\u0090ìüèäĸÜÐŀäüǤèôňǨ"
                        );
                        var2 = (-405435024 << -1302531869 | 595271059) & -201605709;
                  }

                  label80:
                  while (true) {
                     switch ((var2 - 285190700 - 1294899135 ^ 1359730303) + 1316580480 + 1392794398 + 1768176380) {
                        case -2123717326:
                           var10002 = var28;
                           if (var14 >= (-97713565 ^ -794677629 ^ 714026176)) {
                              var2 = -1794763866 ^ -1794763866 - -1794763866 ^ 1967103264;
                              break label80;
                           }

                           int var53 = 0<"JNT",-824628863,"櫕瓕滕ვ껕ೕ","郊뇊释ꯊ","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920758740>(var28, var14) - '!';
                           int var80 = (var53 & 32768) >> 15;
                           int var54 = ((var53 & 32768) >> 15 | var53 << 1) - 26 - 185;
                           int var81 = (((var53 & 32768) >> 15 | var53 << 1) - 26 - 185 & 32768) >> 15;
                           char var55 = (char)(((var80 | var53 << 1) - 26 - 185 & 32768) >> 15 | ((var53 & 32768) >> 15 | var53 << 1) - 26 - 185 << 1);
                           0<"JNT",-824628863,"\u0ad5盕ೕ\uaad5瓕滕ვ껕ೕ","郊뇊ꯊ释뻊","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920758743>(var28, var14, (char)(var81 | var54 << 1));
                           var14 += -880936000 >>> 375118008 ^ 202;
                           var2 = (942263392 + 2072964930 | 93427410) & -843581730;
                           break;
                        case -1884737423:
                           var10002 = var28;
                           if (var14 >= (1592203353 >> 1701595327 ^ 26)) {
                              var2 = (-636260217 * -636260217 | 69091520) & 1562376396;
                              break label80;
                           }

                           char var49 = 0<"JNT",-824628863,"櫕瓕滕ვ껕ೕ","郊뇊释ꯊ","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920758718>(var28, var14);
                           char var50 = (char)((((var49 & '￼') >> 2 | var49 << 14) - 19 ^ 112) + 244 - 220);
                           0<"JNT",-824628863,"\u0ad5盕ೕ\uaad5瓕滕ვ껕ೕ","郊뇊ꯊ释뻊","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920758721>(
                              var28, var14, (char)((((var49 & '￼') >> 2 | var49 << 14) - 19 ^ 112) + 244 - 220)
                           );
                           var14 += -671108405 >>> 699661519 ^ 110590;
                           var2 = (-405435024 << -1302531869 | 595271059) & -201605709;
                           break;
                        case -461167702:
                        default:
                           var10002 = var28;
                           if (var14 >= ((1353117770 - 1353117770 | 21) & 4909175)) {
                              var2 = (195227032 & 195227032 | -789113884) & -201329673;
                              break label80;
                           }

                           int var43 = 0<"JNT",-824628863,"櫕瓕滕ვ껕ೕ","郊뇊释ꯊ","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920762040>(var28, var14) - 20;
                           char var46 = (char)(
                              ((((((var43 & 65520) >> 4 | var43 << 12) ^ 67) & 32768) >> 15 | (((var43 & 65520) >> 4 | var43 << 12) ^ 67) << 1) & 65408) >> 7
                                 | (((((var43 & 65520) >> 4 | var43 << 12) ^ 67) & 32768) >> 15 | (((var43 & 65520) >> 4 | var43 << 12) ^ 67) << 1) << 9
                           );
                           0<"JNT",-824628863,"\u0ad5盕ೕ\uaad5瓕滕ვ껕ೕ","郊뇊ꯊ释뻊","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920762043>(
                              var28,
                              var14,
                              (char)(
                                 ((((((var43 & 65520) >> 4 | var43 << 12) ^ 67) & 32768) >> 15 | (((var43 & 65520) >> 4 | var43 << 12) ^ 67) << 1) & 65408)
                                       >> 7
                                    | (((((var43 & 65520) >> 4 | var43 << 12) ^ 67) & 32768) >> 15 | (((var43 & 65520) >> 4 | var43 << 12) ^ 67) << 1) << 9
                              )
                           );
                           var14 += (-32457721 + -32457721 | 1) & 34244513;
                           var2 = (-856227223 * -1905137489 | -1567016678) & -153535622;
                     }
                  }

                  switch ((var2 ^ 1304393970) + 1630038152 + 1604095785 - 126007320 + 2044587669 + 1204894502) {
                     case -1819115130:
                        0<"JNT",-824628863,"盕糕","郊듊틊짊\udeca짊韊퓊짊훊쿊韊믊\udcca\udaca퇊훊쿊ꏊ듊틊짊\udeca짊韊퓊짊훊쿊韊믊\udcca\udaca퇊훊쿊ꏊ释뻊","äѼ",1920762019>(
                           var10000, var9, 0<"JNT",-824628863,"ೕ˕䫕ೕვ绕ࣕ狕","郊释듊틊짊\udeca짊韊퓊짊훊쿊韊믊\udcca\udaca퇊훊쿊ꏊ","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920762016>(var10002)
                        );
                        PrintStream var7 = 1<"JNT",632072613,"ȩřš","\ud9ff\udd7fꎀ\udd7f쟿\ud8ff\udd7fꞀ\uda7f쟿푿ꄀꐀꒀ\udb7f꜀","ؕߕᄕ᪕ᗕᮕᗕॕ៕ᥕॕပᲕ៕ᦕᬕᑕᬕᲕᣕᗕ\u1ad5๕",737924817>();
                        String var1 = 0<"JNT",-824628863,"ೕ˕䫕ೕვ绕ࣕ狕","郊释듊틊짊\udeca짊韊퓊짊훊쿊韊믊\udcca\udaca퇊훊쿊ꏊ","äфєɜ҄фф҄ҬҔɜ҄ѤфќɜƼѤфќńüҼҔäѬ",1920762039>(
                           0<"JNT",-824628863,"绕ࣕ","郊释듊쯊\ud7ca헊韊쿊\ud7ca\ud7ca쿊퓊췊韊쿊\udbca\ud7ca훊韊닊\udbca\ud7ca훊럊쫊틊췊쯊\udccaꏊ","äѼ",1920762036>(
                              1<"JNT",632072613,"ƹũȡ","ꔀꚀ\udbff","ؕߕᄕᡕᲕ๕",737924816>()
                           )
                        );
                        StringBuilder var10 = (StringBuilder)0<"JNT",-486620083,"鳕绕ࣕ绕ೕ꣕","郊释뻊","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920762038>();
                        int var16 = (734287938 | -1494168260) ^ -1342907010;

                        for (var28 = (StringBuilder)0<"JNT",-486620083,"鳕绕ࣕ绕ೕ꣕","郊듊틊짊\udeca짊韊퓊짊훊쿊韊믊\udcca\udaca퇊훊쿊ꏊ释뻊","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920762041>(
                              "\u0094q\u0087wk\u0086t8¦¨\u00978\u008e§\u008b\u008a>8"
                           );
                           var16 < (-1322099568 << -68101548 ^ -922746862);
                           var16 += (1165532341 - -1481042148 | 0) & 1610644007
                        ) {
                           int var58 = 0<"JNT",-824628863,"櫕瓕滕ვ껕ೕ","郊뇊释ꯊ","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920758742>(var28, var16) + 140 - 223;
                           char var59 = (char)(((var58 & 65535) >> 0 | var58 << 16) + 169 ^ 174);
                           0<"JNT",-824628863,"\u0ad5盕ೕ\uaad5瓕滕ვ껕ೕ","郊뇊ꯊ释뻊","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920758745>(
                              var28, var16, (char)(((var58 & 65535) >> 0 | var58 << 16) + 169 ^ 174)
                           );
                        }

                        0<"JNT",-824628863,"ӕვ绕ࣕೕ糕ࣕ","郊듊틊짊\udeca짊韊퓊짊훊쿊韊믊\udcca\udaca퇊훊쿊ꏊ释뻊","ҼôМôɜҴфɜŌѼҴќѬŤѬѼҔôє",1920758702>(
                           var7,
                           0<"JNT",-824628863,"ೕ˕䫕ೕვ绕ࣕ狕","郊释듊틊짊\udeca짊韊퓊짊훊쿊韊믊\udcca\udaca퇊훊쿊ꏊ","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920758703>(
                              0<"JNT",-824628863,"滕ӕӕ盕ࣕ法","郊듊틊짊\udeca짊韊퓊짊훊쿊韊럊쫊틊췊쯊\udccaꏊ释듊틊짊\udeca짊韊퓊짊훊쿊韊믊\udcca\udaca퇊훊쿊\uaaca\uddca퇊퓊쳊췊\udacaꏊ","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920762028>(
                                 0<"JNT",-824628863,"滕ӕӕ盕ࣕ法","郊듊틊짊\udeca짊韊퓊짊훊쿊韊믊\udcca\udaca퇊훊쿊ꏊ释듊틊짊\udeca짊韊퓊짊훊쿊韊믊\udcca\udaca퇊훊쿊\uaaca\uddca퇊퓊쳊췊\udacaꏊ","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920762029>(
                                    var10, 0<"JNT",-824628863,"ೕ˕䫕ೕვ绕ࣕ狕","郊释듊틊짊\udeca짊韊퓊짊훊쿊韊믊\udcca\udaca퇊훊쿊ꏊ","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920762042>(var28)
                                 ),
                                 var1
                              )
                           )
                        );
                        return;
                     case 423228506:
                        0<"JNT",-824628863,"滕","郊듊틊짊\udeca짊韊퓊짊훊쿊韊믊\udcca\udaca퇊훊쿊ꏊ듊틊짊\udeca짊韊퓊짊훊쿊韊믊\udcca\udaca퇊훊쿊ꏊ释뻊","äѼ",1920758747>(
                           var10000, var9, 0<"JNT",-824628863,"ೕ˕䫕ೕვ绕ࣕ狕","郊释듊틊짊\udeca짊韊퓊짊훊쿊韊믊\udcca\udaca퇊훊쿊ꏊ","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920758744>(var10002)
                        );
                        var10000 = 1<"JNT",632072613,"ƹũȡ","ꔀꚀ\udbff","ؕߕᄕᡕᲕ๕",737924985>();
                        var10001 = -1123510958 << 1981526720 ^ -1123510958;
                        var10002 = (StringBuilder)0<"JNT",-486620083,"鳕绕ࣕ绕ೕ꣕","郊듊틊짊\udeca짊韊퓊짊훊쿊韊믊\udcca\udaca퇊훊쿊ꏊ释뻊","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920758733>(
                           "怌ဏ瀍瀎뀎耍怎"
                        );
                        break label89;
                     case 678977480:
                     default:
                        0<"JNT",-824628863,"惕糕","郊듊틊짊\udeca짊韊퓊짊훊쿊韊믊\udcca\udaca퇊훊쿊ꏊ듊틊짊\udeca짊韊퓊짊훊쿊韊믊\udcca\udaca퇊훊쿊ꏊ释뻊","äѼ",1920758717>(
                           var10000, var9, 0<"JNT",-824628863,"ೕ˕䫕ೕვ绕ࣕ狕","郊释듊틊짊\udeca짊韊퓊짊훊쿊韊믊\udcca\udaca퇊훊쿊ꏊ","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920758730>(var10002)
                        );
                        var10000 = 1<"JNT",632072613,"ƹũȡ","ꔀꚀ\udbff","ؕߕᄕᡕᲕ๕",737924775>();
                        var10001 = 1945276420 + (1853212660 | -404405967) ^ 1676171257;
                        var10002 = (StringBuilder)0<"JNT",-486620083,"鳕绕ࣕ绕ೕ꣕","郊듊틊짊\udeca짊韊퓊짊훊쿊韊믊\udcca\udaca퇊훊쿊ꏊ释뻊","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920758719>(
                           "鐻鬻馻ꈻ鴻ꊻ鬻"
                        );
                  }
               }

               var2 = (-1670176286 | -1617869790 | 183759636) ^ 664004718;
            }

            var2 = 313539328 - 313539328 ^ -666951332;
         }
      }
   }

   // $VF: renamed from: q () void
   @Override
   public void method_1408() {
      0<"JNT",-1913844505,"໕","郊释뻊","ДѤҜ",1920758732>(this);
      0<"JNT",-1710224333,"竕ೕ","郊释뻊","ҬЌ",1920758735>();
   }

   // $VF: renamed from: gd (Class_207) void
   // $VF: Handled exception range with multiple entry points by splitting it
   // $VF: Inserted dummy exception handlers to handle obfuscated exceptions
   @Class_21
   public void method_1649(Class_207 var1) {
      int var3 = -1942592696;

      try {
         var3 = -1581852386;
      } catch (Exception var11) {
         boolean var10001 = false;
         return;
      }

      label87:
      while (true) {
         int var22;
         Class_42 var10000;
         StringBuilder var10002;
         switch ((var3 ^ 978038519) + 1667145909 - 2042290779 + 1257755805 - 905011925 + 1692018472) {
            case -1000277694:
            default:
               return;
            case -567691105:
               try {
                  var10000 = 1<"JNT",632072613,"ƹũȡ","ꔀꚀ\udbff","ؕߕᄕᡕᲕ๕",737924809>();
                  var22 = -1364705992 * -1364705992 ^ -2010923968;
                  var10002 = (StringBuilder)0<"JNT",-486620083,"鳕绕ࣕ绕ೕ꣕","郊듊틊짊\udeca짊韊퓊짊훊쿊韊믊\udcca\udaca퇊훊쿊ꏊ释뻊","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920758621>(
                     "\uf65f\uf17f錄\uf5df\uf0df\uf17f\ueedf"
                  );
                  break;
               } catch (Exception var8) {
                  boolean var21 = false;
                  return;
               }
            case -65582448:
               try {
                  String var2 = 0<"JNT",-824628863,"Õ櫕ᛕ","郊释듊틊짊\udeca짊韊퓊짊훊쿊韊믊\udcca\udaca퇊훊쿊ꏊ","ѴьҜ",1920758624>(this);
                  0<"JNT",-824628863,"ӕ\u0ad5","郊듊틊짊\udeca짊韊퓊짊훊쿊韊믊\udcca\udaca퇊훊쿊ꏊ释뻊","äѼ",1920758626>(
                     1<"JNT",632072613,"ƹũȡ","ꔀꚀ\udbff","ؕߕᄕᡕᲕ๕",737924978>(), var2
                  );
                  0<"JNT",-1710224333,"\u0ad5盕","郊듊쯊\udacaꏊ释뻊","ҬЌ",1920758644>(1<"JNT",632072613,"ƹũȡ","ꔀꚀ\udbff","ؕߕᄕᡕᲕ๕",737925008>());
               } catch (Exception var4) {
                  boolean var20 = false;
               }

               return;
            case -8270029:
               try {
                  if (1<"JNT",2020854725,"ǱǹǙȡǡ©̹ͩ͑͡","Ꞁ\udb7fꒀ쟿꜀\ud97fꞀ\udb7f\udc7fꖀ\udd7f\udbffꒀ쟿\udc7f\ud8ff\udd7fꐀꐀ\ude7f쑿앿웿","ؕߕᄕᦕᣕᬕॕ\u1ad5៕ᦕᣕᡕᲕᗕផᬕॕᡕᤕᗕ᱕᱕ᕕ୕କக๕",737924962>(
                           1<"JNT",2020854725,"ȡő","ꔀꚀ\udbff","ؕߕᄕᦕᣕᬕॕ\u1ad5៕ᦕᣕᡕᲕᗕផᬕॕᡕᤕᗕ᱕᱕ᕕౕ\u09d5ࠕ๕",737924963>(this)
                        )
                        == null
                     || 1<"JNT",2020854725,"ǱǹǙȡǡ©̹ͱ\u0381ͩ","Ꞁ\udb7fꒀ쟿꜀\ud97fꞀ\udb7f\udc7fꖀ\udd7f\udbffꒀ쟿\udc7f\ud8ff\udd7fꐀꐀ\ude7f쑿앿웿","ؕߕᄕᦕᣕᬕॕ\u1ad5៕ᦕᣕᡕᲕᗕផᬕॕᡕᤕᗕ᱕᱕ᕕகౕਕ๕",737924800>(
                           1<"JNT",2020854725,"ȡő","ꔀꚀ\udbff","ؕߕᄕᦕᣕᬕॕ\u1ad5៕ᦕᣕᡕᲕᗕផᬕॕᡕᤕᗕ᱕᱕ᕕౕ\u09d5ࠕ๕",737924801>(this)
                        )
                        == null) {
                     var3 = (-1626142011 * -1792918962 | 13551520) & 1627312114;
                     continue;
                  }
               } catch (Exception var12) {
                  boolean var18 = false;
                  return;
               }

               try {
                  var3 = 295675914 ^ 1858570798 ^ -578715755;
                  continue;
               } catch (Exception var5) {
                  boolean var19 = false;
                  return;
               }
         }

         label85:
         while (true) {
            try {
               var3 = 533022816 >>> 302874293 ^ -1446779325;
            } catch (Exception var7) {
               boolean var23 = false;
               return;
            }

            while (true) {
               label81: {
                  StringBuilder var25;
                  switch (var3 + 104745307 - 1141357862 + 1109006782 - 2000404251 + 402047182 - 2118110278) {
                     case -880070259:
                        try {
                           var25 = var10002;
                           if (var22 < ((600011684 + (600011684 & 600011684 & 600011684) | 4) & -1470103420)) {
                              int var38 = (0<"JNT",-824628863,"櫕瓕滕ვ껕ೕ","郊뇊释ꯊ","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920758734>(var10002, var22) ^ '3') - 159;
                              char var39 = (char)(((var38 & 61440) >> 12 | var38 << 4) + 77 - 187);
                              0<"JNT",-824628863,"\u0ad5盕ೕ\uaad5瓕滕ვ껕ೕ","郊뇊ꯊ释뻊","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920758737>(
                                 var10002, var22, (char)(((var38 & 61440) >> 12 | var38 << 4) + 77 - 187)
                              );
                              var22 += -667848277 ^ -667848278;
                              break label81;
                           }

                           var3 = -1212085341 << -1244234783 ^ -137739147;
                           break;
                        } catch (Exception var14) {
                           boolean var26 = false;
                           return;
                        }
                     case -795885027:
                     default:
                        try {
                           var25 = var10002;
                           if (var22 < ((-2038822433 ^ 1667823678 | 7) & 34080791)) {
                              char var32 = 0<"JNT",-824628863,"櫕瓕滕ვ껕ೕ","郊뇊释ꯊ","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920758632>(var10002, var22);
                              char var35 = (char)(
                                 (
                                          (((((var32 & '￠') >> 5 | var32 << 11) & 61440) >> 12 | ((var32 & '￠') >> 5 | var32 << 11) << 4) & 65520) >> 4
                                             | ((((var32 & '￠') >> 5 | var32 << 11) & 61440) >> 12 | ((var32 & '￠') >> 5 | var32 << 11) << 4) << 12
                                       )
                                       + 141
                                    ^ 118
                              );
                              0<"JNT",-824628863,"\u0ad5盕ೕ\uaad5瓕滕ვ껕ೕ","郊뇊ꯊ释뻊","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920758635>(
                                 var10002,
                                 var22,
                                 (char)(
                                    (
                                             (((((var32 & '￠') >> 5 | var32 << 11) & 61440) >> 12 | ((var32 & '￠') >> 5 | var32 << 11) << 4) & 65520) >> 4
                                                | ((((var32 & '￠') >> 5 | var32 << 11) & 61440) >> 12 | ((var32 & '￠') >> 5 | var32 << 11) << 4) << 12
                                          )
                                          + 141
                                       ^ 118
                                 )
                              );
                              var22 += (-701801796 ^ 1520563746 | 1) & 570757217;
                              continue label85;
                           }

                           var3 = -1524747679 - -1727850911 ^ -1579255817;
                        } catch (Exception var13) {
                           boolean var24 = false;
                           return;
                        }
                  }

                  switch (var3 - 1809719328 + 1070350487 + 1929918102 - 1675172824 - 703913430 - 1247398766) {
                     case 118940964:
                     default:
                        try {
                           0<"JNT",-824628863,"ዕᛕ","郊듊틊짊\udeca짊韊퓊짊훊쿊韊믊\udcca\udaca퇊훊쿊ꏊ释뻊","äѼ",1920758631>(
                              var10000, 0<"JNT",-824628863,"ೕ˕䫕ೕვ绕ࣕ狕","郊释듊틊짊\udeca짊韊퓊짊훊쿊韊믊\udcca\udaca퇊훊쿊ꏊ","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920758628>(var25)
                           );
                           0<"JNT",-1710224333,"\u0ad5盕","郊듊쯊\udacaꏊ释뻊","ҬЌ",1920758633>(1<"JNT",632072613,"ƹũȡ","ꔀꚀ\udbff","ؕߕᄕᡕᲕ๕",737924813>());
                        } catch (Exception var6) {
                           boolean var28 = false;
                           return;
                        }

                        var3 = -1390660320 >>> 653216644 ^ 1346817117;
                        continue label87;
                     case 479460840:
                        try {
                           0<"JNT",-824628863,"ӕ\u0ad5","郊듊틊짊\udeca짊韊퓊짊훊쿊韊믊\udcca\udaca퇊훊쿊ꏊ释뻊","äѼ",1920758623>(
                              var10000, 0<"JNT",-824628863,"ೕ˕䫕ೕვ绕ࣕ狕","郊释듊틊짊\udeca짊韊퓊짊훊쿊韊믊\udcca\udaca퇊훊쿊ꏊ","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920758620>(var25)
                           );
                           var10000 = 1<"JNT",632072613,"ƹũȡ","ꔀꚀ\udbff","ؕߕᄕᡕᲕ๕",737924981>();
                           var22 = 1580806084 << (-1691740569 & -1482394192) ^ 1580806084;
                           var10002 = (StringBuilder)0<"JNT",-486620083,"鳕绕ࣕ绕ೕ꣕","郊듊틊짊\udeca짊韊퓊짊훊쿊韊믊\udcca\udaca퇊훊쿊ꏊ释뻊","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920758625>(
                              "炙\u209fꂟゟ"
                           );
                        } catch (Exception var10) {
                           boolean var27 = false;
                           return;
                        }
                  }
               }

               try {
                  var3 = -1642229026 * -705951817 ^ 1416583327;
               } catch (Exception var9) {
                  boolean var29 = false;
                  return;
               }
            }
         }
      }
   }

   // $VF: renamed from: zcu () java.lang.String
   // $VF: Irreducible bytecode was duplicated to produce valid code
   public String method_1650() {
      int var2 = -1512478835;
      int var10000;
      StringBuilder var10001;
      if (0<"JNT",-824628863,"ە盕ೕ瓕˕法拕軕賕黕飕","郊释싊","ќҔѬɜєҴќҔäѼôҜѬɜäҬôѤѤÄɤɴɌ",1920758651>(
         1<"JNT",2020854725,"ȡő","ꔀꚀ\udbff","ؕߕᄕᦕᣕᬕॕ\u1ad5៕ᦕᣕᡕᲕᗕផᬕॕᡕᤕᗕ᱕᱕ᕕౕ\u09d5ࠕ๕",737925019>(this)
      )) {
         var10000 = -1566014531 + -1566014531 ^ 1162938234;
         var10001 = (StringBuilder)0<"JNT",-486620083,"鳕绕ࣕ绕ೕ꣕","郊듊틊짊\udeca짊韊퓊짊훊쿊韊믊\udcca\udaca퇊훊쿊ꏊ释뻊","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920758650>(
            "耲耵\u0000耴7耫17耩耍耫\u0002\uffc9耼耀\u00027+"
         );
         var2 = -1081671963 << -1081671963 ^ 1613597608;
      } else {
         var2 = -1869202596;

         label43:
         while (true) {
            switch (((var2 ^ 1675627214 ^ 360618584) - 1986728348 ^ 1402777753) - 1785265415 + 851475944) {
               case 72919960:
               default:
                  if (0<"JNT",-824628863,"ە盕ೕ瓕˕法拕軕雕雕铕","郊释듊훊췊\udcca韊헊퇊훊췊쯊\udaca짊컊\udcca韊쯊퓊짊\udbca\udbca쟊黊鳊髊ꏊ","ќҔѬɜєҴќҔäѼôҜѬɜäҬôѤѤÄɤɴɌ",1920758640>(
                           1<"JNT",2020854725,"ȡő","ꔀꚀ\udbff","ؕߕᄕᦕᣕᬕॕ\u1ad5៕ᦕᣕᡕᲕᗕផᬕॕᡕᤕᗕ᱕᱕ᕕౕ\u09d5ࠕ๕",737924996>(this)
                        )
                        != null
                     && 0<"JNT",-824628863,"滕ᓕ","郊释싊","҄Ѽ",1920758642>(1<"JNT",2020854725,"ȩǹ","ꔀꚀ\udbff","ؕߕᄕ\u1755Ვ๕",737924994>(this))) {
                     class_642 var1 = 0<"JNT",-824628863,"ە盕ೕ瓕˕法拕軕雕雕铕","郊释듊훊췊\udcca韊헊퇊훊췊쯊\udaca짊컊\udcca韊쯊퓊짊\udbca\udbca쟊黊鳊髊ꏊ","ќҔѬɜєҴќҔäѼôҜѬɜäҬôѤѤÄɤɴɌ",1920758660>(
                        1<"JNT",2020854725,"ȡő","ꔀꚀ\udbff","ؕߕᄕᦕᣕᬕॕ\u1ad5៕ᦕᣕᡕᲕᗕផᬕॕᡕᤕᗕ᱕᱕ᕕౕ\u09d5ࠕ๕",737924960>(this)
                     );
                     return 1<"JNT",2020854725,"ǱǹǙȡǡ©͉ͩͱ̹","Ꞁ\udb7fꒀ쟿꜀\ud97fꞀ\udb7f\udc7fꖀ\udd7f\udbffꒀ쟿\udc7f\ud8ff\udd7fꐀꐀ\ude7f쏿쓿엿","ؕߕᄕ᪕ᗕᮕᗕॕᤕᗕᦕ\u1755ॕᑕᬕᲕ៕ᦕ\u1755๕",737924958>(
                        var1
                     );
                  }

                  var2 = -117072104;
                  break;
               case 319475276:
                  var10000 = (2022435784 | -2125621604 | 0) & 34603008;
                  var10001 = (StringBuilder)0<"JNT",-486620083,"鳕绕ࣕ绕ೕ꣕","郊듊틊짊\udeca짊韊퓊짊훊쿊韊믊\udcca\udaca퇊훊쿊ꏊ释뻊","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920758636>(
                     "蚞䚝躝亝ꚝ溝躝\ue69d⚝욝庝\uee9b嚞욝庝㺝욝庝"
                  );
                  var2 = -719072861 >> -719072861 ^ 1782181072;
                  break label43;
            }
         }
      }

      label55:
      while (true) {
         switch ((var2 + 1888613399 - 759371446 + 867054818 ^ 1559623550 ^ 1511544736) - 968837052) {
            case -951877159:
               var6 = var10001;
               if (var10000 >= ((-516073454 << -444775240 | 18) & 764470295)) {
                  var2 = (-535571400 ^ -291354198 | 1916821545) & 1934061033;
                  break label55;
               }

               int var13 = ((0<"JNT",-824628863,"櫕瓕滕ვ껕ೕ","郊뇊释ꯊ","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920758639>(var10001, var10000) ^ 27) + 204 ^ 183) - 25;
               char var14 = (char)((var13 & 32768) >> 15 | var13 << 1);
               0<"JNT",-824628863,"\u0ad5盕ೕ\uaad5瓕滕ვ껕ೕ","郊뇊ꯊ释뻊","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920758638>(
                  var10001, var10000, (char)((var13 & 32768) >> 15 | var13 << 1)
               );
               var10000 += 202931851 & -397444372 ^ 134773385;
               var2 = -1081671963 << -1081671963 ^ 1613597608;
               break;
            case -944258499:
            default:
               var6 = var10001;
               if (var10000 >= ((334351467 | 16) & -1006624110)) {
                  var2 = (801588609 * -743217094 | -870661688) & -63254072;
                  break label55;
               }

               int var9 = 0<"JNT",-824628863,"櫕瓕滕ვ껕ೕ","郊뇊释ꯊ","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920758647>(var10001, var10000) + 131 + 226;
               char var10 = (char)((((var9 & 63488) >> 11 | var9 << 5) ^ 191) - 129);
               0<"JNT",-824628863,"\u0ad5盕ೕ\uaad5瓕滕ვ껕ೕ","郊뇊ꯊ释뻊","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920758646>(
                  var10001, var10000, (char)((((var9 & 63488) >> 11 | var9 << 5) ^ 191) - 129)
               );
               var10000 += (-1188395185 | 671185093 & 1065632079) ^ -1188378802;
               var2 = -719072861 >> -719072861 ^ 1782181072;
         }
      }

      switch (((var2 ^ 783716146) + 1895841294 - 1270197983 ^ 427677576 ^ 1616336483) + 339970242) {
         case -1558189948:
         default:
            return 0<"JNT",-824628863,"ೕ˕䫕ೕვ绕ࣕ狕","郊释듊틊짊\udeca짊韊퓊짊훊쿊韊믊\udcca\udaca퇊훊쿊ꏊ","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920758649>(var6);
         case 262961379:
            return 0<"JNT",-824628863,"ೕ˕䫕ೕვ绕ࣕ狕","郊释듊틊짊\udeca짊韊퓊짊훊쿊韊믊\udcca\udaca퇊훊쿊ꏊ","ҼôМôɜҬôќ҄ɜŤѬѼҴќ҄ǼДҴҬìҔѼ",1920758637>(var6);
      }
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1413(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 - 1112664873 + 157591489 - 1576019636 ^ 1624535464 ^ 1797027742) - 212459998 - 1906434376 ^ 1810823039) - 550014680;
      MethodHandle var10000 = field_1875[((var10 - 1112664873 + 157591489 - 1576019636 ^ 1624535464 ^ 1797027742) - 212459998 - 1906434376 ^ 1810823039)
         - 550014680
         - 421342209];
      if (field_1875[var10001 - 421342209] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = (595824449 | 9487426 ^ 595824449 | 0) & -1874579436; var23 < var13.length(); var23 += -538860266 * -2092538726 ^ 943580989) {
            int var42 = var13.charAt(var23);
            int var10004 = (var42 & 65532) >> 2;
            int var43 = ((var42 & 65532) >> 2 | var42 << 14) + 123 - 174;
            int var89 = (((var42 & 65532) >> 2 | var42 << 14) + 123 - 174 & 63488) >> 11;
            var42 = (((var10004 | var42 << 14) + 123 - 174 & 63488) >> 11 | ((var42 & 65532) >> 2 | var42 << 14) + 123 - 174 << 5) - 80;
            var10004 = ((var89 | var43 << 5) - 80 & 61440) >> 12;
            int var45 = ((((var89 | var43 << 5) - 80 & 61440) >> 12 | var42 << 4) ^ 98) - 105 + 246;
            int var91 = (((((var89 | var43 << 5) - 80 & 61440) >> 12 | var42 << 4) ^ 98) - 105 + 246 & 0) >> 16;
            char var46 = (char)(
               (((var10004 | var42 << 4) ^ 98) - 105 + 246 & 0) >> 16 | ((((var89 | var43 << 5) - 80 & 61440) >> 12 | var42 << 4) ^ 98) - 105 + 246 << 0
            );
            var13.setCharAt(var23, (char)(var91 | var45 << 0));
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = 397692543 ^ 904071153 ^ 576145806; var29 < var16.length(); var29 += -659548184 + -1746854868 ^ 1888564245) {
            int var51 = var16.charAt(var29) - 141 ^ 152 ^ 143 ^ 48 ^ 229;
            int var92 = (var51 & 64512) >> 10;
            int var52 = (var51 & 64512) >> 10 | var51 << 6;
            int var93 = (((var51 & 64512) >> 10 | var51 << 6) & 65532) >> 2;
            var51 = ((var92 | var51 << 6) & 65532) >> 2 | ((var51 & 64512) >> 10 | var51 << 6) << 14;
            var92 = ((var93 | var52 << 14) & 0) >> 16;
            int var54 = ((var93 | var52 << 14) & 0) >> 16 | var51 << 0;
            int var95 = ((((var93 | var52 << 14) & 0) >> 16 | var51 << 0) & 61440) >> 12;
            char var55 = (char)((((var92 | var51 << 0) & 61440) >> 12 | (((var93 | var52 << 14) & 0) >> 16 | var51 << 0) << 4) + 152);
            var16.setCharAt(var29, (char)((var95 | var54 << 4) + 152));
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_279.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = (887757041 >>> -738092398 | 0) & 570302593; var35 < var19.length(); var35 += -1975886899 * (-1106303452 ^ 1106386383) ^ 1129546798) {
            int var60 = var19.charAt(var35);
            int var96 = (var60 & 65535) >> 0;
            int var61 = (var60 & 65535) >> 0 | var60 << 16;
            int var97 = (((var60 & 65535) >> 0 | var60 << 16) & 65534) >> 1;
            var60 = (((var96 | var60 << 16) & 65534) >> 1 | ((var60 & 65535) >> 0 | var60 << 16) << 15) - 96 ^ 233;
            var96 = (((var97 | var61 << 15) - 96 ^ 233) & 0) >> 16;
            int var63 = ((((var97 | var61 << 15) - 96 ^ 233) & 0) >> 16 | var60 << 0) + 169;
            int var99 = (((((var97 | var61 << 15) - 96 ^ 233) & 0) >> 16 | var60 << 0) + 169 & 63488) >> 11;
            var60 = ((var96 | var60 << 0) + 169 & 63488) >> 11 | ((((var97 | var61 << 15) - 96 ^ 233) & 0) >> 16 | var60 << 0) + 169 << 5;
            var96 = ((var99 | var63 << 5) & 65024) >> 9;
            int var65 = ((var99 | var63 << 5) & 65024) >> 9 | var60 << 7;
            int var101 = ((((var99 | var63 << 5) & 65024) >> 9 | var60 << 7) & 49152) >> 14;
            char var66 = (char)((((var96 | var60 << 7) & 49152) >> 14 | (((var99 | var63 << 5) & 65024) >> 9 | var60 << 7) << 2) - 6);
            var19.setCharAt(var35, (char)((var101 | var65 << 2) - 6));
         }

         Class var7 = Class.forName(var19.toString(), false, Class_279.class.getClassLoader());
         switch ((var4 - 1251686349 - 1966009372 ^ 2099695312 ^ 1453018155 ^ 235434294 ^ 998877309 ^ 1753290294) - 142789654 - 742536542 - 81531393) {
            case 468245101:
               var10000 = var0.findConstructor(var7, var6);
               break;
            case 1074869417:
            case 1827774594:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 1935118935:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            case 2130612739:
               var10000 = var0.findSpecial(var7, var5, var6, Class_279.class);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_1875[((var10 - 1112664873 + 157591489 - 1576019636 ^ 1624535464 ^ 1797027742) - 212459998 - 1906434376 ^ 1810823039) - 550014680 - 421342209] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1414(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 - 2101427230 ^ 1041808831 ^ 11943956) - 1654755748 - 1418793864 ^ 894977260) - 1759838647 - 931188534 - 1462453114;
      MethodHandle var10000 = field_1875[((var10 - 2101427230 ^ 1041808831 ^ 11943956) - 1654755748 - 1418793864 ^ 894977260)
         - 1759838647
         - 931188534
         - 1462453114
         + 165121923];
      if (field_1875[var10001 + 165121923] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = -1484756122 * -15291274 ^ 1377700100; var24 < var14.length(); var24 += -1203328697 & -1950938966 ^ -2012870653) {
            int var43 = var14.charAt(var24) - 186 + 205 - 72 ^ 180;
            char var46 = (char)(
               ((((((var43 & 65532) >> 2 | var43 << 14) & 65534) >> 1 | ((var43 & 65532) >> 2 | var43 << 14) << 15) ^ 192 ^ 12 ^ 139) & 0) >> 16
                  | (((((var43 & 65532) >> 2 | var43 << 14) & 65534) >> 1 | ((var43 & 65532) >> 2 | var43 << 14) << 15) ^ 192 ^ 12 ^ 139) << 0
            );
            var14.setCharAt(
               var24,
               (char)(
                  ((((((var43 & 65532) >> 2 | var43 << 14) & 65534) >> 1 | ((var43 & 65532) >> 2 | var43 << 14) << 15) ^ 192 ^ 12 ^ 139) & 0) >> 16
                     | (((((var43 & 65532) >> 2 | var43 << 14) & 65534) >> 1 | ((var43 & 65532) >> 2 | var43 << 14) << 15) ^ 192 ^ 12 ^ 139) << 0
               )
            );
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = (357840376 | 680118382 | 0) & -2145255423; var30 < var17.length(); var30 += (876888088 & 876888088 | 1) & -1045288891) {
            int var51 = var17.charAt(var30);
            int var88 = (var51 & 32768) >> 15;
            int var52 = (var51 & 32768) >> 15 | var51 << 1;
            int var89 = (((var51 & 32768) >> 15 | var51 << 1) & 65024) >> 9;
            var51 = ((var88 | var51 << 1) & 65024) >> 9 | ((var51 & 32768) >> 15 | var51 << 1) << 7;
            var88 = ((var89 | var52 << 7) & 32768) >> 15;
            int var54 = ((((var89 | var52 << 7) & 32768) >> 15 | var51 << 1) + 128 ^ 206) - 197 + 40;
            int var91 = (((((var89 | var52 << 7) & 32768) >> 15 | var51 << 1) + 128 ^ 206) - 197 + 40 & 0) >> 16;
            char var55 = (char)(
               ((((var88 | var51 << 1) + 128 ^ 206) - 197 + 40 & 0) >> 16 | ((((var89 | var52 << 7) & 32768) >> 15 | var51 << 1) + 128 ^ 206) - 197 + 40 << 0)
                  - 117
                  + 127
            );
            var17.setCharAt(var30, (char)((var91 | var54 << 0) - 117 + 127));
         }

         Class var6 = Class.forName(var17.toString(), false, Class_279.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = (-2001616204 - 394090221 | 0) & 168329232; var36 < var20.length(); var36 += (-920821737 ^ 1898125274 << 621511516 | 1) & -1797087767) {
            int var60 = (var20.charAt(var36) ^ 197) - 148;
            char var65 = (char)(
               (
                        (
                              (
                                       (
                                                (
                                                      (
                                                               (
                                                                     (((var60 & 57344) >> 13 | var60 << 3) & 57344) >> 13
                                                                        | ((var60 & 57344) >> 13 | var60 << 3) << 3
                                                                  )
                                                                  & 65408
                                                            )
                                                            >> 7
                                                         | ((((var60 & 57344) >> 13 | var60 << 3) & 57344) >> 13 | ((var60 & 57344) >> 13 | var60 << 3) << 3)
                                                            << 9
                                                   )
                                                   ^ 221
                                             )
                                             + 231
                                             + 86
                                          & 65528
                                    )
                                    >> 3
                                 | (
                                          (
                                                (((((var60 & 57344) >> 13 | var60 << 3) & 57344) >> 13 | ((var60 & 57344) >> 13 | var60 << 3) << 3) & 65408)
                                                      >> 7
                                                   | ((((var60 & 57344) >> 13 | var60 << 3) & 57344) >> 13 | ((var60 & 57344) >> 13 | var60 << 3) << 3) << 9
                                             )
                                             ^ 221
                                       )
                                       + 231
                                       + 86
                                    << 13
                           )
                           & 65532
                     )
                     >> 2
                  | (
                        (
                                 (
                                          (
                                                (((((var60 & 57344) >> 13 | var60 << 3) & 57344) >> 13 | ((var60 & 57344) >> 13 | var60 << 3) << 3) & 65408)
                                                      >> 7
                                                   | ((((var60 & 57344) >> 13 | var60 << 3) & 57344) >> 13 | ((var60 & 57344) >> 13 | var60 << 3) << 3) << 9
                                             )
                                             ^ 221
                                       )
                                       + 231
                                       + 86
                                    & 65528
                              )
                              >> 3
                           | (
                                    (
                                          (((((var60 & 57344) >> 13 | var60 << 3) & 57344) >> 13 | ((var60 & 57344) >> 13 | var60 << 3) << 3) & 65408) >> 7
                                             | ((((var60 & 57344) >> 13 | var60 << 3) & 57344) >> 13 | ((var60 & 57344) >> 13 | var60 << 3) << 3) << 9
                                       )
                                       ^ 221
                                 )
                                 + 231
                                 + 86
                              << 13
                     )
                     << 14
            );
            var20.setCharAt(
               var36,
               (char)(
                  (
                           (
                                 (
                                          (
                                                   (
                                                         (
                                                                  (
                                                                        (((var60 & 57344) >> 13 | var60 << 3) & 57344) >> 13
                                                                           | ((var60 & 57344) >> 13 | var60 << 3) << 3
                                                                     )
                                                                     & 65408
                                                               )
                                                               >> 7
                                                            | ((((var60 & 57344) >> 13 | var60 << 3) & 57344) >> 13 | ((var60 & 57344) >> 13 | var60 << 3) << 3)
                                                               << 9
                                                      )
                                                      ^ 221
                                                )
                                                + 231
                                                + 86
                                             & 65528
                                       )
                                       >> 3
                                    | (
                                             (
                                                   (((((var60 & 57344) >> 13 | var60 << 3) & 57344) >> 13 | ((var60 & 57344) >> 13 | var60 << 3) << 3) & 65408)
                                                         >> 7
                                                      | ((((var60 & 57344) >> 13 | var60 << 3) & 57344) >> 13 | ((var60 & 57344) >> 13 | var60 << 3) << 3) << 9
                                                )
                                                ^ 221
                                          )
                                          + 231
                                          + 86
                                       << 13
                              )
                              & 65532
                        )
                        >> 2
                     | (
                           (
                                    (
                                             (
                                                   (((((var60 & 57344) >> 13 | var60 << 3) & 57344) >> 13 | ((var60 & 57344) >> 13 | var60 << 3) << 3) & 65408)
                                                         >> 7
                                                      | ((((var60 & 57344) >> 13 | var60 << 3) & 57344) >> 13 | ((var60 & 57344) >> 13 | var60 << 3) << 3) << 9
                                                )
                                                ^ 221
                                          )
                                          + 231
                                          + 86
                                       & 65528
                                 )
                                 >> 3
                              | (
                                       (
                                             (((((var60 & 57344) >> 13 | var60 << 3) & 57344) >> 13 | ((var60 & 57344) >> 13 | var60 << 3) << 3) & 65408) >> 7
                                                | ((((var60 & 57344) >> 13 | var60 << 3) & 57344) >> 13 | ((var60 & 57344) >> 13 | var60 << 3) << 3) << 9
                                          )
                                          ^ 221
                                    )
                                    + 231
                                    + 86
                                 << 13
                        )
                        << 14
               )
            );
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_279.class.getClassLoader()).returnType();
         switch (((var4 + 1988006541 - 20053418 - 1243227129 - 264830229 ^ 292160140 ^ 1181586234) + 2010708114 ^ 927176399 ^ 1335860171) + 968122425) {
            case 787146899:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            case 928402215:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            case 1809202098:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            case 2116291571:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_1875[((var10 - 2101427230 ^ 1041808831 ^ 11943956) - 1654755748 - 1418793864 ^ 894977260) - 1759838647 - 931188534 - 1462453114 + 165121923] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
