import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;
import net.minecraft.class_1657;

public class Class_154 extends Class_342 {
   // $VF: renamed from: oux Class_49
   public Class_49 field_2096;
   // $VF: renamed from: orb Class_105
   public Class_105 field_2097;
   // $VF: renamed from: zox java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_2098 = new MethodHandle[1749397636 >>> 1749397636 ^ 109337386];

   public Class_154() {
      int var10001 = 6984 & 1823768726;

      StringBuilder var10002;
      for (var10002 = (StringBuilder)0<"JNT",1896210444,"焗䄚鄚䄚\uf11a鄗","陻隟隹隀隵隀陲隿隀隽隺陲隖隷隱隸隽隺陮陸隕","ࢣࡳࣣࡳౣࢃࡳࡣࠓౣ\u0b53ःणࣳࡣࠓਣळࣳࢃࠃ࠳ण",2071457808>("ŎƀǶŒǼǮ");
         var10001 < (1158316080 >>> -2059213193 ^ 140);
         var10001 += (-294009635 << -914298452 | 1) & 41954153
      ) {
         int var14 = 0<"JNT",1641495798,"\ue119ㄚ섙턚섗\uf11a","陻隘陸陦","ࢣࡳࣣࡳౣࢃࡳࡣࠓౣ\u0b53ःणࣳࡣࠓਣळࣳࢃࠃ࠳ण",2071457749>(var10002, var10001) ^ '1' ^ 9;
         int var10005 = (var14 & 57344) >> 13;
         int var15 = (var14 & 57344) >> 13 | var14 << 3;
         int var40 = (((var14 & 57344) >> 13 | var14 << 3) & 65520) >> 4;
         char var16 = (char)((((var10005 | var14 << 3) & 65520) >> 4 | ((var14 & 57344) >> 13 | var14 << 3) << 12) - 115);
         0<"JNT",1641495798,"\ue11aĚ\uf11a\ue117ㄚ섙턚섗\uf11a","陻隘陦陸隕","ࢣࡳࣣࡳౣࢃࡳࡣࠓౣ\u0b53ःणࣳࡣࠓਣळࣳࢃࠃ࠳ण",2071457730>(
            var10002, var10001, (char)((var40 | var15 << 12) - 115)
         );
      }

      String var2 = 0<"JNT",1641495798,"\uf11aꄚ\ue118\uf11a턚䄚鄚ℚ","陻陸隟隹隀隵隀陲隿隀隽隺陲隖隷隱隸隽隺陮","ࢣࡳࣣࡳౣࢃࡳࡣࠓౣ\u0b53ःणࣳࡣࠓਣळࣳࢃࠃ࠳ण",2071457765>(var10002);
      int var8 = (-528997214 << -1888887275 | 0) & 540942350;

      StringBuilder var18;
      for (var18 = (StringBuilder)0<"JNT",1896210444,"焗䄚鄚䄚\uf11a鄗","陻隟隹隀隵隀陲隿隀隽隺陲隖隷隱隸隽隺陮陸隕","ࢣࡳࣣࡳౣࢃࡳࡣࠓౣ\u0b53ःणࣳࡣࠓਣळࣳࢃࠃ࠳ण",2071457810>(
            "涕ᶖ鶖궗ﶖ嶗춖鶛궗鶛鶖\udd96궗ⶖ涗붖趛춖鶛ᶗ\u2d97嶖붗\u0d97ᶖﶚ"
         );
         var8 < ((-6806383 - -231491462 | 8) & 840630490);
         var8 += -2077288176 + -2077288176 ^ 140390945
      ) {
         char var32 = 0<"JNT",1641495798,"\ue119ㄚ섙턚섗\uf11a","陻隘陸陦","ࢣࡳࣣࡳౣࢃࡳࡣࠓౣ\u0b53ःणࣳࡣࠓਣळࣳࢃࠃ࠳ण",2071457738>(var18, var8);
         int var10006 = (var32 & 'ﾀ') >> 7;
         int var33 = ((var32 & 'ﾀ') >> 7 | var32 << '\t') - 27;
         int var47 = (((var32 & 'ﾀ') >> 7 | var32 << '\t') - 27 & 65504) >> 5;
         var32 = (char)((((var10006 | var32 << '\t') - 27 & 65504) >> 5 | ((var32 & 'ﾀ') >> 7 | var32 << '\t') - 27 << 11) - 189 ^ 220);
         0<"JNT",1641495798,"\ue11aĚ\uf11a\ue117ㄚ섙턚섗\uf11a","陻隘陦陸隕","ࢣࡳࣣࡳౣࢃࡳࡣࠓౣ\u0b53ःणࣳࡣࠓਣळࣳࢃࠃ࠳ण",2071457727>(
            var18, var8, (char)((var47 | var33 << 11) - 189 ^ 220)
         );
      }

      super(
         var2,
         0<"JNT",1641495798,"\uf11aꄚ\ue118\uf11a턚䄚鄚ℚ","陻陸隟隹隀隵隀陲隿隀隽隺陲隖隷隱隸隽隺陮","ࢣࡳࣣࡳౣࢃࡳࡣࠓౣ\u0b53ःणࣳࡣࠓਣळࣳࢃࠃ࠳ण",2071457809>(var18),
         -1,
         1<"JNT",-1927233213,"\uf75f｟","㼬⠬","⓿◿䃿痿滿㟿",630556880>()
      );
      var10001 = 0;

      for (var10002 = (StringBuilder)0<"JNT",1896210444,"焗䄚鄚䄚\uf11a鄗","陻隟隹隀隵隀陲隿隀隽隺陲隖隷隱隸隽隺陮陸隕","ࢣࡳࣣࡳౣࢃࡳࡣࠓౣ\u0b53ःणࣳࡣࠓਣळࣳࢃࠃ࠳ण",2071457811>("ΪՂԂҊӲҢ");
         var10001 < (-1731312244 << -1526944069 ^ 1610612742);
         var10001 += 711707128 * 54082519 ^ 1481295689
      ) {
         int var21 = 0<"JNT",1641495798,"\ue119ㄚ섙턚섗\uf11a","陻隘陸陦","ࢣࡳࣣࡳౣࢃࡳࡣࠓౣ\u0b53ःणࣳࡣࠓਣळࣳࢃࠃ࠳ण",2071457767>(var10002, var10001) ^ 6;
         int var43 = (var21 & 65535) >> 0;
         int var22 = ((var21 & 65535) >> 0 | var21 << 16) + 172;
         int var44 = (((var21 & 65535) >> 0 | var21 << 16) + 172 & 65528) >> 3;
         char var23 = (char)((((var43 | var21 << 16) + 172 & 65528) >> 3 | ((var21 & 65535) >> 0 | var21 << 16) + 172 << 13) - 70);
         0<"JNT",1641495798,"\ue11aĚ\uf11a\ue117ㄚ섙턚섗\uf11a","陻隘陦陸隕","ࢣࡳࣣࡳౣࢃࡳࡣࠓౣ\u0b53ःणࣳࡣࠓਣळࣳࢃࠃ࠳ण",2071457764>(
            var10002, var10001, (char)((var44 | var22 << 13) - 70)
         );
      }

      this.field_2096 = (Class_49)0<"JNT",1896210444,"焗䄚鄚䄚\uf11a鄗","陻隟隹隀隵隀陲隿隀隽隺陲隖隷隱隸隽隺陮陧陧陧陧陸隕","ࠃࡓ",2071457729>(
         0<"JNT",1641495798,"\uf11aꄚ\ue118\uf11a턚䄚鄚ℚ","陻陸隟隹隀隵隀陲隿隀隽隺陲隖隷隱隸隽隺陮","ࢣࡳࣣࡳౣࢃࡳࡣࠓౣ\u0b53ःणࣳࡣࠓਣळࣳࢃࠃ࠳ण",2071457724>(var10002), 0.0, 2.0, 0.5, 0.05
      );
      var10001 = 1249886774 << 1249886774 ^ -1920991232;

      for (var10002 = (StringBuilder)0<"JNT",1896210444,"焗䄚鄚䄚\uf11a鄗","陻隟隹隀隵隀陲隿隀隽隺陲隖隷隱隸隽隺陮陸隕","ࢣࡳࣣࡳౣࢃࡳࡣࠓౣ\u0b53ःणࣳࡣࠓਣळࣳࢃࠃ࠳ण",2071457726>("욆묆뒆딆먆뚆鐆촆뚆묆똆뚆봆");
         var10001 < (-1222790058 & -859698021 ^ -2080373729);
         var10001 += (-808298404 >> -997934933 | 1) & 131217
      ) {
         char var26 = 0<"JNT",1641495798,"\ue119ㄚ섙턚섗\uf11a","陻隘陸陦","ࢣࡳࣣࡳౣࢃࡳࡣࠓౣ\u0b53ःणࣳࡣࠓਣळࣳࢃࠃ࠳ण",2071457731>(var10002, var10001);
         int var45 = (var26 & 'ﰀ') >> 10;
         int var27 = ((var26 & 'ﰀ') >> 10 | var26 << 6) - 127 - 70 ^ 228;
         int var46 = ((((var26 & 'ﰀ') >> 10 | var26 << 6) - 127 - 70 ^ 228) & 57344) >> 13;
         char var28 = (char)((((var45 | var26 << 6) - 127 - 70 ^ 228) & 57344) >> 13 | (((var26 & 'ﰀ') >> 10 | var26 << 6) - 127 - 70 ^ 228) << 3);
         0<"JNT",1641495798,"\ue11aĚ\uf11a\ue117ㄚ섙턚섗\uf11a","陻隘陦陸隕","ࢣࡳࣣࡳౣࢃࡳࡣࠓౣ\u0b53ःणࣳࡣࠓਣळࣳࢃࠃ࠳ण",2071457728>(var10002, var10001, (char)(var46 | var27 << 3));
      }

      this.field_2097 = (Class_105)0<"JNT",1896210444,"焗䄚鄚䄚\uf11a鄗","陻隟隹隀隵隀陲隿隀隽隺陲隖隷隱隸隽隺陮隉陸隕","ࠓण",2071457734>(
         0<"JNT",1641495798,"\uf11aꄚ\ue118\uf11a턚䄚鄚ℚ","陻陸隟隹隀隵隀陲隿隀隽隺陲隖隷隱隸隽隺陮","ࢣࡳࣣࡳౣࢃࡳࡣࠓౣ\u0b53ःणࣳࡣࠓਣळࣳࢃࠃ࠳ण",2071457737>(var10002), true
      );
      0<"JNT",1641495798,"섚ě","陻階隟隰隄隄陮陸隕","࣓",2071457725>(
         this, new Class_271[]{1<"JNT",-964159632,"ݟὟ齠","ㄬ","⓿◿䃿毿绿㟿",630556895>(this), 1<"JNT",-964159632,"ݟ흟\uef5f","ㄬ","⓿◿䃿棿濿㟿",630556894>(this)}
      );
   }

   // $VF: renamed from: mg () void
   @Override
   public void method_1407() {
      0<"JNT",-1568374803,"脚ℚ","陻陸隕","ळ॓ߣ",2071457751>(this);
   }

   // $VF: renamed from: q () void
   @Override
   public void method_1408() {
      0<"JNT",-1568374803,"섚","陻陸隕","ळ॓ߣ",2071457748>(this);
   }

   // $VF: renamed from: ag (Class_355) void
   @Class_21
   public void method_1813(Class_355 var1) {
      if (1<"JNT",-964159632,"읟\udf5fὟ","㰬⼬","⓿◿䃿拿槿磿⏿懿旿拿槿濿绿淿櫿磿⏿濿惿淿翿翿叿㷿㻿㗿㯿㟿",630556897>(var1) instanceof class_1657) {
         0<"JNT",1641495798,"\ue11aĚ\uf11a턘Ě\uf11aě턚鄚ᄙ섙焚ěĚ","陻隟隹隀隵隀陲隿隀隽隺陲隒隁隹隄隆隷陮陸隕","\u0893णࠓౣ॓ृ\u0893ࡣࠓ࠳ृ\u0893ओ࠳ण࠳ࠃౣࡳ॓ࢳౣࢳࣳৃࣳࡣౣࣳࡣࢣ࠳ࡓःࣳ\u0893ࡣౣࡓࡳࢃࢃࠣࡳࡓ࣓ౣ\u0a53ࡳࢃࢃࠣࡳࡓ࣓\u0af3ࡣߣ\u0893ଣ࠳ःळणࡣࡳࠣࢃ࠳",2071457402>(
            1<"JNT",-964159632,"佟坟","㰬⼬","⓿◿䃿揿绿毿⏿翿糿揿拿毿槿糿揿篿槿绿槿棿⏿淿翿懿⏿懿旿瓿旿拿⏿旿拿替槿濿磿旿揿拿⏿濿淿惿惿滿淿濿柿⏿俿淿惿惿滿淿濿柿䗿拿櫿揿廿槿磿秿绿拿淿滿惿槿㟿",630556920>(var1),
            0<"JNT",-2114889598,"ᄛ섙焚ěĚꄘᄚ","陻陥陸隟隹隀隵隀陲隿隀隽隺陲陥隿隲隀隷陮","ࢣࡳࣣࡳౣࢃࡳࡣࠓౣৣࢃ\u0893ࡳः",2071457389>(
               (float)0<"JNT",1641495798,"섙넚鄚","陻陸陧","ࠃࡓ",2071457400>(1<"JNT",-964159632,"ݟ흟\uef5f","ㄬ","⓿◿䃿棿濿㟿",630556911>(this))
            )
         );
      }
   }

   // $VF: renamed from: dp () double
   public double method_1814() {
      return !0<"JNT",1641495798,"섙ㄛ","陻陸隉","ࠓण",2071457388>(1<"JNT",-964159632,"ݟὟ齠","ㄬ","⓿◿䃿毿绿㟿",630556923>(this))
         ? 0.0
         : 0<"JNT",1641495798,"섙넚鄚","陻陸陧","ࠃࡓ",2071457390>(1<"JNT",-964159632,"ݟ흟\uef5f","ㄬ","⓿◿䃿棿濿㟿",630556921>(this));
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1413(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 + 735272687 + 620236252 - 1472962279 ^ 972343638) + 1627960947 ^ 380952960 ^ 1930907432) + 1336659528 ^ 1545375817;
      MethodHandle var10000 = field_2098[((var10 + 735272687 + 620236252 - 1472962279 ^ 972343638) + 1627960947 ^ 380952960 ^ 1930907432) + 1336659528
         ^ 1545375817
         ^ 1187497039];
      if (field_2098[var10001 ^ 1187497039] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = -1713474641 + (-621731683 << 2064878095) ^ 707589039; var23 < var13.length(); var23 += -48822519 + -2080640428 ^ -2129462948) {
            int var42 = var13.charAt(var23);
            int var10004 = (var42 & 65408) >> 7;
            int var43 = (var42 & 65408) >> 7 | var42 << 9;
            int var95 = (((var42 & 65408) >> 7 | var42 << 9) & 64512) >> 10;
            var42 = ((var10004 | var42 << 9) & 64512) >> 10 | ((var42 & 65408) >> 7 | var42 << 9) << 6;
            var10004 = ((var95 | var43 << 6) & 65535) >> 0;
            int var45 = ((var95 | var43 << 6) & 65535) >> 0 | var42 << 16;
            int var97 = ((((var95 | var43 << 6) & 65535) >> 0 | var42 << 16) & 64512) >> 10;
            var42 = ((var10004 | var42 << 16) & 64512) >> 10 | (((var95 | var43 << 6) & 65535) >> 0 | var42 << 16) << 6;
            var10004 = ((var97 | var45 << 6) & 65408) >> 7;
            int var47 = (((var97 | var45 << 6) & 65408) >> 7 | var42 << 9) + 160 - 227;
            int var99 = ((((var97 | var45 << 6) & 65408) >> 7 | var42 << 9) + 160 - 227 & 64512) >> 10;
            char var48 = (char)(
               (((var10004 | var42 << 9) + 160 - 227 & 64512) >> 10 | (((var97 | var45 << 6) & 65408) >> 7 | var42 << 9) + 160 - 227 << 6) - 105 - 18
            );
            var13.setCharAt(var23, (char)((var99 | var47 << 6) - 105 - 18));
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = (-2080456698 & -818333756 | 0) & 67370888; var29 < var16.length(); var29 += (-584857087 >>> -1005730630 | 0) & -1790108919) {
            int var53 = (var16.charAt(var29) ^ 26) - 72;
            char var58 = (char)(
               (
                        (
                                 (
                                          (
                                                (
                                                         (
                                                               (((var53 & 65532) >> 2 | var53 << 14) + 132 & 64512) >> 10
                                                                  | ((var53 & 65532) >> 2 | var53 << 14) + 132 << 6
                                                            )
                                                            & 64512
                                                      )
                                                      >> 10
                                                   | (
                                                         (((var53 & 65532) >> 2 | var53 << 14) + 132 & 64512) >> 10
                                                            | ((var53 & 65532) >> 2 | var53 << 14) + 132 << 6
                                                      )
                                                      << 6
                                             )
                                             & 65504
                                       )
                                       >> 5
                                    | (
                                          (
                                                   (
                                                         (((var53 & 65532) >> 2 | var53 << 14) + 132 & 64512) >> 10
                                                            | ((var53 & 65532) >> 2 | var53 << 14) + 132 << 6
                                                      )
                                                      & 64512
                                                )
                                                >> 10
                                             | ((((var53 & 65532) >> 2 | var53 << 14) + 132 & 64512) >> 10 | ((var53 & 65532) >> 2 | var53 << 14) + 132 << 6)
                                                << 6
                                       )
                                       << 11
                              )
                              - 81
                              + 30
                           & 65504
                     )
                     >> 5
                  | (
                           (
                                    (
                                          (
                                                   (
                                                         (((var53 & 65532) >> 2 | var53 << 14) + 132 & 64512) >> 10
                                                            | ((var53 & 65532) >> 2 | var53 << 14) + 132 << 6
                                                      )
                                                      & 64512
                                                )
                                                >> 10
                                             | ((((var53 & 65532) >> 2 | var53 << 14) + 132 & 64512) >> 10 | ((var53 & 65532) >> 2 | var53 << 14) + 132 << 6)
                                                << 6
                                       )
                                       & 65504
                                 )
                                 >> 5
                              | (
                                    (((((var53 & 65532) >> 2 | var53 << 14) + 132 & 64512) >> 10 | ((var53 & 65532) >> 2 | var53 << 14) + 132 << 6) & 64512)
                                          >> 10
                                       | ((((var53 & 65532) >> 2 | var53 << 14) + 132 & 64512) >> 10 | ((var53 & 65532) >> 2 | var53 << 14) + 132 << 6) << 6
                                 )
                                 << 11
                        )
                        - 81
                        + 30
                     << 11
            );
            var16.setCharAt(
               var29,
               (char)(
                  (
                           (
                                    (
                                             (
                                                   (
                                                            (
                                                                  (((var53 & 65532) >> 2 | var53 << 14) + 132 & 64512) >> 10
                                                                     | ((var53 & 65532) >> 2 | var53 << 14) + 132 << 6
                                                               )
                                                               & 64512
                                                         )
                                                         >> 10
                                                      | (
                                                            (((var53 & 65532) >> 2 | var53 << 14) + 132 & 64512) >> 10
                                                               | ((var53 & 65532) >> 2 | var53 << 14) + 132 << 6
                                                         )
                                                         << 6
                                                )
                                                & 65504
                                          )
                                          >> 5
                                       | (
                                             (
                                                      (
                                                            (((var53 & 65532) >> 2 | var53 << 14) + 132 & 64512) >> 10
                                                               | ((var53 & 65532) >> 2 | var53 << 14) + 132 << 6
                                                         )
                                                         & 64512
                                                   )
                                                   >> 10
                                                | ((((var53 & 65532) >> 2 | var53 << 14) + 132 & 64512) >> 10 | ((var53 & 65532) >> 2 | var53 << 14) + 132 << 6)
                                                   << 6
                                          )
                                          << 11
                                 )
                                 - 81
                                 + 30
                              & 65504
                        )
                        >> 5
                     | (
                              (
                                       (
                                             (
                                                      (
                                                            (((var53 & 65532) >> 2 | var53 << 14) + 132 & 64512) >> 10
                                                               | ((var53 & 65532) >> 2 | var53 << 14) + 132 << 6
                                                         )
                                                         & 64512
                                                   )
                                                   >> 10
                                                | ((((var53 & 65532) >> 2 | var53 << 14) + 132 & 64512) >> 10 | ((var53 & 65532) >> 2 | var53 << 14) + 132 << 6)
                                                   << 6
                                          )
                                          & 65504
                                    )
                                    >> 5
                                 | (
                                       (((((var53 & 65532) >> 2 | var53 << 14) + 132 & 64512) >> 10 | ((var53 & 65532) >> 2 | var53 << 14) + 132 << 6) & 64512)
                                             >> 10
                                          | ((((var53 & 65532) >> 2 | var53 << 14) + 132 & 64512) >> 10 | ((var53 & 65532) >> 2 | var53 << 14) + 132 << 6) << 6
                                    )
                                    << 11
                           )
                           - 81
                           + 30
                        << 11
               )
            );
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_154.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = (816043898 - -2052579983 | 0) & 1073758546; var35 < var19.length(); var35 += (1237459107 >>> 1237459107 | 1) & -2033868597) {
            int var63 = var19.charAt(var35);
            int var105 = (var63 & 57344) >> 13;
            int var64 = ((var63 & 57344) >> 13 | var63 << 3) ^ 152;
            int var106 = ((((var63 & 57344) >> 13 | var63 << 3) ^ 152) & 65534) >> 1;
            var63 = (((var105 | var63 << 3) ^ 152) & 65534) >> 1 | (((var63 & 57344) >> 13 | var63 << 3) ^ 152) << 15;
            var105 = ((var106 | var64 << 15) & 65504) >> 5;
            int var66 = ((var106 | var64 << 15) & 65504) >> 5 | var63 << 11;
            int var108 = ((((var106 | var64 << 15) & 65504) >> 5 | var63 << 11) & 0) >> 16;
            var63 = (((var105 | var63 << 11) & 0) >> 16 | (((var106 | var64 << 15) & 65504) >> 5 | var63 << 11) << 0) + 252;
            var105 = ((var108 | var66 << 0) + 252 & 63488) >> 11;
            int var68 = ((var108 | var66 << 0) + 252 & 63488) >> 11 | var63 << 5;
            int var110 = ((((var108 | var66 << 0) + 252 & 63488) >> 11 | var63 << 5) & 65472) >> 6;
            char var69 = (char)((((var105 | var63 << 5) & 65472) >> 6 | (((var108 | var66 << 0) + 252 & 63488) >> 11 | var63 << 5) << 10) - 253 ^ 102);
            var19.setCharAt(var35, (char)((var110 | var68 << 10) - 253 ^ 102));
         }

         Class var7 = Class.forName(var19.toString(), false, Class_154.class.getClassLoader());
         switch (var4 - 2002247352 + 912176025 + 420393497 + 1454661761 + 452266741 + 2008632057 - 2098145627 + 1161885937 + 758441446 + 122556579) {
            case 537149566:
            case 1268053861:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 791864212:
               var10000 = var0.findConstructor(var7, var6);
               break;
            case 1075731466:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            case 1622246261:
               var10000 = var0.findSpecial(var7, var5, var6, Class_154.class);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_2098[((var10 + 735272687 + 620236252 - 1472962279 ^ 972343638) + 1627960947 ^ 380952960 ^ 1930907432) + 1336659528 ^ 1545375817 ^ 1187497039] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1414(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 - 307728938 - 1280620626 ^ 437548317 ^ 337220841) + 1591458779 ^ 1769916059) - 1964063852 - 2128365880 - 426446458;
      MethodHandle var10000 = field_2098[((var10 - 307728938 - 1280620626 ^ 437548317 ^ 337220841) + 1591458779 ^ 1769916059)
         - 1964063852
         - 2128365880
         - 426446458
         - 1097189825];
      if (field_2098[var10001 - 1097189825] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = 997030644 & 997030644 ^ 997030644; var24 < var14.length(); var24 += (-816147526 & -816147526 | 1) & 537135169) {
            int var43 = var14.charAt(var24) + 168;
            char var46 = (char)(
               (
                     (
                           ((((((var43 & 49152) >> 14 | var43 << 2) & 32768) >> 15 | ((var43 & 49152) >> 14 | var43 << 2) << 1) ^ 113) & 49152) >> 14
                              | (((((var43 & 49152) >> 14 | var43 << 2) & 32768) >> 15 | ((var43 & 49152) >> 14 | var43 << 2) << 1) ^ 113) << 2
                        )
                        ^ 42
                        ^ 31
                        ^ 244
                        ^ 239
                  )
                  - 156
            );
            var14.setCharAt(
               var24,
               (char)(
                  (
                        (
                              ((((((var43 & 49152) >> 14 | var43 << 2) & 32768) >> 15 | ((var43 & 49152) >> 14 | var43 << 2) << 1) ^ 113) & 49152) >> 14
                                 | (((((var43 & 49152) >> 14 | var43 << 2) & 32768) >> 15 | ((var43 & 49152) >> 14 | var43 << 2) << 1) ^ 113) << 2
                           )
                           ^ 42
                           ^ 31
                           ^ 244
                           ^ 239
                     )
                     - 156
               )
            );
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = 346101765 * 346101765 ^ 9105433; var30 < var17.length(); var30 += (-1085955485 >>> -1147225660 | 1) & 1611333641) {
            int var51 = var17.charAt(var30);
            int var90 = (var51 & 65535) >> 0;
            int var52 = (((var51 & 65535) >> 0 | var51 << 16) ^ 254) + 91 + 24;
            int var91 = ((((var51 & 65535) >> 0 | var51 << 16) ^ 254) + 91 + 24 & 65528) >> 3;
            var51 = ((((var90 | var51 << 16) ^ 254) + 91 + 24 & 65528) >> 3 | (((var51 & 65535) >> 0 | var51 << 16) ^ 254) + 91 + 24 << 13) - 226;
            var90 = ((var91 | var52 << 13) - 226 & 64512) >> 10;
            int var54 = (((var91 | var52 << 13) - 226 & 64512) >> 10 | var51 << 6) - 205 - 217;
            int var93 = ((((var91 | var52 << 13) - 226 & 64512) >> 10 | var51 << 6) - 205 - 217 & 63488) >> 11;
            char var55 = (char)(((var90 | var51 << 6) - 205 - 217 & 63488) >> 11 | (((var91 | var52 << 13) - 226 & 64512) >> 10 | var51 << 6) - 205 - 217 << 5);
            var17.setCharAt(var30, (char)(var93 | var54 << 5));
         }

         Class var6 = Class.forName(var17.toString(), false, Class_154.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = (-607990374 << 52581353 | 0) & 402932044; var36 < var20.length(); var36 += (757765795 - 1723028938 | 1) & 947924515) {
            int var60 = var20.charAt(var36) - '?';
            int var94 = (var60 & 65520) >> 4;
            int var61 = (var60 & 65520) >> 4 | var60 << 12;
            int var95 = (((var60 & 65520) >> 4 | var60 << 12) & 63488) >> 11;
            var60 = (((var94 | var60 << 12) & 63488) >> 11 | ((var60 & 65520) >> 4 | var60 << 12) << 5) + 237 - 237;
            var94 = ((var95 | var61 << 5) + 237 - 237 & 65528) >> 3;
            int var63 = ((var95 | var61 << 5) + 237 - 237 & 65528) >> 3 | var60 << 13;
            int var97 = ((((var95 | var61 << 5) + 237 - 237 & 65528) >> 3 | var60 << 13) & 65520) >> 4;
            var60 = (((var94 | var60 << 13) & 65520) >> 4 | (((var95 | var61 << 5) + 237 - 237 & 65528) >> 3 | var60 << 13) << 12) ^ 51;
            var94 = (((var97 | var63 << 12) ^ 51) & 63488) >> 11;
            int var65 = (((var97 | var63 << 12) ^ 51) & 63488) >> 11 | var60 << 5;
            int var99 = (((((var97 | var63 << 12) ^ 51) & 63488) >> 11 | var60 << 5) & 65408) >> 7;
            char var66 = (char)(((var94 | var60 << 5) & 65408) >> 7 | ((((var97 | var63 << 12) ^ 51) & 63488) >> 11 | var60 << 5) << 9);
            var20.setCharAt(var36, (char)(var99 | var65 << 9));
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_154.class.getClassLoader()).returnType();
         switch (((((var4 + 837656204 ^ 530406211) - 646874262 - 1067852339 ^ 1695177992) - 844584747 ^ 608202945) + 1892268278 ^ 1740553805) - 498906309) {
            case 8091477:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            case 826282973:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            case 1133649280:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            case 1594764661:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_2098[((var10 - 307728938 - 1280620626 ^ 437548317 ^ 337220841) + 1591458779 ^ 1769916059) - 1964063852 - 2128365880 - 426446458 - 1097189825] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
