import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;
import net.minecraft.class_1937;
import net.minecraft.class_2680;
import net.minecraft.class_2791;
import net.minecraft.class_2826;
import net.minecraft.class_310;

public class Class_253 {
   // $VF: renamed from: vf net.minecraft.class_1937
   public class_1937 field_401 = 1<"JNT",-862814151,"ь汌ౌ呌ᑌ뱋걊葊\uf44a籊","ꋻꌉꋧꉻꋹꋱꋻꌉꌅꋣꌁꌋꋧꉻꌅꋷꌁꋥꋥꌝꉥꉡꉟ","퐒푒\udd12\ue552\ue712\ue2d2헒\ue512\ue412\ue552\ue712\ue692\ue252\ue612\ue752\ue2d2헒\ue692\ue4d2\ue612\ue292\ue292\ud9d2펒틒퀒탒",1080034446>(
      (class_310)1<"JNT",-733371910,"呌ꑌ","ꌋꌁ","퐒푒\udd12\ue452\ue612\ue352\ue612헒\ue4d2\ue612\ue552\ue792헒\uddd2\ue652\ue452\ue712\ue692\ue2d2탒",1080034445>()
   );
   // $VF: renamed from: xqv net.minecraft.class_2791
   public class_2791 field_402;
   // $VF: renamed from: yuk java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_403 = new MethodHandle[25];

   // $VF: renamed from: vq (int, int, int) net.minecraft.class_2680
   public class_2680 method_413(int var1, int var2, int var3) {
      int var8 = 873723839;
      if (0<"JNT",1090069661,"⟿柿\ue000翿㟿忿럿堅䠅\uf006䀅䠅","럌뛴럴뙼","夤判弤ᤤ娤嘤夤判値崤两儤弤ᤤ値圤两怤怤䰤Ḥ☤․␤",983735082>(
         1<"JNT",-862814151,"葌ь","ꋟꌍꋳ","퐒푒\udd12\ue552\ue712\ue2d2헒\ue512\ue412\ue552\ue712\ue692\ue252\ue612\ue752\ue2d2헒\ue692\ue4d2\ue612\ue292\ue292\ud9d2퉒큒틒폒탒",1080034429>(
            this
         ),
         var2
      )) {
         return 0<"JNT",1090069661,"⟿柿\ue000翿㟿忿럿ࠇ\ue806\uf006\ue006","럌럴똬뗜떔땬럄뗔뗴뗜떔떤딼떴떜땬럄떤딬떴딤딤뙄뜼뜜띌뜌띤","夤判弤ᤤ娤嘤夤判値崤两儤弤ᤤ値圤两怤怤䰤ᴤᴤἤ⌤",983735088>(
            1<"JNT",-733371910,"ь汌ౌ呌ᑌ뱋걊둊ꑊ鑊鱊","ꋻꌉꋧꉻꋹꋱꋻꌉꌅꋣꌁꌋꋧꉻꌅꋷꌁꋥꋥꌝꉣꉣꉧꉫ","퐒푒\udd12\ue552\ue712\ue2d2헒\ue512\ue412\ue552\ue712\ue692\ue252\ue612\ue752\ue2d2헒\ue692\ue4d2\ue612\ue292\ue292\ud9d2튒튒팒퀒탒",1080034427>()
         );
      } else {
         int var4 = var1 >> 4;
         int var5 = var3 >> 4;
         class_2791 var6;
         if (1<"JNT",-862814151,"\uf44c걌葌","ꋟꌍꋳ","퐒푒\udd12\ue552\ue712\ue2d2헒\ue512\ue412\ue552\ue712\ue692\ue252\ue612\ue752\ue2d2헒\ue692\ue4d2\ue612\ue292\ue292\ud9d2튒폒큒퉒탒",1080034439>(
                  this
               )
               != null
            && 1<"JNT",-862814151,"ь汌ౌ呌ᑌ뱋\uec4a걊\uf44a걊","ꋻꌉꋧꉻꋹꋱꋻꌉꌅꋣꌁꌋꋧꉻꌅꋷꌁꋥꋥꌝꉡꉑꉣꉥ","퐒푒\udc52",1080034454>(
                  0<"JNT",1090069661,"⟿柿\ue000翿㟿忿럿䠅倅䀅䀅\ue006","럌럴똬뗜떔땬럄뗔뗴뗜떔떤딼떴떜땬럄떤딬떴딤딤뙄뜴띴뜼뜤띤","夤判弤ᤤ娤嘤夤判値崤两儤弤ᤤ値圤两怤怤䰤ᴤ␤☤Ḥ",983720277>(
                     1<"JNT",-862814151,"\uf44c걌葌","ꋟꌍꋳ","퐒푒\udd12\ue552\ue712\ue2d2헒\ue512\ue412\ue552\ue712\ue692\ue252\ue612\ue752\ue2d2헒\ue692\ue4d2\ue612\ue292\ue292\ud9d2튒폒큒퉒탒",1080034448>(
                        this
                     )
                  )
               )
               == var4
            && 1<"JNT",-862814151,"ь汌ౌ呌ᑌ뱋\uec4a걊\uf44a둊","ꋻꌉꋧꉻꋹꋱꋻꌉꌅꋣꌁꌋꋧꉻꌅꋷꌁꋥꋥꌝꉡꉑꉣꉥ","퐒푒\udc52",1080034449>(
                  0<"JNT",1090069661,"⟿柿\ue000翿㟿忿럿䠅倅䀅䀅\ue006","럌럴똬뗜떔땬럄뗔뗴뗜떔떤딼떴떜땬럄떤딬떴딤딤뙄뜴띴뜼뜤띤","夤判弤ᤤ娤嘤夤判値崤两儤弤ᤤ値圤两怤怤䰤ᴤ␤☤Ḥ",983735096>(
                     1<"JNT",-862814151,"\uf44c걌葌","ꋟꌍꋳ","퐒푒\udd12\ue552\ue712\ue2d2헒\ue512\ue412\ue552\ue712\ue692\ue252\ue612\ue752\ue2d2헒\ue692\ue4d2\ue612\ue292\ue292\ud9d2튒폒큒퉒탒",1080034451>(
                        this
                     )
                  )
               )
               == var5) {
            var6 = 1<"JNT",-862814151,"\uf44c걌葌","ꋟꌍꋳ","퐒푒\udd12\ue552\ue712\ue2d2헒\ue512\ue412\ue552\ue712\ue692\ue252\ue612\ue752\ue2d2헒\ue692\ue4d2\ue612\ue292\ue292\ud9d2튒폒큒퉒탒",1080034450>(
               this
            );
         } else {
            var6 = 0<"JNT",1090069661,"⟿柿\ue000翿㟿忿럿\u0007\ue006䀅倅","럌뛴뛴똬뗜떔땬럄뗔뗴뗜떔떤딼떴떜땬럄떤딬떴딤딤뙄뜼띌뜌뜜띤뙼럴똬뗜떔땬럄뗔뗴뗜떔떤딼떴떜땬럄떤딬떴딤딤뙄뜼뜄띴뜴띤","夤判弤ᤤ娤嘤夤判値崤两儤弤ᤤ値圤两怤怤䰤Ḥ☤․␤",983735087>(
               1<"JNT",-862814151,"葌ь","ꋟꌍꋳ","퐒푒\udd12\ue552\ue712\ue2d2헒\ue512\ue412\ue552\ue712\ue692\ue252\ue612\ue752\ue2d2헒\ue692\ue4d2\ue612\ue292\ue292\ud9d2퉒큒틒폒탒",1080034425>(
                  this
               ),
               var4,
               var5,
               1<"JNT",-733371910,"ь汌ౌ呌ᑌ뱋걊ꑊ\uf44a둊鱊","ꋻꌉꋧꉻꋹꋱꋻꌉꌅꋣꌁꌋꋧꉻꌅꋷꌁꋥꋥꌝꉣꉏꉟꉫ","퐒푒\udd12\ue552\ue712\ue2d2헒\ue512\ue412\ue552\ue712\ue692\ue252\ue612\ue752\ue2d2헒\ue692\ue4d2\ue612\ue292\ue292\ud9d2튒퀒툒펒탒",1080034426>(),
               false
            );
         }

         var8 = -1921633817;

         while (true) {
            switch ((var8 ^ 589113625) - 1736928325 - 265538669 + 1481356217 - 535228678 + 1708895828) {
               case -716156589:
               default:
                  if (var6 == null) {
                     return 0<"JNT",1090069661,"⟿柿\ue000翿㟿忿럿ࠇ\ue806\uf006\ue006","럌럴똬뗜떔땬럄뗔뗴뗜떔떤딼떴떜땬럄떤딬떴딤딤뙄뜼뜜띌뜌띤","夤判弤ᤤ娤嘤夤判値崤两儤弤ᤤ値圤两怤怤䰤ᴤᴤἤ⌤",983735109>(
                        1<"JNT",-733371910,"ь汌ౌ呌ᑌ뱋걊둊ꑊ鑊鱊","ꋻꌉꋧꉻꋹꋱꋻꌉꌅꋣꌁꌋꋧꉻꌅꋷꌁꋥꋥꌝꉣꉣꉧꉫ","퐒푒\udd12\ue552\ue712\ue2d2헒\ue512\ue412\ue552\ue712\ue692\ue252\ue612\ue752\ue2d2헒\ue692\ue4d2\ue612\ue292\ue292\ud9d2튒튒팒퀒탒",1080034432>()
                     );
                  }

                  var8 = (229861367 | 229861367) ^ 138937170;
                  break;
               case 1305183761:
                  class_2826 var7 = 0<"JNT",1090069661,"⟿柿\ue000翿㟿忿럿䠅倅䀅䀅\uf006","럌럴뙤똬뗜떔땬럄뗔뗴뗜떔떤딼떴떜땬럄떤딬떴딤딤뙄뜼띌뜼뜜띤","夤判弤ᤤ娤嘤夤判値崤两儤弤ᤤ値圤两怤怤䰤ᴤ␤☤Ḥ",983720187>(var6)[0<"JNT",1090069661,"⟿柿\ue000翿㟿忿럿堅䠅\uf006䀅倅","럌뛴럴뛴","夤判弤ᤤ娤嘤夤判値崤两儤弤ᤤ値圤两怤怤䰤ᴤ␤☤Ḥ",983720192>(
                     var6, var2
                  )];
                  if (var7 == null) {
                     return 0<"JNT",1090069661,"⟿柿\ue000翿㟿忿럿ࠇ\ue806\uf006\ue006","럌럴똬뗜떔땬럄뗔뗴뗜떔떤딼떴떜땬럄떤딬떴딤딤뙄뜼뜜띌뜌띤","夤判弤ᤤ娤嘤夤判値崤两儤弤ᤤ値圤两怤怤䰤ᴤᴤἤ⌤",983720190>(
                        1<"JNT",-733371910,"ь汌ౌ呌ᑌ뱋걊둊ꑊ鑊鱊","ꋻꌉꋧꉻꋹꋱꋻꌉꌅꋣꌁꌋꋧꉻꌅꋷꌁꋥꋥꌝꉣꉣꉧꉫ","퐒푒\udd12\ue552\ue712\ue2d2헒\ue512\ue412\ue552\ue712\ue692\ue252\ue612\ue752\ue2d2헒\ue692\ue4d2\ue612\ue292\ue292\ud9d2튒튒팒퀒탒",1080034441>()
                     );
                  } else {
                     1<"JNT",-313627392,"\uf44c걌葌","ꋟꌍꋳ","퐒푒\udd12\ue552\ue712\ue2d2헒\ue512\ue412\ue552\ue712\ue692\ue252\ue612\ue752\ue2d2헒\ue692\ue4d2\ue612\ue292\ue292\ud9d2튒폒큒퉒탒",1080034447>(
                        this, var6
                     );
                     return 0<"JNT",1090069661,"⟿柿\ue000翿㟿忿럿䠅倅倅\ue806\ue006","럌뛴뛴뛴럴똬뗜떔땬럄뗔뗴뗜떔떤딼떴떜땬럄떤딬떴딤딤뙄뜼뜜띌뜌띤","夤判弤ᤤ娤嘤夤判値崤两儤弤ᤤ値圤两怤怤䰤ᴤ⌤ᴤℤ",983735084>(
                        var7, var1 & 15, var2 & 15, var3 & 15
                     );
                  }
            }
         }
      }
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_414(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 + 2061718702 - 1963718701 + 1814873493 ^ 254370729) + 1852845754 + 1273928832 ^ 605799169) + 407672018 ^ 259004946;
      MethodHandle var10000 = field_403[(
            ((var10 + 2061718702 - 1963718701 + 1814873493 ^ 254370729) + 1852845754 + 1273928832 ^ 605799169) + 407672018 ^ 259004946
         )
         + 1657673771];
      if (field_403[var10001 + 1657673771] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = -1664955229 >>> -1664955229 ^ 328751508; var23 < var13.length(); var23 += (-1960021939 | 1372198847) ^ -605128706) {
            int var42 = var13.charAt(var23) + 23;
            char var47 = (char)(
               (
                     (
                              (
                                    (
                                             (
                                                   (
                                                            (
                                                                     (
                                                                           (((var42 & 65534) >> 1 | var42 << 15) & 64512) >> 10
                                                                              | ((var42 & 65534) >> 1 | var42 << 15) << 6
                                                                        )
                                                                        & 65532
                                                                  )
                                                                  >> 2
                                                               | (
                                                                     (((var42 & 65534) >> 1 | var42 << 15) & 64512) >> 10
                                                                        | ((var42 & 65534) >> 1 | var42 << 15) << 6
                                                                  )
                                                                  << 14
                                                         )
                                                         - 113
                                                      ^ 38
                                                )
                                                & 65520
                                          )
                                          >> 4
                                       | (
                                             (
                                                      (
                                                               (
                                                                     (((var42 & 65534) >> 1 | var42 << 15) & 64512) >> 10
                                                                        | ((var42 & 65534) >> 1 | var42 << 15) << 6
                                                                  )
                                                                  & 65532
                                                            )
                                                            >> 2
                                                         | ((((var42 & 65534) >> 1 | var42 << 15) & 64512) >> 10 | ((var42 & 65534) >> 1 | var42 << 15) << 6)
                                                            << 14
                                                   )
                                                   - 113
                                                ^ 38
                                          )
                                          << 12
                                 )
                                 & 64512
                           )
                           >> 10
                        | (
                              (
                                       (
                                             (
                                                      (
                                                               (
                                                                     (((var42 & 65534) >> 1 | var42 << 15) & 64512) >> 10
                                                                        | ((var42 & 65534) >> 1 | var42 << 15) << 6
                                                                  )
                                                                  & 65532
                                                            )
                                                            >> 2
                                                         | ((((var42 & 65534) >> 1 | var42 << 15) & 64512) >> 10 | ((var42 & 65534) >> 1 | var42 << 15) << 6)
                                                            << 14
                                                   )
                                                   - 113
                                                ^ 38
                                          )
                                          & 65520
                                    )
                                    >> 4
                                 | (
                                       (
                                                (((((var42 & 65534) >> 1 | var42 << 15) & 64512) >> 10 | ((var42 & 65534) >> 1 | var42 << 15) << 6) & 65532)
                                                      >> 2
                                                   | ((((var42 & 65534) >> 1 | var42 << 15) & 64512) >> 10 | ((var42 & 65534) >> 1 | var42 << 15) << 6) << 14
                                             )
                                             - 113
                                          ^ 38
                                    )
                                    << 12
                           )
                           << 6
                  )
                  - 178
                  - 122
            );
            var13.setCharAt(
               var23,
               (char)(
                  (
                        (
                                 (
                                       (
                                                (
                                                      (
                                                               (
                                                                        (
                                                                              (((var42 & 65534) >> 1 | var42 << 15) & 64512) >> 10
                                                                                 | ((var42 & 65534) >> 1 | var42 << 15) << 6
                                                                           )
                                                                           & 65532
                                                                     )
                                                                     >> 2
                                                                  | (
                                                                        (((var42 & 65534) >> 1 | var42 << 15) & 64512) >> 10
                                                                           | ((var42 & 65534) >> 1 | var42 << 15) << 6
                                                                     )
                                                                     << 14
                                                            )
                                                            - 113
                                                         ^ 38
                                                   )
                                                   & 65520
                                             )
                                             >> 4
                                          | (
                                                (
                                                         (
                                                                  (
                                                                        (((var42 & 65534) >> 1 | var42 << 15) & 64512) >> 10
                                                                           | ((var42 & 65534) >> 1 | var42 << 15) << 6
                                                                     )
                                                                     & 65532
                                                               )
                                                               >> 2
                                                            | ((((var42 & 65534) >> 1 | var42 << 15) & 64512) >> 10 | ((var42 & 65534) >> 1 | var42 << 15) << 6)
                                                               << 14
                                                      )
                                                      - 113
                                                   ^ 38
                                             )
                                             << 12
                                    )
                                    & 64512
                              )
                              >> 10
                           | (
                                 (
                                          (
                                                (
                                                         (
                                                                  (
                                                                        (((var42 & 65534) >> 1 | var42 << 15) & 64512) >> 10
                                                                           | ((var42 & 65534) >> 1 | var42 << 15) << 6
                                                                     )
                                                                     & 65532
                                                               )
                                                               >> 2
                                                            | ((((var42 & 65534) >> 1 | var42 << 15) & 64512) >> 10 | ((var42 & 65534) >> 1 | var42 << 15) << 6)
                                                               << 14
                                                      )
                                                      - 113
                                                   ^ 38
                                             )
                                             & 65520
                                       )
                                       >> 4
                                    | (
                                          (
                                                   (((((var42 & 65534) >> 1 | var42 << 15) & 64512) >> 10 | ((var42 & 65534) >> 1 | var42 << 15) << 6) & 65532)
                                                         >> 2
                                                      | ((((var42 & 65534) >> 1 | var42 << 15) & 64512) >> 10 | ((var42 & 65534) >> 1 | var42 << 15) << 6)
                                                         << 14
                                                )
                                                - 113
                                             ^ 38
                                       )
                                       << 12
                              )
                              << 6
                     )
                     - 178
                     - 122
               )
            );
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = (278772414 + 278772414 | 0) & 134218370; var29 < var16.length(); var29 += (1856920252 | 85374454 | 1) & -1874788351) {
            int var52 = var16.charAt(var29) ^ 136 ^ 91;
            char var57 = (char)(
               (
                     (
                              (
                                    (
                                             (
                                                   (
                                                            ((((var52 & 61440) >> 12 | var52 << 4) & 61440) >> 12 | ((var52 & 61440) >> 12 | var52 << 4) << 4)
                                                                  + 79
                                                               & 65024
                                                         )
                                                         >> 9
                                                      | ((((var52 & 61440) >> 12 | var52 << 4) & 61440) >> 12 | ((var52 & 61440) >> 12 | var52 << 4) << 4) + 79
                                                         << 7
                                                )
                                                & 0
                                          )
                                          >> 16
                                       | (
                                             (((((var52 & 61440) >> 12 | var52 << 4) & 61440) >> 12 | ((var52 & 61440) >> 12 | var52 << 4) << 4) + 79 & 65024)
                                                   >> 9
                                                | ((((var52 & 61440) >> 12 | var52 << 4) & 61440) >> 12 | ((var52 & 61440) >> 12 | var52 << 4) << 4) + 79 << 7
                                          )
                                          << 0
                                 )
                                 & 65532
                           )
                           >> 2
                        | (
                              (
                                       (
                                             (((((var52 & 61440) >> 12 | var52 << 4) & 61440) >> 12 | ((var52 & 61440) >> 12 | var52 << 4) << 4) + 79 & 65024)
                                                   >> 9
                                                | ((((var52 & 61440) >> 12 | var52 << 4) & 61440) >> 12 | ((var52 & 61440) >> 12 | var52 << 4) << 4) + 79 << 7
                                          )
                                          & 0
                                    )
                                    >> 16
                                 | (
                                       (((((var52 & 61440) >> 12 | var52 << 4) & 61440) >> 12 | ((var52 & 61440) >> 12 | var52 << 4) << 4) + 79 & 65024) >> 9
                                          | ((((var52 & 61440) >> 12 | var52 << 4) & 61440) >> 12 | ((var52 & 61440) >> 12 | var52 << 4) << 4) + 79 << 7
                                    )
                                    << 0
                           )
                           << 14
                  )
                  ^ 118
                  ^ 154
            );
            var16.setCharAt(
               var29,
               (char)(
                  (
                        (
                                 (
                                       (
                                                (
                                                      (
                                                               (
                                                                        (((var52 & 61440) >> 12 | var52 << 4) & 61440) >> 12
                                                                           | ((var52 & 61440) >> 12 | var52 << 4) << 4
                                                                     )
                                                                     + 79
                                                                  & 65024
                                                            )
                                                            >> 9
                                                         | ((((var52 & 61440) >> 12 | var52 << 4) & 61440) >> 12 | ((var52 & 61440) >> 12 | var52 << 4) << 4)
                                                               + 79
                                                            << 7
                                                   )
                                                   & 0
                                             )
                                             >> 16
                                          | (
                                                (
                                                         ((((var52 & 61440) >> 12 | var52 << 4) & 61440) >> 12 | ((var52 & 61440) >> 12 | var52 << 4) << 4)
                                                               + 79
                                                            & 65024
                                                      )
                                                      >> 9
                                                   | ((((var52 & 61440) >> 12 | var52 << 4) & 61440) >> 12 | ((var52 & 61440) >> 12 | var52 << 4) << 4) + 79
                                                      << 7
                                             )
                                             << 0
                                    )
                                    & 65532
                              )
                              >> 2
                           | (
                                 (
                                          (
                                                (
                                                         ((((var52 & 61440) >> 12 | var52 << 4) & 61440) >> 12 | ((var52 & 61440) >> 12 | var52 << 4) << 4)
                                                               + 79
                                                            & 65024
                                                      )
                                                      >> 9
                                                   | ((((var52 & 61440) >> 12 | var52 << 4) & 61440) >> 12 | ((var52 & 61440) >> 12 | var52 << 4) << 4) + 79
                                                      << 7
                                             )
                                             & 0
                                       )
                                       >> 16
                                    | (
                                          (((((var52 & 61440) >> 12 | var52 << 4) & 61440) >> 12 | ((var52 & 61440) >> 12 | var52 << 4) << 4) + 79 & 65024)
                                                >> 9
                                             | ((((var52 & 61440) >> 12 | var52 << 4) & 61440) >> 12 | ((var52 & 61440) >> 12 | var52 << 4) << 4) + 79 << 7
                                       )
                                       << 0
                              )
                              << 14
                     )
                     ^ 118
                     ^ 154
               )
            );
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_253.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = (-388784321 | -376195343 >> (-388784321 >> -376195343)) ^ -532481;
            var35 < var19.length();
            var35 += (1923493844 | 1518743091 | -1112642162 | 0) & 4231169
         ) {
            int var62 = var19.charAt(var35) - 188 ^ 22;
            int var98 = (var62 & 0) >> 16;
            int var63 = ((var62 & 0) >> 16 | var62 << 0) - 75;
            int var99 = (((var62 & 0) >> 16 | var62 << 0) - 75 & 65472) >> 6;
            var62 = ((var98 | var62 << 0) - 75 & 65472) >> 6 | ((var62 & 0) >> 16 | var62 << 0) - 75 << 10;
            var98 = ((var99 | var63 << 10) & 63488) >> 11;
            int var65 = (((var99 | var63 << 10) & 63488) >> 11 | var62 << 5) ^ 139 ^ 18;
            int var101 = (((((var99 | var63 << 10) & 63488) >> 11 | var62 << 5) ^ 139 ^ 18) & 65408) >> 7;
            char var66 = (char)(
               ((((var98 | var62 << 5) ^ 139 ^ 18) & 65408) >> 7 | ((((var99 | var63 << 10) & 63488) >> 11 | var62 << 5) ^ 139 ^ 18) << 9) - 235
            );
            var19.setCharAt(var35, (char)((var101 | var65 << 9) - 235));
         }

         Class var7 = Class.forName(var19.toString(), false, Class_253.class.getClassLoader());
         switch (((var4 - 402252140 - 1364273624 ^ 545175646) - 2032181424 - 1547189429 + 60663485 - 968072869 - 495315894 ^ 2046932766) + 1882096023) {
            case 621336753:
            case 2101249445:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 1829573705:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            case 1858885865:
               var10000 = var0.findSpecial(var7, var5, var6, Class_253.class);
               break;
            case 1990993606:
               var10000 = var0.findConstructor(var7, var6);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_403[(((var10 + 2061718702 - 1963718701 + 1814873493 ^ 254370729) + 1852845754 + 1273928832 ^ 605799169) + 407672018 ^ 259004946) + 1657673771] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_415(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 + 1020281132 - 1717449499 ^ 1124211517) + 871189492 + 706890154 - 1658261757 - 137818330 ^ 1289212715) + 671729815;
      MethodHandle var10000 = field_403[((var10 + 1020281132 - 1717449499 ^ 1124211517) + 871189492 + 706890154 - 1658261757 - 137818330 ^ 1289212715)
         + 671729815
         - 739251928];
      if (field_403[var10001 - 739251928] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = (1438910533 + -480527574 | 0) & -966775680; var24 < var14.length(); var24 += -2074644765 >>> -915922287 ^ 16938) {
            int var43 = (var14.charAt(var24) ^ 199) - 167;
            char var48 = (char)(
               (
                     (
                              (
                                    (
                                             (
                                                   (
                                                            ((((var43 & 0) >> 16 | var43 << 0) & 65528) >> 3 | ((var43 & 0) >> 16 | var43 << 0) << 13)
                                                                  + 210
                                                                  - 78
                                                               & 32768
                                                         )
                                                         >> 15
                                                      | ((((var43 & 0) >> 16 | var43 << 0) & 65528) >> 3 | ((var43 & 0) >> 16 | var43 << 0) << 13) + 210 - 78
                                                         << 1
                                                )
                                                & 65472
                                          )
                                          >> 6
                                       | (
                                             (((((var43 & 0) >> 16 | var43 << 0) & 65528) >> 3 | ((var43 & 0) >> 16 | var43 << 0) << 13) + 210 - 78 & 32768)
                                                   >> 15
                                                | ((((var43 & 0) >> 16 | var43 << 0) & 65528) >> 3 | ((var43 & 0) >> 16 | var43 << 0) << 13) + 210 - 78 << 1
                                          )
                                          << 10
                                 )
                                 & 65528
                           )
                           >> 3
                        | (
                              (
                                       (
                                             (((((var43 & 0) >> 16 | var43 << 0) & 65528) >> 3 | ((var43 & 0) >> 16 | var43 << 0) << 13) + 210 - 78 & 32768)
                                                   >> 15
                                                | ((((var43 & 0) >> 16 | var43 << 0) & 65528) >> 3 | ((var43 & 0) >> 16 | var43 << 0) << 13) + 210 - 78 << 1
                                          )
                                          & 65472
                                    )
                                    >> 6
                                 | (
                                       (((((var43 & 0) >> 16 | var43 << 0) & 65528) >> 3 | ((var43 & 0) >> 16 | var43 << 0) << 13) + 210 - 78 & 32768) >> 15
                                          | ((((var43 & 0) >> 16 | var43 << 0) & 65528) >> 3 | ((var43 & 0) >> 16 | var43 << 0) << 13) + 210 - 78 << 1
                                    )
                                    << 10
                           )
                           << 13
                  )
                  ^ 231
            );
            var14.setCharAt(
               var24,
               (char)(
                  (
                        (
                                 (
                                       (
                                                (
                                                      (
                                                               ((((var43 & 0) >> 16 | var43 << 0) & 65528) >> 3 | ((var43 & 0) >> 16 | var43 << 0) << 13)
                                                                     + 210
                                                                     - 78
                                                                  & 32768
                                                            )
                                                            >> 15
                                                         | ((((var43 & 0) >> 16 | var43 << 0) & 65528) >> 3 | ((var43 & 0) >> 16 | var43 << 0) << 13)
                                                               + 210
                                                               - 78
                                                            << 1
                                                   )
                                                   & 65472
                                             )
                                             >> 6
                                          | (
                                                (((((var43 & 0) >> 16 | var43 << 0) & 65528) >> 3 | ((var43 & 0) >> 16 | var43 << 0) << 13) + 210 - 78 & 32768)
                                                      >> 15
                                                   | ((((var43 & 0) >> 16 | var43 << 0) & 65528) >> 3 | ((var43 & 0) >> 16 | var43 << 0) << 13) + 210 - 78 << 1
                                             )
                                             << 10
                                    )
                                    & 65528
                              )
                              >> 3
                           | (
                                 (
                                          (
                                                (((((var43 & 0) >> 16 | var43 << 0) & 65528) >> 3 | ((var43 & 0) >> 16 | var43 << 0) << 13) + 210 - 78 & 32768)
                                                      >> 15
                                                   | ((((var43 & 0) >> 16 | var43 << 0) & 65528) >> 3 | ((var43 & 0) >> 16 | var43 << 0) << 13) + 210 - 78 << 1
                                             )
                                             & 65472
                                       )
                                       >> 6
                                    | (
                                          (((((var43 & 0) >> 16 | var43 << 0) & 65528) >> 3 | ((var43 & 0) >> 16 | var43 << 0) << 13) + 210 - 78 & 32768) >> 15
                                             | ((((var43 & 0) >> 16 | var43 << 0) & 65528) >> 3 | ((var43 & 0) >> 16 | var43 << 0) << 13) + 210 - 78 << 1
                                       )
                                       << 10
                              )
                              << 13
                     )
                     ^ 231
               )
            );
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = (1610915357 >>> -618945294 | 0) & -900644408; var30 < var17.length(); var30 += -98329116 >> -98329116 ^ -6145569) {
            char var53 = var17.charAt(var30);
            char var58 = (char)(
               (
                     (
                              (
                                    (
                                             (
                                                      (
                                                               (
                                                                        ((((var53 & '︀') >> 9 | var53 << 7) ^ 15) & 63488) >> 11
                                                                           | (((var53 & '︀') >> 9 | var53 << 7) ^ 15) << 5
                                                                     )
                                                                     - 217
                                                                     + 196
                                                                  & 65504
                                                            )
                                                            >> 5
                                                         | (
                                                                  ((((var53 & '︀') >> 9 | var53 << 7) ^ 15) & 63488) >> 11
                                                                     | (((var53 & '︀') >> 9 | var53 << 7) ^ 15) << 5
                                                               )
                                                               - 217
                                                               + 196
                                                            << 11
                                                   )
                                                   + 35
                                                & 32768
                                          )
                                          >> 15
                                       | (
                                                (
                                                         (
                                                                  ((((var53 & '︀') >> 9 | var53 << 7) ^ 15) & 63488) >> 11
                                                                     | (((var53 & '︀') >> 9 | var53 << 7) ^ 15) << 5
                                                               )
                                                               - 217
                                                               + 196
                                                            & 65504
                                                      )
                                                      >> 5
                                                   | (((((var53 & '︀') >> 9 | var53 << 7) ^ 15) & 63488) >> 11 | (((var53 & '︀') >> 9 | var53 << 7) ^ 15) << 5)
                                                         - 217
                                                         + 196
                                                      << 11
                                             )
                                             + 35
                                          << 1
                                 )
                                 & 65024
                           )
                           >> 9
                        | (
                              (
                                       (
                                                (
                                                         (
                                                                  ((((var53 & '︀') >> 9 | var53 << 7) ^ 15) & 63488) >> 11
                                                                     | (((var53 & '︀') >> 9 | var53 << 7) ^ 15) << 5
                                                               )
                                                               - 217
                                                               + 196
                                                            & 65504
                                                      )
                                                      >> 5
                                                   | (((((var53 & '︀') >> 9 | var53 << 7) ^ 15) & 63488) >> 11 | (((var53 & '︀') >> 9 | var53 << 7) ^ 15) << 5)
                                                         - 217
                                                         + 196
                                                      << 11
                                             )
                                             + 35
                                          & 32768
                                    )
                                    >> 15
                                 | (
                                          (
                                                   (((((var53 & '︀') >> 9 | var53 << 7) ^ 15) & 63488) >> 11 | (((var53 & '︀') >> 9 | var53 << 7) ^ 15) << 5)
                                                         - 217
                                                         + 196
                                                      & 65504
                                                )
                                                >> 5
                                             | (((((var53 & '︀') >> 9 | var53 << 7) ^ 15) & 63488) >> 11 | (((var53 & '︀') >> 9 | var53 << 7) ^ 15) << 5)
                                                   - 217
                                                   + 196
                                                << 11
                                       )
                                       + 35
                                    << 1
                           )
                           << 7
                  )
                  ^ 184
            );
            var17.setCharAt(
               var30,
               (char)(
                  (
                        (
                                 (
                                       (
                                                (
                                                         (
                                                                  (
                                                                           ((((var53 & '︀') >> 9 | var53 << 7) ^ 15) & 63488) >> 11
                                                                              | (((var53 & '︀') >> 9 | var53 << 7) ^ 15) << 5
                                                                        )
                                                                        - 217
                                                                        + 196
                                                                     & 65504
                                                               )
                                                               >> 5
                                                            | (
                                                                     ((((var53 & '︀') >> 9 | var53 << 7) ^ 15) & 63488) >> 11
                                                                        | (((var53 & '︀') >> 9 | var53 << 7) ^ 15) << 5
                                                                  )
                                                                  - 217
                                                                  + 196
                                                               << 11
                                                      )
                                                      + 35
                                                   & 32768
                                             )
                                             >> 15
                                          | (
                                                   (
                                                            (
                                                                     ((((var53 & '︀') >> 9 | var53 << 7) ^ 15) & 63488) >> 11
                                                                        | (((var53 & '︀') >> 9 | var53 << 7) ^ 15) << 5
                                                                  )
                                                                  - 217
                                                                  + 196
                                                               & 65504
                                                         )
                                                         >> 5
                                                      | (
                                                               ((((var53 & '︀') >> 9 | var53 << 7) ^ 15) & 63488) >> 11
                                                                  | (((var53 & '︀') >> 9 | var53 << 7) ^ 15) << 5
                                                            )
                                                            - 217
                                                            + 196
                                                         << 11
                                                )
                                                + 35
                                             << 1
                                    )
                                    & 65024
                              )
                              >> 9
                           | (
                                 (
                                          (
                                                   (
                                                            (
                                                                     ((((var53 & '︀') >> 9 | var53 << 7) ^ 15) & 63488) >> 11
                                                                        | (((var53 & '︀') >> 9 | var53 << 7) ^ 15) << 5
                                                                  )
                                                                  - 217
                                                                  + 196
                                                               & 65504
                                                         )
                                                         >> 5
                                                      | (
                                                               ((((var53 & '︀') >> 9 | var53 << 7) ^ 15) & 63488) >> 11
                                                                  | (((var53 & '︀') >> 9 | var53 << 7) ^ 15) << 5
                                                            )
                                                            - 217
                                                            + 196
                                                         << 11
                                                )
                                                + 35
                                             & 32768
                                       )
                                       >> 15
                                    | (
                                             (
                                                      (((((var53 & '︀') >> 9 | var53 << 7) ^ 15) & 63488) >> 11 | (((var53 & '︀') >> 9 | var53 << 7) ^ 15) << 5)
                                                            - 217
                                                            + 196
                                                         & 65504
                                                   )
                                                   >> 5
                                                | (((((var53 & '︀') >> 9 | var53 << 7) ^ 15) & 63488) >> 11 | (((var53 & '︀') >> 9 | var53 << 7) ^ 15) << 5)
                                                      - 217
                                                      + 196
                                                   << 11
                                          )
                                          + 35
                                       << 1
                              )
                              << 7
                     )
                     ^ 184
               )
            );
         }

         Class var6 = Class.forName(var17.toString(), false, Class_253.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = 839604409 & 1278564765 ^ 88217; var36 < var20.length(); var36 += (-2144491451 << -2144491451 | 1) & -633171131) {
            int var63 = var20.charAt(var36);
            int var99 = (var63 & 57344) >> 13;
            int var64 = ((var63 & 57344) >> 13 | var63 << 3) + 17 - 168;
            int var100 = (((var63 & 57344) >> 13 | var63 << 3) + 17 - 168 & 65024) >> 9;
            var63 = (((var99 | var63 << 3) + 17 - 168 & 65024) >> 9 | ((var63 & 57344) >> 13 | var63 << 3) + 17 - 168 << 7) + 97 ^ 138;
            var99 = (((var100 | var64 << 7) + 97 ^ 138) & 65528) >> 3;
            int var66 = ((((var100 | var64 << 7) + 97 ^ 138) & 65528) >> 3 | var63 << 13) ^ 16;
            int var102 = ((((((var100 | var64 << 7) + 97 ^ 138) & 65528) >> 3 | var63 << 13) ^ 16) & 57344) >> 13;
            char var67 = (char)(
               ((((var99 | var63 << 13) ^ 16) & 57344) >> 13 | (((((var100 | var64 << 7) + 97 ^ 138) & 65528) >> 3 | var63 << 13) ^ 16) << 3) ^ 18
            );
            var20.setCharAt(var36, (char)((var102 | var66 << 3) ^ 18));
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_253.class.getClassLoader()).returnType();
         switch ((((var4 + 697225108 ^ 2069525261 ^ 2033475675) - 1578431037 ^ 1040139035 ^ 1277801855 ^ 1478141417) + 1442348913 ^ 1778992785) - 2090803990) {
            case 11287511:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            case 55106751:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            case 581208274:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            case 936231168:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_403[((var10 + 1020281132 - 1717449499 ^ 1124211517) + 871189492 + 706890154 - 1658261757 - 137818330 ^ 1289212715) + 671729815 - 739251928] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
