import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;
import net.minecraft.class_11909;

public class Class_255 extends Class_375 {
   // $VF: renamed from: nrn Class_251
   public Class_251 field_1298;
   // $VF: renamed from: ocd java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_1299 = new MethodHandle[31];

   public Class_255(Class_199 var1, Class_271 var2, int var3) {
      super(var1, var2, var3);
      this.field_1298 = (Class_251)var2;
   }

   // $VF: renamed from: vk (RenderEngine_216, int, int, float) void
   @Override
   public void method_1268(RenderEngine_216 var1, int var2, int var3, float var4) {
      int var5 = 0<"JNT",1035846875,"勉荒勉","\uf28a劋劏","䐾䑘",2006481039>(this) + 5;
      int var6 = 0<"JNT",1035846875,"画䀘邏","\uf28a劋劏","䐾䑘",2006481040>(this)
         + 0<"JNT",1035846875,"\uf8e3\uf8e3煉","\uf28a劋劏","䐾䑘",2006481037>(this)
         + 1<"JNT",1492496955,"\u0e78᧸᩸","\uec0b谋","ﰻﰫ飼",1860921515>(this)
         + 0<"JNT",1035846875,"賈画","\uf28a劋劏","䐾䑘",2006481043>(this) / 2;
      int var7 = var6 - 4;
      int var8 = 0<"JNT",806123234,"遲藍禎北","\uf28a劋劏","䑘䑏䑄䑏䒜䑃䑂䑗䑚䒜䑡䑓䑂",2006481042>(
         0<"JNT",1035846875,"盧北","\uf28a劋犏㊓劒는劒ኌ튔犔劓犓ኌ銐튒犔銍","䐾䑒䑔",2006481041>(1<"JNT",1492496955,"௸᧸௸","\uec0b谋","ﰻﰫﯻ僚\uf87b鍊וֹ",1860921505>(this))
      );
      int var10001 = -1805080585 * -1805080585 ^ 2128883793;

      StringBuilder var10002;
      for (var10002 = (StringBuilder)0<"JNT",-1728487307,"\uf5f3藍邏藍侀\uf613","\uf28a犏㊓劒는劒ኌ犓劒늓ናኌ銐犔㊔劓늓ና銍劋느","䑘䑏䑄䑏䒜䑚䑏䑜䑕䒜䑡䑂䑀䑗䑜䑕䑰䑃䑗䑚䑒䑓䑀",2006480935>("所憀峀慀澀渀");
         var10001 < 6;
         var10001 += (120063610 | 1489194212 + 120063610 | 1) & -2147213183
      ) {
         char var15 = 0<"JNT",1035846875,"遼盧念䀘ﮣ侀","\uf28a劏劋銎","䑘䑏䑄䑏䒜䑚䑏䑜䑕䒜䑡䑂䑀䑗䑜䑕䑰䑃䑗䑚䑒䑓䑀",2006481047>(var10002, var10001);
         int var10005 = (var15 & '\uffff') >> 0;
         int var16 = (var15 & '\uffff') >> 0 | var15 << 16;
         int var28 = (((var15 & '\uffff') >> 0 | var15 << 16) & 65472) >> 6;
         var15 = (char)((((var10005 | var15 << 16) & 65472) >> 6 | ((var15 & '\uffff') >> 0 | var15 << 16) << 10) - 75 - 158 ^ 239);
         0<"JNT",1035846875,"遲北侀\ufbc3盧念䀘ﮣ侀","\uf28a劏銎劋느","䑘䑏䑄䑏䒜䑚䑏䑜䑕䒜䑡䑂䑀䑗䑜䑕䑰䑃䑗䑚䑒䑓䑀",2006481048>(
            var10002, var10001, (char)((var28 | var16 << 10) - 75 - 158 ^ 239)
         );
      }

      0<"JNT",1035846875,"旅盧","\uf28a犏㊓劒는劒ኌ犓劒늓ናኌ銐犔㊔劓늓ና銍犎犎犏\uf293ን銍劋犎","䑛䑄",2006480923>(
         var1,
         0<"JNT",1035846875,"侀賈ﳃ侀䀘藍邏旅","\uf28a劋犏㊓劒는劒ኌ犓劒늓ናኌ銐犔㊔劓늓ና銍","䑘䑏䑄䑏䒜䑚䑏䑜䑕䒜䑡䑂䑀䑗䑜䑕䑰䑃䑗䑚䑒䑓䑀",2006481045>(var10002),
         (double)var5,
         (double)var7,
         1<"JNT",1456266817,"\u0e78ᅸ","\uec0b谋","ﰻﰫﯻ僚\uf88bוֹ",1860921491>()
      );
      double var10000 = (double)var5;
      int var13 = 0;

      StringBuilder var19;
      for (var19 = (StringBuilder)0<"JNT",-1728487307,"\uf5f3藍邏藍侀\uf613","\uf28a犏㊓劒는劒ኌ犓劒늓ናኌ銐犔㊔劓늓ና銍劋느","䑘䑏䑄䑏䒜䑚䑏䑜䑕䒜䑡䑂䑀䑗䑜䑕䑰䑃䑗䑚䑒䑓䑀",2006480924>(
            "耒\ue016䀕\u0017\ue00fꀌ"
         );
         var13 < ((-1661571219 >> 4452769 | 2) & 822378503);
         var13 += (62611666 | 62611666 | 1) & 1140857637
      ) {
         char var23 = 0<"JNT",1035846875,"遼盧念䀘ﮣ侀","\uf28a劏劋銎","䑘䑏䑄䑏䒜䑚䑏䑜䑕䒜䑡䑂䑀䑗䑜䑕䑰䑃䑗䑚䑒䑓䑀",2006480921>(var19, var13);
         char var26 = (char)(
            (
                  (((((var23 & '耀') >> 15 | var23 << 1) & 64512) >> 10 | ((var23 & '耀') >> 15 | var23 << 1) << 6) & 65520) >> 4
                     | ((((var23 & '耀') >> 15 | var23 << 1) & 64512) >> 10 | ((var23 & '耀') >> 15 | var23 << 1) << 6) << 12
               )
               + 158
               - 227
         );
         0<"JNT",1035846875,"遲北侀\ufbc3盧念䀘ﮣ侀","\uf28a劏銎劋느","䑘䑏䑄䑏䒜䑚䑏䑜䑕䒜䑡䑂䑀䑗䑜䑕䑰䑃䑗䑚䑒䑓䑀",2006480922>(
            var19,
            var13,
            (char)(
               (
                     (((((var23 & '耀') >> 15 | var23 << 1) & 64512) >> 10 | ((var23 & '耀') >> 15 | var23 << 1) << 6) & 65520) >> 4
                        | ((((var23 & '耀') >> 15 | var23 << 1) & 64512) >> 10 | ((var23 & '耀') >> 15 | var23 << 1) << 6) << 12
                  )
                  + 158
                  - 227
            )
         );
      }

      double var9 = var10000
         + 0<"JNT",1035846875,"﨣謹肋","\uf28a犏㊓劒는劒ኌ犓劒늓ናኌ銐犔㊔劓늓ና銍劋犎","䑛䑄",2006480933>(
            var1, 0<"JNT",1035846875,"侀賈ﳃ侀䀘藍邏旅","\uf28a劋犏㊓劒는劒ኌ犓劒늓ናኌ銐犔㊔劓늓ና銍","䑘䑏䑄䑏䒜䑚䑏䑜䑕䒜䑡䑂䑀䑗䑜䑕䑰䑃䑗䑚䑒䑓䑀",2006480936>(var19)
         );
      0<"JNT",1035846875,"旅盧","\uf28a犏㊓劒는劒ኌ犓劒늓ናኌ銐犔㊔劓늓ና銍犎犎犏\uf293ን銍劋犎","䑛䑄",2006480940>(
         var1,
         0<"JNT",-165706402,"望念\uf8f3謹北ﬃ煉","\uf28a劏劋犏㊓劒는劒ኌ犓劒늓ናኌ銐犔㊔劓늓ና銍","䑘䑏䑄䑏䒜䑚䑏䑜䑕䒜䑡䑂䑀䑗䑜䑕",2006480934>(var8),
         var9,
         (double)var7,
         1<"JNT",1492496955,"\u0e78៸\u0e78","\uec0b谋","ﰻﰫﯻ僚\uf88bוֹ",1860921908>(this)
      );
   }

   // $VF: renamed from: yr (net.minecraft.class_11909, boolean) void
   @Override
   public void method_1272(class_11909 var1, boolean var2) {
      if (0<"JNT",1035846875,"旅勉謹","\uf28a犎犎劋㊑","䐾䑘",2006480927>(
            this,
            0<"JNT",1035846875,"遼賈\uf8e3荒ﰃ\uf673\uf683\uf623\uf633","\uf28a劋犎","䑜䑓䑂䒜䑛䑗䑜䑓䑑䑀䑏䑔䑂䒜䑑䑚䑏䑁䑁䑭䑿䑿䒇䑾䒇",2006480937>(var1),
            0<"JNT",1035846875,"遼賈\uf8e3荒ﰃ\uf673\uf683\uf623\uf623","\uf28a劋犎","䑜䑓䑂䒜䑛䑗䑜䑓䑑䑀䑏䑔䑂䒜䑑䑚䑏䑁䑁䑭䑿䑿䒇䑾䒇",2006480938>(var1)
         )
         && 0<"JNT",1035846875,"\uf8e3北侀盧賈拾ﰃ\uf683\uf673\uf6d3\uf673\uf663","\uf28a劋劏","䑜䑓䑂䒜䑛䑗䑜䑓䑑䑀䑏䑔䑂䒜䑑䑚䑏䑁䑁䑭䑿䑿䒇䑾䒇",2006480928>(var1) == 0) {
         0<"JNT",1035846875,"\uf8e3北侀盧賈拾ﰃ\uf6a3\uf663\uf6b3\uf683","\uf28a犏늓튒犔ኌ튓劓늓튒銒㊔劒늒犔ኌ銒犓劒銔銔ኒ犌銌ኍ銍劋느","䑜䑓䑂䒜䑛䑗䑜䑓䑑䑀䑏䑔䑂䒜䑑䑚䑏䑁䑁䑭䒁䑿䑾",2006480932>(
            1<"JNT",1492496955,"\u0af8᧸","\uec0b谋","ﰻﰫﯻ亂\uf86b\uf77bﴋ匿\uf82b亂\uf86b\uf6cb率\uf6ab鍊\uf77bﴋ\uf6cb炙\uf6ab溜溜廓\ufdcbﶫﶻוֹ",1860921510>(this),
            (gzuz)0<"JNT",-1728487307,"\uf5f3藍邏藍侀\uf613","\uf28a犏\uf293㊓銍犏\uf293犒늒銍劋느","䑕䑈䑃䑈",2006480931>(
               this, 1<"JNT",1492496955,"௸᧸௸","\uec0b谋","ﰻﰫﯻ僚\uf87b鍊וֹ",1860921915>(this)
            )
         );
      }

      0<"JNT",1364103908,"﨣䀘","\uf28a犏늓튒犔ኌ튓劓늓튒銒㊔劒늒犔ኌ銒犓劒銔銔ኒ劌劌劍\uf28b劍銍㊑劋느","䑅䑘",2006480929>(this, var1, var2);
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1293(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = (var10 - 1040390361 ^ 207740610) + 1359375821 + 70442460 + 1623151619 + 1186730363 - 150166999 + 1181871996 ^ 1273531127;
      MethodHandle var10000 = field_1299[(var10 - 1040390361 ^ 207740610) + 1359375821 + 70442460 + 1623151619 + 1186730363 - 150166999 + 1181871996
         ^ 1273531127
         ^ 1003441855];
      if (field_1299[var10001 ^ 1003441855] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = 956611437 >>> -1611941522 ^ 58386; var23 < var13.length(); var23 += -1042265057 ^ -58975419 ^ 1033656155) {
            char var42 = var13.charAt(var23);
            char var49 = (char)(
               (
                        (
                              (
                                       (
                                             (
                                                   (
                                                            (
                                                                  (
                                                                           (
                                                                                 (
                                                                                          (
                                                                                                   (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                                      | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                                                )
                                                                                                + 219
                                                                                                + 137
                                                                                             & 64512
                                                                                       )
                                                                                       >> 10
                                                                                    | (
                                                                                             (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                                | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                                          )
                                                                                          + 219
                                                                                          + 137
                                                                                       << 6
                                                                              )
                                                                              & 65528
                                                                        )
                                                                        >> 3
                                                                     | (
                                                                           (
                                                                                    (
                                                                                             (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                                | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                                          )
                                                                                          + 219
                                                                                          + 137
                                                                                       & 64512
                                                                                 )
                                                                                 >> 10
                                                                              | (
                                                                                       (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                          | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                                    )
                                                                                    + 219
                                                                                    + 137
                                                                                 << 6
                                                                        )
                                                                        << 13
                                                               )
                                                               & 65532
                                                         )
                                                         >> 2
                                                      | (
                                                            (
                                                                     (
                                                                           (
                                                                                    (
                                                                                             (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                                | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                                          )
                                                                                          + 219
                                                                                          + 137
                                                                                       & 64512
                                                                                 )
                                                                                 >> 10
                                                                              | (
                                                                                       (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                          | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                                    )
                                                                                    + 219
                                                                                    + 137
                                                                                 << 6
                                                                        )
                                                                        & 65528
                                                                  )
                                                                  >> 3
                                                               | (
                                                                     (
                                                                              (
                                                                                       (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                          | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                                    )
                                                                                    + 219
                                                                                    + 137
                                                                                 & 64512
                                                                           )
                                                                           >> 10
                                                                        | (
                                                                                 (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                    | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                              )
                                                                              + 219
                                                                              + 137
                                                                           << 6
                                                                  )
                                                                  << 13
                                                         )
                                                         << 14
                                                )
                                                ^ 181
                                          )
                                          & 65535
                                    )
                                    >> 0
                                 | (
                                       (
                                             (
                                                      (
                                                            (
                                                                     (
                                                                           (
                                                                                    (
                                                                                             (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                                | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                                          )
                                                                                          + 219
                                                                                          + 137
                                                                                       & 64512
                                                                                 )
                                                                                 >> 10
                                                                              | (
                                                                                       (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                          | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                                    )
                                                                                    + 219
                                                                                    + 137
                                                                                 << 6
                                                                        )
                                                                        & 65528
                                                                  )
                                                                  >> 3
                                                               | (
                                                                     (
                                                                              (
                                                                                       (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                          | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                                    )
                                                                                    + 219
                                                                                    + 137
                                                                                 & 64512
                                                                           )
                                                                           >> 10
                                                                        | (
                                                                                 (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                    | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                              )
                                                                              + 219
                                                                              + 137
                                                                           << 6
                                                                  )
                                                                  << 13
                                                         )
                                                         & 65532
                                                   )
                                                   >> 2
                                                | (
                                                      (
                                                               (
                                                                     (
                                                                              (
                                                                                       (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                          | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                                    )
                                                                                    + 219
                                                                                    + 137
                                                                                 & 64512
                                                                           )
                                                                           >> 10
                                                                        | (
                                                                                 (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                    | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                              )
                                                                              + 219
                                                                              + 137
                                                                           << 6
                                                                  )
                                                                  & 65528
                                                            )
                                                            >> 3
                                                         | (
                                                               (
                                                                        (
                                                                                 (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                    | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                              )
                                                                              + 219
                                                                              + 137
                                                                           & 64512
                                                                     )
                                                                     >> 10
                                                                  | (
                                                                           (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                              | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                        )
                                                                        + 219
                                                                        + 137
                                                                     << 6
                                                            )
                                                            << 13
                                                   )
                                                   << 14
                                          )
                                          ^ 181
                                    )
                                    << 16
                           )
                           & 65532
                     )
                     >> 2
                  | (
                        (
                                 (
                                       (
                                             (
                                                      (
                                                            (
                                                                     (
                                                                           (
                                                                                    (
                                                                                             (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                                | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                                          )
                                                                                          + 219
                                                                                          + 137
                                                                                       & 64512
                                                                                 )
                                                                                 >> 10
                                                                              | (
                                                                                       (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                          | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                                    )
                                                                                    + 219
                                                                                    + 137
                                                                                 << 6
                                                                        )
                                                                        & 65528
                                                                  )
                                                                  >> 3
                                                               | (
                                                                     (
                                                                              (
                                                                                       (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                          | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                                    )
                                                                                    + 219
                                                                                    + 137
                                                                                 & 64512
                                                                           )
                                                                           >> 10
                                                                        | (
                                                                                 (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                    | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                              )
                                                                              + 219
                                                                              + 137
                                                                           << 6
                                                                  )
                                                                  << 13
                                                         )
                                                         & 65532
                                                   )
                                                   >> 2
                                                | (
                                                      (
                                                               (
                                                                     (
                                                                              (
                                                                                       (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                          | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                                    )
                                                                                    + 219
                                                                                    + 137
                                                                                 & 64512
                                                                           )
                                                                           >> 10
                                                                        | (
                                                                                 (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                    | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                              )
                                                                              + 219
                                                                              + 137
                                                                           << 6
                                                                  )
                                                                  & 65528
                                                            )
                                                            >> 3
                                                         | (
                                                               (
                                                                        (
                                                                                 (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                    | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                              )
                                                                              + 219
                                                                              + 137
                                                                           & 64512
                                                                     )
                                                                     >> 10
                                                                  | (
                                                                           (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                              | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                        )
                                                                        + 219
                                                                        + 137
                                                                     << 6
                                                            )
                                                            << 13
                                                   )
                                                   << 14
                                          )
                                          ^ 181
                                    )
                                    & 65535
                              )
                              >> 0
                           | (
                                 (
                                       (
                                                (
                                                      (
                                                               (
                                                                     (
                                                                              (
                                                                                       (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                          | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                                    )
                                                                                    + 219
                                                                                    + 137
                                                                                 & 64512
                                                                           )
                                                                           >> 10
                                                                        | (
                                                                                 (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                    | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                              )
                                                                              + 219
                                                                              + 137
                                                                           << 6
                                                                  )
                                                                  & 65528
                                                            )
                                                            >> 3
                                                         | (
                                                               (
                                                                        (
                                                                                 (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                    | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                              )
                                                                              + 219
                                                                              + 137
                                                                           & 64512
                                                                     )
                                                                     >> 10
                                                                  | (
                                                                           (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                              | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                        )
                                                                        + 219
                                                                        + 137
                                                                     << 6
                                                            )
                                                            << 13
                                                   )
                                                   & 65532
                                             )
                                             >> 2
                                          | (
                                                (
                                                         (
                                                               (
                                                                        (
                                                                                 (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                    | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                              )
                                                                              + 219
                                                                              + 137
                                                                           & 64512
                                                                     )
                                                                     >> 10
                                                                  | (
                                                                           (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                              | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                        )
                                                                        + 219
                                                                        + 137
                                                                     << 6
                                                            )
                                                            & 65528
                                                      )
                                                      >> 3
                                                   | (
                                                         (
                                                                  ((((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5 | ((var42 & '쀀') >> 14 | var42 << 2) << 11)
                                                                        + 219
                                                                        + 137
                                                                     & 64512
                                                               )
                                                               >> 10
                                                            | ((((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5 | ((var42 & '쀀') >> 14 | var42 << 2) << 11)
                                                                  + 219
                                                                  + 137
                                                               << 6
                                                      )
                                                      << 13
                                             )
                                             << 14
                                    )
                                    ^ 181
                              )
                              << 16
                     )
                     << 14
            );
            var13.setCharAt(
               var23,
               (char)(
                  (
                           (
                                 (
                                          (
                                                (
                                                      (
                                                               (
                                                                     (
                                                                              (
                                                                                    (
                                                                                             (
                                                                                                      (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                                         | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                                                   )
                                                                                                   + 219
                                                                                                   + 137
                                                                                                & 64512
                                                                                          )
                                                                                          >> 10
                                                                                       | (
                                                                                                (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                                   | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                                             )
                                                                                             + 219
                                                                                             + 137
                                                                                          << 6
                                                                                 )
                                                                                 & 65528
                                                                           )
                                                                           >> 3
                                                                        | (
                                                                              (
                                                                                       (
                                                                                                (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                                   | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                                             )
                                                                                             + 219
                                                                                             + 137
                                                                                          & 64512
                                                                                    )
                                                                                    >> 10
                                                                                 | (
                                                                                          (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                             | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                                       )
                                                                                       + 219
                                                                                       + 137
                                                                                    << 6
                                                                           )
                                                                           << 13
                                                                  )
                                                                  & 65532
                                                            )
                                                            >> 2
                                                         | (
                                                               (
                                                                        (
                                                                              (
                                                                                       (
                                                                                                (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                                   | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                                             )
                                                                                             + 219
                                                                                             + 137
                                                                                          & 64512
                                                                                    )
                                                                                    >> 10
                                                                                 | (
                                                                                          (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                             | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                                       )
                                                                                       + 219
                                                                                       + 137
                                                                                    << 6
                                                                           )
                                                                           & 65528
                                                                     )
                                                                     >> 3
                                                                  | (
                                                                        (
                                                                                 (
                                                                                          (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                             | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                                       )
                                                                                       + 219
                                                                                       + 137
                                                                                    & 64512
                                                                              )
                                                                              >> 10
                                                                           | (
                                                                                    (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                       | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                                 )
                                                                                 + 219
                                                                                 + 137
                                                                              << 6
                                                                     )
                                                                     << 13
                                                            )
                                                            << 14
                                                   )
                                                   ^ 181
                                             )
                                             & 65535
                                       )
                                       >> 0
                                    | (
                                          (
                                                (
                                                         (
                                                               (
                                                                        (
                                                                              (
                                                                                       (
                                                                                                (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                                   | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                                             )
                                                                                             + 219
                                                                                             + 137
                                                                                          & 64512
                                                                                    )
                                                                                    >> 10
                                                                                 | (
                                                                                          (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                             | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                                       )
                                                                                       + 219
                                                                                       + 137
                                                                                    << 6
                                                                           )
                                                                           & 65528
                                                                     )
                                                                     >> 3
                                                                  | (
                                                                        (
                                                                                 (
                                                                                          (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                             | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                                       )
                                                                                       + 219
                                                                                       + 137
                                                                                    & 64512
                                                                              )
                                                                              >> 10
                                                                           | (
                                                                                    (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                       | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                                 )
                                                                                 + 219
                                                                                 + 137
                                                                              << 6
                                                                     )
                                                                     << 13
                                                            )
                                                            & 65532
                                                      )
                                                      >> 2
                                                   | (
                                                         (
                                                                  (
                                                                        (
                                                                                 (
                                                                                          (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                             | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                                       )
                                                                                       + 219
                                                                                       + 137
                                                                                    & 64512
                                                                              )
                                                                              >> 10
                                                                           | (
                                                                                    (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                       | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                                 )
                                                                                 + 219
                                                                                 + 137
                                                                              << 6
                                                                     )
                                                                     & 65528
                                                               )
                                                               >> 3
                                                            | (
                                                                  (
                                                                           (
                                                                                    (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                       | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                                 )
                                                                                 + 219
                                                                                 + 137
                                                                              & 64512
                                                                        )
                                                                        >> 10
                                                                     | (
                                                                              (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                 | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                           )
                                                                           + 219
                                                                           + 137
                                                                        << 6
                                                               )
                                                               << 13
                                                      )
                                                      << 14
                                             )
                                             ^ 181
                                       )
                                       << 16
                              )
                              & 65532
                        )
                        >> 2
                     | (
                           (
                                    (
                                          (
                                                (
                                                         (
                                                               (
                                                                        (
                                                                              (
                                                                                       (
                                                                                                (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                                   | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                                             )
                                                                                             + 219
                                                                                             + 137
                                                                                          & 64512
                                                                                    )
                                                                                    >> 10
                                                                                 | (
                                                                                          (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                             | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                                       )
                                                                                       + 219
                                                                                       + 137
                                                                                    << 6
                                                                           )
                                                                           & 65528
                                                                     )
                                                                     >> 3
                                                                  | (
                                                                        (
                                                                                 (
                                                                                          (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                             | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                                       )
                                                                                       + 219
                                                                                       + 137
                                                                                    & 64512
                                                                              )
                                                                              >> 10
                                                                           | (
                                                                                    (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                       | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                                 )
                                                                                 + 219
                                                                                 + 137
                                                                              << 6
                                                                     )
                                                                     << 13
                                                            )
                                                            & 65532
                                                      )
                                                      >> 2
                                                   | (
                                                         (
                                                                  (
                                                                        (
                                                                                 (
                                                                                          (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                             | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                                       )
                                                                                       + 219
                                                                                       + 137
                                                                                    & 64512
                                                                              )
                                                                              >> 10
                                                                           | (
                                                                                    (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                       | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                                 )
                                                                                 + 219
                                                                                 + 137
                                                                              << 6
                                                                     )
                                                                     & 65528
                                                               )
                                                               >> 3
                                                            | (
                                                                  (
                                                                           (
                                                                                    (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                       | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                                 )
                                                                                 + 219
                                                                                 + 137
                                                                              & 64512
                                                                        )
                                                                        >> 10
                                                                     | (
                                                                              (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                 | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                           )
                                                                           + 219
                                                                           + 137
                                                                        << 6
                                                               )
                                                               << 13
                                                      )
                                                      << 14
                                             )
                                             ^ 181
                                       )
                                       & 65535
                                 )
                                 >> 0
                              | (
                                    (
                                          (
                                                   (
                                                         (
                                                                  (
                                                                        (
                                                                                 (
                                                                                          (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                             | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                                       )
                                                                                       + 219
                                                                                       + 137
                                                                                    & 64512
                                                                              )
                                                                              >> 10
                                                                           | (
                                                                                    (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                       | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                                 )
                                                                                 + 219
                                                                                 + 137
                                                                              << 6
                                                                     )
                                                                     & 65528
                                                               )
                                                               >> 3
                                                            | (
                                                                  (
                                                                           (
                                                                                    (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                       | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                                 )
                                                                                 + 219
                                                                                 + 137
                                                                              & 64512
                                                                        )
                                                                        >> 10
                                                                     | (
                                                                              (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                 | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                           )
                                                                           + 219
                                                                           + 137
                                                                        << 6
                                                               )
                                                               << 13
                                                      )
                                                      & 65532
                                                )
                                                >> 2
                                             | (
                                                   (
                                                            (
                                                                  (
                                                                           (
                                                                                    (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                       | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                                 )
                                                                                 + 219
                                                                                 + 137
                                                                              & 64512
                                                                        )
                                                                        >> 10
                                                                     | (
                                                                              (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                 | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                           )
                                                                           + 219
                                                                           + 137
                                                                        << 6
                                                               )
                                                               & 65528
                                                         )
                                                         >> 3
                                                      | (
                                                            (
                                                                     (
                                                                              (((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5
                                                                                 | ((var42 & '쀀') >> 14 | var42 << 2) << 11
                                                                           )
                                                                           + 219
                                                                           + 137
                                                                        & 64512
                                                                  )
                                                                  >> 10
                                                               | ((((var42 & '쀀') >> 14 | var42 << 2) & 65504) >> 5 | ((var42 & '쀀') >> 14 | var42 << 2) << 11)
                                                                     + 219
                                                                     + 137
                                                                  << 6
                                                         )
                                                         << 13
                                                )
                                                << 14
                                       )
                                       ^ 181
                                 )
                                 << 16
                        )
                        << 14
               )
            );
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = (338303681 - 1468411447 | 0) & 1094714161; var29 < var16.length(); var29 += (-1669320715 >> -1050348004 | 0) & 1) {
            int var54 = var16.charAt(var29) - 235 + 108;
            char var59 = (char)(
               (
                        (
                              (
                                       (
                                             (
                                                      (
                                                               ((((var54 & 65472) >> 6 | var54 << 10) - 133 ^ 163) & 65504) >> 5
                                                                  | (((var54 & 65472) >> 6 | var54 << 10) - 133 ^ 163) << 11
                                                            )
                                                            - 223
                                                         & 0
                                                   )
                                                   >> 16
                                                | (
                                                         ((((var54 & 65472) >> 6 | var54 << 10) - 133 ^ 163) & 65504) >> 5
                                                            | (((var54 & 65472) >> 6 | var54 << 10) - 133 ^ 163) << 11
                                                      )
                                                      - 223
                                                   << 0
                                          )
                                          & 65408
                                    )
                                    >> 7
                                 | (
                                       (
                                                (
                                                         ((((var54 & 65472) >> 6 | var54 << 10) - 133 ^ 163) & 65504) >> 5
                                                            | (((var54 & 65472) >> 6 | var54 << 10) - 133 ^ 163) << 11
                                                      )
                                                      - 223
                                                   & 0
                                             )
                                             >> 16
                                          | (
                                                   ((((var54 & 65472) >> 6 | var54 << 10) - 133 ^ 163) & 65504) >> 5
                                                      | (((var54 & 65472) >> 6 | var54 << 10) - 133 ^ 163) << 11
                                                )
                                                - 223
                                             << 0
                                    )
                                    << 9
                           )
                           & 63488
                     )
                     >> 11
                  | (
                        (
                                 (
                                       (
                                                (
                                                         ((((var54 & 65472) >> 6 | var54 << 10) - 133 ^ 163) & 65504) >> 5
                                                            | (((var54 & 65472) >> 6 | var54 << 10) - 133 ^ 163) << 11
                                                      )
                                                      - 223
                                                   & 0
                                             )
                                             >> 16
                                          | (
                                                   ((((var54 & 65472) >> 6 | var54 << 10) - 133 ^ 163) & 65504) >> 5
                                                      | (((var54 & 65472) >> 6 | var54 << 10) - 133 ^ 163) << 11
                                                )
                                                - 223
                                             << 0
                                    )
                                    & 65408
                              )
                              >> 7
                           | (
                                 (
                                          (
                                                   ((((var54 & 65472) >> 6 | var54 << 10) - 133 ^ 163) & 65504) >> 5
                                                      | (((var54 & 65472) >> 6 | var54 << 10) - 133 ^ 163) << 11
                                                )
                                                - 223
                                             & 0
                                       )
                                       >> 16
                                    | (
                                             ((((var54 & 65472) >> 6 | var54 << 10) - 133 ^ 163) & 65504) >> 5
                                                | (((var54 & 65472) >> 6 | var54 << 10) - 133 ^ 163) << 11
                                          )
                                          - 223
                                       << 0
                              )
                              << 9
                     )
                     << 5
            );
            var16.setCharAt(
               var29,
               (char)(
                  (
                           (
                                 (
                                          (
                                                (
                                                         (
                                                                  ((((var54 & 65472) >> 6 | var54 << 10) - 133 ^ 163) & 65504) >> 5
                                                                     | (((var54 & 65472) >> 6 | var54 << 10) - 133 ^ 163) << 11
                                                               )
                                                               - 223
                                                            & 0
                                                      )
                                                      >> 16
                                                   | (
                                                            ((((var54 & 65472) >> 6 | var54 << 10) - 133 ^ 163) & 65504) >> 5
                                                               | (((var54 & 65472) >> 6 | var54 << 10) - 133 ^ 163) << 11
                                                         )
                                                         - 223
                                                      << 0
                                             )
                                             & 65408
                                       )
                                       >> 7
                                    | (
                                          (
                                                   (
                                                            ((((var54 & 65472) >> 6 | var54 << 10) - 133 ^ 163) & 65504) >> 5
                                                               | (((var54 & 65472) >> 6 | var54 << 10) - 133 ^ 163) << 11
                                                         )
                                                         - 223
                                                      & 0
                                                )
                                                >> 16
                                             | (
                                                      ((((var54 & 65472) >> 6 | var54 << 10) - 133 ^ 163) & 65504) >> 5
                                                         | (((var54 & 65472) >> 6 | var54 << 10) - 133 ^ 163) << 11
                                                   )
                                                   - 223
                                                << 0
                                       )
                                       << 9
                              )
                              & 63488
                        )
                        >> 11
                     | (
                           (
                                    (
                                          (
                                                   (
                                                            ((((var54 & 65472) >> 6 | var54 << 10) - 133 ^ 163) & 65504) >> 5
                                                               | (((var54 & 65472) >> 6 | var54 << 10) - 133 ^ 163) << 11
                                                         )
                                                         - 223
                                                      & 0
                                                )
                                                >> 16
                                             | (
                                                      ((((var54 & 65472) >> 6 | var54 << 10) - 133 ^ 163) & 65504) >> 5
                                                         | (((var54 & 65472) >> 6 | var54 << 10) - 133 ^ 163) << 11
                                                   )
                                                   - 223
                                                << 0
                                       )
                                       & 65408
                                 )
                                 >> 7
                              | (
                                    (
                                             (
                                                      ((((var54 & 65472) >> 6 | var54 << 10) - 133 ^ 163) & 65504) >> 5
                                                         | (((var54 & 65472) >> 6 | var54 << 10) - 133 ^ 163) << 11
                                                   )
                                                   - 223
                                                & 0
                                          )
                                          >> 16
                                       | (
                                                ((((var54 & 65472) >> 6 | var54 << 10) - 133 ^ 163) & 65504) >> 5
                                                   | (((var54 & 65472) >> 6 | var54 << 10) - 133 ^ 163) << 11
                                             )
                                             - 223
                                          << 0
                                 )
                                 << 9
                        )
                        << 5
               )
            );
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_255.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = (-1533401014 >> -1419042567 | 0) & 33; var35 < var19.length(); var35 += (-681531120 & -2066148372 | 1) & 1790685327) {
            int var64 = var19.charAt(var35) - 181;
            int var104 = (var64 & 63488) >> 11;
            int var65 = ((var64 & 63488) >> 11 | var64 << 5) - 41 - 61 - 194;
            int var105 = (((var64 & 63488) >> 11 | var64 << 5) - 41 - 61 - 194 & 65408) >> 7;
            var64 = (((var104 | var64 << 5) - 41 - 61 - 194 & 65408) >> 7 | ((var64 & 63488) >> 11 | var64 << 5) - 41 - 61 - 194 << 9) ^ 110 ^ 146;
            var104 = (((var105 | var65 << 9) ^ 110 ^ 146) & 0) >> 16;
            int var67 = (((var105 | var65 << 9) ^ 110 ^ 146) & 0) >> 16 | var64 << 0;
            int var107 = (((((var105 | var65 << 9) ^ 110 ^ 146) & 0) >> 16 | var64 << 0) & 49152) >> 14;
            char var68 = (char)(((var104 | var64 << 0) & 49152) >> 14 | ((((var105 | var65 << 9) ^ 110 ^ 146) & 0) >> 16 | var64 << 0) << 2);
            var19.setCharAt(var35, (char)(var107 | var67 << 2));
         }

         Class var7 = Class.forName(var19.toString(), false, Class_255.class.getClassLoader());
         switch (((var4 + 437063863 - 1826524333 - 1380478562 ^ 1051186670) - 288392317 ^ 1239224384) - 1971629699 + 2088766783 - 1983482735 - 915456868) {
            case 586217614:
               var10000 = var0.findSpecial(var7, var5, var6, Class_255.class);
               break;
            case 926919321:
            case 1160434832:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 1338384159:
               var10000 = var0.findConstructor(var7, var6);
               break;
            case 1910368788:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_1299[(var10 - 1040390361 ^ 207740610) + 1359375821 + 70442460 + 1623151619 + 1186730363 - 150166999 + 1181871996 ^ 1273531127 ^ 1003441855] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1294(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = (((var10 ^ 842986774) + 1932385057 + 1787823969 ^ 1662328018) - 371656704 + 216587858 ^ 221699511) + 2122736681 ^ 364769017;
      MethodHandle var10000 = field_1299[(
            (((var10 ^ 842986774) + 1932385057 + 1787823969 ^ 1662328018) - 371656704 + 216587858 ^ 221699511) + 2122736681 ^ 364769017
         )
         + 910623683];
      if (field_1299[var10001 + 910623683] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = (1529791042 & 1529791042 - 251028911 | 0) & 58955700; var24 < var14.length(); var24 += -734986638 >> -28316566 ^ -717762) {
            int var43 = var14.charAt(var24) + '\b';
            char var50 = (char)(
               (
                        (
                              (
                                       (
                                             (
                                                   (
                                                            (
                                                                     (
                                                                              (
                                                                                    (
                                                                                             (
                                                                                                   (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                                      | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                                                )
                                                                                                & 0
                                                                                          )
                                                                                          >> 16
                                                                                       | (
                                                                                             (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                                | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                                          )
                                                                                          << 0
                                                                                 )
                                                                                 & 61440
                                                                           )
                                                                           >> 12
                                                                        | (
                                                                              (
                                                                                       (
                                                                                             (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                                | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                                          )
                                                                                          & 0
                                                                                    )
                                                                                    >> 16
                                                                                 | (
                                                                                       (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                          | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                                    )
                                                                                    << 0
                                                                           )
                                                                           << 4
                                                                  )
                                                                  - 11
                                                               & 65535
                                                         )
                                                         >> 0
                                                      | (
                                                               (
                                                                        (
                                                                              (
                                                                                       (
                                                                                             (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                                | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                                          )
                                                                                          & 0
                                                                                    )
                                                                                    >> 16
                                                                                 | (
                                                                                       (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                          | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                                    )
                                                                                    << 0
                                                                           )
                                                                           & 61440
                                                                     )
                                                                     >> 12
                                                                  | (
                                                                        (
                                                                                 (
                                                                                       (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                          | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                                    )
                                                                                    & 0
                                                                              )
                                                                              >> 16
                                                                           | (
                                                                                 (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                    | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                              )
                                                                              << 0
                                                                     )
                                                                     << 4
                                                            )
                                                            - 11
                                                         << 16
                                                )
                                                ^ 54
                                          )
                                          & 64512
                                    )
                                    >> 10
                                 | (
                                       (
                                             (
                                                      (
                                                               (
                                                                        (
                                                                              (
                                                                                       (
                                                                                             (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                                | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                                          )
                                                                                          & 0
                                                                                    )
                                                                                    >> 16
                                                                                 | (
                                                                                       (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                          | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                                    )
                                                                                    << 0
                                                                           )
                                                                           & 61440
                                                                     )
                                                                     >> 12
                                                                  | (
                                                                        (
                                                                                 (
                                                                                       (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                          | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                                    )
                                                                                    & 0
                                                                              )
                                                                              >> 16
                                                                           | (
                                                                                 (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                    | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                              )
                                                                              << 0
                                                                     )
                                                                     << 4
                                                            )
                                                            - 11
                                                         & 65535
                                                   )
                                                   >> 0
                                                | (
                                                         (
                                                                  (
                                                                        (
                                                                                 (
                                                                                       (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                          | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                                    )
                                                                                    & 0
                                                                              )
                                                                              >> 16
                                                                           | (
                                                                                 (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                    | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                              )
                                                                              << 0
                                                                     )
                                                                     & 61440
                                                               )
                                                               >> 12
                                                            | (
                                                                  (
                                                                           (
                                                                                 (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                    | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                              )
                                                                              & 0
                                                                        )
                                                                        >> 16
                                                                     | (
                                                                           (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                              | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                        )
                                                                        << 0
                                                               )
                                                               << 4
                                                      )
                                                      - 11
                                                   << 16
                                          )
                                          ^ 54
                                    )
                                    << 6
                           )
                           & 65504
                     )
                     >> 5
                  | (
                        (
                                 (
                                       (
                                             (
                                                      (
                                                               (
                                                                        (
                                                                              (
                                                                                       (
                                                                                             (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                                | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                                          )
                                                                                          & 0
                                                                                    )
                                                                                    >> 16
                                                                                 | (
                                                                                       (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                          | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                                    )
                                                                                    << 0
                                                                           )
                                                                           & 61440
                                                                     )
                                                                     >> 12
                                                                  | (
                                                                        (
                                                                                 (
                                                                                       (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                          | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                                    )
                                                                                    & 0
                                                                              )
                                                                              >> 16
                                                                           | (
                                                                                 (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                    | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                              )
                                                                              << 0
                                                                     )
                                                                     << 4
                                                            )
                                                            - 11
                                                         & 65535
                                                   )
                                                   >> 0
                                                | (
                                                         (
                                                                  (
                                                                        (
                                                                                 (
                                                                                       (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                          | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                                    )
                                                                                    & 0
                                                                              )
                                                                              >> 16
                                                                           | (
                                                                                 (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                    | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                              )
                                                                              << 0
                                                                     )
                                                                     & 61440
                                                               )
                                                               >> 12
                                                            | (
                                                                  (
                                                                           (
                                                                                 (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                    | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                              )
                                                                              & 0
                                                                        )
                                                                        >> 16
                                                                     | (
                                                                           (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                              | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                        )
                                                                        << 0
                                                               )
                                                               << 4
                                                      )
                                                      - 11
                                                   << 16
                                          )
                                          ^ 54
                                    )
                                    & 64512
                              )
                              >> 10
                           | (
                                 (
                                       (
                                                (
                                                         (
                                                                  (
                                                                        (
                                                                                 (
                                                                                       (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                          | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                                    )
                                                                                    & 0
                                                                              )
                                                                              >> 16
                                                                           | (
                                                                                 (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                    | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                              )
                                                                              << 0
                                                                     )
                                                                     & 61440
                                                               )
                                                               >> 12
                                                            | (
                                                                  (
                                                                           (
                                                                                 (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                    | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                              )
                                                                              & 0
                                                                        )
                                                                        >> 16
                                                                     | (
                                                                           (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                              | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                        )
                                                                        << 0
                                                               )
                                                               << 4
                                                      )
                                                      - 11
                                                   & 65535
                                             )
                                             >> 0
                                          | (
                                                   (
                                                            (
                                                                  (
                                                                           (
                                                                                 (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                    | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                              )
                                                                              & 0
                                                                        )
                                                                        >> 16
                                                                     | (
                                                                           (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                              | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                        )
                                                                        << 0
                                                               )
                                                               & 61440
                                                         )
                                                         >> 12
                                                      | (
                                                            (
                                                                     (
                                                                           (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                              | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                        )
                                                                        & 0
                                                                  )
                                                                  >> 16
                                                               | (
                                                                     (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                        | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                  )
                                                                  << 0
                                                         )
                                                         << 4
                                                )
                                                - 11
                                             << 16
                                    )
                                    ^ 54
                              )
                              << 6
                     )
                     << 11
            );
            var14.setCharAt(
               var24,
               (char)(
                  (
                           (
                                 (
                                          (
                                                (
                                                      (
                                                               (
                                                                        (
                                                                                 (
                                                                                       (
                                                                                                (
                                                                                                      (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                                         | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                                                   )
                                                                                                   & 0
                                                                                             )
                                                                                             >> 16
                                                                                          | (
                                                                                                (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                                   | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                                             )
                                                                                             << 0
                                                                                    )
                                                                                    & 61440
                                                                              )
                                                                              >> 12
                                                                           | (
                                                                                 (
                                                                                          (
                                                                                                (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                                   | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                                             )
                                                                                             & 0
                                                                                       )
                                                                                       >> 16
                                                                                    | (
                                                                                          (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                             | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                                       )
                                                                                       << 0
                                                                              )
                                                                              << 4
                                                                     )
                                                                     - 11
                                                                  & 65535
                                                            )
                                                            >> 0
                                                         | (
                                                                  (
                                                                           (
                                                                                 (
                                                                                          (
                                                                                                (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                                   | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                                             )
                                                                                             & 0
                                                                                       )
                                                                                       >> 16
                                                                                    | (
                                                                                          (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                             | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                                       )
                                                                                       << 0
                                                                              )
                                                                              & 61440
                                                                        )
                                                                        >> 12
                                                                     | (
                                                                           (
                                                                                    (
                                                                                          (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                             | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                                       )
                                                                                       & 0
                                                                                 )
                                                                                 >> 16
                                                                              | (
                                                                                    (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                       | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                                 )
                                                                                 << 0
                                                                        )
                                                                        << 4
                                                               )
                                                               - 11
                                                            << 16
                                                   )
                                                   ^ 54
                                             )
                                             & 64512
                                       )
                                       >> 10
                                    | (
                                          (
                                                (
                                                         (
                                                                  (
                                                                           (
                                                                                 (
                                                                                          (
                                                                                                (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                                   | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                                             )
                                                                                             & 0
                                                                                       )
                                                                                       >> 16
                                                                                    | (
                                                                                          (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                             | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                                       )
                                                                                       << 0
                                                                              )
                                                                              & 61440
                                                                        )
                                                                        >> 12
                                                                     | (
                                                                           (
                                                                                    (
                                                                                          (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                             | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                                       )
                                                                                       & 0
                                                                                 )
                                                                                 >> 16
                                                                              | (
                                                                                    (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                       | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                                 )
                                                                                 << 0
                                                                        )
                                                                        << 4
                                                               )
                                                               - 11
                                                            & 65535
                                                      )
                                                      >> 0
                                                   | (
                                                            (
                                                                     (
                                                                           (
                                                                                    (
                                                                                          (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                             | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                                       )
                                                                                       & 0
                                                                                 )
                                                                                 >> 16
                                                                              | (
                                                                                    (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                       | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                                 )
                                                                                 << 0
                                                                        )
                                                                        & 61440
                                                                  )
                                                                  >> 12
                                                               | (
                                                                     (
                                                                              (
                                                                                    (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                       | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                                 )
                                                                                 & 0
                                                                           )
                                                                           >> 16
                                                                        | (
                                                                              (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                 | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                           )
                                                                           << 0
                                                                  )
                                                                  << 4
                                                         )
                                                         - 11
                                                      << 16
                                             )
                                             ^ 54
                                       )
                                       << 6
                              )
                              & 65504
                        )
                        >> 5
                     | (
                           (
                                    (
                                          (
                                                (
                                                         (
                                                                  (
                                                                           (
                                                                                 (
                                                                                          (
                                                                                                (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                                   | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                                             )
                                                                                             & 0
                                                                                       )
                                                                                       >> 16
                                                                                    | (
                                                                                          (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                             | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                                       )
                                                                                       << 0
                                                                              )
                                                                              & 61440
                                                                        )
                                                                        >> 12
                                                                     | (
                                                                           (
                                                                                    (
                                                                                          (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                             | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                                       )
                                                                                       & 0
                                                                                 )
                                                                                 >> 16
                                                                              | (
                                                                                    (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                       | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                                 )
                                                                                 << 0
                                                                        )
                                                                        << 4
                                                               )
                                                               - 11
                                                            & 65535
                                                      )
                                                      >> 0
                                                   | (
                                                            (
                                                                     (
                                                                           (
                                                                                    (
                                                                                          (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                             | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                                       )
                                                                                       & 0
                                                                                 )
                                                                                 >> 16
                                                                              | (
                                                                                    (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                       | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                                 )
                                                                                 << 0
                                                                        )
                                                                        & 61440
                                                                  )
                                                                  >> 12
                                                               | (
                                                                     (
                                                                              (
                                                                                    (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                       | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                                 )
                                                                                 & 0
                                                                           )
                                                                           >> 16
                                                                        | (
                                                                              (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                 | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                           )
                                                                           << 0
                                                                  )
                                                                  << 4
                                                         )
                                                         - 11
                                                      << 16
                                             )
                                             ^ 54
                                       )
                                       & 64512
                                 )
                                 >> 10
                              | (
                                    (
                                          (
                                                   (
                                                            (
                                                                     (
                                                                           (
                                                                                    (
                                                                                          (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                             | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                                       )
                                                                                       & 0
                                                                                 )
                                                                                 >> 16
                                                                              | (
                                                                                    (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                       | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                                 )
                                                                                 << 0
                                                                        )
                                                                        & 61440
                                                                  )
                                                                  >> 12
                                                               | (
                                                                     (
                                                                              (
                                                                                    (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                       | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                                 )
                                                                                 & 0
                                                                           )
                                                                           >> 16
                                                                        | (
                                                                              (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                 | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                           )
                                                                           << 0
                                                                  )
                                                                  << 4
                                                         )
                                                         - 11
                                                      & 65535
                                                )
                                                >> 0
                                             | (
                                                      (
                                                               (
                                                                     (
                                                                              (
                                                                                    (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                       | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                                 )
                                                                                 & 0
                                                                           )
                                                                           >> 16
                                                                        | (
                                                                              (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                 | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                           )
                                                                           << 0
                                                                  )
                                                                  & 61440
                                                            )
                                                            >> 12
                                                         | (
                                                               (
                                                                        (
                                                                              (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                                 | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                           )
                                                                           & 0
                                                                     )
                                                                     >> 16
                                                                  | (
                                                                        (((var43 & 64512) >> 10 | var43 << 6) & 65532) >> 2
                                                                           | ((var43 & 64512) >> 10 | var43 << 6) << 14
                                                                     )
                                                                     << 0
                                                            )
                                                            << 4
                                                   )
                                                   - 11
                                                << 16
                                       )
                                       ^ 54
                                 )
                                 << 6
                        )
                        << 11
               )
            );
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = (-735611139 ^ 631025170 | 0) & 239076112; var30 < var17.length(); var30 += (1603276939 - 885520675 | 1) & 1411385491) {
            int var55 = var17.charAt(var30);
            int var96 = (var55 & 65504) >> 5;
            int var56 = (var55 & 65504) >> 5 | var55 << 11;
            int var97 = (((var55 & 65504) >> 5 | var55 << 11) & 65534) >> 1;
            var55 = ((var96 | var55 << 11) & 65534) >> 1 | ((var55 & 65504) >> 5 | var55 << 11) << 15;
            var96 = ((var97 | var56 << 15) & 65520) >> 4;
            int var58 = (((var97 | var56 << 15) & 65520) >> 4 | var55 << 12) + 175 + 81 + 5 + 116;
            int var99 = ((((var97 | var56 << 15) & 65520) >> 4 | var55 << 12) + 175 + 81 + 5 + 116 & 65532) >> 2;
            char var59 = (char)(
               (((var96 | var55 << 12) + 175 + 81 + 5 + 116 & 65532) >> 2 | (((var97 | var56 << 15) & 65520) >> 4 | var55 << 12) + 175 + 81 + 5 + 116 << 14)
                     - 140
                  ^ 225
            );
            var17.setCharAt(var30, (char)((var99 | var58 << 14) - 140 ^ 225));
         }

         Class var6 = Class.forName(var17.toString(), false, Class_255.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = -339188607 & -339188607 ^ -339188607; var36 < var20.length(); var36 += (1813614619 * -670291130 * -479313260 | 1) & -2077539839) {
            int var64 = (var20.charAt(var36) - 0 ^ 133) + 213 - 116;
            char var67 = (char)(
               (
                        (
                              (((((var64 & 65504) >> 5 | var64 << 11) & 57344) >> 13 | ((var64 & 65504) >> 5 | var64 << 11) << 3) & 65532) >> 2
                                 | ((((var64 & 65504) >> 5 | var64 << 11) & 57344) >> 13 | ((var64 & 65504) >> 5 | var64 << 11) << 3) << 14
                           )
                           ^ 21
                     )
                     + 132
                  ^ 96
            );
            var20.setCharAt(
               var36,
               (char)(
                  (
                           (
                                 (((((var64 & 65504) >> 5 | var64 << 11) & 57344) >> 13 | ((var64 & 65504) >> 5 | var64 << 11) << 3) & 65532) >> 2
                                    | ((((var64 & 65504) >> 5 | var64 << 11) & 57344) >> 13 | ((var64 & 65504) >> 5 | var64 << 11) << 3) << 14
                              )
                              ^ 21
                        )
                        + 132
                     ^ 96
               )
            );
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_255.class.getClassLoader()).returnType();
         switch ((((var4 + 1367397068 ^ 1582534502) + 165816378 + 1785236347 - 551998864 ^ 1937689305) - 359439082 ^ 687533413 ^ 940374379) + 873364816) {
            case 945742960:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            case 1133383883:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            case 1171722276:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            case 1769254049:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_1299[((((var10 ^ 842986774) + 1932385057 + 1787823969 ^ 1662328018) - 371656704 + 216587858 ^ 221699511) + 2122736681 ^ 364769017) + 910623683] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
