import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;
import java.util.List;
import net.minecraft.class_1297;
import net.minecraft.class_1511;
import net.minecraft.class_1621;
import net.minecraft.class_2338;
import net.minecraft.class_238;
import net.minecraft.class_3965;
import net.minecraft.class_3966;

public class Class_191 extends Class_342 {
   // $VF: renamed from: vi Class_115
   public Class_115 field_2024;
   // $VF: renamed from: vhv Class_105
   public Class_105 field_2025;
   // $VF: renamed from: oh Class_49
   public Class_49 field_2026;
   // $VF: renamed from: ak Class_49
   public Class_49 field_2027;
   // $VF: renamed from: wr boolean
   public boolean field_2028;
   // $VF: renamed from: az int
   public int field_2029;
   // $VF: renamed from: dm int
   public int field_2030;
   // $VF: renamed from: psm java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_2031 = new MethodHandle[(-1166404845 * -1166404845 | 137) & 540019851];

   public Class_191() {
      int var10001 = (-2011383458 + -218316578 | 0) & -2075787263;

      StringBuilder var10002;
      for (var10002 = (StringBuilder)0<"JNT",-1781964596,"～ＡＤＡﾖｔ","−ꈎ戚ȑ\ue21bȑ숒ꈚȑ\ue21a숙숒䈏ꈛ戛Ț\ue21a숙䈔Ȓ\ue20f","좗뾗풗뾗貗쪗뾗첗얗貗놗튗킗잗첗얗ꂗ펗잗쪗슗쎗킗",-1062811106>(
            "죁줩줧줝좿죅줣줱줥줧줁줗"
         );
         var10001 < (1144779263 >> 1144779263 ^ 12);
         var10001 += (2069218600 & -1301498574 >>> (2069218600 | -1301498574) | 1) & 85326867
      ) {
         int var28 = 0<"JNT",1155399017,"＿ＢＹＰｙﾖ","−ȎȒ䈕","좗뾗풗뾗貗쪗뾗첗얗貗놗튗킗잗첗얗ꂗ펗잗쪗슗쎗킗",-1062811094>(var10002, var10001);
         int var10005 = (var28 & 65504) >> 5;
         int var29 = (var28 & 65504) >> 5 | var28 << 11;
         int var83 = (((var28 & 65504) >> 5 | var28 << 11) & 32768) >> 15;
         var28 = ((var10005 | var28 << 11) & 32768) >> 15 | ((var28 & 65504) >> 5 | var28 << 11) << 1;
         var10005 = ((var83 | var29 << 1) & 65532) >> 2;
         int var31 = (((var83 | var29 << 1) & 65532) >> 2 | var28 << 14) + 223;
         int var85 = ((((var83 | var29 << 1) & 65532) >> 2 | var28 << 14) + 223 & 63488) >> 11;
         char var32 = (char)(((var10005 | var28 << 14) + 223 & 63488) >> 11 | (((var83 | var29 << 1) & 65532) >> 2 | var28 << 14) + 223 << 5);
         0<"JNT",1155399017,"ＯＥﾖ｟ＢＹＰｙﾖ","−Ȏ䈕Ȓ\ue20f","좗뾗풗뾗貗쪗뾗첗얗貗놗튗킗잗첗얗ꂗ펗잗쪗슗쎗킗",-1062811093>(var10002, var10001, (char)(var85 | var31 << 5));
      }

      String var2 = 0<"JNT",1155399017,"ﾖＣｏﾖＰＡＤ［","−Ȓꈎ戚ȑ\ue21bȑ숒ꈚȑ\ue21a숙숒䈏ꈛ戛Ț\ue21a숙䈔","좗뾗풗뾗貗쪗뾗첗얗貗놗튗킗잗첗얗ꂗ펗잗쪗슗쎗킗",-1062811090>(var10002);
      int var14 = -1758852022 >> -1949036490 ^ -420;

      StringBuilder var34;
      for (var34 = (StringBuilder)0<"JNT",-1781964596,"～ＡＤＡﾖｔ","−ꈎ戚ȑ\ue21bȑ숒ꈚȑ\ue21a숙숒䈏ꈛ戛Ț\ue21a숙䈔Ȓ\ue20f","좗뾗풗뾗貗쪗뾗첗얗貗놗튗킗잗첗얗ꂗ펗잗쪗슗쎗킗",-1062811057>(
            "퓫퓦铦哠퓠퓣铦퓡哣퓣铠铠퓥铳哣ᓧ퓥哧铦퓣铠哧铳ᓢ퓣哧铦铳ᓢ哠ᓧ铳퓥哠퓦"
         );
         var14 < 35;
         var14 += -1090657353 & 1090521089
      ) {
         int var63 = 0<"JNT",1155399017,"＿ＢＹＰｙﾖ","−ȎȒ䈕","좗뾗풗뾗貗쪗뾗첗얗貗놗튗킗잗첗얗ꂗ펗잗쪗슗쎗킗",-1062811077>(var34, var14) ^ 248;
         int var10006 = (var63 & 64512) >> 10;
         int var64 = ((var63 & 64512) >> 10 | var63 << 6) ^ 181;
         int var98 = ((((var63 & 64512) >> 10 | var63 << 6) ^ 181) & 65520) >> 4;
         char var65 = (char)(((((var10006 | var63 << 6) ^ 181) & 65520) >> 4 | (((var63 & 64512) >> 10 | var63 << 6) ^ 181) << 12) ^ 5);
         0<"JNT",1155399017,"ＯＥﾖ｟ＢＹＰｙﾖ","−Ȏ䈕Ȓ\ue20f","좗뾗풗뾗貗쪗뾗첗얗貗놗튗킗잗첗얗ꂗ펗잗쪗슗쎗킗",-1062811080>(var34, var14, (char)((var98 | var64 << 12) ^ 5));
      }

      super(
         var2,
         0<"JNT",1155399017,"ﾖＣｏﾖＰＡＤ［","−Ȓꈎ戚ȑ\ue21bȑ숒ꈚȑ\ue21a숙숒䈏ꈛ戛Ț\ue21a숙䈔","좗뾗풗뾗貗쪗뾗첗얗貗놗튗킗잗첗얗ꂗ펗잗쪗슗쎗킗",-1062811009>(var34),
         -1,
         1<"JNT",-2123525829,"ఀ눀","䄚脔","ꩿ\uabff롿퍾콿냿",174763332>()
      );
      var10001 = 1647880619 >>> 1647880619 ^ 804629;

      for (var10002 = (StringBuilder)0<"JNT",-1781964596,"～ＡＤＡﾖｔ","−ꈎ戚ȑ\ue21bȑ숒ꈚȑ\ue21a숙숒䈏ꈛ戛Ț\ue21a숙䈔Ȓ\ue20f","좗뾗풗뾗貗쪗뾗첗얗貗놗튗킗잗첗얗ꂗ펗잗쪗슗쎗킗",-1062811011>(
            "㉈㍘㏠㌈㏰㍈㏠㍨ㅀ㈘㍨㎈"
         );
         var10001 < ((-1022111303 & -471772151 | 4) & 146712588);
         var10001 += -1051514224 - -537515079 ^ -513999146
      ) {
         char var37 = 0<"JNT",1155399017,"＿ＢＹＰｙﾖ","−ȎȒ䈕","좗뾗풗뾗貗쪗뾗첗얗貗놗튗킗잗첗얗ꂗ펗잗쪗슗쎗킗",-1062811096>(var10002, var10001);
         char var40 = (char)(
            ((((((var37 & '︀') >> 9 | var37 << 7) & 57344) >> 13 | ((var37 & '︀') >> 9 | var37 << 7) << 3) ^ 127 ^ 190) & 57344) >> 13
               | (((((var37 & '︀') >> 9 | var37 << 7) & 57344) >> 13 | ((var37 & '︀') >> 9 | var37 << 7) << 3) ^ 127 ^ 190) << 3
         );
         0<"JNT",1155399017,"ＯＥﾖ｟ＢＹＰｙﾖ","−Ȏ䈕Ȓ\ue20f","좗뾗풗뾗貗쪗뾗첗얗貗놗튗킗잗첗얗ꂗ펗잗쪗슗쎗킗",-1062811095>(
            var10002,
            var10001,
            (char)(
               ((((((var37 & '︀') >> 9 | var37 << 7) & 57344) >> 13 | ((var37 & '︀') >> 9 | var37 << 7) << 3) ^ 127 ^ 190) & 57344) >> 13
                  | (((((var37 & '︀') >> 9 | var37 << 7) & 57344) >> 13 | ((var37 & '︀') >> 9 | var37 << 7) << 3) ^ 127 ^ 190) << 3
            )
         );
      }

      Class_115 var5 = (Class_115)0<"JNT",-1781964596,"～ＡＤＡﾖｔ","−ꈎ戚ȑ\ue21bȑ숒ꈚȑ\ue21a숙숒䈏ꈛ戛Ț\ue21a숙䈔Ȏ成Ȓ\ue20f","욗쾗",-1062811099>(
         0<"JNT",1155399017,"ﾖＣｏﾖＰＡＤ［","−Ȓꈎ戚ȑ\ue21bȑ숒ꈚȑ\ue21a숙숒䈏ꈛ戛Ț\ue21a숙䈔","좗뾗풗뾗貗쪗뾗첗얗貗놗튗킗잗첗얗ꂗ펗잗쪗슗쎗킗",-1062811100>(var10002), 1, false
      );
      int var18 = (-1415281757 | 2043297026) ^ -68239453;

      for (var34 = (StringBuilder)0<"JNT",-1781964596,"～ＡＤＡﾖｔ","−ꈎ戚ȑ\ue21bȑ숒ꈚȑ\ue21a숙숒䈏ꈛ戛Ț\ue21a숙䈔Ȓ\ue20f","좗뾗풗뾗貗쪗뾗첗얗貗놗튗킗잗첗얗ꂗ펗잗쪗슗쎗킗",-1062811078>(
            "䮒斒禒ₒ璒梒憒璒ₒ撒澒斒玒ₒ璒梒斒ₒ排犒禒玒璒憒沒沒榒溒枒"
         );
         var18 < ((-1932971610 + (-1107571719 >> 981709722) | 12) & 50777119);
         var18 += 2106275726 >> 2106275726 ^ 128557
      ) {
         int var71 = (0<"JNT",1155399017,"＿ＢＹＰｙﾖ","−ȎȒ䈕","좗뾗풗뾗貗쪗뾗첗얗貗놗튗킗잗첗얗ꂗ펗잗쪗슗쎗킗",-1062811060>(var34, var18) ^ 189) - 30 ^ 17;
         int var99 = (var71 & 65472) >> 6;
         int var72 = (var71 & 65472) >> 6 | var71 << 10;
         int var100 = (((var71 & 65472) >> 6 | var71 << 10) & 65532) >> 2;
         char var73 = (char)(((var99 | var71 << 10) & 65532) >> 2 | ((var71 & 65472) >> 6 | var71 << 10) << 14);
         0<"JNT",1155399017,"ＯＥﾖ｟ＢＹＰｙﾖ","−Ȏ䈕Ȓ\ue20f","좗뾗풗뾗貗쪗뾗첗얗貗놗튗킗잗첗얗ꂗ펗잗쪗슗쎗킗",-1062811059>(var34, var18, (char)(var100 | var72 << 14));
      }

      this.field_2024 = 0<"JNT",1155399017,"＿Ｏ","−ꈎ戚ȑ\ue21bȑ숒ꈚȑ\ue21a숙숒䈏ꈛ戛Ț\ue21a숙䈔Ȓꈎ√ț䈔","욗쾗",-1062811074>(
         var5, 0<"JNT",1155399017,"ﾖＣｏﾖＰＡＤ［","−Ȓꈎ戚ȑ\ue21bȑ숒ꈚȑ\ue21a숙숒䈏ꈛ戛Ț\ue21a숙䈔","좗뾗풗뾗貗쪗뾗첗얗貗놗튗킗잗첗얗ꂗ펗잗쪗슗쎗킗",-1062811079>(var34)
      );
      var10001 = (-13053864 ^ -1481647189 | 0) & 71319552;

      for (var10002 = (StringBuilder)0<"JNT",-1781964596,"～ＡＤＡﾖｔ","−ꈎ戚ȑ\ue21bȑ숒ꈚȑ\ue21a숙숒䈏ꈛ戛Ț\ue21a숙䈔Ȓ\ue20f","좗뾗풗뾗貗쪗뾗첗얗貗놗튗킗잗첗얗ꂗ펗잗쪗슗쎗킗",-1062811105>(
            "ｭｄｩ｀ＰｩｪＰ\u0095ｷｬｬ"
         );
         var10001 < (1101415025 * -1970398327 ^ 1873377653);
         var10001 += (-960772334 >> 830263935 | 0) & 1
      ) {
         int var45 = 0<"JNT",1155399017,"＿ＢＹＰｙﾖ","−ȎȒ䈕","좗뾗풗뾗貗쪗뾗첗얗貗놗튗킗잗첗얗ꂗ펗잗쪗슗쎗킗",-1062811119>(var10002, var10001) ^ 152;
         char var46 = (char)(((var45 & 0) >> 16 | var45 << 0) + 235 ^ 4 ^ 183);
         0<"JNT",1155399017,"ＯＥﾖ｟ＢＹＰｙﾖ","−Ȏ䈕Ȓ\ue20f","좗뾗풗뾗貗쪗뾗첗얗貗놗튗킗잗첗얗ꂗ펗잗쪗슗쎗킗",-1062811114>(
            var10002, var10001, (char)(((var45 & 0) >> 16 | var45 << 0) + 235 ^ 4 ^ 183)
         );
      }

      Class_105 var8 = (Class_105)0<"JNT",-1781964596,"～ＡＤＡﾖｔ","−ꈎ戚ȑ\ue21bȑ숒ꈚȑ\ue21a숙숒䈏ꈛ戛Ț\ue21a숙䈔成Ȓ\ue20f","얗킗",-1062811112>(
         0<"JNT",1155399017,"ﾖＣｏﾖＰＡＤ［","−Ȓꈎ戚ȑ\ue21bȑ숒ꈚȑ\ue21a숙숒䈏ꈛ戛Ț\ue21a숙䈔","좗뾗풗뾗貗쪗뾗첗얗貗놗튗킗잗첗얗ꂗ펗잗쪗슗쎗킗",-1062811109>(var10002), false
      );
      int var22 = (-929100240 * -929100240 | 0) & 1459888214;

      for (var34 = (StringBuilder)0<"JNT",-1781964596,"～ＡＤＡﾖｔ","−ꈎ戚ȑ\ue21bȑ숒ꈚȑ\ue21a숙숒䈏ꈛ戛Ț\ue21a숙䈔Ȓ\ue20f","좗뾗풗뾗貗쪗뾗첗얗貗놗튗킗잗첗얗ꂗ펗잗쪗슗쎗킗",-1062811111>(
            "㿺뿴俳㿷\ueff4꿷\ufff3迴ῴ\ufff4\ueff4鿳濳꿷ῳ쿳꿷鿳꿷\ueff3\udff3鿳\ueff3꿷꿴濳鿳ῴ\udff3迴꿷ῳ\ufff4꿷俳\udff3鿳迴迳ῴ"
         );
         var22 < (-485798723 ^ -1888801800 - -1613589529 ^ 211014788);
         var22 += -2130956636 << 2143651867 ^ 536870913
      ) {
         char var77 = 0<"JNT",1155399017,"＿ＢＹＰｙﾖ","−ȎȒ䈕","좗뾗풗뾗貗쪗뾗첗얗貗놗튗킗잗첗얗ꂗ펗잗쪗슗쎗킗",-1062811070>(var34, var22);
         char var78 = (char)((((var77 & '\uf000') >> 12 | var77 << 4) + 192 - 112 ^ 75) + 159);
         0<"JNT",1155399017,"ＯＥﾖ｟ＢＹＰｙﾖ","−Ȏ䈕Ȓ\ue20f","좗뾗풗뾗貗쪗뾗첗얗貗놗튗킗잗첗얗ꂗ펗잗쪗슗쎗킗",-1062811069>(
            var34, var22, (char)((((var77 & '\uf000') >> 12 | var77 << 4) + 192 - 112 ^ 75) + 159)
         );
      }

      this.field_2025 = 0<"JNT",1155399017,"ＹﾕＦ","−ꈎ戚ȑ\ue21bȑ숒ꈚȑ\ue21a숙숒䈏ꈛ戛Ț\ue21a숙䈔Ȓꈎ숙戛䈔","얗킗",-1062811116>(
         var8, 0<"JNT",1155399017,"ﾖＣｏﾖＰＡＤ［","−Ȓꈎ戚ȑ\ue21bȑ숒ꈚȑ\ue21a숙숒䈏ꈛ戛Ț\ue21a숙䈔","좗뾗풗뾗貗쪗뾗첗얗貗놗튗킗잗첗얗ꂗ펗잗쪗슗쎗킗",-1062811113>(var34)
      );
      var10001 = -1428906364 * 764230192 ^ -1233411904;

      for (var10002 = (StringBuilder)0<"JNT",-1781964596,"～ＡＤＡﾖｔ","−ꈎ戚ȑ\ue21bȑ숒ꈚȑ\ue21a숙숒䈏ꈛ戛Ț\ue21a숙䈔Ȓ\ue20f","좗뾗풗뾗貗쪗뾗첗얗貗놗튗킗잗첗얗ꂗ펗잗쪗슗쎗킗",-1062811115>(
            "ÞŖŀńňƾĆňŖŀİ"
         );
         var10001 < ((1007890594 - (996373718 << 198408513) | 9) & 973154571);
         var10001 += -1546278854 * -1270801713 ^ -1416434969
      ) {
         int var51 = 0<"JNT",1155399017,"＿ＢＹＰｙﾖ","−ȎȒ䈕","좗뾗풗뾗貗쪗뾗첗얗貗놗튗킗잗첗얗ꂗ펗잗쪗슗쎗킗",-1062811108>(var10002, var10001) + 208;
         int var95 = (var51 & 65408) >> 7;
         int var52 = (var51 & 65408) >> 7 | var51 << 9;
         int var96 = (((var51 & 65408) >> 7 | var51 << 9) & 64512) >> 10;
         char var53 = (char)((((var95 | var51 << 9) & 64512) >> 10 | ((var51 & 65408) >> 7 | var51 << 9) << 6) - 215 ^ 80);
         0<"JNT",1155399017,"ＯＥﾖ｟ＢＹＰｙﾖ","−Ȏ䈕Ȓ\ue20f","좗뾗풗뾗貗쪗뾗첗얗貗놗튗킗잗첗얗ꂗ펗잗쪗슗쎗킗",-1062811107>(var10002, var10001, (char)((var96 | var52 << 6) - 215 ^ 80));
      }

      this.field_2026 = (Class_49)0<"JNT",-1781964596,"～ＡＤＡﾖｔ","−ꈎ戚ȑ\ue21bȑ숒ꈚȑ\ue21a숙숒䈏ꈛ戛Ț\ue21a숙䈔ꈍꈍꈍꈍȒ\ue20f","슗솗",-1062811117>(
         0<"JNT",1155399017,"ﾖＣｏﾖＰＡＤ［","−Ȓꈎ戚ȑ\ue21bȑ숒ꈚȑ\ue21a숙숒䈏ꈛ戛Ț\ue21a숙䈔","좗뾗풗뾗貗쪗뾗첗얗貗놗튗킗잗첗얗ꂗ펗잗쪗슗쎗킗",-1062811118>(var10002), 0.0, 20.0, 0.0, 1.0
      );
      var10001 = -794952260 - -794952260 ^ 0;

      for (var10002 = (StringBuilder)0<"JNT",-1781964596,"～ＡＤＡﾖｔ","−ꈎ戚ȑ\ue21bȑ숒ꈚȑ\ue21a숙숒䈏ꈛ戛Ț\ue21a숙䈔Ȓ\ue20f","좗뾗풗뾗貗쪗뾗첗얗貗놗튗킗잗첗얗ꂗ펗잗쪗슗쎗킗",-1062811120>(
            "ﾔﾠ뾝뾜㾟羌羕뾝羟뾜뾢"
         );
         var10001 < ((-431359351 - -1957379398 | 0) & 84461627);
         var10001 += -2026107900 ^ -628757662 ^ 1572464487
      ) {
         int var56 = 0<"JNT",1155399017,"＿ＢＹＰｙﾖ","−ȎȒ䈕","좗뾗풗뾗貗쪗뾗첗얗貗놗튗킗잗첗얗ꂗ펗잗쪗슗쎗킗",-1062811022>(var10002, var10001) + 25 - 113 + 169;
         char var57 = (char)(((var56 & 49152) >> 14 | var56 << 2) + 171);
         0<"JNT",1155399017,"ＯＥﾖ｟ＢＹＰｙﾖ","−Ȏ䈕Ȓ\ue20f","좗뾗풗뾗貗쪗뾗첗얗貗놗튗킗잗첗얗ꂗ펗잗쪗슗쎗킗",-1062811021>(
            var10002, var10001, (char)(((var56 & 49152) >> 14 | var56 << 2) + 171)
         );
      }

      this.field_2027 = (Class_49)0<"JNT",-1781964596,"～ＡＤＡﾖｔ","−ꈎ戚ȑ\ue21bȑ숒ꈚȑ\ue21a숙숒䈏ꈛ戛Ț\ue21a숙䈔ꈍꈍꈍꈍȒ\ue20f","슗솗",-1062811135>(
         0<"JNT",1155399017,"ﾖＣｏﾖＰＡＤ［","−Ȓꈎ戚ȑ\ue21bȑ숒ꈚȑ\ue21a숙숒䈏ꈛ戛Ț\ue21a숙䈔","좗뾗풗뾗貗쪗뾗첗얗貗놗튗킗잗첗얗ꂗ펗잗쪗슗쎗킗",-1062811072>(var10002), 0.0, 20.0, 0.0, 1.0
      );
      0<"JNT",1155399017,"Ｉﾕ","−䈐ꈎț舙舙䈔Ȓ\ue20f","쪗햗펗",-1062811110>(
         this,
         new Class_271[]{
            1<"JNT",-1604146937,"Ȁ글Ȁ","ė섙䄙","ꩿ\uabff롿쫿훾냿",174763390>(this),
            1<"JNT",-1604146937,"Ȁ가","ė섙䄙","ꩿ\uabff롿쩿흾냿",174763377>(this),
            1<"JNT",-1604146937,"쀀글","ė섙䄙","ꩿ\uabff롿챿쳿냿",174763388>(this),
            1<"JNT",-1604146937,"\udc00렀","ė섙䄙","ꩿ\uabff롿챿쳿냿",174763335>(this)
         }
      );
   }

   // $VF: renamed from: mg () void
   @Override
   public void method_1407() {
      0<"JNT",1155399017,"Ｄﾘ","−Ȓ\ue20f","쪗햗펗",-1062811024>(this);
      1<"JNT",-1687665313,"က먀","ė섙䄙","ꩿ\uabff썿",174763339>(this, false);
      0<"JNT",858717970,"Ｍ［","−Ȓ\ue20f","펗톗쒗",-1062811018>(this);
   }

   // $VF: renamed from: nz () void
   public void method_1747() {
      1<"JNT",-1687665313,"\udc00\u0a00","ė섙䄙","ꩿ\uabff믿",174763329>(this, 0);
      1<"JNT",-1687665313,"ꘀ됀","ė섙䄙","ꩿ\uabff믿",174763340>(this, 0);
   }

   // $VF: renamed from: gd (Class_207) void
   @Class_21
   public void method_1748(Class_207 var1) {
      int var2 = -1349285583;
      if (1<"JNT",-1604146937,"ꈀ가ꐀ똀ꘀ\ue000㷿退萀萀","脗䄕ę脧䄗䄖脗䄕섔脘䄔脕ę脧섔ė䄔섘섘섓섨䄨Ĩ","ꩿ\uabff롿쥿췿폾뛿짿쯿쥿췿쳿훾뿿쵿폾뛿쳿졿뿿푾푾컿둿듿닿냿",174763348>(
            1<"JNT",-1604146937,"똀먀","ė섙䄙","ꩿ\uabff롿쥿췿폾뛿짿쯿쥿췿쳿훾뿿쵿폾뛿쳿졿뿿푾푾컿듿럿뙿냿",174763337>(this)
         )
         == null) {
         var2 = 1583827991;

         while (true) {
            switch ((var2 ^ 890060914) - 1909631046 - 1159673962 - 1696415096 + 829644424 + 366041430) {
               case -1767922149:
                  if (0<"JNT",1155399017,"Ｙﾒ","−Ȓ成","얗킗",-1062810137>(1<"JNT",-1604146937,"Ȁ글Ȁ","ė섙䄙","ꩿ\uabff롿쫿훾냿",174763358>(this))
                     && 0<"JNT",896021534,"ﾫ｀","−Ȓ成","킗쾗",-1062810140>()) {
                     return;
                  }

                  var2 = -845915817;
                  break;
               case -891635658:
                  0<"JNT",1155399017,"ＮＩ","−Ȓ\ue20f","쪗햗펗",-1062811019>(this);
                  return;
               case 600748763:
               default:
                  0<"JNT",1155399017,"ﾫＡ","−Ȓ\ue20f","쪗햗펗",-1062811102>(this);
                  if (0<"JNT",1155399017,"ＭＥﾖＢＣＦＳｬ￩￩ｕ","−Ȓ成","첗쎗튗貗쮗잗첗쎗솗킗뾗쒗튗貗솗쪗뾗톗톗붗閗銗钗",-1062810143>(
                     1<"JNT",-1604146937,"ꈀ가ꐀ똀ꘀ\ue000㷿退㯿蘀","脗䄕ę脧䄗䄖脗䄕섔脘䄔脕ę脧섔ė䄔섘섘섓섨䄨Ĩ","ꩿ\uabff롿쥿췿폾뛿짿쯿쥿췿쳿훾뿿쵿폾뛿쳿졿뿿푾푾컿닿둿땿냿",174763344>(
                        1<"JNT",-1604146937,"똀먀","ė섙䄙","ꩿ\uabff롿쥿췿폾뛿짿쯿쥿췿쳿훾뿿쵿폾뛿쳿졿뿿푾푾컿듿럿뙿냿",174763429>(this)
                     )
                  )) {
                     return;
                  }

                  var2 = (-290695099 & -290695099 | 271689118) & 427015582;
                  break;
               case 1483904930:
                  if (!0<"JNT",1155399017,"ＭＯＧ","−Ȓ成","쪗햗펗",-1062811091>(this)) {
                     return;
                  }

                  var2 = (1506904775 >> (593500563 | -237427328) | 30659648) & 1037302981;
                  break;
               case 1611937256:
                  if (0<"JNT",1155399017,"ＭＥﾖＢＣＦＳｫｑ￪ｑ","−Ȓꈎ\ue21a舙ꈛ숒舚Ț\ue21a舙䈑戛ȑ\ue219ꈛ숒䈑ꈚȑ䈛䈛숐ȓ숓Ȕ戓䈔","첗쎗튗貗쮗잗첗쎗솗킗뾗쒗튗貗솗쪗뾗톗톗붗辗閗鞗鞗",-1062811127>(
                        0<"JNT",1155399017,"ＭＥﾖＢＣＦＳｬ￪ｖｫ","−Ȓꈎ\ue21a舙ꈛ숒舚Ț\ue21a舙䈑戛ȑ\ue219ꈛ숒䈑ꈚȑ䈛䈛숐ȓ숓ȔȔ䈔","첗쎗튗貗쮗잗첗쎗솗킗뾗쒗튗貗솗쪗뾗톗톗붗閗銗钗",-1062811128>(
                           1<"JNT",-1604146937,"ꈀ가ꐀ똀ꘀ\ue000㷿退㯿蘀","脗䄕ę脧䄗䄖脗䄕섔脘䄔脕ę脧섔ė䄔섘섘섓섨䄨Ĩ","ꩿ\uabff롿쥿췿폾뛿짿쯿쥿췿쳿훾뿿쵿폾뛿쳿졿뿿푾푾컿닿둿땿냿",174763357>(
                              1<"JNT",-1604146937,"똀먀","ė섙䄙","ꩿ\uabff롿쥿췿폾뛿짿쯿쥿췿쳿훾뿿쵿폾뛿쳿졿뿿푾푾컿듿럿뙿냿",174763338>(this)
                           )
                        )
                     )
                     != 1<"JNT",-2123525829,"ꈀ가ꐀ똀ꘀ\ue000踀蠀㿿㷿","脗䄕ę脧䄗䄖脗䄕섔脘䄔脕ę脧섔ė䄔섘섘섓䄨ĪĨ脨","ꩿ\uabff롿쥿췿폾뛿짿쯿쥿췿쳿훾뿿쵿폾뛿쳿졿뿿푾푾컿럿닿돿띿냿",174763350>()) {
                     return;
                  }

                  var2 = (618214116 * 358308232 | -1433922830) & -1095074050;
            }
         }
      }
   }

   // $VF: renamed from: wi () void
   public void method_1749() {
      int var1 = 10018818;
      if (1<"JNT",-1604146937,"\udc00\u0a00","ė섙䄙","ꩿ\uabff믿",174763352>(this) > 0) {
         1<"JNT",-1687665313,"\udc00\u0a00","ė섙䄙","ꩿ\uabff믿",174763430>(this, 1<"JNT",-1604146937,"\udc00\u0a00","ė섙䄙","ꩿ\uabff믿",174763427>(this) - 1);
      }

      var1 = -889730843;

      while (true) {
         switch (var1 - 994504596 + 1946687147 + 1658871619 + 197826897 - 611259188 - 1461141926) {
            case -1715370032:
               return;
            case -153250890:
         }

         if (1<"JNT",-1604146937,"ꘀ됀","ė섙䄙","ꩿ\uabff믿",174763431>(this) > 0) {
            1<"JNT",-1687665313,"ꘀ됀","ė섙䄙","ꩿ\uabff믿",174763437>(this, 1<"JNT",-1604146937,"ꘀ됀","ė섙䄙","ꩿ\uabff믿",174763354>(this) - 1);
         }

         var1 = (-827416297 | -827416297 >> -846846960) ^ -1843113152;
      }
   }

   // $VF: renamed from: msk () boolean
   public boolean method_1750() {
      int var1 = 0<"JNT",1155399017,"＼Ｂ","−ȒȎ","욗쾗",-1062810147>(1<"JNT",-1604146937,"Ȁ가","ė섙䄙","ꩿ\uabff롿쩿흾냿",174763428>(this));
      if (var1 != -1 && !0<"JNT",896021534,"Ｍ＿","−ȎȒ成","쪗삗",-1062810158>(var1)) {
         0<"JNT",1155399017,"Ｄﾘ","−Ȓ\ue20f","쪗햗펗",-1062810157>(this);
         1<"JNT",-1687665313,"က먀","ė섙䄙","ꩿ\uabff썿",174763424>(this, false);
         return false;
      } else {
         1<"JNT",-1687665313,"က먀","ė섙䄙","ꩿ\uabff썿",174763353>(this, true);
         return true;
      }
   }

   // $VF: renamed from: lq () void
   // $VF: Irreducible bytecode was duplicated to produce valid code
   public void method_1751() {
      int var4 = -420918397;
      if (1<"JNT",-1604146937,"ꈀ가ꐀ똀ꘀ\ue000㷿退舀萀","脗䄕ę脧䄗䄖脗䄕섔脘䄔脕ę脧섔ė䄔섘섘섓섨䄨Ĩ","ꩿ\uabff롿쥿췿폾뛿짿쯿쥿췿쳿훾뿿쵿폾뛿쳿졿뿿푾푾컿띿듿돿냿",174763438>(
         1<"JNT",-1604146937,"똀먀","ė섙䄙","ꩿ\uabff롿쥿췿폾뛿짿쯿쥿췿쳿훾뿿쵿폾뛿쳿졿뿿푾푾컿듿럿뙿냿",174763435>(this)
      ) instanceof class_3965 var1) {
         0<"JNT",1155399017,"＼｀＿","−ꈎ\ue21a舙ꈛ숒舚Ț\ue21a舙䈑戛ȑ\ue219ꈛ숒䈑ꈚȑ䈛䈛숐䈓Ȕ\ue213舓䈔Ȓ\ue20f","쪗햗펗",-1062810153>(this, var1);
         var4 = 500345545;
      } else {
         var4 = -696114761;
      }

      while (true) {
         switch ((var4 - 723057399 ^ 380369198) - 368370900 - 2138744023 - 1353819242 ^ 1233133473) {
            case -1641959816:
               if (1<"JNT",-1604146937,"ꈀ가ꐀ똀ꘀ\ue000㷿退舀萀","脗䄕ę脧䄗䄖脗䄕섔脘䄔脕ę脧섔ė䄔섘섘섓섨䄨Ĩ","ꩿ\uabff롿쥿췿폾뛿짿쯿쥿췿쳿훾뿿쵿폾뛿쳿졿뿿푾푾컿띿듿돿냿",174763447>(
                  1<"JNT",-1604146937,"똀먀","ė섙䄙","ꩿ\uabff롿쥿췿폾뛿짿쯿쥿췿쳿훾뿿쵿폾뛿쳿졿뿿푾푾컿듿럿뙿냿",174763436>(this)
               ) instanceof class_3966 var2) {
                  0<"JNT",1155399017,"Ｐﾘ","−ꈎ\ue21a舙ꈛ숒舚Ț\ue21a舙䈑戛ȑ\ue219ꈛ숒䈑ꈚȑ䈛䈛숐䈓Ȕ\ue213\ue213䈔Ȓ\ue20f","쪗햗펗",-1062810134>(this, var2);
               }

               var4 = 500345545;
               break;
            case -1267648698:
            default:
               return;
         }
      }
   }

   // $VF: renamed from: fbc (net.minecraft.class_3965) void
   public void method_1752(class_3965 var1) {
      int var4 = 350110065;
      if (0<"JNT",1155399017,"ＭＥﾖＢＣＦＳ￩ｫｫｒ\uffef","−Ȓꈎ\ue21a舙ꈛ숒舚Ț\ue21a舙䈑戛ȑ\ue219ꈛ숒䈑ꈚȑ䈛䈛숐戓䈓Ȕꈑ䈑ꈚȑ䈛䈛숐戓ꈓ∓䈔","첗쎗튗貗쮗잗첗쎗솗킗뾗쒗튗貗솗쪗뾗톗톗붗醗鞗钗鎗",-1062810136>(var1)
         == 1<"JNT",-2123525829,"ꈀ가ꐀ똀ꘀ\ue000㷿蠀蠀㯿","脗䄕ę脧䄗䄖脗䄕섔脘䄔脕ę脧섔ė䄔섘섘섓脨섨䄪ĥ섔ė䄔섘섘섓脨ĩĨ","ꩿ\uabff롿쥿췿폾뛿짿쯿쥿췿쳿훾뿿쵿폾뛿쳿졿뿿푾푾컿띿듿돿걿쳿졿뿿푾푾컿띿둿뙿냿",174763443>()) {
         var4 = -1220541647;

         while (true) {
            switch ((var4 + 1140494202 ^ 1062752812 ^ 189966118) - 547309506 ^ 1185985202 ^ 37917709) {
               case -362596000:
               default:
                  if (1<"JNT",-1604146937,"\udc00\u0a00","ė섙䄙","ꩿ\uabff믿",174763453>(this) > 0) {
                     return;
                  }

                  var4 = -47656469 & 2048670518 ^ 1697738734;
                  break;
               case 1886229813:
                  class_2338 var2 = 0<"JNT",1155399017,"ＭＥﾖＢＣＦＳ￩ｫｫｫｫ","−Ȓꈎ\ue21a舙ꈛ숒舚Ț\ue21a舙䈑戛ȑ\ue219ꈛ숒䈑ꈚȑ䈛䈛숐戓䈓䈓∔䈔","첗쎗튗貗쮗잗첗쎗솗킗뾗쒗튗貗솗쪗뾗톗톗붗醗鞗钗鎗",-1062811133>(
                     var1
                  );
                  if (!0<"JNT",896021534,"ﾘﾘ","−ꈎ\ue21a舙ꈛ숒舚Ț\ue21a舙䈑戛ȑ\ue219ꈛ숒䈑ꈚȑ䈛䈛숐戓䈓䈓∔䈔ꈎ\ue21a舙ꈛ숒舚Ț\ue21a舙䈑戛ȑ\ue219ꈛ숒䈑ꈚȑ䈛䈛숐戓戓ꈓ∔䈔Ȓ成","킗쾗",-1062810175>(
                        var2, 1<"JNT",-2123525829,"ꈀ가ꐀ똀ꘀ\ue000㷿㿿萀蘀㿿","脗䄕ę脧䄗䄖脗䄕섔脘䄔脕ę脧섔ė䄔섘섘섓脨脨ĩ脩","ꩿ\uabff롿쥿췿폾뛿짿쯿쥿췿쳿훾뿿쵿폾뛿쳿졿뿿푾푾컿띿띿둿뉿냿",174763440>()
                     )
                     && !0<"JNT",896021534,"ﾘﾘ","−ꈎ\ue21a舙ꈛ숒舚Ț\ue21a舙䈑戛ȑ\ue219ꈛ숒䈑ꈚȑ䈛䈛숐戓䈓䈓∔䈔ꈎ\ue21a舙ꈛ숒舚Ț\ue21a舙䈑戛ȑ\ue219ꈛ숒䈑ꈚȑ䈛䈛숐戓戓ꈓ∔䈔Ȓ成","킗쾗",-1062810169>(
                        var2, 1<"JNT",-2123525829,"ꈀ가ꐀ똀ꘀ\ue000谀谀踀退","脗䄕ę脧䄗䄖脗䄕섔脘䄔脕ę脧섔ė䄔섘섘섓脨脨ĩ脩","ꩿ\uabff롿쥿췿폾뛿짿쯿쥿췿쳿훾뿿쵿폾뛿쳿졿뿿푾푾컿띿띿둿뉿냿",174763454>()
                     )) {
                     var4 = -581343192;
                  } else {
                     var4 = -975093811 << -1554024445 ^ -147931872;
                  }
                  boolean var3 = switch ((var4 + 440400794 ^ 1790169232 ^ 234273610) - 379357293 + 126550364 ^ 1309104578) {
                     default -> true;
                     case -808593211 -> false;
                  };
                  if (var3 && 0<"JNT",1155399017,"ﾕＤ","−ꈎ\ue21a舙ꈛ숒舚Ț\ue21a舙䈑戛ȑ\ue219ꈛ숒䈑ꈚȑ䈛䈛숐戓䈓䈓∔䈔Ȓ成","쪗햗펗",-1062810130>(this, var2)) {
                     0<"JNT",896021534,"＿ﾑ","−ꈎ\ue21a舙ꈛ숒舚Ț\ue21a舙䈑戛ȑ\ue219ꈛ숒䈑ꈚȑ䈛䈛숐䈓Ȕ\ue213舓䈔成Ȓ\ue20f","킗쾗",-1062811121>(var1, true);
                     1<"JNT",-1687665313,"\udc00\u0a00","ė섙䄙","ꩿ\uabff믿",174763442>(
                        this, 0<"JNT",1155399017,"＼ﾘ［","−ȒȎ","슗솗",-1062811123>(1<"JNT",-1604146937,"쀀글","ė섙䄙","ꩿ\uabff롿챿쳿냿",174763444>(this))
                     );
                  }

                  return;
            }
         }
      }
   }

   // $VF: renamed from: rz (net.minecraft.class_3966) void
   public void method_1753(class_3966 var1) {
      if (1<"JNT",-1604146937,"ꘀ됀","ė섙䄙","ꩿ\uabff믿",174762635>(this) <= 0) {
         class_1297 var2 = 0<"JNT",1155399017,"ＭＥﾖＢＣＦＳ￩ｫｫｒ\ufff0","−Ȓꈎ\ue21a舙ꈛ숒舚Ț\ue21a舙䈑戛ȑ\ue219ꈛ숒䈑ꈚȑ䈛䈛숐ȓ戓Ȕ숓䈔","첗쎗튗貗쮗잗첗쎗솗킗뾗쒗튗貗솗쪗뾗톗톗붗醗鞗钗钗",-1062810576>(var1);
         if (var2 instanceof class_1511 || var2 instanceof class_1621) {
            0<"JNT",1155399017,"ＭＥﾖＢＣＦＳ\ufff0ｑ￩ｒ","−ꈎ\ue21a舙ꈛ숒舚Ț\ue21a舙䈑戛ȑ\ue219ꈛ숒䈑ꈚȑ䈛䈛숐ȓ\ue213舓숓䈔ꈎ\ue21a舙ꈛ숒舚Ț\ue21a舙䈑戛ȑ\ue219ꈛ숒䈑ꈚȑ䈛䈛숐ȓ戓Ȕ숓䈔Ȓ\ue20f","첗쎗튗貗쮗잗첗쎗솗킗뾗쒗튗貗솗쪗뾗톗톗붗钗醗钗",-1062810152>(
               1<"JNT",-1604146937,"ꈀ가ꐀ똀ꘀ\ue000㷿退舀㷿","脗䄕ę脧䄗䄖脗䄕섔脘䄔脕ę脧섔ė䄔섘섘섓섨䄨Ĩ","ꩿ\uabff롿쥿췿폾뛿짿쯿쥿췿쳿훾뿿쵿폾뛿쳿졿뿿푾푾컿땿듿땿냿",174763399>(
                  1<"JNT",-1604146937,"똀먀","ė섙䄙","ꩿ\uabff롿쥿췿폾뛿짿쯿쥿췿쳿훾뿿쵿폾뛿쳿졿뿿푾푾컿듿럿뙿냿",174763452>(this)
               ),
               1<"JNT",-1604146937,"ꈀ가ꐀ똀ꘀ\ue000㷿退㯿蘀","脗䄕ę脧䄗䄖脗䄕섔脘䄔脕ę脧섔ė䄔섘섘섓섨䄨Ĩ","ꩿ\uabff롿쥿췿폾뛿짿쯿쥿췿쳿훾뿿쵿폾뛿쳿졿뿿푾푾컿닿둿땿냿",174762125>(
                  1<"JNT",-1604146937,"똀먀","ė섙䄙","ꩿ\uabff롿쥿췿폾뛿짿쯿쥿췿쳿훾뿿쵿폾뛿쳿졿뿿푾푾컿듿럿뙿냿",174763450>(this)
               ),
               var2
            );
            0<"JNT",1155399017,"ＭＥﾖＢＣＦＳｬ￩￪ｖ","−ꈎ\ue21a舙ꈛ숒舚Ț\ue21a舙䈑戛ȑ\ue219ꈛ숒䈑ꈚȑ䈛䈛숐ȓ戓\ue213∔䈔Ȓ\ue20f","첗쎗튗貗쮗잗첗쎗솗킗뾗쒗튗貗솗쪗뾗톗톗붗閗銗钗",-1062810564>(
               1<"JNT",-1604146937,"ꈀ가ꐀ똀ꘀ\ue000㷿退㯿蘀","脗䄕ę脧䄗䄖脗䄕섔脘䄔脕ę脧섔ė䄔섘섘섓섨䄨Ĩ","ꩿ\uabff롿쥿췿폾뛿짿쯿쥿췿쳿훾뿿쵿폾뛿쳿졿뿿푾푾컿닿둿땿냿",174763398>(
                  1<"JNT",-1604146937,"똀먀","ė섙䄙","ꩿ\uabff롿쥿췿폾뛿짿쯿쥿췿쳿훾뿿쵿폾뛿쳿졿뿿푾푾컿듿럿뙿냿",174763395>(this)
               ),
               1<"JNT",-2123525829,"ꈀ가ꐀ똀ꘀ\ue000萀踀㿿踀","脗䄕ę脧䄗䄖脗䄕섔脘䄔脕ę脧섔ė䄔섘섘섓䄨脨脩Ī","ꩿ\uabff롿쥿췿폾뛿짿쯿쥿췿쳿훾뿿쵿폾뛿쳿졿뿿푾푾컿럿띿땿뉿냿",174763449>()
            );
            1<"JNT",-1687665313,"ꘀ됀","ė섙䄙","ꩿ\uabff믿",174762645>(
               this, 0<"JNT",1155399017,"＼ﾘ［","−ȒȎ","슗솗",-1062810574>(1<"JNT",-1604146937,"\udc00렀","ė섙䄙","ꩿ\uabff롿챿쳿냿",174762127>(this))
            );
         }
      }
   }

   // $VF: renamed from: lrl (Class_256) void
   @Class_21
   public void method_1754(Class_256 var1) {
      int var5 = 1682662647;
      if (0<"JNT",1155399017,"ＭＥﾖＢＣＦＳｫｑ￪ｑ","−Ȓꈎ\ue21a舙ꈛ숒舚Ț\ue21a舙䈑戛ȑ\ue219ꈛ숒䈑ꈚȑ䈛䈛숐ȓ숓Ȕ戓䈔","첗쎗튗貗쮗잗첗쎗솗킗뾗쒗튗貗솗쪗뾗톗톗붗辗閗鞗鞗",-1062810571>(
            0<"JNT",1155399017,"ＭＥﾖＢＣＦＳｬ￪ｖｫ","−Ȓꈎ\ue21a舙ꈛ숒舚Ț\ue21a舙䈑戛ȑ\ue219ꈛ숒䈑ꈚȑ䈛䈛숐ȓ숓ȔȔ䈔","첗쎗튗貗쮗잗첗쎗솗킗뾗쒗튗貗솗쪗뾗톗톗붗閗銗钗",-1062810572>(
               1<"JNT",-1604146937,"ꈀ가ꐀ똀ꘀ\ue000㷿退㯿蘀","脗䄕ę脧䄗䄖脗䄕섔脘䄔脕ę脧섔ė䄔섘섘섓섨䄨Ĩ","ꩿ\uabff롿쥿췿폾뛿짿쯿쥿췿쳿훾뿿쵿폾뛿쳿졿뿿푾푾컿닿둿땿냿",174762113>(
                  1<"JNT",-1604146937,"똀먀","ė섙䄙","ꩿ\uabff롿쥿췿폾뛿짿쯿쥿췿쳿훾뿿쵿폾뛿쳿졿뿿푾푾컿듿럿뙿냿",174762126>(this)
               )
            )
         )
         == 1<"JNT",-2123525829,"ꈀ가ꐀ똀ꘀ\ue000踀蠀㿿㷿","脗䄕ę脧䄗䄖脗䄕섔脘䄔脕ę脧섔ė䄔섘섘섓䄨ĪĨ脨","ꩿ\uabff롿쥿췿폾뛿짿쯿쥿췿쳿훾뿿쵿폾뛿쳿졿뿿푾푾컿럿닿돿띿냿",174762634>()) {
         if (1<"JNT",-1604146937,"ꈀ가ꐀ똀ꘀ\ue000㷿退舀萀","脗䄕ę脧䄗䄖脗䄕섔脘䄔脕ę脧섔ė䄔섘섘섓섨䄨Ĩ","ꩿ\uabff롿쥿췿폾뛿짿쯿쥿췿쳿훾뿿쵿폾뛿쳿졿뿿푾푾컿띿듿돿냿",174762643>(
            1<"JNT",-1604146937,"똀먀","ė섙䄙","ꩿ\uabff롿쥿췿폾뛿짿쯿쥿췿쳿훾뿿쵿폾뛿쳿졿뿿푾푾컿듿럿뙿냿",174762632>(this)
         ) instanceof class_3965 var2) {
            var5 = (-1168082087 >> -1168082087 | 768098344) & 771251246;

            while (true) {
               switch (var5 + 1186801679 + 506941758 - 825994930 + 1076129158 + 1345163148 + 459715361) {
                  case 225040122:
                     if (0<"JNT",1155399017,"ＭＥﾖＢＣＦＳ￩ｫｫｒ\uffef","−Ȓꈎ\ue21a舙ꈛ숒舚Ț\ue21a舙䈑戛ȑ\ue219ꈛ숒䈑ꈚȑ䈛䈛숐戓䈓Ȕꈑ䈑ꈚȑ䈛䈛숐戓ꈓ∓䈔","첗쎗튗貗쮗잗첗쎗솗킗뾗쒗튗貗솗쪗뾗톗톗붗醗鞗钗鎗",-1062810162>(
                           var2
                        )
                        != 1<"JNT",-2123525829,"ꈀ가ꐀ똀ꘀ\ue000㷿蠀蠀㯿","脗䄕ę脧䄗䄖脗䄕섔脘䄔脕ę脧섔ė䄔섘섘섓脨섨䄪ĥ섔ė䄔섘섘섓脨ĩĨ","ꩿ\uabff롿쥿췿폾뛿짿쯿쥿췿쳿훾뿿쵿폾뛿쳿졿뿿푾푾컿띿듿돿걿쳿졿뿿푾푾컿띿둿뙿냿",174762633>()) {
                        return;
                     }

                     var5 = 1702560563;
                     break;
                  case 1156349441:
                  default:
                     class_2338 var6 = 0<"JNT",1155399017,"ＭＥﾖＢＣＦＳ￩ｫｫｫｫ","−Ȓꈎ\ue21a舙ꈛ숒舚Ț\ue21a舙䈑戛ȑ\ue219ꈛ숒䈑ꈚȑ䈛䈛숐戓䈓䈓∔䈔","첗쎗튗貗쮗잗첗쎗솗킗뾗쒗튗貗솗쪗뾗톗톗붗醗鞗钗鎗",-1062810132>(
                        var2
                     );
                     if (!0<"JNT",896021534,"ﾘﾘ","−ꈎ\ue21a舙ꈛ숒舚Ț\ue21a舙䈑戛ȑ\ue219ꈛ숒䈑ꈚȑ䈛䈛숐戓䈓䈓∔䈔ꈎ\ue21a舙ꈛ숒舚Ț\ue21a舙䈑戛ȑ\ue219ꈛ숒䈑ꈚȑ䈛䈛숐戓戓ꈓ∔䈔Ȓ成","킗쾗",-1062810142>(
                           var6, 1<"JNT",-2123525829,"ꈀ가ꐀ똀ꘀ\ue000㷿㿿萀蘀㿿","脗䄕ę脧䄗䄖脗䄕섔脘䄔脕ę脧섔ė䄔섘섘섓脨脨ĩ脩","ꩿ\uabff롿쥿췿폾뛿짿쯿쥿췿쳿훾뿿쵿폾뛿쳿졿뿿푾푾컿띿띿둿뉿냿",174762655>()
                        )
                        && !0<"JNT",896021534,"ﾘﾘ","−ꈎ\ue21a舙ꈛ숒舚Ț\ue21a舙䈑戛ȑ\ue219ꈛ숒䈑ꈚȑ䈛䈛숐戓䈓䈓∔䈔ꈎ\ue21a舙ꈛ숒舚Ț\ue21a舙䈑戛ȑ\ue219ꈛ숒䈑ꈚȑ䈛䈛숐戓戓ꈓ∔䈔Ȓ成","킗쾗",-1062810144>(
                           var6, 1<"JNT",-2123525829,"ꈀ가ꐀ똀ꘀ\ue000谀谀踀退","脗䄕ę脧䄗䄖脗䄕섔脘䄔脕ę脧섔ė䄔섘섘섓脨脨ĩ脩","ꩿ\uabff롿쥿췿폾뛿짿쯿쥿췿쳿훾뿿쵿폾뛿쳿졿뿿푾푾컿띿띿둿뉿냿",174762725>()
                        )) {
                        var5 = 689901925;
                     } else {
                        var5 = -156985297 >>> -737573996 ^ -2072196809;
                     }
                     boolean var4 = switch ((var5 - 1068006831 + 1711638955 + 788056110 + 606846371 ^ 1597696587) - 1109070125) {
                        case -1149290420 -> false;
                        default -> true;
                     };
                     if (var4) {
                        0<"JNT",1155399017,"ＮＡ","−Ȓ\ue20f","캗좗펗",-1062810165>(var1);
                     }

                     return;
               }
            }
         }
      }
   }

   // $VF: renamed from: un (net.minecraft.class_2338) boolean
   public boolean method_1755(class_2338 var1) {
      class_2338 var2 = 0<"JNT",1155399017,"ＭＥﾖＢＣＦＳ￩￪￪ｒｖ","−Ȓꈎ\ue21a舙ꈛ숒舚Ț\ue21a舙䈑戛ȑ\ue219ꈛ숒䈑ꈚȑ䈛䈛숐戓䈓䈓∔䈔","첗쎗튗貗쮗잗첗쎗솗킗뾗쒗튗貗솗쪗뾗톗톗붗邗醗醗隗",-1062810183>(var1);
      if (!0<"JNT",1155399017,"ＭＥﾖＢＣＦＳ\ufff0\ufff0\uffefｖｫ","−ꈎ\ue21a舙ꈛ숒舚Ț\ue21a舙䈑戛ȑ\ue219ꈛ숒䈑ꈚȑ䈛䈛숐戓䈓䈓∔䈔Ȓ成","첗쎗튗貗쮗잗첗쎗솗킗뾗쒗튗貗솗쪗뾗톗톗붗钗醗隗",-1062810212>(
         1<"JNT",-1604146937,"ꈀ가ꐀ똀ꘀ\ue000㷿舀踀退","脗䄕ę脧䄗䄖脗䄕섔脘䄔脕ę脧섔ė䄔섘섘섓섨䄨Ĩ","ꩿ\uabff롿쥿췿폾뛿짿쯿쥿췿쳿훾뿿쵿폾뛿쳿졿뿿푾푾컿땿듿뉿냿",174762649>(
            1<"JNT",-1604146937,"똀먀","ė섙䄙","ꩿ\uabff롿쥿췿폾뛿짿쯿쥿췿쳿훾뿿쵿폾뛿쳿졿뿿푾푾컿듿럿뙿냿",174762726>(this)
         ),
         var2
      )) {
         return false;
      } else {
         double var3 = (double)0<"JNT",1155399017,"ＭＥﾖＢＣＦＳ￩￪\ufff0ｬ\uffef","−ȒȎ","첗쎗튗貗쮗잗첗쎗솗킗뾗쒗튗貗솗쪗뾗톗톗붗邗醗醗隗",-1062810207>(var2);
         double var5 = (double)0<"JNT",1155399017,"ＭＥﾖＢＣＦＳ￩￪\ufff0ｬｖ","−ȒȎ","첗쎗튗貗쮗잗첗쎗솗킗뾗쒗튗貗솗쪗뾗톗톗붗邗醗醗隗",-1062810202>(var2);
         double var7 = (double)0<"JNT",1155399017,"ＭＥﾖＢＣＦＳ￩￪\ufff0ｬ￪","−ȒȎ","첗쎗튗貗쮗잗첗쎗솗킗뾗쒗튗貗솗쪗뾗톗톗붗邗醗醗隗",-1062810201>(var2);
         double var9 = var3 + 1.0;
         double var11 = var5 + 2.0;
         double var13 = var7 + 1.0;
         class_238 var15 = (class_238)0<"JNT",-1781964596,"～ＡＤＡﾖｔ","−ꈍꈍꈍꈍꈍꈍȒ\ue20f","첗쎗튗貗쮗잗첗쎗솗킗뾗쒗튗貗솗쪗뾗톗톗붗邗醗隗",-1062810204>(var3, var5, var7, var9, var11, var13);
         List var16 = 0<"JNT",1155399017,"ＭＥﾖＢＣＦＳｒ\uffef\uffefｕ","−ꈎ\ue21a舙ꈛ숒舚Ț\ue21a舙䈑戛ȑ\ue219ꈛ숒䈑ꈚȑ䈛䈛숐ȓ戓Ȕ숓䈔ꈎ\ue21a舙ꈛ숒舚Ț\ue21a舙䈑戛ȑ\ue219ꈛ숒䈑ꈚȑ䈛䈛숐戓䈓∔䈔Ȓꈎ戚ȑ\ue21bȑ숒舛ꈛȚꈚ숒ꈎȚ䈛ꈛ䈔","첗쎗튗貗쮗잗첗쎗솗킗뾗쒗튗貗솗쪗뾗톗톗붗钗醗隗",-1062810181>(
            1<"JNT",-1604146937,"ꈀ가ꐀ똀ꘀ\ue000㷿舀踀退","脗䄕ę脧䄗䄖脗䄕섔脘䄔脕ę脧섔ė䄔섘섘섓섨䄨Ĩ","ꩿ\uabff롿쥿췿폾뛿짿쯿쥿췿쳿훾뿿쵿폾뛿쳿졿뿿푾푾컿땿듿뉿냿",174762650>(
               1<"JNT",-1604146937,"똀먀","ė섙䄙","ꩿ\uabff롿쥿췿폾뛿짿쯿쥿췿쳿훾뿿쵿폾뛿쳿졿뿿푾푾컿듿럿뙿냿",174762727>(this)
            ),
            null,
            var15
         );
         return 0<"JNT",1884131317,"ＡＯｅＭＪﾖﾑ","−Ȓ成","좗뾗풗뾗貗펗튗잗쪗貗ꪗ잗톗튗",-1062810184>(var16);
      }
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1413(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = (((var10 ^ 1941917987 ^ 1342670825) + 567996939 ^ 1373188910) + 1805145817 + 1689098125 ^ 395312414) - 453693930 + 1966458140;
      MethodHandle var10000 = field_2031[(((var10 ^ 1941917987 ^ 1342670825) + 567996939 ^ 1373188910) + 1805145817 + 1689098125 ^ 395312414)
         - 453693930
         + 1966458140
         + 1928018859];
      if (field_2031[var10001 + 1928018859] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = (-151893277 ^ -635987967 | 0) & -2097018876; var23 < var13.length(); var23 += -1298254660 & -1298254660 ^ -1298254659) {
            var13.setCharAt(var23, (char)(((var13.charAt(var23) - 227 - 77 + 254 + 145 ^ 71 ^ 77) + 126 ^ 67) - 52 ^ 126));
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = (1818237491 + 1094629202 | 0) & 6293538; var29 < var16.length(); var29 += (-1750186218 >> -813155236 | 0) & 1) {
            int var46 = var16.charAt(var29) - 222 - 108 - 182;
            int var10004 = (var46 & 57344) >> 13;
            int var47 = (((var46 & 57344) >> 13 | var46 << 3) - 153 - 156 + 9 ^ 33) + 228;
            int var68 = ((((var46 & 57344) >> 13 | var46 << 3) - 153 - 156 + 9 ^ 33) + 228 & 0) >> 16;
            char var48 = (char)(
               (((var10004 | var46 << 3) - 153 - 156 + 9 ^ 33) + 228 & 0) >> 16 | (((var46 & 57344) >> 13 | var46 << 3) - 153 - 156 + 9 ^ 33) + 228 << 0
            );
            var16.setCharAt(var29, (char)(var68 | var47 << 0));
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_191.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = (1238160847 & -175865217 | 0) & 577978672; var35 < var19.length(); var35 += (1940595806 & 1654554021 | 1) & -2061231879) {
            int var53 = ((var19.charAt(var35) ^ '(') - 156 + 33 ^ 59) + 130;
            int var69 = (var53 & 65534) >> 1;
            int var54 = (var53 & 65534) >> 1 | var53 << 15;
            int var70 = (((var53 & 65534) >> 1 | var53 << 15) & 65408) >> 7;
            char var55 = (char)((((var69 | var53 << 15) & 65408) >> 7 | ((var53 & 65534) >> 1 | var53 << 15) << 9) - 111 - 219 - 21);
            var19.setCharAt(var35, (char)((var70 | var54 << 9) - 111 - 219 - 21));
         }

         Class var7 = Class.forName(var19.toString(), false, Class_191.class.getClassLoader());
         switch (((var4 + 844805277 - 1052815892 - 942001361 + 1228762123 + 2011993738 - 1805840883 ^ 1475191953) + 514746343 ^ 1402629183) - 1093076666) {
            case 455475431:
               var10000 = var0.findConstructor(var7, var6);
               break;
            case 549789473:
               var10000 = var0.findSpecial(var7, var5, var6, Class_191.class);
               break;
            case 578823221:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            case 844241996:
            case 1705160768:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_2031[(((var10 ^ 1941917987 ^ 1342670825) + 567996939 ^ 1373188910) + 1805145817 + 1689098125 ^ 395312414) - 453693930 + 1966458140 + 1928018859] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1414(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = ((((var10 ^ 512900569) - 1523823956 ^ 259784828 ^ 411975298) - 1797987961 ^ 1077093242) + 561020513 ^ 1386104570) + 1978938341;
      MethodHandle var10000 = field_2031[((((var10 ^ 512900569) - 1523823956 ^ 259784828 ^ 411975298) - 1797987961 ^ 1077093242) + 561020513 ^ 1386104570)
         + 1978938341
         + 326412260];
      if (field_2031[var10001 + 326412260] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = -792392705 ^ 941957481 ^ -387962218; var24 < var14.length(); var24 += -1628530119 + -87871873 ^ -1716401991) {
            char var43 = var14.charAt(var24);
            int var10004 = (var43 & '\ue000') >> 13;
            int var44 = ((var43 & '\ue000') >> 13 | var43 << 3) ^ 220 ^ 60 ^ 228;
            int var84 = ((((var43 & '\ue000') >> 13 | var43 << 3) ^ 220 ^ 60 ^ 228) & 61440) >> 12;
            var43 = (char)(
               (
                     ((((var10004 | var43 << 3) ^ 220 ^ 60 ^ 228) & 61440) >> 12 | (((var43 & '\ue000') >> 13 | var43 << 3) ^ 220 ^ 60 ^ 228) << 4) + 159 - 208
                        ^ 253
                        ^ 238
                  )
                  + 115
            );
            var14.setCharAt(var24, (char)(((var84 | var44 << 4) + 159 - 208 ^ 253 ^ 238) + 115));
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = -653424970 + 1967421947 ^ 1313996977; var30 < var17.length(); var30 += 879539264 * -1816631083 ^ 363592001) {
            char var50 = var17.charAt(var30);
            char var55 = (char)(
               (
                        (
                              (
                                       (
                                             (
                                                      (
                                                            (
                                                                     (((var50 & '\uf800') >> 11 | var50 << 5) & 65472) >> 6
                                                                        | ((var50 & '\uf800') >> 11 | var50 << 5) << 10
                                                                  )
                                                                  - 248
                                                                  + 146
                                                               ^ 53
                                                               ^ 52
                                                               ^ 41
                                                         )
                                                         & 64512
                                                   )
                                                   >> 10
                                                | (
                                                      ((((var50 & '\uf800') >> 11 | var50 << 5) & 65472) >> 6 | ((var50 & '\uf800') >> 11 | var50 << 5) << 10)
                                                            - 248
                                                            + 146
                                                         ^ 53
                                                         ^ 52
                                                         ^ 41
                                                   )
                                                   << 6
                                          )
                                          & 65528
                                    )
                                    >> 3
                                 | (
                                       (
                                                (
                                                      ((((var50 & '\uf800') >> 11 | var50 << 5) & 65472) >> 6 | ((var50 & '\uf800') >> 11 | var50 << 5) << 10)
                                                            - 248
                                                            + 146
                                                         ^ 53
                                                         ^ 52
                                                         ^ 41
                                                   )
                                                   & 64512
                                             )
                                             >> 10
                                          | (
                                                ((((var50 & '\uf800') >> 11 | var50 << 5) & 65472) >> 6 | ((var50 & '\uf800') >> 11 | var50 << 5) << 10)
                                                      - 248
                                                      + 146
                                                   ^ 53
                                                   ^ 52
                                                   ^ 41
                                             )
                                             << 6
                                    )
                                    << 13
                           )
                           & 0
                     )
                     >> 16
                  | (
                        (
                                 (
                                       (
                                                (
                                                      ((((var50 & '\uf800') >> 11 | var50 << 5) & 65472) >> 6 | ((var50 & '\uf800') >> 11 | var50 << 5) << 10)
                                                            - 248
                                                            + 146
                                                         ^ 53
                                                         ^ 52
                                                         ^ 41
                                                   )
                                                   & 64512
                                             )
                                             >> 10
                                          | (
                                                ((((var50 & '\uf800') >> 11 | var50 << 5) & 65472) >> 6 | ((var50 & '\uf800') >> 11 | var50 << 5) << 10)
                                                      - 248
                                                      + 146
                                                   ^ 53
                                                   ^ 52
                                                   ^ 41
                                             )
                                             << 6
                                    )
                                    & 65528
                              )
                              >> 3
                           | (
                                 (
                                          (
                                                ((((var50 & '\uf800') >> 11 | var50 << 5) & 65472) >> 6 | ((var50 & '\uf800') >> 11 | var50 << 5) << 10)
                                                      - 248
                                                      + 146
                                                   ^ 53
                                                   ^ 52
                                                   ^ 41
                                             )
                                             & 64512
                                       )
                                       >> 10
                                    | (
                                          ((((var50 & '\uf800') >> 11 | var50 << 5) & 65472) >> 6 | ((var50 & '\uf800') >> 11 | var50 << 5) << 10) - 248 + 146
                                             ^ 53
                                             ^ 52
                                             ^ 41
                                       )
                                       << 6
                              )
                              << 13
                     )
                     << 0
            );
            var17.setCharAt(
               var30,
               (char)(
                  (
                           (
                                 (
                                          (
                                                (
                                                         (
                                                               (
                                                                        (((var50 & '\uf800') >> 11 | var50 << 5) & 65472) >> 6
                                                                           | ((var50 & '\uf800') >> 11 | var50 << 5) << 10
                                                                     )
                                                                     - 248
                                                                     + 146
                                                                  ^ 53
                                                                  ^ 52
                                                                  ^ 41
                                                            )
                                                            & 64512
                                                      )
                                                      >> 10
                                                   | (
                                                         (
                                                                  (((var50 & '\uf800') >> 11 | var50 << 5) & 65472) >> 6
                                                                     | ((var50 & '\uf800') >> 11 | var50 << 5) << 10
                                                               )
                                                               - 248
                                                               + 146
                                                            ^ 53
                                                            ^ 52
                                                            ^ 41
                                                      )
                                                      << 6
                                             )
                                             & 65528
                                       )
                                       >> 3
                                    | (
                                          (
                                                   (
                                                         (
                                                                  (((var50 & '\uf800') >> 11 | var50 << 5) & 65472) >> 6
                                                                     | ((var50 & '\uf800') >> 11 | var50 << 5) << 10
                                                               )
                                                               - 248
                                                               + 146
                                                            ^ 53
                                                            ^ 52
                                                            ^ 41
                                                      )
                                                      & 64512
                                                )
                                                >> 10
                                             | (
                                                   ((((var50 & '\uf800') >> 11 | var50 << 5) & 65472) >> 6 | ((var50 & '\uf800') >> 11 | var50 << 5) << 10)
                                                         - 248
                                                         + 146
                                                      ^ 53
                                                      ^ 52
                                                      ^ 41
                                                )
                                                << 6
                                       )
                                       << 13
                              )
                              & 0
                        )
                        >> 16
                     | (
                           (
                                    (
                                          (
                                                   (
                                                         (
                                                                  (((var50 & '\uf800') >> 11 | var50 << 5) & 65472) >> 6
                                                                     | ((var50 & '\uf800') >> 11 | var50 << 5) << 10
                                                               )
                                                               - 248
                                                               + 146
                                                            ^ 53
                                                            ^ 52
                                                            ^ 41
                                                      )
                                                      & 64512
                                                )
                                                >> 10
                                             | (
                                                   ((((var50 & '\uf800') >> 11 | var50 << 5) & 65472) >> 6 | ((var50 & '\uf800') >> 11 | var50 << 5) << 10)
                                                         - 248
                                                         + 146
                                                      ^ 53
                                                      ^ 52
                                                      ^ 41
                                                )
                                                << 6
                                       )
                                       & 65528
                                 )
                                 >> 3
                              | (
                                    (
                                             (
                                                   ((((var50 & '\uf800') >> 11 | var50 << 5) & 65472) >> 6 | ((var50 & '\uf800') >> 11 | var50 << 5) << 10)
                                                         - 248
                                                         + 146
                                                      ^ 53
                                                      ^ 52
                                                      ^ 41
                                                )
                                                & 64512
                                          )
                                          >> 10
                                       | (
                                             ((((var50 & '\uf800') >> 11 | var50 << 5) & 65472) >> 6 | ((var50 & '\uf800') >> 11 | var50 << 5) << 10)
                                                   - 248
                                                   + 146
                                                ^ 53
                                                ^ 52
                                                ^ 41
                                          )
                                          << 6
                                 )
                                 << 13
                        )
                        << 0
               )
            );
         }

         Class var6 = Class.forName(var17.toString(), false, Class_191.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = 531661777 - -40390335 ^ 572052112; var36 < var20.length(); var36 += (1027438030 << -1006107563 | 1) & 103808347) {
            int var60 = var20.charAt(var36);
            int var90 = (var60 & 65534) >> 1;
            int var61 = (var60 & 65534) >> 1 | var60 << 15;
            int var91 = (((var60 & 65534) >> 1 | var60 << 15) & 63488) >> 11;
            var60 = (((var90 | var60 << 15) & 63488) >> 11 | ((var60 & 65534) >> 1 | var60 << 15) << 5) + 83;
            var90 = ((var91 | var61 << 5) + 83 & 65534) >> 1;
            int var63 = ((((var91 | var61 << 5) + 83 & 65534) >> 1 | var60 << 15) ^ 38) - 4;
            int var93 = (((((var91 | var61 << 5) + 83 & 65534) >> 1 | var60 << 15) ^ 38) - 4 & 64512) >> 10;
            char var64 = (char)(
               (((((var90 | var60 << 15) ^ 38) - 4 & 64512) >> 10 | ((((var91 | var61 << 5) + 83 & 65534) >> 1 | var60 << 15) ^ 38) - 4 << 6) ^ 141)
                  - 140
                  + 251
            );
            var20.setCharAt(var36, (char)(((var93 | var63 << 6) ^ 141) - 140 + 251));
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_191.class.getClassLoader()).returnType();
         switch ((var4 + 427479525 - 853205910 + 1653173387 ^ 920467092) + 14271464 + 342357442 + 1206038127 + 694050483 - 1955225586 + 487353870) {
            case 22113173:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            case 240519773:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            case 726708073:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            case 1489676133:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_2031[((((var10 ^ 512900569) - 1523823956 ^ 259784828 ^ 411975298) - 1797987961 ^ 1077093242) + 561020513 ^ 1386104570) + 1978938341 + 326412260] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
