import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;

public class Class_31 extends Class_342 {
   // $VF: renamed from: zh Class_105
   public Class_105 field_2265;
   // $VF: renamed from: jqq Class_49
   public Class_49 field_2266;
   // $VF: renamed from: sxn Class_49
   public Class_49 field_2267;
   // $VF: renamed from: qif java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_2268 = new MethodHandle[65];

   public Class_31() {
      int var10001 = 713548335 & 713548335 ^ 713548335;

      StringBuilder var10002;
      for (var10002 = (StringBuilder)0<"JNT",-722148994,"ⶂ\u20c2✂\u20c2ᎂ⌂","̵ꜵ씵갵儵갵墨융갵뤵숵墨鸵뼵봵쐵뤵숵阵е넵","\uf563텣դ텣散\ued63텣敤北散襣\u0d64ᕤ\uf163敤北啣Ť\uf163\ued63쵣셣ᕤ",2077666707>(
            "ᵴἔἌỤᱬᷔẴỜẔ"
         );
         var10001 < ((-728160502 | -1429545619 | 8) & 137);
         var10001 += (99218783 & -409920501 | 0) & -1207639499
      ) {
         int var21 = 0<"JNT",871640874,"⑂₂⛂ Ểᎂ","̵ꐵе踵","\uf563텣դ텣散\ued63텣敤北散襣\u0d64ᕤ\uf163敤北啣Ť\uf163\ued63쵣셣ᕤ",2077666903>(var10002, var10001) + 20;
         char var24 = (char)(
            (((((var21 & 63488) >> 11 | var21 << 5) & 64512) >> 10 | ((var21 & 63488) >> 11 | var21 << 5) << 6) - 220 & 49152) >> 14
               | ((((var21 & 63488) >> 11 | var21 << 5) & 64512) >> 10 | ((var21 & 63488) >> 11 | var21 << 5) << 6) - 220 << 2
         );
         0<"JNT",871640874,"⁂⟂ᎂ᱂₂⛂ Ểᎂ","̵ꐵ踵е넵","\uf563텣դ텣散\ued63텣敤北散襣\u0d64ᕤ\uf163敤北啣Ť\uf163\ued63쵣셣ᕤ",2077666904>(
            var10002,
            var10001,
            (char)(
               (((((var21 & 63488) >> 11 | var21 << 5) & 64512) >> 10 | ((var21 & 63488) >> 11 | var21 << 5) << 6) - 220 & 49152) >> 14
                  | ((((var21 & 63488) >> 11 | var21 << 5) & 64512) >> 10 | ((var21 & 63488) >> 11 | var21 << 5) << 6) - 220 << 2
            )
         );
      }

      String var3 = 0<"JNT",871640874,"ᎂὂᡂᎂ \u20c2✂╂","̵еꜵ씵갵儵갵墨융갵뤵숵墨鸵뼵봵쐵뤵숵阵","\uf563텣դ텣散\ued63텣敤北散襣\u0d64ᕤ\uf163敤北啣Ť\uf163\ued63쵣셣ᕤ",2077666906>(var10002);
      int var13 = 1817515234 & 861046358 ^ 542114882;

      StringBuilder var26;
      for (var26 = (StringBuilder)0<"JNT",-722148994,"ⶂ\u20c2✂\u20c2ᎂ⌂","̵ꜵ씵갵儵갵墨융갵뤵숵墨鸵뼵봵쐵뤵숵阵е넵","\uf563텣դ텣散\ued63텣敤北散襣\u0d64ᕤ\uf163敤北啣Ť\uf163\ued63쵣셣ᕤ",2077666907>(
            "댷쐷뺷윷슷뼷鲷욷삷봷욷鲷봷슷슷쐷젷옷鲷쒷슷봷줷뼷얷옷鲷욷쐷鲷봷윷욷쐷쌷봷욷섷븷봷슷슷줷鲷쌷섷쎷뼷"
         );
         var13 < (-1347945456 >> -1881292513 ^ -49);
         var13 += 1286259454 & 2043101591 >>> (1286259454 >>> 2043101591) ^ 61
      ) {
         char var47 = 0<"JNT",871640874,"⑂₂⛂ Ểᎂ","̵ꐵе踵","\uf563텣դ텣散\ued63텣敤北散襣\u0d64ᕤ\uf163敤北啣Ť\uf163\ued63쵣셣ᕤ",2077666905>(var26, var13);
         int var10006 = (var47 & '￼') >> 2;
         int var48 = ((var47 & '￼') >> 2 | var47 << 14) + 146;
         int var69 = (((var47 & '￼') >> 2 | var47 << 14) + 146 & 65504) >> 5;
         var47 = (char)((((var10006 | var47 << 14) + 146 & 65504) >> 5 | ((var47 & '￼') >> 2 | var47 << 14) + 146 << 11) + 145 + 82);
         0<"JNT",871640874,"⁂⟂ᎂ᱂₂⛂ Ểᎂ","̵ꐵ踵е넵","\uf563텣դ텣散\ued63텣敤北散襣\u0d64ᕤ\uf163敤北啣Ť\uf163\ued63쵣셣ᕤ",2077666866>(
            var26, var13, (char)((var69 | var48 << 11) + 145 + 82)
         );
      }

      super(
         var3,
         0<"JNT",871640874,"ᎂὂᡂᎂ \u20c2✂╂","̵еꜵ씵갵儵갵墨융갵뤵숵墨鸵뼵봵쐵뤵숵阵","\uf563텣դ텣散\ued63텣敤北散襣\u0d64ᕤ\uf163敤北啣Ť\uf163\ued63쵣셣ᕤ",2077666911>(var26),
         -1,
         1<"JNT",-2022356218,"ˑˍʿ","\ue312蜒","﹨繨ﹶ纐ﺃ繯",1839891416>()
      );
      var10001 = (445208097 << -1636044023 | 0) & 1627527261;

      for (var10002 = (StringBuilder)0<"JNT",-722148994,"ⶂ\u20c2✂\u20c2ᎂ⌂","̵ꜵ씵갵儵갵墨융갵뤵숵墨鸵뼵봵쐵뤵숵阵е넵","\uf563텣դ텣散\ued63텣敤北散襣\u0d64ᕤ\uf163敤北啣Ť\uf163\ued63쵣셣ᕤ",2077666913>(
            "✥㢥㊥㚥ᄥⰥ㖥㎥㲥"
         );
         var10001 < ((1982275731 >> (990592381 << 660378625) | 1) & -714710679);
         var10001 += (1949804767 | -1205087964 | 0) & 4194817
      ) {
         int var29 = 0<"JNT",871640874,"⑂₂⛂ Ểᎂ","̵ꐵе踵","\uf563텣դ텣散\ued63텣敤北散襣\u0d64ᕤ\uf163敤北啣Ť\uf163\ued63쵣셣ᕤ",2077666917>(var10002, var10001)
            - 130
            + 0
            - 142
            - 21;
         char var30 = (char)((var29 & 65408) >> 7 | var29 << 9);
         0<"JNT",871640874,"⁂⟂ᎂ᱂₂⛂ Ểᎂ","̵ꐵ踵е넵","\uf563텣դ텣散\ued63텣敤北散襣\u0d64ᕤ\uf163敤北啣Ť\uf163\ued63쵣셣ᕤ",2077666894>(
            var10002, var10001, (char)((var29 & 65408) >> 7 | var29 << 9)
         );
      }

      this.field_2265 = (Class_105)0<"JNT",-722148994,"ⶂ\u20c2✂\u20c2ᎂ⌂","̵ꜵ씵갵儵갵墨융갵뤵숵墨鸵뼵봵쐵뤵숵阵딵е넵","北ᕤ",2077666909>(
         0<"JNT",871640874,"ᎂὂᡂᎂ \u20c2✂╂","̵еꜵ씵갵儵갵墨융갵뤵숵墨鸵뼵봵쐵뤵숵阵","\uf563텣դ텣散\ued63텣敤北散襣\u0d64ᕤ\uf163敤北啣Ť\uf163\ued63쵣셣ᕤ",2077666908>(var10002), true
      );
      var10001 = -1335947162 ^ -164149060 ^ 1181243610;

      for (var10002 = (StringBuilder)0<"JNT",-722148994,"ⶂ\u20c2✂\u20c2ᎂ⌂","̵ꜵ씵갵儵갵墨융갵뤵숵墨鸵뼵봵쐵뤵숵阵е넵","\uf563텣դ텣散\ued63텣敤北散襣\u0d64ᕤ\uf163敤北啣Ť\uf163\ued63쵣셣ᕤ",2077666918>(
            "좚邝\ue89d悝袝"
         );
         var10001 < 5;
         var10001 += 1
      ) {
         int var33 = 0<"JNT",871640874,"⑂₂⛂ Ểᎂ","̵ꐵе踵","\uf563텣դ텣散\ued63텣敤北散襣\u0d64ᕤ\uf163敤北啣Ť\uf163\ued63쵣셣ᕤ",2077666871>(var10002, var10001) ^ 153;
         int var63 = (var33 & 0) >> 16;
         int var34 = (var33 & 0) >> 16 | var33 << 0;
         int var64 = (((var33 & 0) >> 16 | var33 << 0) & 63488) >> 11;
         char var35 = (char)((((var63 | var33 << 0) & 63488) >> 11 | ((var33 & 0) >> 16 | var33 << 0) << 5) - 32 - 9);
         0<"JNT",871640874,"⁂⟂ᎂ᱂₂⛂ Ểᎂ","̵ꐵ踵е넵","\uf563텣դ텣散\ued63텣敤北散襣\u0d64ᕤ\uf163敤北啣Ť\uf163\ued63쵣셣ᕤ",2077666872>(
            var10002, var10001, (char)((var64 | var34 << 5) - 32 - 9)
         );
      }

      this.field_2266 = (Class_49)0<"JNT",-722148994,"ⶂ\u20c2✂\u20c2ᎂ⌂","̵ꜵ씵갵儵갵墨융갵뤵숵墨鸵뼵봵쐵뤵숵阵輵輵輵輵е넵","쵣쥣",2077666915>(
         0<"JNT",871640874,"ᎂὂᡂᎂ \u20c2✂╂","̵еꜵ씵갵儵갵墨융갵뤵숵墨鸵뼵봵쐵뤵숵阵","\uf563텣դ텣散\ued63텣敤北散襣\u0d64ᕤ\uf163敤北啣Ť\uf163\ued63쵣셣ᕤ",2077666914>(var10002),
         -180.0,
         180.0,
         0.0,
         0.1
      );
      var10001 = 581043149 >>> (1221554698 | 581043149) ^ 17732;

      for (var10002 = (StringBuilder)0<"JNT",-722148994,"ⶂ\u20c2✂\u20c2ᎂ⌂","̵ꜵ씵갵儵갵墨융갵뤵숵墨鸵뼵봵쐵뤵숵阵е넵","\uf563텣դ텣散\ued63텣敤北散襣\u0d64ᕤ\uf163敤北啣Ť\uf163\ued63쵣셣ᕤ",2077666916>(
            "욏윏졯"
         );
         var10001 < ((1187843440 - (1490096255 << 1187843440 + 1490096255) | 3) & 19948047);
         var10001 += 964191907 ^ (964191907 | 1562501207) ^ 1140949077
      ) {
         char var38 = 0<"JNT",871640874,"⑂₂⛂ Ểᎂ","̵ꐵе踵","\uf563텣դ텣散\ued63텣敤北散襣\u0d64ᕤ\uf163敤北啣Ť\uf163\ued63쵣셣ᕤ",2077666617>(var10002, var10001);
         int var65 = (var38 & 'ﾀ') >> 7;
         int var39 = ((var38 & 'ﾀ') >> 7 | var38 << '\t') + 126;
         int var66 = (((var38 & 'ﾀ') >> 7 | var38 << '\t') + 126 & 65528) >> 3;
         int var40 = ((var65 | var38 << '\t') + 126 & 65528) >> 3 | ((var38 & 'ﾀ') >> 7 | var38 << '\t') + 126 << 13;
         var65 = ((var66 | var39 << 13) & 32768) >> 15;
         int var41 = ((var66 | var39 << 13) & 32768) >> 15 | var40 << 1;
         int var68 = ((((var66 | var39 << 13) & 32768) >> 15 | var40 << 1) & 63488) >> 11;
         char var42 = (char)(((var65 | var40 << 1) & 63488) >> 11 | (((var66 | var39 << 13) & 32768) >> 15 | var40 << 1) << 5);
         0<"JNT",871640874,"⁂⟂ᎂ᱂₂⛂ Ểᎂ","̵ꐵ踵е넵","\uf563텣դ텣散\ued63텣敤北散襣\u0d64ᕤ\uf163敤北啣Ť\uf163\ued63쵣셣ᕤ",2077666706>(
            var10002, var10001, (char)(var68 | var41 << 5)
         );
      }

      this.field_2267 = (Class_49)0<"JNT",-722148994,"ⶂ\u20c2✂\u20c2ᎂ⌂","̵ꜵ씵갵儵갵墨융갵뤵숵墨鸵뼵봵쐵뤵숵阵輵輵輵輵е넵","쵣쥣",2077666709>(
         0<"JNT",871640874,"ᎂὂᡂᎂ \u20c2✂╂","̵еꜵ씵갵儵갵墨융갵뤵숵墨鸵뼵봵쐵뤵숵阵","\uf563텣դ텣散\ued63텣敤北散襣\u0d64ᕤ\uf163敤北啣Ť\uf163\ued63쵣셣ᕤ",2077666708>(var10002),
         -180.0,
         180.0,
         0.0,
         0.1
      );
      Class_49 var10000 = 1<"JNT",-1908582836,"˛ˍˍ","蜒쬒","﹨繨ﹶﺂ纃繯",1839891370>(this);
      Class_105 var10 = 1<"JNT",-1908582836,"ʻ˟","蜒쬒","﹨繨ﹶ纁ﺋ繯",1839891403>(this);
      0<"JNT",-221904746," ⟂⋂Ꮒ\u20c2 ⟂ἂὂ✂ἂᏂↂↂ","̵ꜵ씵갵儵갵墨융갵뤵숵墨騵괵씵쀵긵뼵阵еꜵ씵갵儵갵墨융갵뤵숵墨騵괵씵쀵긵뼵阵","\uf563텣դ텣散Ť\u0d64\uf163\ued63散饣핣\uf563셣쥣\u0d64।",2077666704>(var10);
      0<"JNT",871640874,"✂ሂ⁂","̵ꜵ씵갵儵갵墨倵뼵쐵융墨섵倵뤵긵뼵쐵먵뤵墨鸵倵묵묵융쐵쀵봵阵еꜵ밵쀵쀵阵","쵣쥣",2077666705>(var10000, var10::ax);
      var10000 = 1<"JNT",-1908582836,"ˉʿ˃","蜒쬒","﹨繨ﹶﺂ纃繯",1839891390>(this);
      Class_105 var11 = 1<"JNT",-1908582836,"ʻ˟","蜒쬒","﹨繨ﹶ纁ﺋ繯",1839891391>(this);
      0<"JNT",-221904746," ⟂⋂Ꮒ\u20c2 ⟂ἂὂ✂ἂᏂↂↂ","̵ꜵ씵갵儵갵墨융갵뤵숵墨騵괵씵쀵긵뼵阵еꜵ씵갵儵갵墨융갵뤵숵墨騵괵씵쀵긵뼵阵","\uf563텣դ텣散Ť\u0d64\uf163\ued63散饣핣\uf563셣쥣\u0d64।",2077666892>(var11);
      0<"JNT",871640874,"✂ሂ⁂","̵ꜵ씵갵儵갵墨倵뼵쐵융墨섵倵뤵긵뼵쐵먵뤵墨鸵倵묵묵융쐵쀵봵阵еꜵ밵쀵쀵阵","쵣쥣",2077666893>(var10000, var11::ax);
      0<"JNT",871640874,"⋂Ꮒ","̵똵ꜵ밵쀵쀵阵е넵","핣।",2077666889>(
         this,
         new Class_271[]{
            1<"JNT",-1908582836,"ʻ˟","蜒쬒","﹨繨ﹶ纁ﺋ繯",1839891394>(this),
            1<"JNT",-1908582836,"˛ˍˍ","蜒쬒","﹨繨ﹶﺂ纃繯",1839891395>(this),
            1<"JNT",-1908582836,"ˉʿ˃","蜒쬒","﹨繨ﹶﺂ纃繯",1839891392>(this)
         }
      );
   }

   // $VF: renamed from: mg () void
   @Override
   public void method_1407() {
      0<"JNT",-699354126,"⇂╂","̵е넵","Ť।앣",2077666867>(this);
   }

   // $VF: renamed from: q () void
   @Override
   public void method_1408() {
      if (1<"JNT",-1908582836,"˓˝˕ˇ˗ˡōıŋķ","뜒錒켒뜑댒ꌒ뜒錒謒윒茒霒켒뜑謒꼒茒쬒쬒笒쬑쌑뼑","﹨繨ﹶﺅ纂ﺊ繥纆纈ﺅ纂纃ﺋ纄ﺁﺊ繥纃ﺆ纄纋纋繽繩﹪﹩繯",1839891435>(
            1<"JNT",-1908582836,"ˇˋ","蜒쬒","﹨繨ﹶﺅ纂ﺊ繥纆纈ﺅ纂纃ﺋ纄ﺁﺊ繥纃ﺆ纄纋纋繽繫繬\ufe6c繯",1839889994>(this)
         )
         != null) {
         0<"JNT",-699354126,"⋂","̵е넵","Ť।앣",2077666868>(this);
         0<"JNT",-221904746," ℂሂ","̵딵딵е넵","ᕤᅤ",2077666869>(false, false);
      }
   }

   // $VF: renamed from: gd (Class_207) void
   @Class_21
   public void method_1901(Class_207 var1) {
      int var7 = 1882240927;
      Class_316 var2 = (Class_316)0<"JNT",871640874,"\u20c2⁂","̵ꜵ씵갵儵갵墨융갵뤵숵墨踵융갵븵븵阵еꜵ倵븵섵阵","敤쥣",2077667688>(
         (ConfigManager_221)1<"JNT",-1908582836,"˫ˉ","霒茒","﹨繨ﹶﺇ纄ﺉ纄繥ﺆ纄ﺅ纁繥繵ﺃﺇ纂纃ﺊ繯",1839891427>(
            (ScreenUI_78)1<"JNT",-2022356218,"˕ʵˍ","霒茒","﹨繨ﹶﺇ纄ﺉ纄繥ﺆ纄ﺅ纁繥繵ﺃﺇ纂纃ﺊ繯",1839891426>()
         ),
         Class_316.class
      );
      if (!0<"JNT",871640874,"⊂␂⇂","̵е딵","\u0d64앣㥤",2077667689>(var2) || !0<"JNT",871640874,"♂ሂ\u20c2","̵е딵","\u0d64앣㥤",2077667714>(var2)) {
         var7 = (719137771 << 719137771 | 529571255) & 531873279;

         while (true) {
            switch (((var7 - 936214205 ^ 1751450209) + 374867678 + 855755556 ^ 1151718194) - 871446481) {
               case 1324714159:
                  return;
               case 1751647710:
            }

            0<"JNT",-221904746," ℂሂ","̵딵딵е넵","ᕤᅤ",2077667715>(true, false);
            if (0<"JNT",871640874,"⛂ᲂ","̵е딵","北ᕤ",2077667717>(1<"JNT",-1908582836,"ʻ˟","蜒쬒","﹨繨ﹶ纁ﺋ繯",1839891412>(this))) {
               float var3 = 0<"JNT",871640874,"⇂⟂ᎂ₂ὂ➂ፂあ\u3102⎂⏂⎂","̵еꄵ","敤셣\u0d64散慤\uf163敤셣쥣ᕤ텣앣\u0d64散쥣\ued63텣।।\ud963㥣ൣգ",2077667712>(
                  1<"JNT",-1908582836,"˓˝˕ˇ˗ˡōıŋķ","뜒錒켒뜑댒ꌒ뜒錒謒윒茒霒켒뜑謒꼒茒쬒쬒笒쬑쌑뼑","﹨繨ﹶﺅ纂ﺊ繥纆纈ﺅ纂纃ﺋ纄ﺁﺊ繥纃ﺆ纄纋纋繽繩﹪﹩繯",1839891451>(
                     1<"JNT",-1908582836,"ˇˋ","蜒쬒","﹨繨ﹶﺅ纂ﺊ繥纆纈ﺅ纂纃ﺋ纄ﺁﺊ繥纃ﺆ纄纋纋繽繫繬\ufe6c繯",1839891418>(this)
                  )
               );
               float var4 = 0<"JNT",871640874,"⇂⟂ᎂ₂ὂ➂ፂあ\u3102⎂⏂⏂","̵еꄵ","敤셣\u0d64散慤\uf163敤셣쥣ᕤ텣앣\u0d64散쥣\ued63텣।।\ud963㥣ൣգ",2077667707>(
                  1<"JNT",-1908582836,"˓˝˕ˇ˗ˡōıŋķ","뜒錒켒뜑댒ꌒ뜒錒謒윒茒霒켒뜑謒꼒茒쬒쬒笒쬑쌑뼑","﹨繨ﹶﺅ纂ﺊ繥纆纈ﺅ纂纃ﺋ纄ﺁﺊ繥纃ﺆ纄纋纋繽繩﹪﹩繯",1839891438>(
                     1<"JNT",-1908582836,"ˇˋ","蜒쬒","﹨繨ﹶﺅ纂ﺊ繥纆纈ﺅ纂纃ﺋ纄ﺁﺊ繥纃ﺆ纄纋纋繽繫繬\ufe6c繯",1839891449>(this)
                  )
               );
               float var5 = 0<"JNT",871640874,"⛂ᎂ\u20c2","̵еꄵ","쵣쥣",2077667709>(1<"JNT",-1908582836,"ˉʿ˃","蜒쬒","﹨繨ﹶﺂ纃繯",1839891436>(this));
               float var6 = 0<"JNT",871640874,"⛂ᎂ\u20c2","̵еꄵ","쵣쥣",2077667703>(1<"JNT",-1908582836,"˛ˍˍ","蜒쬒","﹨繨ﹶﺂ纃繯",1839891442>(this));
               if (var3 != var5 || var4 != var6) {
                  0<"JNT",871640874,"⇂⟂ᎂ₂ὂ➂ፂあ\u3102⎂⏂\u3102","̵ꄵе넵","敤셣\u0d64散慤\uf163敤셣쥣ᕤ텣앣\u0d64散쥣\ued63텣।।\ud963㥣ൣգ",2077667690>(
                     1<"JNT",-1908582836,"˓˝˕ˇ˗ˡōıŋķ","뜒錒켒뜑댒ꌒ뜒錒謒윒茒霒켒뜑謒꼒茒쬒쬒笒쬑쌑뼑","﹨繨ﹶﺅ纂ﺊ繥纆纈ﺅ纂纃ﺋ纄ﺁﺊ繥纃ﺆ纄纋纋繽繩﹪﹩繯",1839891433>(
                        1<"JNT",-1908582836,"ˇˋ","蜒쬒","﹨繨ﹶﺅ纂ﺊ繥纆纈ﺅ纂纃ﺋ纄ﺁﺊ繥纃ﺆ纄纋纋繽繫繬\ufe6c繯",1839891432>(this)
                     ),
                     var5
                  );
                  0<"JNT",871640874,"⇂⟂ᎂ₂ὂ➂ፂあ\u3102⎂⏂ㅂ","̵ꄵе넵","敤셣\u0d64散慤\uf163敤셣쥣ᕤ텣앣\u0d64散쥣\ued63텣।।\ud963㥣ൣգ",2077667693>(
                     1<"JNT",-1908582836,"˓˝˕ˇ˗ˡōıŋķ","뜒錒켒뜑댒ꌒ뜒錒謒윒茒霒켒뜑謒꼒茒쬒쬒笒쬑쌑뼑","﹨繨ﹶﺅ纂ﺊ繥纆纈ﺅ纂纃ﺋ纄ﺁﺊ繥纃ﺆ纄纋纋繽繩﹪﹩繯",1839891420>(
                        1<"JNT",-1908582836,"ˇˋ","蜒쬒","﹨繨ﹶﺅ纂ﺊ繥纆纈ﺅ纂纃ﺋ纄ﺁﺊ繥纃ﺆ纄纋纋繽繫繬\ufe6c繯",1839891423>(this)
                     ),
                     var6
                  );
               }
            }

            var7 = (-1200882523 << -1200882523 | 1079001742) & -27663714;
         }
      }
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1413(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 - 2101407129 - 1718998798 ^ 1582886697) + 1375124934 ^ 1698118785) - 1689201725 - 1593572712 + 566413976 ^ 1939532324;
      MethodHandle var10000 = field_2268[(
            ((var10 - 2101407129 - 1718998798 ^ 1582886697) + 1375124934 ^ 1698118785) - 1689201725 - 1593572712 + 566413976 ^ 1939532324
         )
         + 1464306731];
      if (field_2268[var10001 + 1464306731] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = -1642184047 & -1642184047 ^ -1642184047; var23 < var13.length(); var23 += -948976001 + 214924084 ^ -734051918) {
            int var42 = (var13.charAt(var23) ^ 150) + 60;
            int var10004 = (var42 & 65528) >> 3;
            int var43 = (((var42 & 65528) >> 3 | var42 << 13) ^ 128) - 211 ^ 231;
            int var79 = (((((var42 & 65528) >> 3 | var42 << 13) ^ 128) - 211 ^ 231) & 65528) >> 3;
            char var44 = (char)(
               (((((var10004 | var42 << 13) ^ 128) - 211 ^ 231) & 65528) >> 3 | ((((var42 & 65528) >> 3 | var42 << 13) ^ 128) - 211 ^ 231) << 13) + 87 - 13
                  ^ 220
            );
            var13.setCharAt(var23, (char)((var79 | var43 << 13) + 87 - 13 ^ 220));
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = -1812804895 * 1292424196 ^ 1674936196; var29 < var16.length(); var29 += 1912876270 * (680111865 + 1912876270) ^ 1598694595) {
            char var49 = var16.charAt(var29);
            char var54 = (char)(
               (
                        (
                                 (
                                          (
                                                   (
                                                            (
                                                                  (
                                                                           ((((var49 & '쀀') >> 14 | var49 << 2) ^ 244) & 57344) >> 13
                                                                              | (((var49 & '쀀') >> 14 | var49 << 2) ^ 244) << 3
                                                                        )
                                                                        + 215
                                                                     ^ 137
                                                               )
                                                               & 65528
                                                         )
                                                         >> 3
                                                      | (
                                                            (
                                                                     ((((var49 & '쀀') >> 14 | var49 << 2) ^ 244) & 57344) >> 13
                                                                        | (((var49 & '쀀') >> 14 | var49 << 2) ^ 244) << 3
                                                                  )
                                                                  + 215
                                                               ^ 137
                                                         )
                                                         << 13
                                                )
                                                + 85
                                             & 65472
                                       )
                                       >> 6
                                    | (
                                             (
                                                      (
                                                            (
                                                                     ((((var49 & '쀀') >> 14 | var49 << 2) ^ 244) & 57344) >> 13
                                                                        | (((var49 & '쀀') >> 14 | var49 << 2) ^ 244) << 3
                                                                  )
                                                                  + 215
                                                               ^ 137
                                                         )
                                                         & 65528
                                                   )
                                                   >> 3
                                                | (
                                                      (
                                                               ((((var49 & '쀀') >> 14 | var49 << 2) ^ 244) & 57344) >> 13
                                                                  | (((var49 & '쀀') >> 14 | var49 << 2) ^ 244) << 3
                                                            )
                                                            + 215
                                                         ^ 137
                                                   )
                                                   << 13
                                          )
                                          + 85
                                       << 10
                              )
                              - 178
                           & 65520
                     )
                     >> 4
                  | (
                           (
                                    (
                                             (
                                                      (
                                                            (
                                                                     ((((var49 & '쀀') >> 14 | var49 << 2) ^ 244) & 57344) >> 13
                                                                        | (((var49 & '쀀') >> 14 | var49 << 2) ^ 244) << 3
                                                                  )
                                                                  + 215
                                                               ^ 137
                                                         )
                                                         & 65528
                                                   )
                                                   >> 3
                                                | (
                                                      (
                                                               ((((var49 & '쀀') >> 14 | var49 << 2) ^ 244) & 57344) >> 13
                                                                  | (((var49 & '쀀') >> 14 | var49 << 2) ^ 244) << 3
                                                            )
                                                            + 215
                                                         ^ 137
                                                   )
                                                   << 13
                                          )
                                          + 85
                                       & 65472
                                 )
                                 >> 6
                              | (
                                       (
                                                (
                                                      (
                                                               ((((var49 & '쀀') >> 14 | var49 << 2) ^ 244) & 57344) >> 13
                                                                  | (((var49 & '쀀') >> 14 | var49 << 2) ^ 244) << 3
                                                            )
                                                            + 215
                                                         ^ 137
                                                   )
                                                   & 65528
                                             )
                                             >> 3
                                          | (
                                                (((((var49 & '쀀') >> 14 | var49 << 2) ^ 244) & 57344) >> 13 | (((var49 & '쀀') >> 14 | var49 << 2) ^ 244) << 3)
                                                      + 215
                                                   ^ 137
                                             )
                                             << 13
                                    )
                                    + 85
                                 << 10
                        )
                        - 178
                     << 12
            );
            var16.setCharAt(
               var29,
               (char)(
                  (
                           (
                                    (
                                             (
                                                      (
                                                               (
                                                                     (
                                                                              ((((var49 & '쀀') >> 14 | var49 << 2) ^ 244) & 57344) >> 13
                                                                                 | (((var49 & '쀀') >> 14 | var49 << 2) ^ 244) << 3
                                                                           )
                                                                           + 215
                                                                        ^ 137
                                                                  )
                                                                  & 65528
                                                            )
                                                            >> 3
                                                         | (
                                                               (
                                                                        ((((var49 & '쀀') >> 14 | var49 << 2) ^ 244) & 57344) >> 13
                                                                           | (((var49 & '쀀') >> 14 | var49 << 2) ^ 244) << 3
                                                                     )
                                                                     + 215
                                                                  ^ 137
                                                            )
                                                            << 13
                                                   )
                                                   + 85
                                                & 65472
                                          )
                                          >> 6
                                       | (
                                                (
                                                         (
                                                               (
                                                                        ((((var49 & '쀀') >> 14 | var49 << 2) ^ 244) & 57344) >> 13
                                                                           | (((var49 & '쀀') >> 14 | var49 << 2) ^ 244) << 3
                                                                     )
                                                                     + 215
                                                                  ^ 137
                                                            )
                                                            & 65528
                                                      )
                                                      >> 3
                                                   | (
                                                         (
                                                                  ((((var49 & '쀀') >> 14 | var49 << 2) ^ 244) & 57344) >> 13
                                                                     | (((var49 & '쀀') >> 14 | var49 << 2) ^ 244) << 3
                                                               )
                                                               + 215
                                                            ^ 137
                                                      )
                                                      << 13
                                             )
                                             + 85
                                          << 10
                                 )
                                 - 178
                              & 65520
                        )
                        >> 4
                     | (
                              (
                                       (
                                                (
                                                         (
                                                               (
                                                                        ((((var49 & '쀀') >> 14 | var49 << 2) ^ 244) & 57344) >> 13
                                                                           | (((var49 & '쀀') >> 14 | var49 << 2) ^ 244) << 3
                                                                     )
                                                                     + 215
                                                                  ^ 137
                                                            )
                                                            & 65528
                                                      )
                                                      >> 3
                                                   | (
                                                         (
                                                                  ((((var49 & '쀀') >> 14 | var49 << 2) ^ 244) & 57344) >> 13
                                                                     | (((var49 & '쀀') >> 14 | var49 << 2) ^ 244) << 3
                                                               )
                                                               + 215
                                                            ^ 137
                                                      )
                                                      << 13
                                             )
                                             + 85
                                          & 65472
                                    )
                                    >> 6
                                 | (
                                          (
                                                   (
                                                         (
                                                                  ((((var49 & '쀀') >> 14 | var49 << 2) ^ 244) & 57344) >> 13
                                                                     | (((var49 & '쀀') >> 14 | var49 << 2) ^ 244) << 3
                                                               )
                                                               + 215
                                                            ^ 137
                                                      )
                                                      & 65528
                                                )
                                                >> 3
                                             | (
                                                   (
                                                            ((((var49 & '쀀') >> 14 | var49 << 2) ^ 244) & 57344) >> 13
                                                               | (((var49 & '쀀') >> 14 | var49 << 2) ^ 244) << 3
                                                         )
                                                         + 215
                                                      ^ 137
                                                )
                                                << 13
                                       )
                                       + 85
                                    << 10
                           )
                           - 178
                        << 12
               )
            );
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_31.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = (1282098990 >> -709573817 | 0) & -2027806624; var35 < var19.length(); var35 += 578177538 ^ -233758537 - 1568934784 ^ -1225040076) {
            int var59 = var19.charAt(var35) - '@' - 98;
            int var85 = (var59 & 65472) >> 6;
            int var60 = ((((var59 & 65472) >> 6 | var59 << 10) ^ 154) - 112 - 224 - 217 ^ 249) + 199;
            int var86 = (((((var59 & 65472) >> 6 | var59 << 10) ^ 154) - 112 - 224 - 217 ^ 249) + 199 & 65520) >> 4;
            char var61 = (char)(
               ((((var85 | var59 << 10) ^ 154) - 112 - 224 - 217 ^ 249) + 199 & 65520) >> 4
                  | ((((var59 & 65472) >> 6 | var59 << 10) ^ 154) - 112 - 224 - 217 ^ 249) + 199 << 12
            );
            var19.setCharAt(var35, (char)(var86 | var60 << 12));
         }

         Class var7 = Class.forName(var19.toString(), false, Class_31.class.getClassLoader());
         switch (((var4 - 1410513637 ^ 763180534 ^ 1269241890) + 1071775793 - 278975799 ^ 616836480) - 820013253 - 1655613045 - 840913295 ^ 1747370848) {
            case 51950314:
               var10000 = var0.findSpecial(var7, var5, var6, Class_31.class);
               break;
            case 69761438:
               var10000 = var0.findConstructor(var7, var6);
               break;
            case 454125917:
            case 1865190178:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 1441176950:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_2268[(((var10 - 2101407129 - 1718998798 ^ 1582886697) + 1375124934 ^ 1698118785) - 1689201725 - 1593572712 + 566413976 ^ 1939532324) + 1464306731] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1414(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 + 593525492 ^ 2071328058) + 471618327 + 1732424429 + 1499671159 ^ 322084405) + 1622699864 ^ 308719849 ^ 1454645949;
      MethodHandle var10000 = field_2268[((var10 + 593525492 ^ 2071328058) + 471618327 + 1732424429 + 1499671159 ^ 322084405) + 1622699864
         ^ 308719849
         ^ 1454645949
         ^ 1912505297];
      if (field_2268[var10001 ^ 1912505297] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = -1804690013 ^ 2115128103 ^ -360917372; var24 < var14.length(); var24 += -2034861594 << -1719908013 ^ -818937855) {
            int var43 = (var14.charAt(var24) ^ '8' ^ 206) - 38 + 215;
            int var10004 = (var43 & 65535) >> 0;
            int var44 = ((var43 & 65535) >> 0 | var43 << 16) - 116;
            int var84 = (((var43 & 65535) >> 0 | var43 << 16) - 116 & 64512) >> 10;
            var43 = ((var10004 | var43 << 16) - 116 & 64512) >> 10 | ((var43 & 65535) >> 0 | var43 << 16) - 116 << 6;
            var10004 = ((var84 | var44 << 6) & 65408) >> 7;
            int var46 = ((var84 | var44 << 6) & 65408) >> 7 | var43 << 9;
            int var86 = ((((var84 | var44 << 6) & 65408) >> 7 | var43 << 9) & 65535) >> 0;
            char var47 = (char)((((var10004 | var43 << 9) & 65535) >> 0 | (((var84 | var44 << 6) & 65408) >> 7 | var43 << 9) << 16) - 203);
            var14.setCharAt(var24, (char)((var86 | var46 << 16) - 203));
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = 1005851014 & 1005851014 ^ 1005851014; var30 < var17.length(); var30 += 1647944796 ^ 2138406206 ^ 491575651) {
            int var52 = var17.charAt(var30) - 224 - 225;
            char var57 = (char)(
               (
                        (
                                 (
                                          (
                                                (
                                                         (
                                                               (
                                                                        (((var52 & 65534) >> 1 | var52 << 15) & 65534) >> 1
                                                                           | ((var52 & 65534) >> 1 | var52 << 15) << 15
                                                                     )
                                                                     + 135
                                                                  ^ 143
                                                            )
                                                            & 63488
                                                      )
                                                      >> 11
                                                   | (
                                                         ((((var52 & 65534) >> 1 | var52 << 15) & 65534) >> 1 | ((var52 & 65534) >> 1 | var52 << 15) << 15)
                                                               + 135
                                                            ^ 143
                                                      )
                                                      << 5
                                             )
                                             & 65408
                                       )
                                       >> 7
                                    | (
                                          (
                                                   (
                                                         ((((var52 & 65534) >> 1 | var52 << 15) & 65534) >> 1 | ((var52 & 65534) >> 1 | var52 << 15) << 15)
                                                               + 135
                                                            ^ 143
                                                      )
                                                      & 63488
                                                )
                                                >> 11
                                             | (((((var52 & 65534) >> 1 | var52 << 15) & 65534) >> 1 | ((var52 & 65534) >> 1 | var52 << 15) << 15) + 135 ^ 143)
                                                << 5
                                       )
                                       << 9
                              )
                              + 43
                           & 65472
                     )
                     >> 6
                  | (
                           (
                                    (
                                          (
                                                   (
                                                         ((((var52 & 65534) >> 1 | var52 << 15) & 65534) >> 1 | ((var52 & 65534) >> 1 | var52 << 15) << 15)
                                                               + 135
                                                            ^ 143
                                                      )
                                                      & 63488
                                                )
                                                >> 11
                                             | (((((var52 & 65534) >> 1 | var52 << 15) & 65534) >> 1 | ((var52 & 65534) >> 1 | var52 << 15) << 15) + 135 ^ 143)
                                                << 5
                                       )
                                       & 65408
                                 )
                                 >> 7
                              | (
                                    ((((((var52 & 65534) >> 1 | var52 << 15) & 65534) >> 1 | ((var52 & 65534) >> 1 | var52 << 15) << 15) + 135 ^ 143) & 63488)
                                          >> 11
                                       | (((((var52 & 65534) >> 1 | var52 << 15) & 65534) >> 1 | ((var52 & 65534) >> 1 | var52 << 15) << 15) + 135 ^ 143) << 5
                                 )
                                 << 9
                        )
                        + 43
                     << 10
            );
            var17.setCharAt(
               var30,
               (char)(
                  (
                           (
                                    (
                                             (
                                                   (
                                                            (
                                                                  (
                                                                           (((var52 & 65534) >> 1 | var52 << 15) & 65534) >> 1
                                                                              | ((var52 & 65534) >> 1 | var52 << 15) << 15
                                                                        )
                                                                        + 135
                                                                     ^ 143
                                                               )
                                                               & 63488
                                                         )
                                                         >> 11
                                                      | (
                                                            ((((var52 & 65534) >> 1 | var52 << 15) & 65534) >> 1 | ((var52 & 65534) >> 1 | var52 << 15) << 15)
                                                                  + 135
                                                               ^ 143
                                                         )
                                                         << 5
                                                )
                                                & 65408
                                          )
                                          >> 7
                                       | (
                                             (
                                                      (
                                                            ((((var52 & 65534) >> 1 | var52 << 15) & 65534) >> 1 | ((var52 & 65534) >> 1 | var52 << 15) << 15)
                                                                  + 135
                                                               ^ 143
                                                         )
                                                         & 63488
                                                   )
                                                   >> 11
                                                | (
                                                      ((((var52 & 65534) >> 1 | var52 << 15) & 65534) >> 1 | ((var52 & 65534) >> 1 | var52 << 15) << 15) + 135
                                                         ^ 143
                                                   )
                                                   << 5
                                          )
                                          << 9
                                 )
                                 + 43
                              & 65472
                        )
                        >> 6
                     | (
                              (
                                       (
                                             (
                                                      (
                                                            ((((var52 & 65534) >> 1 | var52 << 15) & 65534) >> 1 | ((var52 & 65534) >> 1 | var52 << 15) << 15)
                                                                  + 135
                                                               ^ 143
                                                         )
                                                         & 63488
                                                   )
                                                   >> 11
                                                | (
                                                      ((((var52 & 65534) >> 1 | var52 << 15) & 65534) >> 1 | ((var52 & 65534) >> 1 | var52 << 15) << 15) + 135
                                                         ^ 143
                                                   )
                                                   << 5
                                          )
                                          & 65408
                                    )
                                    >> 7
                                 | (
                                       (
                                                (((((var52 & 65534) >> 1 | var52 << 15) & 65534) >> 1 | ((var52 & 65534) >> 1 | var52 << 15) << 15) + 135 ^ 143)
                                                   & 63488
                                             )
                                             >> 11
                                          | (((((var52 & 65534) >> 1 | var52 << 15) & 65534) >> 1 | ((var52 & 65534) >> 1 | var52 << 15) << 15) + 135 ^ 143)
                                             << 5
                                    )
                                    << 9
                           )
                           + 43
                        << 10
               )
            );
         }

         Class var6 = Class.forName(var17.toString(), false, Class_31.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = 1442465600 >> -752386320 ^ 22010; var36 < var20.length(); var36 += (-1748746777 | -1075266515 | 1) & 1074807313) {
            int var62 = var20.charAt(var36) + 141 - 8 + 145 - 8;
            int var92 = (var62 & 61440) >> 12;
            int var63 = (var62 & 61440) >> 12 | var62 << 4;
            int var93 = (((var62 & 61440) >> 12 | var62 << 4) & 65528) >> 3;
            char var64 = (char)((((var92 | var62 << 4) & 65528) >> 3 | ((var62 & 61440) >> 12 | var62 << 4) << 13) + 59 + 198 + 193 ^ 135);
            var20.setCharAt(var36, (char)((var93 | var63 << 13) + 59 + 198 + 193 ^ 135));
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_31.class.getClassLoader()).returnType();
         switch ((((var4 ^ 24949823) - 264404234 - 221216072 ^ 1017116509) - 2000874365 ^ 346242102) + 1506859828 + 1881891044 - 1869440163 + 368824662) {
            case 730130757:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            case 867743892:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            case 997252310:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            case 1146237344:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_2268[((var10 + 593525492 ^ 2071328058) + 471618327 + 1732424429 + 1499671159 ^ 322084405) + 1622699864 ^ 308719849 ^ 1454645949 ^ 1912505297] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
