import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;
import java.util.function.Predicate;
import net.minecraft.class_1269;
import net.minecraft.class_1792;
import net.minecraft.class_1799;

public class Class_241 extends Class_342 {
   // $VF: renamed from: rd Class_115
   public Class_115 field_1900;
   // $VF: renamed from: wb Class_49
   public Class_49 field_1901;
   // $VF: renamed from: ks Class_105
   public Class_105 field_1902;
   // $VF: renamed from: oht Class_49
   public Class_49 field_1903;
   // $VF: renamed from: oau Class_105
   public Class_105 field_1904;
   // $VF: renamed from: wr boolean
   public boolean field_1905;
   // $VF: renamed from: xbr boolean
   public boolean field_1906;
   // $VF: renamed from: yaj int
   public int field_1907;
   // $VF: renamed from: wdn int
   public int field_1908;
   // $VF: renamed from: dl int
   public int field_1909;
   // $VF: renamed from: fd int
   public int field_1910;
   // $VF: renamed from: tfa net.minecraft.class_1799
   public class_1799 field_1911;
   // $VF: renamed from: kcv java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_1912 = new MethodHandle[133];

   public Class_241() {
      int var10001 = -706935572 * -527017279 ^ 1369681388;

      StringBuilder var10002;
      for (var10002 = (StringBuilder)0<"JNT",1590662855,"홁퓩퐱퓩퐁햱","䋷烷揷晷混晷䅷惷晷懷敷䅷罷泷濷扷懷敷䭷䉷緷","\uea51\ue151\uf651\ue151깑\uec51\ue151\uee51\ue751깑퍑\uf451\uf251\ue951\uee51\ue751쉑\uf551\ue951\uec51\ue451\ue551\uf251",-664143664>(
            "*UC耰,[聙聖耰&联W聟TU"
         );
         var10001 < ((281803390 | 1499395518) ^ 1507852273);
         var10001 += (766813923 | -1913688901) ^ -1375736070
      ) {
         char var33 = 0<"JNT",-355053008,"풙퓡풩퐑햩퐁","䋷牷䉷睷","\uea51\ue151\uf651\ue151깑\uec51\ue151\uee51\ue751깑퍑\uf451\uf251\ue951\uee51\ue751쉑\uf551\ue951\uec51\ue451\ue551\uf251",-664143662>(
            var10002, var10001
         );
         char var36 = (char)(
            (
                  (
                        (((((var33 & 'ﾀ') >> 7 | var33 << '\t') & 61440) >> 12 | ((var33 & 'ﾀ') >> 7 | var33 << '\t') << 4) & 61440) >> 12
                           | ((((var33 & 'ﾀ') >> 7 | var33 << '\t') & 61440) >> 12 | ((var33 & 'ﾀ') >> 7 | var33 << '\t') << 4) << 4
                     )
                     ^ 38
               )
               - 39
         );
         0<"JNT",-355053008,"퐙풉퐁햙퓡풩퐑햩퐁","䋷牷睷䉷緷","\uea51\ue151\uf651\ue151깑\uec51\ue151\uee51\ue751깑퍑\uf451\uf251\ue951\uee51\ue751쉑\uf551\ue951\uec51\ue451\ue551\uf251",-664143661>(
            var10002,
            var10001,
            (char)(
               (
                     (
                           (((((var33 & 'ﾀ') >> 7 | var33 << '\t') & 61440) >> 12 | ((var33 & 'ﾀ') >> 7 | var33 << '\t') << 4) & 61440) >> 12
                              | ((((var33 & 'ﾀ') >> 7 | var33 << '\t') & 61440) >> 12 | ((var33 & 'ﾀ') >> 7 | var33 << '\t') << 4) << 4
                        )
                        ^ 38
                  )
                  - 39
            )
         );
      }

      String var2 = 0<"JNT",-355053008,"퐁퐹픙퐁퐑퓩퐱퓹","䋷䉷烷揷晷混晷䅷惷晷懷敷䅷罷泷濷扷懷敷䭷","\uea51\ue151\uf651\ue151깑\uec51\ue151\uee51\ue751깑퍑\uf451\uf251\ue951\uee51\ue751쉑\uf551\ue951\uec51\ue451\ue551\uf251",-664143657>(
         var10002
      );
      int var17 = -679192043 - 86619273 ^ -765811316;

      StringBuilder var38;
      for (var38 = (StringBuilder)0<"JNT",1590662855,"홁퓩퐱퓩퐁햱","䋷烷揷晷混晷䅷惷晷懷敷䅷罷泷濷扷懷敷䭷䉷緷","\uea51\ue151\uf651\ue151깑\uec51\ue151\uee51\ue751깑퍑\uf451\uf251\ue951\uee51\ue751쉑\uf551\ue951\uec51\ue451\ue551\uf251",-664143676>(
            "꠲頳⠳頳1렲䠳瀳″1ᠲ䀳࠳逳㠳⠳1렳䀳⠳瀳1젳砳꠳1耳逳⠳頳頳1ꀳ䀳⠳1࠳頳頳䠳㠳瀳⠳″1堳⠳젳瀱"
         );
         var17 < (1658916185 ^ 1658916185 ^ 49);
         var17 += -114387570 - -825039462 ^ 710651893
      ) {
         int var69 = (
               0<"JNT",-355053008,"풙퓡풩퐑햩퐁","䋷牷䉷睷","\uea51\ue151\uf651\ue151깑\uec51\ue151\uee51\ue751깑퍑\uf451\uf251\ue951\uee51\ue751쉑\uf551\ue951\uec51\ue451\ue551\uf251",-664143677>(
                        var38, var17
                     )
                     + 153
                     + 24
                  ^ 88
            )
            - 185;
         char var70 = (char)((var69 & 63488) >> 11 | var69 << 5);
         0<"JNT",-355053008,"퐙풉퐁햙퓡풩퐑햩퐁","䋷牷睷䉷緷","\uea51\ue151\uf651\ue151깑\uec51\ue151\uee51\ue751깑퍑\uf451\uf251\ue951\uee51\ue751쉑\uf551\ue951\uec51\ue451\ue551\uf251",-664143680>(
            var38, var17, (char)((var69 & 63488) >> 11 | var69 << 5)
         );
      }

      super(
         var2,
         0<"JNT",-355053008,"퐁퐹픙퐁퐑퓩퐱퓹","䋷䉷烷揷晷混晷䅷惷晷懷敷䅷罷泷濷扷懷敷䭷","\uea51\ue151\uf651\ue151깑\uec51\ue151\uee51\ue751깑퍑\uf451\uf251\ue951\uee51\ue751쉑\uf551\ue951\uec51\ue451\ue551\uf251",-664143652>(
            var38
         ),
         -1,
         1<"JNT",1034882378,"ⶈ涉䶊","１枒","ᄃ儃ᄌ儗鄑턇",1361929170>()
      );
      var10001 = (2025526185 ^ 2025526185 | 0) & -2035496606;

      for (var10002 = (StringBuilder)0<"JNT",1590662855,"홁퓩퐱퓩퐁햱","䋷烷揷晷混晷䅷惷晷懷敷䅷罷泷濷扷懷敷䭷䉷緷","\uea51\ue151\uf651\ue151깑\uec51\ue151\uee51\ue751깑퍑\uf451\uf251\ue951\uee51\ue751쉑\uf551\ue951\uec51\ue451\ue551\uf251",-664143654>(
            "輑缐\uf713伐\ue713輐\uf713漐霒㼑漐켓"
         );
         var10001 < (1554390027 + -1890904850 ^ -336514827);
         var10001 += (1173099118 + -1757553712 + 1173099118 | 1) & -792183549
      ) {
         int var41 = (
               0<"JNT",-355053008,"풙퓡풩퐑햩퐁","䋷牷䉷睷","\uea51\ue151\uf651\ue151깑\uec51\ue151\uee51\ue751깑퍑\uf451\uf251\ue951\uee51\ue751쉑\uf551\ue951\uec51\ue451\ue551\uf251",-664143636>(
                     var10002, var10001
                  )
                  ^ 222
            )
            + 58;
         char var42 = (char)(((var41 & 63488) >> 11 | var41 << 5) - 180 ^ 63);
         0<"JNT",-355053008,"퐙풉퐁햙퓡풩퐑햩퐁","䋷牷睷䉷緷","\uea51\ue151\uf651\ue151깑\uec51\ue151\uee51\ue751깑퍑\uf451\uf251\ue951\uee51\ue751쉑\uf551\ue951\uec51\ue451\ue551\uf251",-664143635>(
            var10002, var10001, (char)(((var41 & 63488) >> 11 | var41 << 5) - 180 ^ 63)
         );
      }

      this.field_1900 = (Class_115)0<"JNT",1590662855,"홁퓩퐱퓩퐁햱","䋷烷揷晷混晷䅷惷晷懷敷䅷罷泷濷扷懷敷䭷牷篷䉷緷","\ue851\uf151",-664203782>(
         0<"JNT",-355053008,"퐁퐹픙퐁퐑퓩퐱퓹","䋷䉷烷揷晷混晷䅷惷晷懷敷䅷罷泷濷扷懷敷䭷","\uea51\ue151\uf651\ue151깑\uec51\ue151\uee51\ue751깑퍑\uf451\uf251\ue951\uee51\ue751쉑\uf551\ue951\uec51\ue451\ue551\uf251",-664203779>(
            var10002
         ),
         -1,
         false
      );
      var10001 = 1921330451 >>> (1921330451 & 1921330451) ^ 3664;

      for (var10002 = (StringBuilder)0<"JNT",1590662855,"홁퓩퐱퓩퐁햱","䋷烷揷晷混晷䅷惷晷懷敷䅷罷泷濷扷懷敷䭷䉷緷","\uea51\ue151\uf651\ue151깑\uec51\ue151\uee51\ue751깑퍑\uf451\uf251\ue951\uee51\ue751쉑\uf551\ue951\uec51\ue451\ue551\uf251",-664203781>(
            "陔둔Ꙕ\ue154蕔Ꙕ굔ꉔ메"
         );
         var10001 < (-1746765956 & -1746765956 ^ -1746765963);
         var10001 += (-1716457809 | 1688746461) ^ -38207490
      ) {
         int var45 = 0<"JNT",-355053008,"풙퓡풩퐑햩퐁","䋷牷䉷睷","\uea51\ue151\uf651\ue151깑\uec51\ue151\uee51\ue751깑퍑\uf451\uf251\ue951\uee51\ue751쉑\uf551\ue951\uec51\ue451\ue551\uf251",-664143655>(
               var10002, var10001
            )
            - 187
            - 101;
         int var95 = (var45 & 49152) >> 14;
         int var46 = ((var45 & 49152) >> 14 | var45 << 2) ^ 211;
         int var96 = ((((var45 & 49152) >> 14 | var45 << 2) ^ 211) & 64512) >> 10;
         char var47 = (char)((((var95 | var45 << 2) ^ 211) & 64512) >> 10 | (((var45 & 49152) >> 14 | var45 << 2) ^ 211) << 6);
         0<"JNT",-355053008,"퐙풉퐁햙퓡풩퐑햩퐁","䋷牷睷䉷緷","\uea51\ue151\uf651\ue151깑\uec51\ue151\uee51\ue751깑퍑\uf451\uf251\ue951\uee51\ue751쉑\uf551\ue951\uec51\ue451\ue551\uf251",-664143674>(
            var10002, var10001, (char)(var96 | var46 << 6)
         );
      }

      this.field_1901 = (Class_49)0<"JNT",1590662855,"홁퓩퐱퓩퐁햱","䋷烷揷晷混晷䅷惷晷懷敷䅷罷泷濷扷懷敷䭷瓷瓷瓷瓷䉷緷","\ue451\ue351",-664143637>(
         0<"JNT",-355053008,"퐁퐹픙퐁퐑퓩퐱퓹","䋷䉷烷揷晷混晷䅷惷晷懷敷䅷罷泷濷扷懷敷䭷","\uea51\ue151\uf651\ue151깑\uec51\ue151\uee51\ue751깑퍑\uf451\uf251\ue951\uee51\ue751쉑\uf551\ue951\uec51\ue451\ue551\uf251",-664143638>(
            var10002
         ),
         0.0,
         20.0,
         0.0,
         1.0
      );
      var10001 = (830449001 << 830449001 | 0) & 10750052;

      for (var10002 = (StringBuilder)0<"JNT",1590662855,"홁퓩퐱퓩퐁햱","䋷烷揷晷混晷䅷惷晷懷敷䅷罷泷濷扷懷敷䭷䉷緷","\uea51\ue151\uf651\ue151깑\uec51\ue151\uee51\ue751깑퍑\uf451\uf251\ue951\uee51\ue751쉑\uf551\ue951\uec51\ue451\ue551\uf251",-664143640>(
            "êĎĀċúÿ·ÙøúĂ"
         );
         var10001 < ((1838624165 * 1434846120 | 3) & 29367451);
         var10001 += -393753358 >>> 980888353 ^ 1950606968
      ) {
         int var50 = 0<"JNT",-355053008,"풙퓡풩퐑햩퐁","䋷牷䉷睷","\uea51\ue151\uf651\ue151깑\uec51\ue151\uee51\ue751깑퍑\uf451\uf251\ue951\uee51\ue751쉑\uf551\ue951\uec51\ue451\ue551\uf251",-664143653>(
               var10002, var10001
            )
            + 's'
            - 197
            - 69;
         int var97 = (var50 & 0) >> 16;
         int var51 = (var50 & 0) >> 16 | var50 << 0;
         int var98 = (((var50 & 0) >> 16 | var50 << 0) & 0) >> 16;
         char var52 = (char)(((var97 | var50 << 0) & 0) >> 16 | ((var50 & 0) >> 16 | var50 << 0) << 0);
         0<"JNT",-355053008,"퐙풉퐁햙퓡풩퐑햩퐁","䋷牷睷䉷緷","\uea51\ue151\uf651\ue151깑\uec51\ue151\uee51\ue751깑퍑\uf451\uf251\ue951\uee51\ue751쉑\uf551\ue951\uec51\ue451\ue551\uf251",-664143656>(
            var10002, var10001, (char)(var98 | var51 << 0)
         );
      }

      this.field_1902 = (Class_105)0<"JNT",1590662855,"홁퓩퐱퓩퐁햱","䋷烷揷晷混晷䅷惷晷懷敷䅷罷泷濷扷懷敷䭷篷䉷緷","\ue751\uf251",-664203783>(
         0<"JNT",-355053008,"퐁퐹픙퐁퐑퓩퐱퓹","䋷䉷烷揷晷混晷䅷惷晷懷敷䅷罷泷濷扷懷敷䭷","\uea51\ue151\uf651\ue151깑\uec51\ue151\uee51\ue751깑퍑\uf451\uf251\ue951\uee51\ue751쉑\uf551\ue951\uec51\ue451\ue551\uf251",-664203784>(
            var10002
         ),
         true
      );
      var10001 = 0;

      for (var10002 = (StringBuilder)0<"JNT",1590662855,"홁퓩퐱퓩퐁햱","䋷烷揷晷混晷䅷惷晷懷敷䅷罷泷濷扷懷敷䭷䉷緷","\uea51\ue151\uf651\ue151깑\uec51\ue151\uee51\ue751깑퍑\uf451\uf251\ue951\uee51\ue751쉑\uf551\ue951\uec51\ue451\ue551\uf251",-664203802>(
            "\u001d+:耭5耻耗耥4耹62"
         );
         var10001 < ((116862648 + (116862648 << -2015579418) | 4) & 268435981);
         var10001 += 393565706 - -1100671523 ^ 1494237228
      ) {
         int var55 = 0<"JNT",-355053008,"풙퓡풩퐑햩퐁","䋷牷䉷睷","\uea51\ue151\uf651\ue151깑\uec51\ue151\uee51\ue751깑퍑\uf451\uf251\ue951\uee51\ue751쉑\uf551\ue951\uec51\ue451\ue551\uf251",-664143639>(
               var10002, var10001
            )
            - 'J';
         char var56 = (char)(((var55 & 32768) >> 15 | var55 << 1) + 131 + 154 ^ 151);
         0<"JNT",-355053008,"퐙풉퐁햙퓡풩퐑햩퐁","䋷牷睷䉷緷","\uea51\ue151\uf651\ue151깑\uec51\ue151\uee51\ue751깑퍑\uf451\uf251\ue951\uee51\ue751쉑\uf551\ue951\uec51\ue451\ue551\uf251",-664143658>(
            var10002, var10001, (char)(((var55 & 32768) >> 15 | var55 << 1) + 131 + 154 ^ 151)
         );
      }

      Class_49 var11 = (Class_49)0<"JNT",1590662855,"홁퓩퐱퓩퐁햱","䋷烷揷晷混晷䅷惷晷懷敷䅷罷泷濷扷懷敷䭷瓷瓷瓷瓷䉷緷","\ue451\ue351",-664143660>(
         0<"JNT",-355053008,"퐁퐹픙퐁퐑퓩퐱퓹","䋷䉷烷揷晷混晷䅷惷晷懷敷䅷罷泷濷扷懷敷䭷","\uea51\ue151\uf651\ue151깑\uec51\ue151\uee51\ue751깑퍑\uf451\uf251\ue951\uee51\ue751쉑\uf551\ue951\uec51\ue451\ue551\uf251",-664203801>(
            var10002
         ),
         0.0,
         20.0,
         0.0,
         1.0
      );
      int var27 = 0;

      for (var38 = (StringBuilder)0<"JNT",1590662855,"홁퓩퐱퓩퐁햱","䋷烷揷晷混晷䅷惷晷懷敷䅷罷泷濷扷懷敷䭷䉷緷","\uea51\ue151\uf651\ue151깑\uec51\ue151\uee51\ue751깑퍑\uf451\uf251\ue951\uee51\ue751쉑\uf551\ue951\uec51\ue451\ue551\uf251",-664143659>(
            "\ufefe？Ｆ；Ｓﻚ；＠Ｎ？ＬﻚＯＭＣＨＡﻚ１ＣＨ＞ﻚ\ufefdＢ；ＬＡ？ﻚ＜？＠ＩＬ？ﻚＭＱＣＮ＝ＢＣＨＡﻚ＜；＝Ｅﻨ"
         );
         var27 < (-969922562 * -1226753469 ^ -2115501234);
         var27 += (-1739880474 | -1739880474 | 1) & 3420185
      ) {
         int var79 = 0<"JNT",-355053008,"풙퓡풩퐑햩퐁","䋷牷䉷睷","\uea51\ue151\uf651\ue151깑\uec51\ue151\uee51\ue751깑퍑\uf451\uf251\ue951\uee51\ue751쉑\uf551\ue951\uec51\ue451\ue551\uf251",-664143671>(
               var38, var27
            )
            + 158
            + 168;
         char var82 = (char)(
            (((((var79 & 32768) >> 15 | var79 << 1) & 65528) >> 3 | ((var79 & 32768) >> 15 | var79 << 1) << 13) & 49152) >> 14
               | ((((var79 & 32768) >> 15 | var79 << 1) & 65528) >> 3 | ((var79 & 32768) >> 15 | var79 << 1) << 13) << 2
         );
         0<"JNT",-355053008,"퐙풉퐁햙퓡풩퐑햩퐁","䋷牷睷䉷緷","\uea51\ue151\uf651\ue151깑\uec51\ue151\uee51\ue751깑퍑\uf451\uf251\ue951\uee51\ue751쉑\uf551\ue951\uec51\ue451\ue551\uf251",-664143690>(
            var38,
            var27,
            (char)(
               (((((var79 & 32768) >> 15 | var79 << 1) & 65528) >> 3 | ((var79 & 32768) >> 15 | var79 << 1) << 13) & 49152) >> 14
                  | ((((var79 & 32768) >> 15 | var79 << 1) & 65528) >> 3 | ((var79 & 32768) >> 15 | var79 << 1) << 13) << 2
            )
         );
      }

      this.field_1903 = 0<"JNT",-355053008,"퐹퓩퓡","䋷烷揷晷混晷䅷惷晷懷敷䅷罷泷濷扷懷敷䭷䉷烷擷杷䭷","\ue451\ue351",-664143650>(
         var11,
         0<"JNT",-355053008,"퐁퐹픙퐁퐑퓩퐱퓹","䋷䉷烷揷晷混晷䅷惷晷懷敷䅷罷泷濷扷懷敷䭷","\uea51\ue151\uf651\ue151깑\uec51\ue151\uee51\ue751깑퍑\uf451\uf251\ue951\uee51\ue751쉑\uf551\ue951\uec51\ue451\ue551\uf251",-664143663>(
            var38
         )
      );
      var10001 = (-1684517834 * (-2029301238 - -1809627311) | 0) & 738595049;

      for (var10002 = (StringBuilder)0<"JNT",1590662855,"홁퓩퐱퓩퐁햱","䋷烷揷晷混晷䅷惷晷懷敷䅷罷泷濷扷懷敷䭷䉷緷","\uea51\ue151\uf651\ue151깑\uec51\ue151\uee51\ue751깑퍑\uf451\uf251\ue951\uee51\ue751쉑\uf551\ue951\uec51\ue451\ue551\uf251",-664143649>(
            "往檀氀梀洀瀀䘀往熀檀瀀枀樀"
         );
         var10001 < ((-1895442447 & -1895442447 | 12) & 1615857679);
         var10001 += 860832347 ^ -1605289675 ^ -1826718865
      ) {
         char var61 = 0<"JNT",-355053008,"풙퓡풩퐑햩퐁","䋷牷䉷睷","\uea51\ue151\uf651\ue151깑\uec51\ue151\uee51\ue751깑퍑\uf451\uf251\ue951\uee51\ue751쉑\uf551\ue951\uec51\ue451\ue551\uf251",-664143673>(
            var10002, var10001
         );
         char var62 = (char)(((var61 & 'ﾀ') >> 7 | var61 << '\t') + 54 - 6 + 75 - 231);
         0<"JNT",-355053008,"퐙풉퐁햙퓡풩퐑햩퐁","䋷牷睷䉷緷","\uea51\ue151\uf651\ue151깑\uec51\ue151\uee51\ue751깑퍑\uf451\uf251\ue951\uee51\ue751쉑\uf551\ue951\uec51\ue451\ue551\uf251",-664143692>(
            var10002, var10001, (char)(((var61 & 'ﾀ') >> 7 | var61 << '\t') + 54 - 6 + 75 - 231)
         );
      }

      Class_105 var14 = (Class_105)0<"JNT",1590662855,"홁퓩퐱퓩퐁햱","䋷烷揷晷混晷䅷惷晷懷敷䅷罷泷濷扷懷敷䭷篷䉷緷","\ue751\uf251",-664143666>(
         0<"JNT",-355053008,"퐁퐹픙퐁퐑퓩퐱퓹","䋷䉷烷揷晷混晷䅷惷晷懷敷䅷罷泷濷扷懷敷䭷","\uea51\ue151\uf651\ue151깑\uec51\ue151\uee51\ue751깑퍑\uf451\uf251\ue951\uee51\ue751쉑\uf551\ue951\uec51\ue451\ue551\uf251",-664143679>(
            var10002
         ),
         false
      );
      int var31 = (1726967761 | -1088799970) ^ -32801;

      for (var38 = (StringBuilder)0<"JNT",1590662855,"홁퓩퐱퓩퐁햱","䋷烷揷晷混晷䅷惷晷懷敷䅷罷泷濷扷懷敷䭷䉷緷","\uea51\ue151\uf651\ue151깑\uec51\ue151\uee51\ue751깑퍑\uf451\uf251\ue951\uee51\ue751쉑\uf551\ue951\uec51\ue451\ue551\uf251",-664143665>(
            "緯뷫ᷨ㷪ᷨ㷫\ufdeb\uddeb緡\uddef巪鷨\ufdeb\udde9編鷨㷫巨緡\ufdeb巫緡鷩㷫巫\ufdeb編ᷨ뷫緡\uddeb\ufde8巫\ufdeb緡巪編ᷨ㷫緡ᷮ\uddeb鷨㷫巨緡差鷨㷫\ufde9緡\udded編鷩뷫巨ᷨ\uddeb㷣"
         );
         var31 < ((514731808 * 657929683 | 27) & 537757883);
         var31 += (-1156999819 << 200992395 | 1) & 587219703
      ) {
         int var86 = 0<"JNT",-355053008,"풙퓡풩퐑햩퐁","䋷牷䉷睷","\uea51\ue151\uf651\ue151깑\uec51\ue151\uee51\ue751깑퍑\uf451\uf251\ue951\uee51\ue751쉑\uf551\ue951\uec51\ue451\ue551\uf251",-664143675>(
               var38, var31
            )
            ^ 'e';
         char var89 = (char)(
            (((((var86 & 65408) >> 7 | var86 << 9) - 251 & 65535) >> 0 | ((var86 & 65408) >> 7 | var86 << 9) - 251 << 16) & 65472) >> 6
               | ((((var86 & 65408) >> 7 | var86 << 9) - 251 & 65535) >> 0 | ((var86 & 65408) >> 7 | var86 << 9) - 251 << 16) << 10
         );
         0<"JNT",-355053008,"퐙풉퐁햙퓡풩퐑햩퐁","䋷牷睷䉷緷","\uea51\ue151\uf651\ue151깑\uec51\ue151\uee51\ue751깑퍑\uf451\uf251\ue951\uee51\ue751쉑\uf551\ue951\uec51\ue451\ue551\uf251",-664143678>(
            var38,
            var31,
            (char)(
               (((((var86 & 65408) >> 7 | var86 << 9) - 251 & 65535) >> 0 | ((var86 & 65408) >> 7 | var86 << 9) - 251 << 16) & 65472) >> 6
                  | ((((var86 & 65408) >> 7 | var86 << 9) - 251 & 65535) >> 0 | ((var86 & 65408) >> 7 | var86 << 9) - 251 << 16) << 10
            )
         );
      }

      this.field_1904 = 0<"JNT",-355053008,"풩퐉풁","䋷烷揷晷混晷䅷惷晷懷敷䅷罷泷濷扷懷敷䭷䉷烷敷濷䭷","\ue751\uf251",-664143694>(
         var14,
         0<"JNT",-355053008,"퐁퐹픙퐁퐑퓩퐱퓹","䋷䉷烷揷晷混晷䅷惷晷懷敷䅷罷泷濷扷懷敷䭷","\uea51\ue151\uf651\ue151깑\uec51\ue151\uee51\ue751깑퍑\uf451\uf251\ue951\uee51\ue751쉑\uf551\ue951\uec51\ue451\ue551\uf251",-664143691>(
            var38
         )
      );
      this.field_1905 = false;
      this.field_1906 = false;
      this.field_1907 = 0;
      this.field_1908 = 0;
      this.field_1909 = 0;
      this.field_1910 = -1;
      this.field_1911 = null;
      Class_49 var10000 = 1<"JNT",118929749,"ⶉ䶈춉","璒炒","ᄃ儃ᄌᄒ턑턇",1361929124>(this);
      Class_105 var15 = 1<"JNT",118929749,"궈궉","璒炒","ᄃ儃ᄌ턒鄕턇",1361929127>(this);
      0<"JNT",99618620,"퐑풉퐩퐉퓩퐑풉픱퐹퐱픱퐉퓁퓁","䋷烷揷晷混晷䅷惷晷懷敷䅷煷柷揷摷杷泷䭷䉷烷揷晷混晷䅷惷晷懷敷䅷煷柷揷摷杷泷䭷","\uea51\ue151\uf651\ue151깑\uf551\uf451\ue951\uec51깑콑\ue251\uea51\ue551\ue351\uf451\uf351",-664143695>(
         var15
      );
      0<"JNT",-355053008,"퐱푑퐙","䋷烷揷晷混晷䅷汷泷扷惷䅷旷汷懷杷泷扷慷懷䅷罷汷滷滷惷扷摷濷䭷䉷烷湷摷摷䭷","\ue451\ue351",-664143682>(var10000, var15::ax);
      0<"JNT",-355053008,"퐩퐉","䋷筷烷湷摷摷䭷䉷緷","\uef51\ueb51",-664143672>(
         this,
         new Class_271[]{
            1<"JNT",118929749,"趉춇","璒炒","ᄃ儃ᄌᄓ儕턇",1361929120>(this),
            1<"JNT",118929749,"ⶊ趇","璒炒","ᄃ儃ᄌᄒ턑턇",1361929123>(this),
            1<"JNT",118929749,"궈궉","璒炒","ᄃ儃ᄌ턒鄕턇",1361929122>(this),
            1<"JNT",118929749,"ⶉ䶈춉","璒炒","ᄃ儃ᄌᄒ턑턇",1361929149>(this),
            1<"JNT",118929749,"ⶉ涇\ued89","璒炒","ᄃ儃ᄌ턒鄕턇",1361929148>(this)
         }
      );
   }

   // $VF: renamed from: mg () void
   @Override
   public void method_1407() {
      0<"JNT",-355053008,"푑퓩퓉","䋷䉷緷","\uef51\ueb51",-664143689>(this);
      0<"JNT",1393140061,"퓉퓹","䋷䉷緷","\uf551\uf351\ue651",-664203996>(this);
   }

   // $VF: renamed from: q () void
   @Override
   public void method_1408() {
      0<"JNT",1393140061,"퐩","䋷䉷緷","\uf551\uf351\ue651",-664203995>(this);
   }

   // $VF: renamed from: yup (Class_70) void
   @Class_21
   public void method_1665(Class_70 var1) {
      if (0<"JNT",-355053008,"풙퐹퓉퐡풹혁홹황혉","䋷䉷牷","\uee51\ue551\uf451깑\ued51\ue951\uee51\ue551\ue351\uf251\ue151\ue651\uf451깑\ue351\uec51\ue151\uf351\uf351\udf51녑녑륑끑롑",-664203997>(
               1<"JNT",118929749,"\ued89趇춇","檒炒","ᄃ儃ᄌ鄔儒ᄖ턄儔儓鄔儒턑鄕儑鄒ᄖ턄턑ᄔ儑턕턕턐儅儅儇ᄅᄇ턇",1361929141>(var1)
            )
            == 0<"JNT",-355053008,"퓱퓡","䋷䉷牷","\ue851\uf151",-664203999>(1<"JNT",118929749,"趉춇","璒炒","ᄃ儃ᄌᄓ儕턇",1361929143>(this))
         && 1<"JNT",118929749,"ⶊ涇춇","檒炒","ᄃ儃儋",1361929137>(var1) == 1) {
         1<"JNT",-988577068,"ⶊ趉","璒炒","ᄃ儃鄏",1361929136>(this, true);
      }
   }

   // $VF: renamed from: gd (Class_207) void
   @Class_21
   public void method_1666(Class_207 var1) {
      int var3 = -848795899;
      if (1<"JNT",118929749,"ඈ消\ued87춈춇ⶇ涁ⶂ\ued81\ued81","玒檒﨑뎑犒溒玒檒梒\uf811暒殒﨑뎑梒熒暒螺螺撒㢒㚒떑","ᄃ儃ᄌ鄔儒ᄖ턄儔儓鄔儒턑鄕儑鄒ᄖ턄턑ᄔ儑턕턕턐ᄆ턅턆턇",1361929044>(
               1<"JNT",118929749,"춈趉","璒炒","ᄃ儃ᄌ鄔儒ᄖ턄儔儓鄔儒턑鄕儑鄒ᄖ턄턑ᄔ儑턕턕턐턅儅ᄅ턇",1361929045>(this)
            )
            == null
         && 1<"JNT",118929749,"ඈ消\ued87춈춇ⶇ涁ⶂ趁춁","玒檒﨑뎑犒溒玒檒梒\uf811暒殒﨑뎑梒熒暒螺螺撒㢒㚒떑","ᄃ儃ᄌ鄔儒ᄖ턄儔儓鄔儒턑鄕儑鄒ᄖ턄턑ᄔ儑턕턕턐턆ᄆ鄆턇",1361929046>(
               1<"JNT",118929749,"춈趉","璒炒","ᄃ儃ᄌ鄔儒ᄖ턄儔儓鄔儒턑鄕儑鄒ᄖ턄턑ᄔ儑턕턕턐턅儅ᄅ턇",1361929047>(this)
            )
            != null
         && 1<"JNT",118929749,"ඈ消\ued87춈춇ⶇ涁ⶂං涁","玒檒﨑뎑犒溒玒檒梒\uf811暒殒﨑뎑梒熒暒螺螺撒㢒㚒떑","ᄃ儃ᄌ鄔儒ᄖ턄儔儓鄔儒턑鄕儑鄒ᄖ턄턑ᄔ儑턕턕턐鄆턅鄆턇",1361929040>(
               1<"JNT",118929749,"춈趉","璒炒","ᄃ儃ᄌ鄔儒ᄖ턄儔儓鄔儒턑鄕儑鄒ᄖ턄턑ᄔ儑턕턕턐턅儅ᄅ턇",1361929041>(this)
            )
            != null) {
         var3 = (1146665364 | 1146665364 | -743805336) & -536969619;
      } else {
         var3 = (167485681 - -569818075 | -1265631192) & -23146071;
      }

      while (true) {
         switch (((var3 ^ 2028164481) - 1667245018 + 242234748 - 630030452 ^ 1144890441) + 967389203) {
            case -1986312373:
               return;
            case -1437644443:
               if (1<"JNT",118929749,"춇춈","璒炒","ᄃ儃儋",1361929139>(this) > 0) {
                  1<"JNT",-988577068,"춇춈","璒炒","ᄃ儃儋",1361929037>(this, 1<"JNT",118929749,"춇춈","璒炒","ᄃ儃儋",1361929074>(this) - 1);
                  return;
               }

               var3 = 1184625905 * -690386173 ^ -957141525;
               break;
            case -429517088:
               if (!1<"JNT",118929749,"䶊趇趉","璒炒","ᄃ儃鄏",1361929036>(this)) {
                  class_1269 var2 = 0<"JNT",-355053008,"퓉풉퐁퓡퐹풁풹협황혩황","䋷烷懷摷泷䅷恷扷懷摷杷濷晷旷泷䅷杷惷晷潷潷祷乷䷷䱷䵷䭷烷懷摷泷䅷恷扷懷摷杷濷晷旷泷䅷杷惷晷潷潷祷乷俷䷷䫷䭷䉷烷懷摷泷䅷恷扷懷摷杷濷晷旷泷䅷杷惷晷潷潷祷乷俷䷷䩷䭷","\uee51\ue551\uf451깑\ued51\ue951\uee51\ue551\ue351\uf251\ue151\ue651\uf451깑\ue351\uec51\ue151\uf351\uf351\udf51뙑덑뙑",-664204011>(
                     1<"JNT",118929749,"ඈ消\ued87춈춇ⶇ涁ⶂං涁","玒檒﨑뎑犒溒玒檒梒\uf811暒殒﨑뎑梒熒暒螺螺撒㢒㚒떑","ᄃ儃ᄌ鄔儒ᄖ턄儔儓鄔儒턑鄕儑鄒ᄖ턄턑ᄔ儑턕턕턐鄆턅鄆턇",1361929038>(
                        1<"JNT",118929749,"춈趉","璒炒","ᄃ儃ᄌ鄔儒ᄖ턄儔儓鄔儒턑鄕儑鄒ᄖ턄턑ᄔ儑턕턕턐턅儅ᄅ턇",1361929039>(this)
                     ),
                     1<"JNT",118929749,"ඈ消\ued87춈춇ⶇ涁ⶂ趁춁","玒檒﨑뎑犒溒玒檒梒\uf811暒殒﨑뎑梒熒暒螺螺撒㢒㚒떑","ᄃ儃ᄌ鄔儒ᄖ턄儔儓鄔儒턑鄕儑鄒ᄖ턄턑ᄔ儑턕턕턐턆ᄆ鄆턇",1361929032>(
                        1<"JNT",118929749,"춈趉","璒炒","ᄃ儃ᄌ鄔儒ᄖ턄儔儓鄔儒턑鄕儑鄒ᄖ턄턑ᄔ儑턕턕턐턅儅ᄅ턇",1361929033>(this)
                     ),
                     1<"JNT",1034882378,"ඈ消\ued87춈춇ⶇ\ued81䶂䶁䶂","玒檒﨑뎑犒溒玒檒梒\uf811暒殒﨑뎑梒熒暒螺螺撒㚒㞒㮒㶒","ᄃ儃ᄌ鄔儒ᄖ턄儔儓鄔儒턑鄕儑鄒ᄖ턄턑ᄔ儑턕턕턐儅鄅鄆ᄇ턇",1361929035>()
                  );
                  if (0<"JNT",227075148,"퓉풉퐁퓡퐹풁풹협혙홱홱혉","䋷䉷篷","\uee51\ue551\uf451깑\ued51\ue951\uee51\ue551\ue351\uf251\ue151\ue651\uf451깑\ue351\uec51\ue151\uf351\uf351\udf51녑뉑뙑륑",-664204014>(
                        var2
                     )
                     && 0<"JNT",227075148,"퓉풉퐁퓡퐹풁풹협혙홱홱혉","䋷䉷篷","\uee51\ue551\uf451깑\ued51\ue951\uee51\ue551\ue351\uf251\ue151\ue651\uf451깑\ue351\uec51\ue151\uf351\uf351\udf51녑뉑뙑륑",-664204013>(
                        var2
                     )
                     && !0<"JNT",-355053008,"풩푡","䋷䉷篷","\ue751\uf251",-664204015>(1<"JNT",118929749,"ⶉ涇\ued89","璒炒","ᄃ儃ᄌ턒鄕턇",1361929031>(this))) {
                     0<"JNT",-355053008,"퓉풉퐁퓡퐹풁풹홱혩혡혁","䋷烷懷摷泷䅷恷扷懷摷杷濷晷旷泷䅷杷惷晷潷潷祷乷俷䷷䫷䭷䉷緷","\uee51\ue551\uf451깑\ued51\ue951\uee51\ue551\ue351\uf251\ue151\ue651\uf451깑\ue351\uec51\ue151\uf351\uf351\udf51띑둑뙑",-664203987>(
                        1<"JNT",118929749,"ඈ消\ued87춈춇ⶇ涁ⶂ趁춁","玒檒﨑뎑犒溒玒檒梒\uf811暒殒﨑뎑梒熒暒螺螺撒㢒㚒떑","ᄃ儃ᄌ鄔儒ᄖ턄儔儓鄔儒턑鄕儑鄒ᄖ턄턑ᄔ儑턕턕턐턆ᄆ鄆턇",1361929024>(
                           1<"JNT",118929749,"춈趉","璒炒","ᄃ儃ᄌ鄔儒ᄖ턄儔儓鄔儒턑鄕儑鄒ᄖ턄턑ᄔ儑턕턕턐턅儅ᄅ턇",1361929025>(this)
                        ),
                        1<"JNT",1034882378,"ඈ消\ued87춈춇ⶇ\ued81䶂䶁䶂","玒檒﨑뎑犒溒玒檒梒\uf811暒殒﨑뎑梒熒暒螺螺撒㚒㞒㮒㶒","ᄃ儃ᄌ鄔儒ᄖ턄儔儓鄔儒턑鄕儑鄒ᄖ턄턑ᄔ儑턕턕턐儅鄅鄆ᄇ턇",1361929027>()
                     );
                  }

                  1<"JNT",-988577068,"䶊趇趉","璒炒","ᄃ儃鄏",1361929057>(this, true);
                  if (!0<"JNT",-355053008,"풩푡","䋷䉷篷","\ue751\uf251",-664204020>(1<"JNT",118929749,"궈궉","璒炒","ᄃ儃ᄌ턒鄕턇",1361929056>(this))) {
                     0<"JNT",-355053008,"푑퓩퓉","䋷䉷緷","\uef51\ueb51",-664204019>(this);
                  }
               }

               var3 = 1922601475 >> 1922601475 ^ -1622640227;
               break;
            case 693970625:
               if (!1<"JNT",118929749,"ⶊ趉","璒炒","ᄃ儃鄏",1361929062>(this)) {
                  return;
               }

               var3 = 176324397 << -292559797 ^ 1483737914;
               break;
            case 914002867:
               if (1<"JNT",118929749,"ඈ춇","璒炒","ᄃ儃儋",1361929043>(this) == -1) {
                  1<"JNT",-988577068,"ඈ춇","璒炒","ᄃ儃儋",1361929070>(
                     this,
                     0<"JNT",-355053008,"퓉풉퐁퓡퐹풁풹홱홹혉혙협","䋷䉷牷","\uee51\ue551\uf451깑\ued51\ue951\uee51\ue551\ue351\uf251\ue151\ue651\uf451깑\ue351\uec51\ue151\uf351\uf351\udf51녑뙑뙑녑",-664204008>(
                        0<"JNT",-355053008,"퓉풉퐁퓡퐹풁풹혙혩혉혁홡","䋷䉷烷懷摷泷䅷恷扷懷摷杷濷晷旷泷䅷杷惷晷潷潷祷乷䷷䷷乷䭷","\uee51\ue551\uf451깑\ued51\ue951\uee51\ue551\ue351\uf251\ue151\ue651\uf451깑\ue351\uec51\ue151\uf351\uf351\udf51띑둑뙑",-664204005>(
                           1<"JNT",118929749,"ඈ消\ued87춈춇ⶇ涁ⶂ趁춁","玒檒﨑뎑犒溒玒檒梒\uf811暒殒﨑뎑梒熒暒螺螺撒㢒㚒떑","ᄃ儃ᄌ鄔儒ᄖ턄儔儓鄔儒턑鄕儑鄒ᄖ턄턑ᄔ儑턕턕턐턆ᄆ鄆턇",1361929069>(
                              1<"JNT",118929749,"춈趉","璒炒","ᄃ儃ᄌ鄔儒ᄖ턄儔儓鄔儒턑鄕儑鄒ᄖ턄턑ᄔ儑턕턕턐턅儅ᄅ턇",1361929106>(this)
                           )
                        )
                     )
                  );
                  1<"JNT",-988577068,"춉ඈ涇","璒炒","ᄃ儃ᄌ鄔儒ᄖ턄儔儓鄔儒턑鄕儑鄒ᄖ턄턑ᄔ儑턕턕턐儅턆儇儇턇",1361929066>(
                     this,
                     0<"JNT",-355053008,"퓉풉퐁퓡퐹풁풹홱혡혁홹","䋷䉷烷懷摷泷䅷恷扷懷摷杷濷晷旷泷䅷杷惷晷潷潷祷乷䵷䩷䩷䭷","\uee51\ue551\uf451깑\ued51\ue951\uee51\ue551\ue351\uf251\ue151\ue651\uf451깑\ue351\uec51\ue151\uf351\uf351\udf51띑둑뙑",-664203788>(
                        1<"JNT",118929749,"ඈ消\ued87춈춇ⶇ涁ⶂ趁춁","玒檒﨑뎑犒溒玒檒梒\uf811暒殒﨑뎑梒熒暒螺螺撒㢒㚒떑","ᄃ儃ᄌ鄔儒ᄖ턄儔儓鄔儒턑鄕儑鄒ᄖ턄턑ᄔ儑턕턕턐턆ᄆ鄆턇",1361929064>(
                           1<"JNT",118929749,"춈趉","璒炒","ᄃ儃ᄌ鄔儒ᄖ턄儔儓鄔儒턑鄕儑鄒ᄖ턄턑ᄔ儑턕턕턐턅儅ᄅ턇",1361929065>(this)
                        )
                     )
                  );
               }

               var3 = -1451914492;
               break;
            case 1232560689:
            default:
               return;
            case 1288567821:
               if (!0<"JNT",99618620,"푱푑풑","䋷烷懷摷泷䅷恷扷懷摷杷濷晷旷泷䅷杷惷晷潷潷祷乷䵷䩷俷䭷䉷篷","\ue851",-664203789>(
                  1<"JNT",1034882378,"ඈ消\ued87춈춇ⶇ춁涂䶁涂䶂","玒檒﨑뎑犒溒玒檒梒\uf811暒殒﨑뎑梒熒暒螺螺撒㚒㶒떑㞒","ᄃ儃ᄌ鄔儒ᄖ턄儔儓鄔儒턑鄕儑鄒ᄖ턄턑ᄔ儑턕턕턐儅턆儇鄅턇",1361929061>()
               )) {
                  0<"JNT",-355053008,"푑퓩퓉","䋷䉷緷","\uef51\ueb51",-664203792>(this);
                  return;
               }

               var3 = (2013759386 + 528799668 | -1609479519) & -1470903645;
               break;
            case 1408386092:
               if (1<"JNT",118929749,"涊涇趈","璒炒","ᄃ儃儋",1361929054>(this)
                  < 0<"JNT",-355053008,"퓱푑퓹","䋷䉷牷","\ue451\ue351",-664204009>(1<"JNT",118929749,"ⶊ趇","璒炒","ᄃ儃ᄌᄒ턑턇",1361929049>(this))) {
                  1<"JNT",-988577068,"涊涇趈","璒炒","ᄃ儃儋",1361929050>(this, 1<"JNT",118929749,"涊涇趈","璒炒","ᄃ儃儋",1361929051>(this) + 1);
                  return;
               }

               var3 = -1804041550 << -1027558778 ^ 71125079;
               break;
            case 1693490134:
               if (0<"JNT",-355053008,"풩푡","䋷䉷篷","\ue751\uf251",-664203989>(1<"JNT",118929749,"궈궉","璒炒","ᄃ儃ᄌ턒鄕턇",1361929053>(this))) {
                  0<"JNT",-355053008,"풑푡퓉","䋷䉷緷","\uef51\ueb51",-664203992>(this);
               }

               var3 = -22120510;
         }
      }
   }

   // $VF: renamed from: bxm () void
   public void method_1667() {
      int var1 = -686398102;
      if (1<"JNT",118929749,"ⶊ춇ඉ","璒炒","ᄃ儃儋",1361929086>(this)
         < 0<"JNT",-355053008,"퓱푑퓹","䋷䉷牷","\ue451\ue351",-664203785>(1<"JNT",118929749,"ⶉ䶈춉","璒炒","ᄃ儃ᄌᄒ턑턇",1361929081>(this))) {
         1<"JNT",-988577068,"ⶊ춇ඉ","璒炒","ᄃ儃儋",1361929082>(this, 1<"JNT",118929749,"ⶊ춇ඉ","璒炒","ᄃ儃儋",1361929083>(this) + 1);
      } else {
         var1 = -2005742357;

         while (true) {
            switch ((var1 ^ 988158784) + 81171150 - 270863031 - 1053408422 + 81108867 - 1991330970) {
               case -1859724441:
                  0<"JNT",-355053008,"푑퓩퓉","䋷䉷緷","\uef51\ueb51",-664204022>(this);
                  return;
               case -157223419:
               default:
                  if (1<"JNT",118929749,"춉ඈ涇","璒炒","ᄃ儃ᄌ鄔儒ᄖ턄儔儓鄔儒턑鄕儑鄒ᄖ턄턑ᄔ儑턕턕턐儅턆儇儇턇",1361929084>(this) == null) {
                     var1 = -289767106;
                     continue;
                  }

                  0<"JNT",99618620,"퐩푑퓙","䋷烷揷晷混晷䅷汷泷扷惷䅷旷汷懷杷泷扷慷懷䅷绷濷摷擷扷杷晷泷摷䭷䉷篷","\ue851",-664204024>(
                     (Predicate<class_1792>)var1x -> var1x
                           == 0<"JNT",-355053008,"퓉풉퐁퓡퐹풁풹홹황혡황","䋷䉷烷懷摷泷䅷恷扷懷摷杷濷晷旷泷䅷杷惷晷潷潷祷乷䵷䩷俷䭷","\uee51\ue551\uf451깑\ued51\ue951\uee51\ue551\ue351\uf251\ue151\ue651\uf451깑\ue351\uec51\ue151\uf351\uf351\udf51녑띑륑륑",-664204679>(
                              1<"JNT",118929749,"춉ඈ涇","璒炒","ᄃ儃ᄌ鄔儒ᄖ턄儔儓鄔儒턑鄕儑鄒ᄖ턄턑ᄔ儑턕턕턐儅턆儇儇턇",1361928207>(this)
                           )
                  );
                  break;
               case 409516248:
                  if (1<"JNT",118929749,"ඈ춇","璒炒","ᄃ儃儋",1361929077>(this) != -1) {
                     0<"JNT",99618620,"푱퐁퓑","䋷牷䉷緷","\ue851",-664203936>(1<"JNT",118929749,"ඈ춇","璒炒","ᄃ儃儋",1361929076>(this));
                  }
            }

            var1 = 1859913561 * -1154683679 ^ -74963084;
         }
      }
   }

   // $VF: renamed from: zim () void
   public void method_1668() {
      1<"JNT",-988577068,"ඈ춇","璒炒","ᄃ儃儋",1361929078>(this, -1);
      1<"JNT",-988577068,"춉ඈ涇","璒炒","ᄃ儃ᄌ鄔儒ᄖ턄儔儓鄔儒턑鄕儑鄒ᄖ턄턑ᄔ儑턕턕턐儅턆儇儇턇",1361929073>(this, null);
      1<"JNT",-988577068,"涊涇趈","璒炒","ᄃ儃儋",1361929072>(this, 0);
      1<"JNT",-988577068,"ⶊ춇ඉ","璒炒","ᄃ儃儋",1361929075>(this, 0);
      1<"JNT",-988577068,"춇춈","璒炒","ᄃ儃儋",1361928242>(this, 4);
      1<"JNT",-988577068,"ⶊ趉","璒炒","ᄃ儃鄏",1361928205>(this, false);
      1<"JNT",-988577068,"䶊趇趉","璒炒","ᄃ儃鄏",1361928204>(this, false);
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1413(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = (((var10 ^ 641500790) - 1911976544 + 676669831 - 138241081 ^ 800044666) - 286677704 ^ 1471527474) + 1801995647 + 109989328;
      MethodHandle var10000 = field_1912[(((var10 ^ 641500790) - 1911976544 + 676669831 - 138241081 ^ 800044666) - 286677704 ^ 1471527474)
         + 1801995647
         + 109989328
         + 1754445224];
      if (field_1912[var10001 + 1754445224] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = (285622476 >> 285622476 | 0) & -882062192; var23 < var13.length(); var23 += -190904089 ^ 583908775 ^ -699222719) {
            char var42 = var13.charAt(var23);
            char var47 = (char)(
               (
                        (
                              (
                                       (
                                                (
                                                         (
                                                                  ((((var42 & '\ufff8') >> 3 | var42 << '\r') ^ 118) + 254 & 65504) >> 5
                                                                     | (((var42 & '\ufff8') >> 3 | var42 << '\r') ^ 118) + 254 << 11
                                                               )
                                                               + 126
                                                               + 134
                                                            & 65520
                                                      )
                                                      >> 4
                                                   | (
                                                            ((((var42 & '\ufff8') >> 3 | var42 << '\r') ^ 118) + 254 & 65504) >> 5
                                                               | (((var42 & '\ufff8') >> 3 | var42 << '\r') ^ 118) + 254 << 11
                                                         )
                                                         + 126
                                                         + 134
                                                      << 12
                                             )
                                             - 46
                                          & 57344
                                    )
                                    >> 13
                                 | (
                                          (
                                                   (
                                                            ((((var42 & '\ufff8') >> 3 | var42 << '\r') ^ 118) + 254 & 65504) >> 5
                                                               | (((var42 & '\ufff8') >> 3 | var42 << '\r') ^ 118) + 254 << 11
                                                         )
                                                         + 126
                                                         + 134
                                                      & 65520
                                                )
                                                >> 4
                                             | (
                                                      ((((var42 & '\ufff8') >> 3 | var42 << '\r') ^ 118) + 254 & 65504) >> 5
                                                         | (((var42 & '\ufff8') >> 3 | var42 << '\r') ^ 118) + 254 << 11
                                                   )
                                                   + 126
                                                   + 134
                                                << 12
                                       )
                                       - 46
                                    << 3
                           )
                           & 64512
                     )
                     >> 10
                  | (
                        (
                                 (
                                          (
                                                   (
                                                            ((((var42 & '\ufff8') >> 3 | var42 << '\r') ^ 118) + 254 & 65504) >> 5
                                                               | (((var42 & '\ufff8') >> 3 | var42 << '\r') ^ 118) + 254 << 11
                                                         )
                                                         + 126
                                                         + 134
                                                      & 65520
                                                )
                                                >> 4
                                             | (
                                                      ((((var42 & '\ufff8') >> 3 | var42 << '\r') ^ 118) + 254 & 65504) >> 5
                                                         | (((var42 & '\ufff8') >> 3 | var42 << '\r') ^ 118) + 254 << 11
                                                   )
                                                   + 126
                                                   + 134
                                                << 12
                                       )
                                       - 46
                                    & 57344
                              )
                              >> 13
                           | (
                                    (
                                             (
                                                      ((((var42 & '\ufff8') >> 3 | var42 << '\r') ^ 118) + 254 & 65504) >> 5
                                                         | (((var42 & '\ufff8') >> 3 | var42 << '\r') ^ 118) + 254 << 11
                                                   )
                                                   + 126
                                                   + 134
                                                & 65520
                                          )
                                          >> 4
                                       | (
                                                ((((var42 & '\ufff8') >> 3 | var42 << '\r') ^ 118) + 254 & 65504) >> 5
                                                   | (((var42 & '\ufff8') >> 3 | var42 << '\r') ^ 118) + 254 << 11
                                             )
                                             + 126
                                             + 134
                                          << 12
                                 )
                                 - 46
                              << 3
                     )
                     << 6
            );
            var13.setCharAt(
               var23,
               (char)(
                  (
                           (
                                 (
                                          (
                                                   (
                                                            (
                                                                     ((((var42 & '\ufff8') >> 3 | var42 << '\r') ^ 118) + 254 & 65504) >> 5
                                                                        | (((var42 & '\ufff8') >> 3 | var42 << '\r') ^ 118) + 254 << 11
                                                                  )
                                                                  + 126
                                                                  + 134
                                                               & 65520
                                                         )
                                                         >> 4
                                                      | (
                                                               ((((var42 & '\ufff8') >> 3 | var42 << '\r') ^ 118) + 254 & 65504) >> 5
                                                                  | (((var42 & '\ufff8') >> 3 | var42 << '\r') ^ 118) + 254 << 11
                                                            )
                                                            + 126
                                                            + 134
                                                         << 12
                                                )
                                                - 46
                                             & 57344
                                       )
                                       >> 13
                                    | (
                                             (
                                                      (
                                                               ((((var42 & '\ufff8') >> 3 | var42 << '\r') ^ 118) + 254 & 65504) >> 5
                                                                  | (((var42 & '\ufff8') >> 3 | var42 << '\r') ^ 118) + 254 << 11
                                                            )
                                                            + 126
                                                            + 134
                                                         & 65520
                                                   )
                                                   >> 4
                                                | (
                                                         ((((var42 & '\ufff8') >> 3 | var42 << '\r') ^ 118) + 254 & 65504) >> 5
                                                            | (((var42 & '\ufff8') >> 3 | var42 << '\r') ^ 118) + 254 << 11
                                                      )
                                                      + 126
                                                      + 134
                                                   << 12
                                          )
                                          - 46
                                       << 3
                              )
                              & 64512
                        )
                        >> 10
                     | (
                           (
                                    (
                                             (
                                                      (
                                                               ((((var42 & '\ufff8') >> 3 | var42 << '\r') ^ 118) + 254 & 65504) >> 5
                                                                  | (((var42 & '\ufff8') >> 3 | var42 << '\r') ^ 118) + 254 << 11
                                                            )
                                                            + 126
                                                            + 134
                                                         & 65520
                                                   )
                                                   >> 4
                                                | (
                                                         ((((var42 & '\ufff8') >> 3 | var42 << '\r') ^ 118) + 254 & 65504) >> 5
                                                            | (((var42 & '\ufff8') >> 3 | var42 << '\r') ^ 118) + 254 << 11
                                                      )
                                                      + 126
                                                      + 134
                                                   << 12
                                          )
                                          - 46
                                       & 57344
                                 )
                                 >> 13
                              | (
                                       (
                                                (
                                                         ((((var42 & '\ufff8') >> 3 | var42 << '\r') ^ 118) + 254 & 65504) >> 5
                                                            | (((var42 & '\ufff8') >> 3 | var42 << '\r') ^ 118) + 254 << 11
                                                      )
                                                      + 126
                                                      + 134
                                                   & 65520
                                             )
                                             >> 4
                                          | (
                                                   ((((var42 & '\ufff8') >> 3 | var42 << '\r') ^ 118) + 254 & 65504) >> 5
                                                      | (((var42 & '\ufff8') >> 3 | var42 << '\r') ^ 118) + 254 << 11
                                                )
                                                + 126
                                                + 134
                                             << 12
                                    )
                                    - 46
                                 << 3
                        )
                        << 6
               )
            );
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = (686731553 | -140343239) ^ -1132231; var29 < var16.length(); var29 += (-1221933944 & -1221933944 | 1) & 1082392609) {
            int var52 = var16.charAt(var29);
            int var95 = (var52 & 65535) >> 0;
            int var53 = ((var52 & 65535) >> 0 | var52 << 16) ^ 247;
            int var96 = ((((var52 & 65535) >> 0 | var52 << 16) ^ 247) & 49152) >> 14;
            var52 = (((((var95 | var52 << 16) ^ 247) & 49152) >> 14 | (((var52 & 65535) >> 0 | var52 << 16) ^ 247) << 2) ^ 0) - 0;
            var95 = (((var96 | var53 << 2) ^ 0) - 0 & 65024) >> 9;
            int var55 = (((var96 | var53 << 2) ^ 0) - 0 & 65024) >> 9 | var52 << 7;
            int var98 = (((((var96 | var53 << 2) ^ 0) - 0 & 65024) >> 9 | var52 << 7) & 0) >> 16;
            var52 = (((var95 | var52 << 7) & 0) >> 16 | ((((var96 | var53 << 2) ^ 0) - 0 & 65024) >> 9 | var52 << 7) << 0) ^ 172;
            var95 = (((var98 | var55 << 0) ^ 172) & 0) >> 16;
            int var57 = (((var98 | var55 << 0) ^ 172) & 0) >> 16 | var52 << 0;
            int var100 = (((((var98 | var55 << 0) ^ 172) & 0) >> 16 | var52 << 0) & 65535) >> 0;
            char var58 = (char)(((var95 | var52 << 0) & 65535) >> 0 | ((((var98 | var55 << 0) ^ 172) & 0) >> 16 | var52 << 0) << 16);
            var16.setCharAt(var29, (char)(var100 | var57 << 16));
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_241.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = 814967275 >> (1469385868 ^ -211970743) ^ 25467727; var35 < var19.length(); var35 += (-1341146129 >>> -951654232 | 1) & 620769281) {
            int var63 = var19.charAt(var35) ^ 'g';
            int var101 = (var63 & 65532) >> 2;
            int var64 = (var63 & 65532) >> 2 | var63 << 14;
            int var102 = (((var63 & 65532) >> 2 | var63 << 14) & 57344) >> 13;
            var63 = ((((var101 | var63 << 14) & 57344) >> 13 | ((var63 & 65532) >> 2 | var63 << 14) << 3) + 49 ^ 246 ^ 215) - 27 - 164;
            var101 = (((var102 | var64 << 3) + 49 ^ 246 ^ 215) - 27 - 164 & 65024) >> 9;
            int var66 = (((var102 | var64 << 3) + 49 ^ 246 ^ 215) - 27 - 164 & 65024) >> 9 | var63 << 7;
            int var104 = (((((var102 | var64 << 3) + 49 ^ 246 ^ 215) - 27 - 164 & 65024) >> 9 | var63 << 7) & 0) >> 16;
            char var67 = (char)(((var101 | var63 << 7) & 0) >> 16 | ((((var102 | var64 << 3) + 49 ^ 246 ^ 215) - 27 - 164 & 65024) >> 9 | var63 << 7) << 0);
            var19.setCharAt(var35, (char)(var104 | var66 << 0));
         }

         Class var7 = Class.forName(var19.toString(), false, Class_241.class.getClassLoader());
         switch ((((var4 ^ 1364145146) - 2030781104 - 164355817 ^ 2098338076) + 762158326 - 101667917 ^ 1352220789) + 650211623 - 606903751 - 829248165) {
            case 249520734:
            case 1845573786:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 447226831:
               var10000 = var0.findConstructor(var7, var6);
               break;
            case 1248489865:
               var10000 = var0.findSpecial(var7, var5, var6, Class_241.class);
               break;
            case 1441303402:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_1912[(((var10 ^ 641500790) - 1911976544 + 676669831 - 138241081 ^ 800044666) - 286677704 ^ 1471527474) + 1801995647 + 109989328 + 1754445224] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1414(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = (var10 ^ 1591353508 ^ 788849464 ^ 1816547735 ^ 519685794 ^ 1552825702 ^ 1907871423 ^ 886588061) - 1089573080 + 1382836249;
      MethodHandle var10000 = field_1912[(var10 ^ 1591353508 ^ 788849464 ^ 1816547735 ^ 519685794 ^ 1552825702 ^ 1907871423 ^ 886588061)
            - 1089573080
            + 1382836249
         ^ 1562926496];
      if (field_1912[var10001 ^ 1562926496] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = 79763498 << -516741163 ^ 88080384; var24 < var14.length(); var24 += (160380707 | -1989629507 | 0) & 1442857025) {
            int var43 = var14.charAt(var24) - '~' - 189;
            char var46 = (char)(
               (
                        (
                                 ((((var43 & 65504) >> 5 | var43 << 11) + 34 - 252 ^ 234) - 210 & 65528) >> 3
                                    | (((var43 & 65504) >> 5 | var43 << 11) + 34 - 252 ^ 234) - 210 << 13
                              )
                              - 18
                           & 65504
                     )
                     >> 5
                  | (
                           ((((var43 & 65504) >> 5 | var43 << 11) + 34 - 252 ^ 234) - 210 & 65528) >> 3
                              | (((var43 & 65504) >> 5 | var43 << 11) + 34 - 252 ^ 234) - 210 << 13
                        )
                        - 18
                     << 11
            );
            var14.setCharAt(
               var24,
               (char)(
                  (
                           (
                                    ((((var43 & 65504) >> 5 | var43 << 11) + 34 - 252 ^ 234) - 210 & 65528) >> 3
                                       | (((var43 & 65504) >> 5 | var43 << 11) + 34 - 252 ^ 234) - 210 << 13
                                 )
                                 - 18
                              & 65504
                        )
                        >> 5
                     | (
                              ((((var43 & 65504) >> 5 | var43 << 11) + 34 - 252 ^ 234) - 210 & 65528) >> 3
                                 | (((var43 & 65504) >> 5 | var43 << 11) + 34 - 252 ^ 234) - 210 << 13
                           )
                           - 18
                        << 11
               )
            );
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = (-1597662590 + -1597662590 | 0) & 644121298; var30 < var17.length(); var30 += (1524974027 - -1554478675 | 1) & 1077085473) {
            int var51 = var17.charAt(var30) - 18;
            int var84 = (var51 & 65504) >> 5;
            int var52 = (var51 & 65504) >> 5 | var51 << 11;
            int var85 = (((var51 & 65504) >> 5 | var51 << 11) & 65532) >> 2;
            var51 = (((var84 | var51 << 11) & 65532) >> 2 | ((var51 & 65504) >> 5 | var51 << 11) << 14) + 150 - 130 ^ 129;
            var84 = (((var85 | var52 << 14) + 150 - 130 ^ 129) & 65534) >> 1;
            int var54 = ((((var85 | var52 << 14) + 150 - 130 ^ 129) & 65534) >> 1 | var51 << 15) + 45;
            int var87 = (((((var85 | var52 << 14) + 150 - 130 ^ 129) & 65534) >> 1 | var51 << 15) + 45 & 65535) >> 0;
            char var55 = (char)(
               (((var84 | var51 << 15) + 45 & 65535) >> 0 | ((((var85 | var52 << 14) + 150 - 130 ^ 129) & 65534) >> 1 | var51 << 15) + 45 << 16) + 4
            );
            var17.setCharAt(var30, (char)((var87 | var54 << 16) + 4));
         }

         Class var6 = Class.forName(var17.toString(), false, Class_241.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = (-513234448 * 1125767448 | 0) & -2147319725; var36 < var20.length(); var36 += 740425759 * 151138913 ^ 1948654014) {
            int var60 = var20.charAt(var36) - 'P' + 42 - 184;
            char var63 = (char)(
               (
                     (((((var60 & 64512) >> 10 | var60 << 6) + 204 & 65520) >> 4 | ((var60 & 64512) >> 10 | var60 << 6) + 204 << 12) + 78 & 0) >> 16
                        | ((((var60 & 64512) >> 10 | var60 << 6) + 204 & 65520) >> 4 | ((var60 & 64512) >> 10 | var60 << 6) + 204 << 12) + 78 << 0
                  )
                  - 181
                  - 18
            );
            var20.setCharAt(
               var36,
               (char)(
                  (
                        (((((var60 & 64512) >> 10 | var60 << 6) + 204 & 65520) >> 4 | ((var60 & 64512) >> 10 | var60 << 6) + 204 << 12) + 78 & 0) >> 16
                           | ((((var60 & 64512) >> 10 | var60 << 6) + 204 & 65520) >> 4 | ((var60 & 64512) >> 10 | var60 << 6) + 204 << 12) + 78 << 0
                     )
                     - 181
                     - 18
               )
            );
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_241.class.getClassLoader()).returnType();
         switch (((var4 ^ 2034955814) - 1200409470 - 1060601111 + 1411726434 + 662810596 - 883664620 ^ 1438949059 ^ 1531695316) + 340635173 - 406482185) {
            case 128382786:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            case 741294923:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            case 1787248260:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            case 1848803516:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_1912[(var10 ^ 1591353508 ^ 788849464 ^ 1816547735 ^ 519685794 ^ 1552825702 ^ 1907871423 ^ 886588061) - 1089573080 + 1382836249 ^ 1562926496] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
