import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;
import net.minecraft.class_1268;
import net.minecraft.class_1511;
import net.minecraft.class_243;
import net.minecraft.class_3966;
import net.minecraft.class_2824.class_5908;

public class Class_213 implements class_5908 {
   // $VF: renamed from: heq java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_493 = new MethodHandle[20];

   public Class_213(Class_270 var1) {
      this.field_492 = var1;
      super();
   }

   public void method_34219(class_1268 var1) {
   }

   public void method_34220(class_1268 var1, class_243 var2) {
   }

   public void method_34218() {
      int var3 = -1852003684;
      if (1<"JNT",-1153558748,"ᢓ\uf090႓䢓\u0893ꂐゑ悑频邑","W³OŗS£W³\u008bG\u0083·Oŗ\u008b¯\u0083KK\u009bŋŃş","嘋型栋礋疋簋媋禋瞋礋疋璋笋王甋簋媋璋砋王粋粋犋嬋岋律悋",1491319411>(
            0<"JNT",333467404,"䑉䁉㍉","韭뀜젞砞㿬迭뀜ꀟ栞\uf01e忬ꠟ蠟ꀟ栞砞쀞䠞怞\uf01e忬砞뀟䠞\uf81e\uf81e\ud81f￬쿬ퟬ㿬","뱃䱅",-1222921079>(
               1<"JNT",-1153558748,"颓\uf090낐","SG","嘋型栋箋璋悋",1491319417>(this)
            )
         )
         != null) {
         var3 = (1157118388 & 1157118388 | -2113874426) & -2029125810;

         while (true) {
            switch (var3 + 1597316928 - 1213124191 - 87511053 - 371970301 - 1334370228 ^ 1416009354) {
               case 194462350:
                  return;
               case 1717950883:
            }

            if (0<"JNT",1109373810,"㥉ㅉ䁉㑉㭉ぉ⭉﵈͉͉щｈ","韭迭뀜ꀟ栞\uf01e忬ꠟ蠟ꀟ栞砞쀞䠞怞\uf01e忬砞뀟䠞\uf81e\uf81e\ud81f쟬￬\u0fec矬砞뀟䠞\uf81e\uf81e\ud81f쟬\uf7ecퟬ㿬","ꑃ居푃ꑅ鱃籃ꑃ居䱅쑃㱅摅푃ꑅ䱅鑃㱅챃챃ⱅ쑅책ﱅ",-1222921064>(
                     1<"JNT",-1153558748,"ᢓ\uf090႓䢓\u0893ꂐゑ悑频邑","W³OŗS£W³\u008bG\u0083·Oŗ\u008b¯\u0083KK\u009bŋŃş","嘋型栋礋疋簋媋禋瞋礋疋璋笋王甋簋媋璋砋王粋粋犋嬋岋律悋",1491319398>(
                        0<"JNT",333467404,"䅉㭉","韭뀜젞砞㿬迭뀜ꀟ栞\uf01e忬ꠟ蠟ꀟ栞砞쀞䠞怞\uf01e忬砞뀟䠞\uf81e\uf81e\ud81f￬쿬ퟬ㿬","뱃䱅",-1222920982>(
                           1<"JNT",-1153558748,"颓\uf090낐","SG","嘋型栋箋璋悋",1491319396>(this)
                        )
                     )
                  )
                  == 1<"JNT",-79469338,"ᢓ\uf090႓䢓\u0893ꂐゑ肑肑ゑ","W³OŗS£W³\u008bG\u0083·Oŗ\u008b¯\u0083KK\u009bŇŋţƏ\u008b¯\u0083KK\u009bŇŏş","嘋型栋礋疋簋媋禋瞋礋疋璋笋王甋簋媋璋砋王粋粋犋嬋岋律吋璋砋王粋粋犋嬋尋娋悋",1491319392>()
               && 1<"JNT",-1153558748,"ᢓ\uf090႓䢓\u0893ꂐゑ悑频邑","W³OŗS£W³\u008bG\u0083·Oŗ\u008b¯\u0083KK\u009bŋŃş","嘋型栋礋疋簋媋禋瞋礋疋璋笋王甋簋媋璋砋王粋粋犋嬋岋律悋",1491319423>(
                  0<"JNT",333467404,"䕉䅉㽉","韭뀜젞砞㿬迭뀜ꀟ栞\uf01e忬ꠟ蠟ꀟ栞砞쀞䠞怞\uf01e忬砞뀟䠞\uf81e\uf81e\ud81f￬쿬ퟬ㿬","뱃䱅",-1222921059>(
                     1<"JNT",-1153558748,"颓\uf090낐","SG","嘋型栋箋璋悋",1491319413>(this)
                  )
               ) instanceof class_3966 var1
               && 0<"JNT",1109373810,"㥉ㅉ䁉㑉㭉ぉ⭉﵈͉͉щ﹈","韭迭뀜ꀟ栞\uf01e忬ꠟ蠟ꀟ栞砞쀞䠞怞\uf01e忬砞뀟䠞\uf81e\uf81e\ud81f쿬쟬\u0fec頜㿬","ꑃ居푃ꑅ鱃籃ꑃ居䱅쑃㱅摅푃ꑅ䱅鑃㱅챃챃ⱅ책ﱅ\ue445\ue445",-1222921069>(
                  var1
               ) instanceof class_1511) {
               0<"JNT",1109373810,"㥉ㅉ䁉㑉㭉ぉ⭉ŉɉŉﱈ","韭뀜ꀟ栞\uf01e忬ꠟ蠟ꀟ栞砞쀞䠞怞\uf01e忬砞뀟䠞\uf81e\uf81e\ud81f쿬쟬\u0fec頜矬砞뀟䠞\uf81e\uf81e\ud81f\uefec\uefec쟬\u0fec㿬迭\ue01f","ꑃ居푃ꑅ鱃籃ꑃ居䱅쑃㱅摅푃ꑅ䱅鑃㱅챃챃ⱅ뱅쑅ﱅ\uec45",-1222920992>(
                  0<"JNT",1109373810,"㥉ㅉ䁉㑉㭉ぉ⭉﵈͉͉щ﹈","韭迭뀜ꀟ栞\uf01e忬ꠟ蠟ꀟ栞砞쀞䠞怞\uf01e忬砞뀟䠞\uf81e\uf81e\ud81f쿬쟬\u0fec頜㿬","ꑃ居푃ꑅ鱃籃ꑃ居䱅쑃㱅摅푃ꑅ䱅鑃㱅챃챃ⱅ책ﱅ\ue445\ue445",-1222921070>(
                     var1
                  ),
                  1<"JNT",-79469338,"ᢓ\uf090႓䢓\u0893ꂐ㢑频炑炑梑","W³OŗS£W³\u008bG\u0083·Oŗ\u008b¯\u0083KK\u009bŃŇţŻƏ\u008b¯\u0083KK\u009bųųŇţ","嘋型栋礋疋簋媋禋瞋礋疋璋笋王甋簋媋璋砋王粋粋犋宋嬋律庋吋璋砋王粋粋犋嶋嶋嬋律悋",1491319422>()
               );
               0<"JNT",1109373810,"㥉ㅉ䁉㑉㭉ぉ⭉ｈ﵈͉Iŉ","韭뀜ꀟ栞\uf01e忬ꠟ蠟ꀟ栞砞쀞䠞怞\uf01e忬砞뀟䠞\uf81e\uf81e\ud81f쿬쟬\u0fec頜矬砞뀟䠞\uf81e\uf81e\ud81f\uefec\uefec쟬\u0fec㿬迭\ue01f","ꑃ居푃ꑅ鱃籃ꑃ居䱅쑃㱅摅푃ꑅ䱅鑃㱅챃챃ⱅ뱅쑅ﱅ\uec45",-1222920987>(
                  0<"JNT",1109373810,"㥉ㅉ䁉㑉㭉ぉ⭉﵈͉͉щ﹈","韭迭뀜ꀟ栞\uf01e忬ꠟ蠟ꀟ栞砞쀞䠞怞\uf01e忬砞뀟䠞\uf81e\uf81e\ud81f쿬쟬\u0fec頜㿬","ꑃ居푃ꑅ鱃籃ꑃ居䱅쑃㱅摅푃ꑅ䱅鑃㱅챃챃ⱅ책ﱅ\ue445\ue445",-1222920985>(
                     var1
                  ),
                  1<"JNT",-79469338,"ᢓ\uf090႓䢓\u0893ꂐ㢑频炑炑梑","W³OŗS£W³\u008bG\u0083·Oŗ\u008b¯\u0083KK\u009bŃŇţŻƏ\u008b¯\u0083KK\u009bųųŇţ","嘋型栋礋疋簋媋禋瞋礋疋璋笋王甋簋媋璋砋王粋粋犋宋嬋律庋吋璋砋王粋粋犋嶋嶋嬋律悋",1491318157>()
               );
               0<"JNT",1109373810,"㥉ㅉ䁉㑉㭉ぉ⭉ｈɉ﹈ﱈՉ","韭迭\ue01f","ꑃ居푃ꑅ鱃籃ꑃ居䱅쑃㱅摅푃ꑅ䱅鑃㱅챃챃ⱅ뱅쑅ﱅ\uec45",-1222921061>(
                  0<"JNT",1109373810,"㥉ㅉ䁉㑉㭉ぉ⭉﵈͉͉щ﹈","韭迭뀜ꀟ栞\uf01e忬ꠟ蠟ꀟ栞砞쀞䠞怞\uf01e忬砞뀟䠞\uf81e\uf81e\ud81f쿬쟬\u0fec頜㿬","ꑃ居푃ꑅ鱃籃ꑃ居䱅쑃㱅摅푃ꑅ䱅鑃㱅챃챃ⱅ책ﱅ\ue445\ue445",-1222920988>(
                     var1
                  )
               );
            }

            var3 = -1275624479;
         }
      }
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_534(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = (var10 ^ 1866856356) - 736147507 + 133194495 + 1384530633 - 1293661565 - 174587943 - 36915233 - 2122587126 ^ 1393148407;
      MethodHandle var10000 = field_493[(
            (var10 ^ 1866856356) - 736147507 + 133194495 + 1384530633 - 1293661565 - 174587943 - 36915233 - 2122587126 ^ 1393148407
         )
         - 2108741342];
      if (field_493[var10001 - 2108741342] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = (62622630 | 1472539176 | 0) & -2013245360;
            var23 < var13.length();
            var23 += (608313590 * (-7185972 << 608313590 - -7185972) | 1) & 366733
         ) {
            char var42 = var13.charAt(var23);
            char var49 = (char)(
               (
                        (
                                 (
                                          (
                                                (
                                                         (
                                                               (
                                                                        (
                                                                              (
                                                                                       (
                                                                                                (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                                                   | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                                             )
                                                                                             + 237
                                                                                          & 61440
                                                                                    )
                                                                                    >> 12
                                                                                 | (
                                                                                          (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                                             | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                                       )
                                                                                       + 237
                                                                                    << 4
                                                                           )
                                                                           & 65535
                                                                     )
                                                                     >> 0
                                                                  | (
                                                                        (
                                                                                 (
                                                                                          (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                                             | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                                       )
                                                                                       + 237
                                                                                    & 61440
                                                                              )
                                                                              >> 12
                                                                           | (
                                                                                    (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                                       | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                                 )
                                                                                 + 237
                                                                              << 4
                                                                     )
                                                                     << 16
                                                            )
                                                            & 65528
                                                      )
                                                      >> 3
                                                   | (
                                                         (
                                                                  (
                                                                        (
                                                                                 (
                                                                                          (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                                             | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                                       )
                                                                                       + 237
                                                                                    & 61440
                                                                              )
                                                                              >> 12
                                                                           | (
                                                                                    (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                                       | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                                 )
                                                                                 + 237
                                                                              << 4
                                                                     )
                                                                     & 65535
                                                               )
                                                               >> 0
                                                            | (
                                                                  (
                                                                           (
                                                                                    (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                                       | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                                 )
                                                                                 + 237
                                                                              & 61440
                                                                        )
                                                                        >> 12
                                                                     | (
                                                                              (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                                 | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                           )
                                                                           + 237
                                                                        << 4
                                                               )
                                                               << 16
                                                      )
                                                      << 13
                                             )
                                             & 65472
                                       )
                                       >> 6
                                    | (
                                          (
                                                   (
                                                         (
                                                                  (
                                                                        (
                                                                                 (
                                                                                          (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                                             | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                                       )
                                                                                       + 237
                                                                                    & 61440
                                                                              )
                                                                              >> 12
                                                                           | (
                                                                                    (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                                       | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                                 )
                                                                                 + 237
                                                                              << 4
                                                                     )
                                                                     & 65535
                                                               )
                                                               >> 0
                                                            | (
                                                                  (
                                                                           (
                                                                                    (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                                       | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                                 )
                                                                                 + 237
                                                                              & 61440
                                                                        )
                                                                        >> 12
                                                                     | (
                                                                              (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                                 | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                           )
                                                                           + 237
                                                                        << 4
                                                               )
                                                               << 16
                                                      )
                                                      & 65528
                                                )
                                                >> 3
                                             | (
                                                   (
                                                            (
                                                                  (
                                                                           (
                                                                                    (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                                       | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                                 )
                                                                                 + 237
                                                                              & 61440
                                                                        )
                                                                        >> 12
                                                                     | (
                                                                              (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                                 | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                           )
                                                                           + 237
                                                                        << 4
                                                               )
                                                               & 65535
                                                         )
                                                         >> 0
                                                      | (
                                                            (
                                                                     (
                                                                              (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                                 | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                           )
                                                                           + 237
                                                                        & 61440
                                                                  )
                                                                  >> 12
                                                               | (
                                                                        (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                           | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                     )
                                                                     + 237
                                                                  << 4
                                                         )
                                                         << 16
                                                )
                                                << 13
                                       )
                                       << 10
                              )
                              - 185
                              + 32
                           & 65024
                     )
                     >> 9
                  | (
                           (
                                    (
                                          (
                                                   (
                                                         (
                                                                  (
                                                                        (
                                                                                 (
                                                                                          (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                                             | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                                       )
                                                                                       + 237
                                                                                    & 61440
                                                                              )
                                                                              >> 12
                                                                           | (
                                                                                    (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                                       | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                                 )
                                                                                 + 237
                                                                              << 4
                                                                     )
                                                                     & 65535
                                                               )
                                                               >> 0
                                                            | (
                                                                  (
                                                                           (
                                                                                    (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                                       | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                                 )
                                                                                 + 237
                                                                              & 61440
                                                                        )
                                                                        >> 12
                                                                     | (
                                                                              (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                                 | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                           )
                                                                           + 237
                                                                        << 4
                                                               )
                                                               << 16
                                                      )
                                                      & 65528
                                                )
                                                >> 3
                                             | (
                                                   (
                                                            (
                                                                  (
                                                                           (
                                                                                    (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                                       | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                                 )
                                                                                 + 237
                                                                              & 61440
                                                                        )
                                                                        >> 12
                                                                     | (
                                                                              (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                                 | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                           )
                                                                           + 237
                                                                        << 4
                                                               )
                                                               & 65535
                                                         )
                                                         >> 0
                                                      | (
                                                            (
                                                                     (
                                                                              (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                                 | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                           )
                                                                           + 237
                                                                        & 61440
                                                                  )
                                                                  >> 12
                                                               | (
                                                                        (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                           | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                     )
                                                                     + 237
                                                                  << 4
                                                         )
                                                         << 16
                                                )
                                                << 13
                                       )
                                       & 65472
                                 )
                                 >> 6
                              | (
                                    (
                                             (
                                                   (
                                                            (
                                                                  (
                                                                           (
                                                                                    (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                                       | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                                 )
                                                                                 + 237
                                                                              & 61440
                                                                        )
                                                                        >> 12
                                                                     | (
                                                                              (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                                 | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                           )
                                                                           + 237
                                                                        << 4
                                                               )
                                                               & 65535
                                                         )
                                                         >> 0
                                                      | (
                                                            (
                                                                     (
                                                                              (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                                 | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                           )
                                                                           + 237
                                                                        & 61440
                                                                  )
                                                                  >> 12
                                                               | (
                                                                        (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                           | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                     )
                                                                     + 237
                                                                  << 4
                                                         )
                                                         << 16
                                                )
                                                & 65528
                                          )
                                          >> 3
                                       | (
                                             (
                                                      (
                                                            (
                                                                     (
                                                                              (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                                 | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                           )
                                                                           + 237
                                                                        & 61440
                                                                  )
                                                                  >> 12
                                                               | (
                                                                        (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                           | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                     )
                                                                     + 237
                                                                  << 4
                                                         )
                                                         & 65535
                                                   )
                                                   >> 0
                                                | (
                                                      (
                                                               (
                                                                        (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                           | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                     )
                                                                     + 237
                                                                  & 61440
                                                            )
                                                            >> 12
                                                         | (
                                                                  (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                     | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                               )
                                                               + 237
                                                            << 4
                                                   )
                                                   << 16
                                          )
                                          << 13
                                 )
                                 << 10
                        )
                        - 185
                        + 32
                     << 7
            );
            var13.setCharAt(
               var23,
               (char)(
                  (
                           (
                                    (
                                             (
                                                   (
                                                            (
                                                                  (
                                                                           (
                                                                                 (
                                                                                          (
                                                                                                   (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                                                      | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                                                )
                                                                                                + 237
                                                                                             & 61440
                                                                                       )
                                                                                       >> 12
                                                                                    | (
                                                                                             (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                                                | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                                          )
                                                                                          + 237
                                                                                       << 4
                                                                              )
                                                                              & 65535
                                                                        )
                                                                        >> 0
                                                                     | (
                                                                           (
                                                                                    (
                                                                                             (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                                                | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                                          )
                                                                                          + 237
                                                                                       & 61440
                                                                                 )
                                                                                 >> 12
                                                                              | (
                                                                                       (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                                          | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                                    )
                                                                                    + 237
                                                                                 << 4
                                                                        )
                                                                        << 16
                                                               )
                                                               & 65528
                                                         )
                                                         >> 3
                                                      | (
                                                            (
                                                                     (
                                                                           (
                                                                                    (
                                                                                             (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                                                | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                                          )
                                                                                          + 237
                                                                                       & 61440
                                                                                 )
                                                                                 >> 12
                                                                              | (
                                                                                       (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                                          | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                                    )
                                                                                    + 237
                                                                                 << 4
                                                                        )
                                                                        & 65535
                                                                  )
                                                                  >> 0
                                                               | (
                                                                     (
                                                                              (
                                                                                       (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                                          | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                                    )
                                                                                    + 237
                                                                                 & 61440
                                                                           )
                                                                           >> 12
                                                                        | (
                                                                                 (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                                    | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                              )
                                                                              + 237
                                                                           << 4
                                                                  )
                                                                  << 16
                                                         )
                                                         << 13
                                                )
                                                & 65472
                                          )
                                          >> 6
                                       | (
                                             (
                                                      (
                                                            (
                                                                     (
                                                                           (
                                                                                    (
                                                                                             (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                                                | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                                          )
                                                                                          + 237
                                                                                       & 61440
                                                                                 )
                                                                                 >> 12
                                                                              | (
                                                                                       (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                                          | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                                    )
                                                                                    + 237
                                                                                 << 4
                                                                        )
                                                                        & 65535
                                                                  )
                                                                  >> 0
                                                               | (
                                                                     (
                                                                              (
                                                                                       (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                                          | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                                    )
                                                                                    + 237
                                                                                 & 61440
                                                                           )
                                                                           >> 12
                                                                        | (
                                                                                 (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                                    | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                              )
                                                                              + 237
                                                                           << 4
                                                                  )
                                                                  << 16
                                                         )
                                                         & 65528
                                                   )
                                                   >> 3
                                                | (
                                                      (
                                                               (
                                                                     (
                                                                              (
                                                                                       (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                                          | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                                    )
                                                                                    + 237
                                                                                 & 61440
                                                                           )
                                                                           >> 12
                                                                        | (
                                                                                 (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                                    | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                              )
                                                                              + 237
                                                                           << 4
                                                                  )
                                                                  & 65535
                                                            )
                                                            >> 0
                                                         | (
                                                               (
                                                                        (
                                                                                 (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                                    | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                              )
                                                                              + 237
                                                                           & 61440
                                                                     )
                                                                     >> 12
                                                                  | (
                                                                           (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                              | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                        )
                                                                        + 237
                                                                     << 4
                                                            )
                                                            << 16
                                                   )
                                                   << 13
                                          )
                                          << 10
                                 )
                                 - 185
                                 + 32
                              & 65024
                        )
                        >> 9
                     | (
                              (
                                       (
                                             (
                                                      (
                                                            (
                                                                     (
                                                                           (
                                                                                    (
                                                                                             (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                                                | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                                          )
                                                                                          + 237
                                                                                       & 61440
                                                                                 )
                                                                                 >> 12
                                                                              | (
                                                                                       (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                                          | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                                    )
                                                                                    + 237
                                                                                 << 4
                                                                        )
                                                                        & 65535
                                                                  )
                                                                  >> 0
                                                               | (
                                                                     (
                                                                              (
                                                                                       (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                                          | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                                    )
                                                                                    + 237
                                                                                 & 61440
                                                                           )
                                                                           >> 12
                                                                        | (
                                                                                 (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                                    | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                              )
                                                                              + 237
                                                                           << 4
                                                                  )
                                                                  << 16
                                                         )
                                                         & 65528
                                                   )
                                                   >> 3
                                                | (
                                                      (
                                                               (
                                                                     (
                                                                              (
                                                                                       (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                                          | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                                    )
                                                                                    + 237
                                                                                 & 61440
                                                                           )
                                                                           >> 12
                                                                        | (
                                                                                 (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                                    | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                              )
                                                                              + 237
                                                                           << 4
                                                                  )
                                                                  & 65535
                                                            )
                                                            >> 0
                                                         | (
                                                               (
                                                                        (
                                                                                 (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                                    | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                              )
                                                                              + 237
                                                                           & 61440
                                                                     )
                                                                     >> 12
                                                                  | (
                                                                           (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                              | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                        )
                                                                        + 237
                                                                     << 4
                                                            )
                                                            << 16
                                                   )
                                                   << 13
                                          )
                                          & 65472
                                    )
                                    >> 6
                                 | (
                                       (
                                                (
                                                      (
                                                               (
                                                                     (
                                                                              (
                                                                                       (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                                          | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                                    )
                                                                                    + 237
                                                                                 & 61440
                                                                           )
                                                                           >> 12
                                                                        | (
                                                                                 (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                                    | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                              )
                                                                              + 237
                                                                           << 4
                                                                  )
                                                                  & 65535
                                                            )
                                                            >> 0
                                                         | (
                                                               (
                                                                        (
                                                                                 (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                                    | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                              )
                                                                              + 237
                                                                           & 61440
                                                                     )
                                                                     >> 12
                                                                  | (
                                                                           (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                              | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                        )
                                                                        + 237
                                                                     << 4
                                                            )
                                                            << 16
                                                   )
                                                   & 65528
                                             )
                                             >> 3
                                          | (
                                                (
                                                         (
                                                               (
                                                                        (
                                                                                 (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                                    | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                              )
                                                                              + 237
                                                                           & 61440
                                                                     )
                                                                     >> 12
                                                                  | (
                                                                           (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                              | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                        )
                                                                        + 237
                                                                     << 4
                                                            )
                                                            & 65535
                                                      )
                                                      >> 0
                                                   | (
                                                         (
                                                                  (
                                                                           (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                              | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                        )
                                                                        + 237
                                                                     & 61440
                                                               )
                                                               >> 12
                                                            | (
                                                                     (((var42 & '\uffff') >> 0 | var42 << 16) & 64512) >> 10
                                                                        | ((var42 & '\uffff') >> 0 | var42 << 16) << 6
                                                                  )
                                                                  + 237
                                                               << 4
                                                      )
                                                      << 16
                                             )
                                             << 13
                                    )
                                    << 10
                           )
                           - 185
                           + 32
                        << 7
               )
            );
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = (-715938515 << -1360835338 | 0) & 548818662;
            var29 < var16.length();
            var29 += (434181505 - (-1652683304 >> -1121229762) | 1) & -971627999
         ) {
            char var54 = var16.charAt(var29);
            int var97 = (var54 & '\ue000') >> 13;
            int var55 = ((var54 & '\ue000') >> 13 | var54 << 3) ^ 38 ^ 178;
            int var98 = ((((var54 & '\ue000') >> 13 | var54 << 3) ^ 38 ^ 178) & 49152) >> 14;
            var54 = (char)(
               (((((var97 | var54 << 3) ^ 38 ^ 178) & 49152) >> 14 | (((var54 & '\ue000') >> 13 | var54 << 3) ^ 38 ^ 178) << 2) - 200 ^ 251) + 63
                  ^ 247
                  ^ 23
                  ^ 232
            );
            var16.setCharAt(var29, (char)(((var98 | var55 << 2) - 200 ^ 251) + 63 ^ 247 ^ 23 ^ 232));
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_213.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = (-1237480664 * -1430419460 | 0) & 1082165250; var35 < var19.length(); var35 += 1295659509 ^ -957512924 ^ -1948798256) {
            int var61 = var19.charAt(var35);
            int var99 = (var61 & 64512) >> 10;
            int var62 = ((var61 & 64512) >> 10 | var61 << 6) + 186 - 212;
            int var100 = (((var61 & 64512) >> 10 | var61 << 6) + 186 - 212 & 65520) >> 4;
            var61 = ((var99 | var61 << 6) + 186 - 212 & 65520) >> 4 | ((var61 & 64512) >> 10 | var61 << 6) + 186 - 212 << 12;
            var99 = ((var100 | var62 << 12) & 65532) >> 2;
            int var64 = (((var100 | var62 << 12) & 65532) >> 2 | var61 << 14) ^ 71;
            int var102 = (((((var100 | var62 << 12) & 65532) >> 2 | var61 << 14) ^ 71) & 57344) >> 13;
            var61 = (((var99 | var61 << 14) ^ 71) & 57344) >> 13 | ((((var100 | var62 << 12) & 65532) >> 2 | var61 << 14) ^ 71) << 3;
            var99 = ((var102 | var64 << 3) & 61440) >> 12;
            int var66 = (((var102 | var64 << 3) & 61440) >> 12 | var61 << 4) - 102;
            int var104 = ((((var102 | var64 << 3) & 61440) >> 12 | var61 << 4) - 102 & 65532) >> 2;
            char var67 = (char)(((var99 | var61 << 4) - 102 & 65532) >> 2 | (((var102 | var64 << 3) & 61440) >> 12 | var61 << 4) - 102 << 14);
            var19.setCharAt(var35, (char)(var104 | var66 << 14));
         }

         Class var7 = Class.forName(var19.toString(), false, Class_213.class.getClassLoader());
         switch (((var4 ^ 1994896320 ^ 1665200754) - 1897090291 - 397132603 + 1485657384 + 427215670 - 1102582749 ^ 1258598072) + 1792205643 ^ 59423168) {
            case 313163211:
            case 480156982:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 567826577:
               var10000 = var0.findConstructor(var7, var6);
               break;
            case 1260840697:
               var10000 = var0.findSpecial(var7, var5, var6, Class_213.class);
               break;
            case 1378431284:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_493[((var10 ^ 1866856356) - 736147507 + 133194495 + 1384530633 - 1293661565 - 174587943 - 36915233 - 2122587126 ^ 1393148407) - 2108741342] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_535(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = (((var10 ^ 201855600) + 1750852660 - 924812000 ^ 884820998) + 1108423266 + 1545319758 - 363216559 ^ 1326025850) - 261120674;
      MethodHandle var10000 = field_493[(((var10 ^ 201855600) + 1750852660 - 924812000 ^ 884820998) + 1108423266 + 1545319758 - 363216559 ^ 1326025850)
         - 261120674
         - 1686241139];
      if (field_493[var10001 - 1686241139] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = 530034134 ^ -1421155203 ^ -1260566101; var24 < var14.length(); var24 += 1458357899 - 372316402 ^ 1086041496) {
            int var43 = (var14.charAt(var24) ^ 253) + 103 - 168;
            int var10004 = (var43 & 57344) >> 13;
            int var44 = ((var43 & 57344) >> 13 | var43 << 3) - 126 - 133 + 10 ^ 97;
            int var82 = ((((var43 & 57344) >> 13 | var43 << 3) - 126 - 133 + 10 ^ 97) & 49152) >> 14;
            char var45 = (char)(
               ((((var10004 | var43 << 3) - 126 - 133 + 10 ^ 97) & 49152) >> 14 | (((var43 & 57344) >> 13 | var43 << 3) - 126 - 133 + 10 ^ 97) << 2) + 43
            );
            var14.setCharAt(var24, (char)((var82 | var44 << 2) + 43));
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = 754884504 + (-453149058 >>> 567717039) ^ 755001746; var30 < var17.length(); var30 += (-2016472795 << 369996317 | 1) & 252590611) {
            int var50 = var17.charAt(var30);
            int var83 = (var50 & 65528) >> 3;
            int var51 = (((var50 & 65528) >> 3 | var50 << 13) ^ 58) + 31;
            int var84 = ((((var50 & 65528) >> 3 | var50 << 13) ^ 58) + 31 & 64512) >> 10;
            var50 = (((var83 | var50 << 13) ^ 58) + 31 & 64512) >> 10 | (((var50 & 65528) >> 3 | var50 << 13) ^ 58) + 31 << 6;
            var83 = ((var84 | var51 << 6) & 65534) >> 1;
            int var53 = ((var84 | var51 << 6) & 65534) >> 1 | var50 << 15;
            int var86 = ((((var84 | var51 << 6) & 65534) >> 1 | var50 << 15) & 65534) >> 1;
            var50 = (((var83 | var50 << 15) & 65534) >> 1 | (((var84 | var51 << 6) & 65534) >> 1 | var50 << 15) << 15) - 58;
            var83 = ((var86 | var53 << 15) - 58 & 65534) >> 1;
            int var55 = (((var86 | var53 << 15) - 58 & 65534) >> 1 | var50 << 15) - 170;
            int var88 = ((((var86 | var53 << 15) - 58 & 65534) >> 1 | var50 << 15) - 170 & 65532) >> 2;
            char var56 = (char)(((var83 | var50 << 15) - 170 & 65532) >> 2 | (((var86 | var53 << 15) - 58 & 65534) >> 1 | var50 << 15) - 170 << 14);
            var17.setCharAt(var30, (char)(var88 | var55 << 14));
         }

         Class var6 = Class.forName(var17.toString(), false, Class_213.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = (1932045371 | -115133998) ^ -81019397; var36 < var20.length(); var36 += -1596390067 - -586913853 ^ -1009476213) {
            int var61 = var20.charAt(var36) - 'w' - 224;
            int var89 = (var61 & 65535) >> 0;
            int var62 = (((var61 & 65535) >> 0 | var61 << 16) + 194 + 64 - 182 ^ 199) - 199;
            int var90 = ((((var61 & 65535) >> 0 | var61 << 16) + 194 + 64 - 182 ^ 199) - 199 & 65408) >> 7;
            char var63 = (char)(
               ((((var89 | var61 << 16) + 194 + 64 - 182 ^ 199) - 199 & 65408) >> 7 | (((var61 & 65535) >> 0 | var61 << 16) + 194 + 64 - 182 ^ 199) - 199 << 9)
                  - 130
            );
            var20.setCharAt(var36, (char)((var90 | var62 << 9) - 130));
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_213.class.getClassLoader()).returnType();
         switch ((((var4 ^ 828876646) - 1503283190 + 1180465020 ^ 894081438) - 1358618629 ^ 1864591215 ^ 1203293907 ^ 1375218466) - 878473521 ^ 764589340) {
            case 988226496:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            case 1109290846:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            case 1663057507:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            case 2118895234:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_493[(((var10 ^ 201855600) + 1750852660 - 924812000 ^ 884820998) + 1108423266 + 1545319758 - 363216559 ^ 1326025850) - 261120674 - 1686241139] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
