import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;

public class Class_80 extends Class_342 {
   // $VF: renamed from: rd Class_115
   public Class_115 field_2178;
   // $VF: renamed from: wb Class_49
   public Class_49 field_2179;
   // $VF: renamed from: ks Class_105
   public Class_105 field_2180;
   // $VF: renamed from: oht Class_49
   public Class_49 field_2181;
   // $VF: renamed from: at boolean
   public boolean field_2182;
   // $VF: renamed from: tg boolean
   public boolean field_2183;
   // $VF: renamed from: dk int
   public int field_2184;
   // $VF: renamed from: fd int
   public int field_2185;
   // $VF: renamed from: nm int
   public int field_2186;
   // $VF: renamed from: jl int
   public int field_2187;
   // $VF: renamed from: bvi java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_2188 = new MethodHandle[(-1267563565 | -1267563565 | 9) & 42819721];

   public Class_80() {
      int var10001 = 0 ^ 0;

      StringBuilder var10002;
      for (var10002 = (StringBuilder)0<"JNT",734202247,"란瞋㞌瞋랎㞀","ᄜ錩팥㌥匨㌥猝錥㌥匥猦猝\uf32c錨패㌤匥猦\uf31fㄜ匬","ꑆ㑆摇㑆\ue442쑆㑆\ue446鑆\ue442呅䑇⑇둆\ue446鑆⑄瑇둆쑆䑆瑆⑇",-42245023>(
            "㈑㼑㻑㶑⧑㍑㰑㹑㬑㾑㶑㹑㲑"
         );
         var10001 < (1922253443 >> (1457275870 >>> -1329506164) ^ 120140837);
         var10001 += -1190894744 * 857568510 ^ -1976712911
      ) {
         int var26 = 0<"JNT",-1893106882,"\uf788랋瞉㞍瞁랎","ᄜ㌨ㄜ\uf32a","ꑆ㑆摇㑆\ue442쑆㑆\ue446鑆\ue442呅䑇⑇둆\ue446鑆⑄瑇둆쑆䑆瑆⑇",-42245024>(var10002, var10001) + 239;
         char var29 = (char)(
            (
                  (((((var26 & 65534) >> 1 | var26 << 15) & 65504) >> 5 | ((var26 & 65534) >> 1 | var26 << 15) << 11) & 65535) >> 0
                     | ((((var26 & 65534) >> 1 | var26 << 15) & 65504) >> 5 | ((var26 & 65534) >> 1 | var26 << 15) << 11) << 16
               )
               - 139
         );
         0<"JNT",-1893106882,"\uf78c瞊랎\uf780랋瞉㞍瞁랎","ᄜ㌨\uf32aㄜ匬","ꑆ㑆摇㑆\ue442쑆㑆\ue446鑆\ue442呅䑇⑇둆\ue446鑆⑄瑇둆쑆䑆瑆⑇",-42245025>(
            var10002,
            var10001,
            (char)(
               (
                     (((((var26 & 65534) >> 1 | var26 << 15) & 65504) >> 5 | ((var26 & 65534) >> 1 | var26 << 15) << 11) & 65535) >> 0
                        | ((((var26 & 65534) >> 1 | var26 << 15) & 65504) >> 5 | ((var26 & 65534) >> 1 | var26 << 15) << 11) << 16
                  )
                  - 139
            )
         );
      }

      String var2 = 0<"JNT",-1893106882,"랎\uf78b\uf784랎㞍瞋㞌\uf789","ᄜㄜ錩팥㌥匨㌥猝錥㌥匥猦猝\uf32c錨패㌤匥猦\uf31f","ꑆ㑆摇㑆\ue442쑆㑆\ue446鑆\ue442呅䑇⑇둆\ue446鑆⑄瑇둆쑆䑆瑆⑇",-42245030>(
         var10002
      );
      int var14 = (-1721248292 | 596739157 | 0) & 67641890;

      StringBuilder var31;
      for (var31 = (StringBuilder)0<"JNT",734202247,"란瞋㞌瞋랎㞀","ᄜ錩팥㌥匨㌥猝錥㌥匥猦猝\uf32c錨패㌤匥猦\uf31fㄜ匬","ꑆ㑆摇㑆\ue442쑆㑆\ue446鑆\ue442呅䑇⑇둆\ue446鑆⑄瑇둆쑆䑆瑆⑇",-42245031>(
            "ꚿ\ueebf튿\ue8bf욿킿쪿\ue6bf䂿\ue8bf\udebf䂿슿䂿첿튿\ue4bf쪿\ueebf\udebf\ue4bf횿䂿슿\udcbf좿䂿\ueabf\ue6bf쪿\ue6bf䂿튿\ue8bf䂿\ueebf킿쪿\udcbf䂿\uf2bf\udebf\ueabf䂿\ue0bf\ue4bf쪿\ue6bf\ue6bf䂿슿䂿쒿튿\udcbf좿岿"
         );
         var14 < (414324714 >>> 414324714 ^ 404668);
         var14 += (-958711106 ^ -958711106 | 1) & -40103529
      ) {
         int var57 = 0<"JNT",-1893106882,"\uf788랋瞉㞍瞁랎","ᄜ㌨ㄜ\uf32a","ꑆ㑆摇㑆\ue442쑆㑆\ue446鑆\ue442呅䑇⑇둆\ue446鑆⑄瑇둆쑆䑆瑆⑇",-42245026>(var31, var14) - 141 - 49;
         int var10006 = (var57 & 65520) >> 4;
         int var58 = (var57 & 65520) >> 4 | var57 << 12;
         int var86 = (((var57 & 65520) >> 4 | var57 << 12) & 65504) >> 5;
         char var59 = (char)((((var10006 | var57 << 12) & 65504) >> 5 | ((var57 & 65520) >> 4 | var57 << 12) << 11) - 128);
         0<"JNT",-1893106882,"\uf78c瞊랎\uf780랋瞉㞍瞁랎","ᄜ㌨\uf32aㄜ匬","ꑆ㑆摇㑆\ue442쑆㑆\ue446鑆\ue442呅䑇⑇둆\ue446鑆⑄瑇둆쑆䑆瑆⑇",-42245027>(
            var31, var14, (char)((var86 | var58 << 11) - 128)
         );
      }

      super(
         var2,
         0<"JNT",-1893106882,"랎\uf78b\uf784랎㞍瞋㞌\uf789","ᄜㄜ錩팥㌥匨㌥猝錥㌥匥猦猝\uf32c錨패㌤匥猦\uf31f","ꑆ㑆摇㑆\ue442쑆㑆\ue446鑆\ue442呅䑇⑇둆\ue446鑆⑄瑇둆쑆䑆瑆⑇",-42245045>(var31),
         -1,
         1<"JNT",541184840,"튚튂퉮","湜沬","\ue6bd\ue7bd\u0ab4㞴₴尿",1672424620>()
      );
      var10001 = (2040157454 >> 1230052399 | 0) & 1500907712;

      for (var10002 = (StringBuilder)0<"JNT",734202247,"란瞋㞌瞋랎㞀","ᄜ錩팥㌥匨㌥猝錥㌥匥猦猝\uf32c錨패㌤匥猦\uf31fㄜ匬","ꑆ㑆摇㑆\ue442쑆㑆\ue446鑆\ue442呅䑇⑇둆\ue446鑆⑄瑇둆쑆䑆瑆⑇",-42245047>(
            "\u0ff0ᄀᆈᄰᆘჰᆈᄐ\u0ee8၀ᄐᆰ"
         );
         var10001 < ((-1230224642 << -477136942 | 12) & 805747934);
         var10001 += 1426254834 & -1734474097 ^ 268567171
      ) {
         char var34 = 0<"JNT",-1893106882,"\uf788랋瞉㞍瞁랎","ᄜ㌨ㄜ\uf32a","ꑆ㑆摇㑆\ue442쑆㑆\ue446鑆\ue442呅䑇⑇둆\ue446鑆⑄瑇둆쑆䑆瑆⑇",-42245028>(var10002, var10001);
         int var77 = (var34 & '\ufff0') >> 4;
         int var35 = ((var34 & '\ufff0') >> 4 | var34 << '\f') - 2 - 164;
         int var78 = (((var34 & '\ufff0') >> 4 | var34 << '\f') - 2 - 164 & 32768) >> 15;
         char var36 = (char)((((var77 | var34 << '\f') - 2 - 164 & 32768) >> 15 | ((var34 & '\ufff0') >> 4 | var34 << '\f') - 2 - 164 << 1) - 113);
         0<"JNT",-1893106882,"\uf78c瞊랎\uf780랋瞉㞍瞁랎","ᄜ㌨\uf32aㄜ匬","ꑆ㑆摇㑆\ue442쑆㑆\ue446鑆\ue442呅䑇⑇둆\ue446鑆⑄瑇둆쑆䑆瑆⑇",-42245029>(
            var10002, var10001, (char)((var78 | var35 << 1) - 113)
         );
      }

      this.field_2178 = (Class_115)0<"JNT",734202247,"란瞋㞌瞋랎㞀","ᄜ錩팥㌥匨㌥猝錥㌥匥猦猝\uf32c錨패㌤匥猦\uf31f㌨팫ㄜ匬","葆㑇",-42245021>(
         0<"JNT",-1893106882,"랎\uf78b\uf784랎㞍瞋㞌\uf789","ᄜㄜ錩팥㌥匨㌥猝錥㌥匥猦猝\uf32c錨패㌤匥猦\uf31f","ꑆ㑆摇㑆\ue442쑆㑆\ue446鑆\ue442呅䑇⑇둆\ue446鑆⑄瑇둆쑆䑆瑆⑇",-42245020>(var10002),
         -1,
         false
      );
      var10001 = 0;

      for (var10002 = (StringBuilder)0<"JNT",734202247,"란瞋㞌瞋랎㞀","ᄜ錩팥㌥匨㌥猝錥㌥匥猦猝\uf32c錨패㌤匥猦\uf31fㄜ匬","ꑆ㑆摇㑆\ue442쑆㑆\ue446鑆\ue442呅䑇⑇둆\ue446鑆⑄瑇둆쑆䑆瑆⑇",-42245022>(
            "렖㠡렢㠧㠫"
         );
         var10001 < ((914797272 - 723320868 | 5) & -796901105);
         var10001 += -745839574 * (-745839574 - -745839574) ^ 1
      ) {
         char var39 = 0<"JNT",-1893106882,"\uf788랋瞉㞍瞁랎","ᄜ㌨ㄜ\uf32a","ꑆ㑆摇㑆\ue442쑆㑆\ue446鑆\ue442呅䑇⑇둆\ue446鑆⑄瑇둆쑆䑆瑆⑇",-42244989>(var10002, var10001);
         char var42 = (char)(
            ((((((var39 & '\uf800') >> 11 | var39 << 5) ^ 163) & 65532) >> 2 | (((var39 & '\uf800') >> 11 | var39 << 5) ^ 163) << 14) + 115 & 65532) >> 2
               | (((((var39 & '\uf800') >> 11 | var39 << 5) ^ 163) & 65532) >> 2 | (((var39 & '\uf800') >> 11 | var39 << 5) ^ 163) << 14) + 115 << 14
         );
         0<"JNT",-1893106882,"\uf78c瞊랎\uf780랋瞉㞍瞁랎","ᄜ㌨\uf32aㄜ匬","ꑆ㑆摇㑆\ue442쑆㑆\ue446鑆\ue442呅䑇⑇둆\ue446鑆⑄瑇둆쑆䑆瑆⑇",-42244990>(
            var10002,
            var10001,
            (char)(
               ((((((var39 & '\uf800') >> 11 | var39 << 5) ^ 163) & 65532) >> 2 | (((var39 & '\uf800') >> 11 | var39 << 5) ^ 163) << 14) + 115 & 65532) >> 2
                  | (((((var39 & '\uf800') >> 11 | var39 << 5) ^ 163) & 65532) >> 2 | (((var39 & '\uf800') >> 11 | var39 << 5) ^ 163) << 14) + 115 << 14
            )
         );
      }

      this.field_2179 = (Class_49)0<"JNT",734202247,"란瞋㞌瞋랎㞀","ᄜ錩팥㌥匨㌥猝錥㌥匥猦猝\uf32c錨패㌤匥猦\uf31f錪錪錪錪ㄜ匬","䑆呆",-42244994>(
         0<"JNT",-1893106882,"랎\uf78b\uf784랎㞍瞋㞌\uf789","ᄜㄜ錩팥㌥匨㌥猝錥㌥匥猦猝\uf32c錨패㌤匥猦\uf31f","ꑆ㑆摇㑆\ue442쑆㑆\ue446鑆\ue442呅䑇⑇둆\ue446鑆⑄瑇둆쑆䑆瑆⑇",-42244993>(var10002),
         0.0,
         20.0,
         0.0,
         1.0
      );
      var10001 = -755442864 >>> (-1676940568 >>> 785527995) ^ 6751;

      for (var10002 = (StringBuilder)0<"JNT",734202247,"란瞋㞌瞋랎㞀","ᄜ錩팥㌥匨㌥猝錥㌥匥猦猝\uf32c錨패㌤匥猦\uf31fㄜ匬","ꑆ㑆摇㑆\ue442쑆㑆\ue446鑆\ue442呅䑇⑇둆\ue446鑆⑄瑇둆쑆䑆瑆⑇",-42244995>(
            "ￊ￮￠￫ￚ\uffdfﾗﾹ\uffd8ￚ￢"
         );
         var10001 < ((-1184160636 * 1486334771 | 3) & -2147316421);
         var10001 += (444240525 ^ 1826871459 | 1) & -1990019647
      ) {
         0<"JNT",-1893106882,"\uf78c瞊랎\uf780랋瞉㞍瞁랎","ᄜ㌨\uf32aㄜ匬","ꑆ㑆摇㑆\ue442쑆㑆\ue446鑆\ue442呅䑇⑇둆\ue446鑆⑄瑇둆쑆䑆瑆⑇",-42244985>(
            var10002,
            var10001,
            (char)(
               0<"JNT",-1893106882,"\uf788랋瞉㞍瞁랎","ᄜ㌨ㄜ\uf32a","ꑆ㑆摇㑆\ue442쑆㑆\ue446鑆\ue442呅䑇⑇둆\ue446鑆⑄瑇둆쑆䑆瑆⑇",-42245048>(var10002, var10001)
                  + '!'
                  + 159
                  - 113
                  + 3
                  + 55
            )
         );
      }

      this.field_2180 = (Class_105)0<"JNT",734202247,"란瞋㞌瞋랎㞀","ᄜ錩팥㌥匨㌥猝錥㌥匥猦猝\uf32c錨패㌤匥猦\uf31f팫ㄜ匬","鑆⑇",-42244987>(
         0<"JNT",-1893106882,"랎\uf78b\uf784랎㞍瞋㞌\uf789","ᄜㄜ錩팥㌥匨㌥猝錥㌥匥猦猝\uf32c錨패㌤匥猦\uf31f","ꑆ㑆摇㑆\ue442쑆㑆\ue446鑆\ue442呅䑇⑇둆\ue446鑆⑄瑇둆쑆䑆瑆⑇",-42244986>(var10002),
         true
      );
      var10001 = (-197472263 >>> 754573826 | 0) & -1026539520;

      for (var10002 = (StringBuilder)0<"JNT",734202247,"란瞋㞌瞋랎㞀","ᄜ錩팥㌥匨㌥猝錥㌥匥猦猝\uf32c錨패㌤匥猦\uf31fㄜ匬","ꑆ㑆摇㑆\ue442쑆㑆\ue446鑆\ue442呅䑇⑇둆\ue446鑆⑄瑇둆쑆䑆瑆⑇",-42244988>(
            "땣ꧣꠣꦃ띣ꠃ뼃뎃랣ꢃ뜣ꨣ"
         );
         var10001 < ((1809619696 >> 1809619696 | 4) & 625381423);
         var10001 += (1016039865 ^ -912503840 | 0) & 49033507
      ) {
         char var47 = 0<"JNT",-1893106882,"\uf788랋瞉㞍瞁랎","ᄜ㌨ㄜ\uf32a","ꑆ㑆摇㑆\ue442쑆㑆\ue446鑆\ue442呅䑇⑇둆\ue446鑆⑄瑇둆쑆䑆瑆⑇",-42245043>(var10002, var10001);
         char var50 = (char)(
            ((((((var47 & 'ﰀ') >> 10 | var47 << 6) ^ 254) & 49152) >> 14 | (((var47 & 'ﰀ') >> 10 | var47 << 6) ^ 254) << 2) - 67 & 57344) >> 13
               | (((((var47 & 'ﰀ') >> 10 | var47 << 6) ^ 254) & 49152) >> 14 | (((var47 & 'ﰀ') >> 10 | var47 << 6) ^ 254) << 2) - 67 << 3
         );
         0<"JNT",-1893106882,"\uf78c瞊랎\uf780랋瞉㞍瞁랎","ᄜ㌨\uf32aㄜ匬","ꑆ㑆摇㑆\ue442쑆㑆\ue446鑆\ue442呅䑇⑇둆\ue446鑆⑄瑇둆쑆䑆瑆⑇",-42245044>(
            var10002,
            var10001,
            (char)(
               ((((((var47 & 'ﰀ') >> 10 | var47 << 6) ^ 254) & 49152) >> 14 | (((var47 & 'ﰀ') >> 10 | var47 << 6) ^ 254) << 2) - 67 & 57344) >> 13
                  | (((((var47 & 'ﰀ') >> 10 | var47 << 6) ^ 254) & 49152) >> 14 | (((var47 & 'ﰀ') >> 10 | var47 << 6) ^ 254) << 2) - 67 << 3
            )
         );
      }

      Class_49 var11 = (Class_49)0<"JNT",734202247,"란瞋㞌瞋랎㞀","ᄜ錩팥㌥匨㌥猝錥㌥匥猦猝\uf32c錨패㌤匥猦\uf31f錪錪錪錪ㄜ匬","䑆呆",-42245018>(
         0<"JNT",-1893106882,"랎\uf78b\uf784랎㞍瞋㞌\uf789","ᄜㄜ錩팥㌥匨㌥猝錥㌥匥猦猝\uf32c錨패㌤匥猦\uf31f","ꑆ㑆摇㑆\ue442쑆㑆\ue446鑆\ue442呅䑇⑇둆\ue446鑆⑄瑇둆쑆䑆瑆⑇",-42245017>(var10002),
         0.0,
         20.0,
         0.0,
         1.0
      );
      int var24 = 0;

      for (var31 = (StringBuilder)0<"JNT",734202247,"란瞋㞌瞋랎㞀","ᄜ錩팥㌥匨㌥猝錥㌥匥猦猝\uf32c錨패㌤匥猦\uf31fㄜ匬","ꑆ㑆摇㑆\ue442쑆㑆\ue446鑆\ue442呅䑇⑇둆\ue446鑆⑄瑇둆쑆䑆瑆⑇",-42245019>(
            "뿤￬뿮￫\uffd9뿻￫㿭뿘￬㿘뿻\uffd8翘￭㿗翭뿻㿭￭㿘￬翙翗㿘翮뿻㿬￬㿭翗㿘￬뿻翘翙￭뿘翬뿭￭㿗翭뿻㿬￫翬翮㿧"
         );
         var24 < ((-633816279 ^ -633816279 | 49) & -1716239051);
         var24 += 236659160 + 1463424392 ^ 1700083553
      ) {
         char var70 = 0<"JNT",-1893106882,"\uf788랋瞉㞍瞁랎","ᄜ㌨ㄜ\uf32a","ꑆ㑆摇㑆\ue442쑆㑆\ue446鑆\ue442呅䑇⑇둆\ue446鑆⑄瑇둆쑆䑆瑆⑇",-42244991>(var31, var24);
         char var71 = (char)((((var70 & '쀀') >> 14 | var70 << 2) + 149 - 224 ^ 208) + 173);
         0<"JNT",-1893106882,"\uf78c瞊랎\uf780랋瞉㞍瞁랎","ᄜ㌨\uf32aㄜ匬","ꑆ㑆摇㑆\ue442쑆㑆\ue446鑆\ue442呅䑇⑇둆\ue446鑆⑄瑇둆쑆䑆瑆⑇",-42244992>(
            var31, var24, (char)((((var70 & '쀀') >> 14 | var70 << 2) + 149 - 224 ^ 208) + 173)
         );
      }

      this.field_2181 = 0<"JNT",-1893106882,"\uf78b瞋랋","ᄜ錩팥㌥匨㌥猝錥㌥匥猦猝\uf32c錨패㌤匥猦\uf31fㄜ錩錦\uf326\uf31f","䑆呆",-42245033>(
         var11, 0<"JNT",-1893106882,"랎\uf78b\uf784랎㞍瞋㞌\uf789","ᄜㄜ錩팥㌥匨㌥猝錥㌥匥猦猝\uf32c錨패㌤匥猦\uf31f","ꑆ㑆摇㑆\ue442쑆㑆\ue446鑆\ue442呅䑇⑇둆\ue446鑆⑄瑇둆쑆䑆瑆⑇",-42245032>(var31)
      );
      Class_49 var10000 = 1<"JNT",1399327823,"퉺튮퉞","汬汬浬","\ue6bd\ue7bd\u0ab4⊴↴尿",1672424616>(this);
      Class_105 var12 = 1<"JNT",1399327823,"튪튊","汬汬浬","\ue6bd\ue7bd\u0ab4▴ゴ尿",1672424617>(this);
      0<"JNT",-2058682369,"㞍瞊瞍瞎瞋㞍瞊㞄\uf78b㞌㞄瞎람람","ᄜ錩팥㌥匨㌥猝錥㌥匥猦猝猩팦팥댦\uf326錨\uf31fㄜ錩팥㌥匨㌥猝錥㌥匥猦猝猩팦팥댦\uf326錨\uf31f","ꑆ㑆摇㑆\ue442瑇䑇둆쑆\ue442ᑅ⑆ꑆ瑆呆䑇呇",-42245036>(var12);
      0<"JNT",-1893106882,"㞌㞏\uf78c","ᄜ錩팥㌥匨㌥猝댨錨㌤錥猝匦댨匥\uf326錨㌤猥匥猝\uf32c댨ጧጧ錥㌤댦패\uf31fㄜ錩㌧댦댦\uf31f","䑆呆",-42245037>(var10000, var12::ax);
      0<"JNT",-1893106882,"瞍瞎","ᄜ\uf32b錩㌧댦댦\uf31fㄜ匬","摆摆摇",-42245042>(
         this,
         new Class_271[]{
            1<"JNT",1399327823,"튆튞","汬汬浬","\ue6bd\ue7bd\u0ab4⚴⾴尿",1672424612>(this),
            1<"JNT",1399327823,"퉚틆","汬汬浬","\ue6bd\ue7bd\u0ab4⊴↴尿",1672424613>(this),
            1<"JNT",1399327823,"튪튊","汬汬浬","\ue6bd\ue7bd\u0ab4▴ゴ尿",1672424618>(this),
            1<"JNT",1399327823,"퉺튮퉞","汬汬浬","\ue6bd\ue7bd\u0ab4⊴↴尿",1672424627>(this)
         }
      );
   }

   // $VF: renamed from: mg () void
   @Override
   public void method_1407() {
      0<"JNT",-1893106882,"㞎\uf78d","ᄜㄜ匬","摆摆摇",-42244996>(this);
      0<"JNT",-1742273490,"瞌\uf789","ᄜㄜ匬","瑇呇摆",-42244997>(this);
   }

   // $VF: renamed from: q () void
   @Override
   public void method_1408() {
      0<"JNT",-1742273490,"瞍","ᄜㄜ匬","瑇呇摆",-42244998>(this);
   }

   // $VF: renamed from: gd (Class_207) void
   @Class_21
   public void method_1862(Class_207 var1) {
      int var2 = 561129078;
      if (1<"JNT",1399327823,"튖튢튒퉾튞튺\udd82\udd5a\udd52\udd52","泬沜涌棬洜浜泬沜沼涬泜汬涌棬沼洌泜涼涼濼榼槜槌","\ue6bd\ue7bd\u0ab4Ⲵ⎴㊴\uedbd⮴➴Ⲵ⎴↴ゴᾴ⒴㊴\uedbd↴⪴ᾴㆴㆴᶴ\uf2bd\uf1bd\uf5bd尿",1672424579>(
            1<"JNT",1399327823,"퉾튆","汬汬浬","\ue6bd\ue7bd\u0ab4Ⲵ⎴㊴\uedbd⮴➴Ⲵ⎴↴ゴᾴ⒴㊴\uedbd↴⪴ᾴㆴㆴᶴ\uf1bd\uefbd\ueebd尿",1672424570>(this)
         )
         == null) {
         var2 = -1333794680 << (-3948794 & -1684811339) ^ -2094584944;

         while (true) {
            label74:
            while (true) {
               switch ((var2 ^ 133550668) + 660598310 + 757787881 - 594973668 - 1837293442 + 1348317634) {
                  case -1759802681:
                     if (1<"JNT",1399327823,"튦퉾","汬汬浬","\ue6bd\ue7bd\u07b4",1672424548>(this) > 0) {
                        1<"JNT",-1454595458,"튦퉾","汬汬浬","\ue6bd\ue7bd\u07b4",1672424554>(
                           this, 1<"JNT",1399327823,"튦퉾","汬汬浬","\ue6bd\ue7bd\u07b4",1672424549>(this) - 1
                        );
                        return;
                     }

                     var2 = 2083041033 * -355400072 ^ 1603251884;
                     continue;
                  case -1541027043:
                     return;
                  case -1155143601:
                  default:
                     if (!1<"JNT",1399327823,"퉞튚","汬汬浬","\ue6bd\ue7bdᢴ",1672424598>(this)) {
                        0<"JNT",-1893106882,"瞌瞊랎랋\uf78b랊\uf787㝽睿睽睿","ᄜ錩匥댦錨猝댥㌤匥댦\uf326패㌥匦錨猝\uf326錥㌥\uf328\uf328猫㌟匠댠猠\uf31f錩匥댦錨猝댥㌤匥댦\uf326패㌥匦錨猝\uf326錥㌥\uf328\uf328猫㌟팠匠ጞ\uf31fㄜ錩匥댦錨猝댥㌤匥댦\uf326패㌥匦錨猝\uf326錥㌥\uf328\uf328猫㌟팠匠㌞\uf31f","\ue446瑆䑇\ue442\uf446둆\ue446瑆呆⑇㑆摆䑇\ue442呆쑆㑆呇呇ᑆ摃呃摃",-42245066>(
                           1<"JNT",1399327823,"튖튢튒퉾튞튺\udd82\udd5a\udd56\udd82","泬沜涌棬洜浜泬沜沼涬泜汬涌棬沼洌泜涼涼濼榼槜槌","\ue6bd\ue7bd\u0ab4Ⲵ⎴㊴\uedbd⮴➴Ⲵ⎴↴ゴᾴ⒴㊴\uedbd↴⪴ᾴㆴㆴᶴ\uf4bd\uf1bd\uf4bd尿",1672424604>(
                              1<"JNT",1399327823,"퉾튆","汬汬浬","\ue6bd\ue7bd\u0ab4Ⲵ⎴㊴\uedbd⮴➴Ⲵ⎴↴ゴᾴ⒴㊴\uedbd↴⪴ᾴㆴㆴᶴ\uf1bd\uefbd\ueebd尿",1672424607>(this)
                           ),
                           1<"JNT",1399327823,"튖튢튒퉾튞튺\udd82\udd5a\udd86\udd5e","泬沜涌棬洜浜泬沜沼涬泜汬涌棬沼洌泜涼涼濼榼槜槌","\ue6bd\ue7bd\u0ab4Ⲵ⎴㊴\uedbd⮴➴Ⲵ⎴↴ゴᾴ⒴㊴\uedbd↴⪴ᾴㆴㆴᶴ\uf5bd\uf2bd\uf4bd尿",1672424610>(
                              1<"JNT",1399327823,"퉾튆","汬汬浬","\ue6bd\ue7bd\u0ab4Ⲵ⎴㊴\uedbd⮴➴Ⲵ⎴↴ゴᾴ⒴㊴\uedbd↴⪴ᾴㆴㆴᶴ\uf1bd\uefbd\ueebd尿",1672424605>(this)
                           ),
                           1<"JNT",541184840,"튖튢튒퉾튞튺\udd52\udd6e\udd8e\udd6e","泬沜涌棬洜浜泬沜沼涬泜汬涌棬沼洌泜涼涼濼槜榬楬橌","\ue6bd\ue7bd\u0ab4Ⲵ⎴㊴\uedbd⮴➴Ⲵ⎴↴ゴᾴ⒴㊴\uedbd↴⪴ᾴㆴㆴᶴ\uefbd\uf0bd\uf4bd\uf6bd尿",1672424587>()
                        );
                        1<"JNT",-1454595458,"퉞튚","汬汬浬","\ue6bd\ue7bdᢴ",1672424585>(this, true);
                     }

                     var2 = 1804419181 & 1804419181 ^ 1517079638;
                     continue;
                  case -886593052:
                     0<"JNT",-1893106882,"㞎\uf78d","ᄜㄜ匬","摆摆摇",-42245108>(this);
                     break;
                  case 268590589:
                     if (0<"JNT",-1893106882,"瞌瞊랎랋\uf78b랊\uf787\uf77c睽睾\uf77d띾","ᄜ錩匥댦錨猝댥㌤匥댦\uf326패㌥匦錨猝\uf326錥㌥\uf328\uf328猫㌟猠㌞팠\uf31fㄜ팫","\ue446瑆䑇\ue442\uf446둆\ue446瑆呆⑇㑆摆䑇\ue442呆쑆㑆呇呇ᑆ㑃鑃둃둃",-42245004>(
                           0<"JNT",-1893106882,"瞌瞊랎랋\uf78b랊\uf787㝾睽睽띿","ᄜ錩匥댦錨猝댥㌤匥댦\uf326패㌥匦錨猝\uf326錥㌥\uf328\uf328猫㌟\uf320ጟ錠\uf31fㄜ錩匥댦錨猝댥㌤匥댦\uf326패㌥匦錨猝\uf326錥㌥\uf328\uf328猫㌟猠㌞㌞\uf31f","\ue446瑆䑇\ue442\uf446둆\ue446瑆呆⑇㑆摆䑇\ue442呆쑆㑆呇呇ᑆ鑃䑃摃",-42245002>(
                              1<"JNT",1399327823,"튖튢튒퉾튞튺\udd82\udd5a\udd86\udd5e","泬沜涌棬洜浜泬沜沼涬泜汬涌棬沼洌泜涼涼濼榼槜槌","\ue6bd\ue7bd\u0ab4Ⲵ⎴㊴\uedbd⮴➴Ⲵ⎴↴ゴᾴ⒴㊴\uedbd↴⪴ᾴㆴㆴᶴ\uf5bd\uf2bd\uf4bd尿",1672424674>(
                                 1<"JNT",1399327823,"퉾튆","汬汬浬","\ue6bd\ue7bd\u0ab4Ⲵ⎴㊴\uedbd⮴➴Ⲵ⎴↴ゴᾴ⒴㊴\uedbd↴⪴ᾴㆴㆴᶴ\uf1bd\uefbd\ueebd尿",1672424669>(this)
                              ),
                              1<"JNT",541184840,"튖튢튒퉾튞튺\udd56\udd82\udd5a\udd5e","泬沜涌棬洜浜泬沜沼涬泜汬涌棬沼洌泜涼涼濼槜榼槌榌","\ue6bd\ue7bd\u0ab4Ⲵ⎴㊴\uedbd⮴➴Ⲵ⎴↴ゴᾴ⒴㊴\uedbd↴⪴ᾴㆴㆴᶴ\uefbd\uf1bd\ueebd\uf2bd尿",1672424651>()
                           ),
                           1<"JNT",541184840,"튖튢튒퉾튞튺\udd6e\udd6e\udd8a\udd8a","泬沜涌棬洜浜泬沜沼涬泜汬涌棬沼洌泜涼涼濼槜橌槌榬","\ue6bd\ue7bd\u0ab4Ⲵ⎴㊴\uedbd⮴➴Ⲵ⎴↴ゴᾴ⒴㊴\uedbd↴⪴ᾴㆴㆴᶴ\uefbd\uf5bd\uf7bd\uf0bd尿",1672424649>()
                        )
                        && !0<"JNT",-1893106882,"瞌瞊랎랋\uf78b랊\uf787\uf77c睽睾\uf77d띾","ᄜ錩匥댦錨猝댥㌤匥댦\uf326패㌥匦錨猝\uf326錥㌥\uf328\uf328猫㌟猠㌞팠\uf31fㄜ팫","\ue446瑆䑇\ue442\uf446둆\ue446瑆呆⑇㑆摆䑇\ue442呆쑆㑆呇呇ᑆ㑃鑃둃둃",-42245010>(
                           0<"JNT",-1893106882,"瞌瞊랎랋\uf78b랊\uf787\uf77d\uf77c睿睽","ᄜㄜ錩匥댦錨猝댥㌤匥댦\uf326패㌥匦錨猝\uf326錥㌥\uf328\uf328猫㌟猠㌞㌞\uf31f","\ue446瑆䑇\ue442\uf446둆\ue446瑆呆⑇㑆摆䑇\ue442呆쑆㑆呇呇ᑆ㑃摃摃㑃",-42245008>(
                              0<"JNT",-1893106882,"瞌瞊랎랋\uf78b랊\uf787\uf77c睽睾띾띿","ᄜㄜ錩匥댦錨猝댥㌤匥댦\uf326패㌥匦錨猝\uf326錥㌥\uf328\uf328猫㌟匠匠㌟\uf31f","\ue446瑆䑇\ue442\uf446둆\ue446瑆呆⑇㑆摆䑇\ue442呆쑆㑆呇呇ᑆ鑃䑃摃",-42245007>(
                                 1<"JNT",1399327823,"튖튢튒퉾튞튺\udd82\udd5a\udd86\udd5e","泬沜涌棬洜浜泬沜沼涬泜汬涌棬沼洌泜涼涼濼榼槜槌","\ue6bd\ue7bd\u0ab4Ⲵ⎴㊴\uedbd⮴➴Ⲵ⎴↴ゴᾴ⒴㊴\uedbd↴⪴ᾴㆴㆴᶴ\uf5bd\uf2bd\uf4bd尿",1672424644>(
                                    1<"JNT",1399327823,"퉾튆","汬汬浬","\ue6bd\ue7bd\u0ab4Ⲵ⎴㊴\uedbd⮴➴Ⲵ⎴↴ゴᾴ⒴㊴\uedbd↴⪴ᾴㆴㆴᶴ\uf1bd\uefbd\ueebd尿",1672424647>(this)
                                 )
                              )
                           ),
                           1<"JNT",541184840,"튖튢튒퉾튞튺\udd6e\udd56\udd8a\udd62","泬沜涌棬洜浜泬沜沼涬泜汬涌棬沼洌泜涼涼濼槜橌槌榬","\ue6bd\ue7bd\u0ab4Ⲵ⎴㊴\uedbd⮴➴Ⲵ⎴↴ゴᾴ⒴㊴\uedbd↴⪴ᾴㆴㆴᶴ\uefbd\uf5bd\uf7bd\uf0bd尿",1672424659>()
                        )
                        && !0<"JNT",-209706528,"瞌瞊랎랋\uf78b랊\uf787睾\uf77d띿\uf77c㝽","ᄜ錩匥댦錨猝댥㌤匥댦\uf326패㌥匦錨猝\uf326錥㌥\uf328\uf328猫㌞\uf320\uf320㌟\uf31fㄜ팫","\ue446瑆䑇\ue442\uf446둆\ue446瑆呆⑇㑆摆䑇\ue442呆쑆㑆呇呇ᑆ둃呃⑃呃",-42245081>(
                           0<"JNT",-1893106882,"瞌瞊랎랋\uf78b랊\uf787睾\uf77d\uf77c띾\uf77d","ᄜㄜ錩匥댦錨猝댥㌤匥댦\uf326패㌥匦錨猝\uf326錥㌥\uf328\uf328猫㌞\uf320팠\uf320\uf31f","\ue446瑆䑇\ue442\uf446둆\ue446瑆呆⑇㑆摆䑇\ue442呆쑆㑆呇呇ᑆ㑃鑃둃⑃",-42245015>(
                              0<"JNT",-1893106882,"瞌瞊랎랋\uf78b랊\uf787\uf77d睿락睿","ᄜㄜ錩匥댦錨猝댥㌤匥댦\uf326패㌥匦錨猝\uf326錥㌥\uf328\uf328猫㌟猠㌞팠\uf31f","\ue446瑆䑇\ue442\uf446둆\ue446瑆呆⑇㑆摆䑇\ue442呆쑆㑆呇呇ᑆ㑃鑃둃둃",-42245014>(
                                 0<"JNT",-1893106882,"瞌瞊랎랋\uf78b랊\uf787㝾락띾\uf77d","ᄜㄜ錩匥댦錨猝댥㌤匥댦\uf326패㌥匦錨猝\uf326錥㌥\uf328\uf328猫㌟猠㌞㌞\uf31f","\ue446瑆䑇\ue442\uf446둆\ue446瑆呆⑇㑆摆䑇\ue442呆쑆㑆呇呇ᑆ鑃䑃摃",-42245013>(
                                    1<"JNT",1399327823,"튖튢튒퉾튞튺\udd82\udd5a\udd86\udd5e","泬沜涌棬洜浜泬沜沼涬泜汬涌棬沼洌泜涼涼濼榼槜槌","\ue6bd\ue7bd\u0ab4Ⲵ⎴㊴\uedbd⮴➴Ⲵ⎴↴ゴᾴ⒴㊴\uedbd↴⪴ᾴㆴㆴᶴ\uf5bd\uf2bd\uf4bd尿",1672424646>(
                                       1<"JNT",1399327823,"퉾튆","汬汬浬","\ue6bd\ue7bd\u0ab4Ⲵ⎴㊴\uedbd⮴➴Ⲵ⎴↴ゴᾴ⒴㊴\uedbd↴⪴ᾴㆴㆴᶴ\uf1bd\uefbd\ueebd尿",1672424657>(this)
                                    )
                                 )
                              )
                           ),
                           1<"JNT",541184840,"튖튢튒퉾튞튺\udd52\udd8e\udd8e\udd5a\udd52","泬沜涌棬洜浜泬沜沼涬泜汬涌棬沼洌泜涼涼濼橜榼榼榌","\ue6bd\ue7bd\u0ab4Ⲵ⎴㊴\uedbd⮴➴Ⲵ⎴↴ゴᾴ⒴㊴\uedbd↴⪴ᾴㆴㆴᶴ\uf7bd\uf1bd\uf1bd\uefbd尿",1672424658>()
                        )
                        && 0<"JNT",-1893106882,"瞌瞊랎랋\uf78b랊\uf787睾띿㝾睿띾","ᄜ錩匥댦錨猝댥㌤匥댦\uf326패㌥匦錨猝\uf326錥㌥\uf328\uf328猫㌞\uf320\uf320㌟\uf31fㄜ錩팥㌥匨㌥猝錥㌥匥猦猝猩팦팥댦\uf326錨\uf31f","\ue446瑆䑇\ue442\uf446둆\ue446瑆呆⑇㑆摆䑇\ue442呆쑆㑆呇呇ᑆ㑃鑃둃둃",-42245086>(
                              0<"JNT",-1893106882,"瞌瞊랎랋\uf78b랊\uf787㝾락띾\uf77d","ᄜㄜ錩匥댦錨猝댥㌤匥댦\uf326패㌥匦錨猝\uf326錥㌥\uf328\uf328猫㌟猠㌞㌞\uf31f","\ue446瑆䑇\ue442\uf446둆\ue446瑆呆⑇㑆摆䑇\ue442呆쑆㑆呇呇ᑆ鑃䑃摃",-42245084>(
                                 1<"JNT",1399327823,"튖튢튒퉾튞튺\udd82\udd5a\udd86\udd5e","泬沜涌棬洜浜泬沜沼涬泜汬涌棬沼洌泜涼涼濼榼槜槌","\ue6bd\ue7bd\u0ab4Ⲵ⎴㊴\uedbd⮴➴Ⲵ⎴↴ゴᾴ⒴㊴\uedbd↴⪴ᾴㆴㆴᶴ\uf5bd\uf2bd\uf4bd尿",1672424569>(
                                    1<"JNT",1399327823,"퉾튆","汬汬浬","\ue6bd\ue7bd\u0ab4Ⲵ⎴㊴\uedbd⮴➴Ⲵ⎴↴ゴᾴ⒴㊴\uedbd↴⪴ᾴㆴㆴᶴ\uf1bd\uefbd\ueebd尿",1672424568>(this)
                                 )
                              ),
                              1<"JNT",541184840,"튖튢튒퉾튞튺\udd52\udd5e\udd82\udd62\udd56","泬沜涌棬洜浜泬沜沼涬泜汬涌棬沼洌泜涼涼濼橜榼榼榌","\ue6bd\ue7bd\u0ab4Ⲵ⎴㊴\uedbd⮴➴Ⲵ⎴↴ゴᾴ⒴㊴\uedbd↴⪴ᾴㆴㆴᶴ\uf7bd\uf1bd\uf1bd\uefbd尿",1672424567>()
                           )
                           == null) {
                        1<"JNT",-1454595458,"틂퉞","汬汬浬","\ue6bd\ue7bdᢴ",1672424565>(this, true);
                     }
                     break label74;
                  case 725941838:
                     if (1<"JNT",1399327823,"틂퉞","汬汬浬","\ue6bd\ue7bdᢴ",1672424576>(this)) {
                        if (1<"JNT",1399327823,"튖튞","汬汬浬","\ue6bd\ue7bd\u07b4",1672424577>(this) == -1) {
                           1<"JNT",-1454595458,"튖튞","汬汬浬","\ue6bd\ue7bd\u07b4",1672424578>(
                              this,
                              0<"JNT",-1893106882,"瞌瞊랎랋\uf78b랊\uf787㝾\uf77d睾\uf77c㝽","ᄜㄜ㌨","\ue446瑆䑇\ue442\uf446둆\ue446瑆呆⑇㑆摆䑇\ue442呆쑆㑆呇呇ᑆ㑃摃摃㑃",-42245095>(
                                 0<"JNT",-1893106882,"瞌瞊랎랋\uf78b랊\uf787\uf77c睽睾띾띿","ᄜㄜ錩匥댦錨猝댥㌤匥댦\uf326패㌥匦錨猝\uf326錥㌥\uf328\uf328猫㌟匠匠㌟\uf31f","\ue446瑆䑇\ue442\uf446둆\ue446瑆呆⑇㑆摆䑇\ue442呆쑆㑆呇呇ᑆ鑃䑃摃",-42245094>(
                                    1<"JNT",1399327823,"튖튢튒퉾튞튺\udd82\udd5a\udd86\udd5e","泬沜涌棬洜浜泬沜沼涬泜汬涌棬沼洌泜涼涼濼榼槜槌","\ue6bd\ue7bd\u0ab4Ⲵ⎴㊴\uedbd⮴➴Ⲵ⎴↴ゴᾴ⒴㊴\uedbd↴⪴ᾴㆴㆴᶴ\uf5bd\uf2bd\uf4bd尿",1672424575>(
                                       1<"JNT",1399327823,"퉾튆","汬汬浬","\ue6bd\ue7bd\u0ab4Ⲵ⎴㊴\uedbd⮴➴Ⲵ⎴↴ゴᾴ⒴㊴\uedbd↴⪴ᾴㆴㆴᶴ\uf1bd\uefbd\ueebd尿",1672424566>(this)
                                    )
                                 )
                              )
                           );
                        }

                        var2 = 1480403667;
                        continue;
                     }
                     break;
                  case 871258179:
                     if (1<"JNT",1399327823,"튖튢튒퉾튞튺\udd82\udd5a\udd86\udd5e","泬沜涌棬洜浜泬沜沼涬泜汬涌棬沼洌泜涼涼濼榼槜槌","\ue6bd\ue7bd\u0ab4Ⲵ⎴㊴\uedbd⮴➴Ⲵ⎴↴ゴᾴ⒴㊴\uedbd↴⪴ᾴㆴㆴᶴ\uf5bd\uf2bd\uf4bd尿",1672424556>(
                              1<"JNT",1399327823,"퉾튆","汬汬浬","\ue6bd\ue7bd\u0ab4Ⲵ⎴㊴\uedbd⮴➴Ⲵ⎴↴ゴᾴ⒴㊴\uedbd↴⪴ᾴㆴㆴᶴ\uf1bd\uefbd\ueebd尿",1672424559>(this)
                           )
                           != null
                        && 0<"JNT",-2058682369,"瞌\uf788","ᄜ㌨ㄜ팫","쑆⑆",-42245049>(
                           0<"JNT",-1893106882,"㞊랋","ᄜㄜ㌨","葆㑇",-42245112>(1<"JNT",1399327823,"튆튞","汬汬浬","\ue6bd\ue7bd\u0ab4⚴⾴尿",1672424557>(this))
                        )
                        && (
                           0<"JNT",-1893106882,"랍㞉瞌","ᄜㄜ팫","葇둇",-42245053>(
                                 (Class_398)0<"JNT",-1893106882,"瞋\uf78c","ᄜ錩팥㌥匨㌥猝錥㌥匥猦猝\uf32a錥㌥\uf328\uf328\uf31fㄜ錩댨\uf328匦\uf31f","\ue446呆",-42245052>(
                                    (ConfigManager_221)1<"JNT",1399327823,"틆튊","汬泜","\ue6bd\ue7bd\u0ab4⢴ᾴ㒴ᾴ\uedbd⪴ᾴⲴ▴\uedbdප₴⢴⎴↴㊴尿",1672424601>(
                                       (ScreenUI_78)1<"JNT",541184840,"튒퉒튂","汬泜","\ue6bd\ue7bd\u0ab4⢴ᾴ㒴ᾴ\uedbd⪴ᾴⲴ▴\uedbdප₴⢴⎴↴㊴尿",1672424600>()
                                    ),
                                    Class_398.class
                                 )
                              )
                              || 0<"JNT",-1893106882,"瞌瞊랎랋\uf78b랊\uf787㝾睽㝽띿","ᄜㄜ팫","\ue446瑆䑇\ue442\uf446둆\ue446瑆呆⑇㑆摆䑇\ue442呆쑆㑆呇呇ᑆ鑃䑃摃",-42245056>(
                                 1<"JNT",1399327823,"튖튢튒퉾튞튺\udd82\udd5a\udd86\udd5e","泬沜涌棬洜浜泬沜沼涬泜汬涌棬沼洌泜涼涼濼榼槜槌","\ue6bd\ue7bd\u0ab4Ⲵ⎴㊴\uedbd⮴➴Ⲵ⎴↴ゴᾴ⒴㊴\uedbd↴⪴ᾴㆴㆴᶴ\uf5bd\uf2bd\uf4bd尿",1672424597>(
                                    1<"JNT",1399327823,"퉾튆","汬汬浬","\ue6bd\ue7bd\u0ab4Ⲵ⎴㊴\uedbd⮴➴Ⲵ⎴↴ゴᾴ⒴㊴\uedbd↴⪴ᾴㆴㆴᶴ\uf1bd\uefbd\ueebd尿",1672424596>(this)
                                 )
                              )
                        )) {
                        var2 = -551125308 - -551125308 ^ -68774178;
                        continue;
                     }
                     break label74;
                  case 968139845:
                     if (1<"JNT",1399327823,"튞튪","汬汬浬","\ue6bd\ue7bd\u07b4",1672424555>(this)
                        < 0<"JNT",-1893106882,"㞊㞏\uf789","ᄜㄜ㌨","䑆呆",-42245099>(1<"JNT",1399327823,"퉚틆","汬汬浬","\ue6bd\ue7bd\u0ab4⊴↴尿",1672424552>(this))) {
                        1<"JNT",-1454595458,"튞튪","汬汬浬","\ue6bd\ue7bd\u07b4",1672424551>(
                           this, 1<"JNT",1399327823,"튞튪","汬汬浬","\ue6bd\ue7bd\u07b4",1672424574>(this) + 1
                        );
                        return;
                     }

                     var2 = -1597825880;
                     continue;
                  case 1241741282:
                     if (!0<"JNT",-1893106882,"瞉랏","ᄜㄜ팫","鑆⑇",-42245106>(1<"JNT",1399327823,"튪튊","汬汬浬","\ue6bd\ue7bd\u0ab4▴ゴ尿",1672424563>(this))) {
                        var2 = 138369120 << 849855828 ^ 919421493;
                        continue;
                     }

                     0<"JNT",-1893106882,"\uf78c랎","ᄜㄜ匬","摆摆摇",-42245107>(this);
                     break;
                  case 1941443082:
                     if (!0<"JNT",-2058682369,"㞎㞏㞉","ᄜ錩匥댦錨猝댥㌤匥댦\uf326패㌥匦錨猝\uf326錥㌥\uf328\uf328猫㌟猠㌞팠\uf31fㄜ팫","葆",-42245058>(
                        1<"JNT",541184840,"튖튢튒퉾튞튺\udd6e\udd56\udd8a\udd62","泬沜涌棬洜浜泬沜沼涬泜汬涌棬沼洌泜涼涼濼槜橌槌榬","\ue6bd\ue7bd\u0ab4Ⲵ⎴㊴\uedbd⮴➴Ⲵ⎴↴ゴᾴ⒴㊴\uedbd↴⪴ᾴㆴㆴᶴ\uefbd\uf5bd\uf7bd\uf0bd尿",1672424611>()
                     )) {
                        0<"JNT",-1893106882,"㞎\uf78d","ᄜㄜ匬","摆摆摇",-42245059>(this);
                        return;
                     }

                     var2 = (627516853 - 1382353911 | 573587462) & 779213526;
                     continue;
               }

               var2 = -1982447447 * (-1512053533 >> -1512053533) ^ -1570004734;
            }

            var2 = (13771033 | 270546598) & 1487222447;
         }
      }
   }

   // $VF: renamed from: st () void
   public void method_1863() {
      if (1<"JNT",1399327823,"퉶퉲","汬汬浬","\ue6bd\ue7bd\u07b4",1672424581>(this)
         < 0<"JNT",-1893106882,"㞊㞏\uf789","ᄜㄜ㌨","䑆呆",-42245073>(1<"JNT",1399327823,"퉺튮퉞","汬汬浬","\ue6bd\ue7bd\u0ab4⊴↴尿",1672424586>(this))) {
         1<"JNT",-1454595458,"퉶퉲","汬汬浬","\ue6bd\ue7bd\u07b4",1672424593>(this, 1<"JNT",1399327823,"퉶퉲","汬汬浬","\ue6bd\ue7bd\u07b4",1672424592>(this) + 1);
      } else {
         0<"JNT",-2058682369,"㞎랎㞋","ᄜ㌨ㄜ匬","葆",-42245069>(1<"JNT",1399327823,"튖튞","汬汬浬","\ue6bd\ue7bd\u07b4",1672424606>(this));
         0<"JNT",-1893106882,"㞎\uf78d","ᄜㄜ匬","摆摆摇",-42245070>(this);
      }
   }

   // $VF: renamed from: vw () void
   public void method_1864() {
      1<"JNT",-1454595458,"튖튞","汬汬浬","\ue6bd\ue7bd\u07b4",1672424582>(this, -1);
      1<"JNT",-1454595458,"튞튪","汬汬浬","\ue6bd\ue7bd\u07b4",1672424591>(this, 0);
      1<"JNT",-1454595458,"퉶퉲","汬汬浬","\ue6bd\ue7bd\u07b4",1672424588>(this, 0);
      1<"JNT",-1454595458,"튦퉾","汬汬浬","\ue6bd\ue7bd\u07b4",1672424589>(this, 4);
      1<"JNT",-1454595458,"틂퉞","汬汬浬","\ue6bd\ue7bdᢴ",1672424594>(this, false);
      1<"JNT",-1454595458,"퉞튚","汬汬浬","\ue6bd\ue7bdᢴ",1672424507>(this, false);
   }

   // $VF: renamed from: da (Class_89) void
   @Class_21
   public void method_1865(Class_89 var1) {
      int var2 = -1828180482;
      if (0<"JNT",-1893106882,"瞌瞊랎랋\uf78b랊\uf787\uf77c睽睾\uf77d띾","ᄜ錩匥댦錨猝댥㌤匥댦\uf326패㌥匦錨猝\uf326錥㌥\uf328\uf328猫㌟猠㌞팠\uf31fㄜ팫","\ue446瑆䑇\ue442\uf446둆\ue446瑆呆⑇㑆摆䑇\ue442呆쑆㑆呇呇ᑆ㑃鑃둃둃",-42245150>(
         0<"JNT",-1893106882,"瞌瞊랎랋\uf78b랊\uf787㝾락띾\uf77d","ᄜㄜ錩匥댦錨猝댥㌤匥댦\uf326패㌥匦錨猝\uf326錥㌥\uf328\uf328猫㌟猠㌞㌞\uf31f","\ue446瑆䑇\ue442\uf446둆\ue446瑆呆⑇㑆摆䑇\ue442呆쑆㑆呇呇ᑆ鑃䑃摃",-42245148>(
            1<"JNT",1399327823,"튖튢튒퉾튞튺\udd82\udd5a\udd86\udd5e","泬沜涌棬洜浜泬沜沼涬泜汬涌棬沼洌泜涼涼濼榼槜槌","\ue6bd\ue7bd\u0ab4Ⲵ⎴㊴\uedbd⮴➴Ⲵ⎴↴ゴᾴ⒴㊴\uedbd↴⪴ᾴㆴㆴᶴ\uf5bd\uf2bd\uf4bd尿",1672424505>(
               1<"JNT",1399327823,"퉾튆","汬汬浬","\ue6bd\ue7bd\u0ab4Ⲵ⎴㊴\uedbd⮴➴Ⲵ⎴↴ゴᾴ⒴㊴\uedbd↴⪴ᾴㆴㆴᶴ\uf1bd\uefbd\ueebd尿",1672424504>(this)
            )
         ),
         1<"JNT",541184840,"튖튢튒퉾튞튺\udd6e\udd56\udd8a\udd62","泬沜涌棬洜浜泬沜沼涬泜汬涌棬沼洌泜涼涼濼槜橌槌榬","\ue6bd\ue7bd\u0ab4Ⲵ⎴㊴\uedbd⮴➴Ⲵ⎴↴ゴᾴ⒴㊴\uedbd↴⪴ᾴㆴㆴᶴ\uefbd\uf5bd\uf7bd\uf0bd尿",1672424503>()
      )) {
         1<"JNT",-1454595458,"퉞튚","汬汬浬","\ue6bd\ue7bdᢴ",1672424501>(this, true);
      }

      var2 = -772365652 >> -772365652 ^ 2034632065;

      while (true) {
         switch (((var2 ^ 1109991293) + 749931698 - 10710295 ^ 1749101384 ^ 1086461600) - 1146434121) {
            case -1815255408:
            default:
               if (1<"JNT",1399327823,"튦퉾","汬汬浬","\ue6bd\ue7bd\u07b4",1672424506>(this) > 0) {
                  0<"JNT",-1893106882,"람瞋","ᄜㄜ匬","摆㑇⑇",-42245153>(var1);
               }

               var2 = -1947980222;
               break;
            case -1727350039:
               return;
         }
      }
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1413(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = var10 + 132096506 + 388028217 + 1716299915 - 1156483294 + 1872169865 - 353855297 + 418648231 + 1534414761 ^ 653537549;
      MethodHandle var10000 = field_2188[var10 + 132096506 + 388028217 + 1716299915 - 1156483294 + 1872169865 - 353855297 + 418648231 + 1534414761
         ^ 653537549
         ^ 708260050];
      if (field_2188[var10001 ^ 708260050] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = 763440825 ^ 1673341367 ^ 1312556814; var23 < var13.length(); var23 += (-1236571960 >>> -1294081341 | 0) & 691442311) {
            int var42 = var13.charAt(var23) - 248;
            char var47 = (char)(
               (
                        (
                              (
                                       (
                                             (
                                                      (
                                                               ((((var42 & 65024) >> 9 | var42 << 7) & 64512) >> 10 | ((var42 & 65024) >> 9 | var42 << 7) << 6)
                                                                     - 207
                                                                  & 65024
                                                            )
                                                            >> 9
                                                         | ((((var42 & 65024) >> 9 | var42 << 7) & 64512) >> 10 | ((var42 & 65024) >> 9 | var42 << 7) << 6)
                                                               - 207
                                                            << 7
                                                   )
                                                   + 104
                                                   - 118
                                                ^ 13
                                          )
                                          & 65535
                                    )
                                    >> 0
                                 | (
                                       (
                                                (((((var42 & 65024) >> 9 | var42 << 7) & 64512) >> 10 | ((var42 & 65024) >> 9 | var42 << 7) << 6) - 207 & 65024)
                                                      >> 9
                                                   | ((((var42 & 65024) >> 9 | var42 << 7) & 64512) >> 10 | ((var42 & 65024) >> 9 | var42 << 7) << 6) - 207
                                                      << 7
                                             )
                                             + 104
                                             - 118
                                          ^ 13
                                    )
                                    << 16
                           )
                           & 65532
                     )
                     >> 2
                  | (
                        (
                                 (
                                       (
                                                (((((var42 & 65024) >> 9 | var42 << 7) & 64512) >> 10 | ((var42 & 65024) >> 9 | var42 << 7) << 6) - 207 & 65024)
                                                      >> 9
                                                   | ((((var42 & 65024) >> 9 | var42 << 7) & 64512) >> 10 | ((var42 & 65024) >> 9 | var42 << 7) << 6) - 207
                                                      << 7
                                             )
                                             + 104
                                             - 118
                                          ^ 13
                                    )
                                    & 65535
                              )
                              >> 0
                           | (
                                 (
                                          (((((var42 & 65024) >> 9 | var42 << 7) & 64512) >> 10 | ((var42 & 65024) >> 9 | var42 << 7) << 6) - 207 & 65024) >> 9
                                             | ((((var42 & 65024) >> 9 | var42 << 7) & 64512) >> 10 | ((var42 & 65024) >> 9 | var42 << 7) << 6) - 207 << 7
                                       )
                                       + 104
                                       - 118
                                    ^ 13
                              )
                              << 16
                     )
                     << 14
            );
            var13.setCharAt(
               var23,
               (char)(
                  (
                           (
                                 (
                                          (
                                                (
                                                         (
                                                                  (
                                                                           (((var42 & 65024) >> 9 | var42 << 7) & 64512) >> 10
                                                                              | ((var42 & 65024) >> 9 | var42 << 7) << 6
                                                                        )
                                                                        - 207
                                                                     & 65024
                                                               )
                                                               >> 9
                                                            | ((((var42 & 65024) >> 9 | var42 << 7) & 64512) >> 10 | ((var42 & 65024) >> 9 | var42 << 7) << 6)
                                                                  - 207
                                                               << 7
                                                      )
                                                      + 104
                                                      - 118
                                                   ^ 13
                                             )
                                             & 65535
                                       )
                                       >> 0
                                    | (
                                          (
                                                   (
                                                            ((((var42 & 65024) >> 9 | var42 << 7) & 64512) >> 10 | ((var42 & 65024) >> 9 | var42 << 7) << 6)
                                                                  - 207
                                                               & 65024
                                                         )
                                                         >> 9
                                                      | ((((var42 & 65024) >> 9 | var42 << 7) & 64512) >> 10 | ((var42 & 65024) >> 9 | var42 << 7) << 6) - 207
                                                         << 7
                                                )
                                                + 104
                                                - 118
                                             ^ 13
                                       )
                                       << 16
                              )
                              & 65532
                        )
                        >> 2
                     | (
                           (
                                    (
                                          (
                                                   (
                                                            ((((var42 & 65024) >> 9 | var42 << 7) & 64512) >> 10 | ((var42 & 65024) >> 9 | var42 << 7) << 6)
                                                                  - 207
                                                               & 65024
                                                         )
                                                         >> 9
                                                      | ((((var42 & 65024) >> 9 | var42 << 7) & 64512) >> 10 | ((var42 & 65024) >> 9 | var42 << 7) << 6) - 207
                                                         << 7
                                                )
                                                + 104
                                                - 118
                                             ^ 13
                                       )
                                       & 65535
                                 )
                                 >> 0
                              | (
                                    (
                                             (((((var42 & 65024) >> 9 | var42 << 7) & 64512) >> 10 | ((var42 & 65024) >> 9 | var42 << 7) << 6) - 207 & 65024)
                                                   >> 9
                                                | ((((var42 & 65024) >> 9 | var42 << 7) & 64512) >> 10 | ((var42 & 65024) >> 9 | var42 << 7) << 6) - 207 << 7
                                          )
                                          + 104
                                          - 118
                                       ^ 13
                                 )
                                 << 16
                        )
                        << 14
               )
            );
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = (-2098744132 ^ 1444684538 | 0) & 50348080;
            var29 < var16.length();
            var29 += -113535419 ^ 1482816521 - (-113535419 - 1482816521) ^ 1320417161
         ) {
            int var52 = var16.charAt(var29) - 29;
            char var57 = (char)(
               (
                     (
                              (
                                       (
                                                (
                                                         (
                                                                  (
                                                                        (
                                                                              (((var52 & 61440) >> 12 | var52 << 4) & 61440) >> 12
                                                                                 | ((var52 & 61440) >> 12 | var52 << 4) << 4
                                                                           )
                                                                           ^ 245
                                                                     )
                                                                     & 65520
                                                               )
                                                               >> 4
                                                            | (
                                                                  (
                                                                        (((var52 & 61440) >> 12 | var52 << 4) & 61440) >> 12
                                                                           | ((var52 & 61440) >> 12 | var52 << 4) << 4
                                                                     )
                                                                     ^ 245
                                                               )
                                                               << 12
                                                      )
                                                      + 253
                                                   & 61440
                                             )
                                             >> 12
                                          | (
                                                   (
                                                            (
                                                                  (
                                                                        (((var52 & 61440) >> 12 | var52 << 4) & 61440) >> 12
                                                                           | ((var52 & 61440) >> 12 | var52 << 4) << 4
                                                                     )
                                                                     ^ 245
                                                               )
                                                               & 65520
                                                         )
                                                         >> 4
                                                      | (
                                                            ((((var52 & 61440) >> 12 | var52 << 4) & 61440) >> 12 | ((var52 & 61440) >> 12 | var52 << 4) << 4)
                                                               ^ 245
                                                         )
                                                         << 12
                                                )
                                                + 253
                                             << 4
                                    )
                                    + 106
                                 & 65504
                           )
                           >> 5
                        | (
                                 (
                                          (
                                                   (
                                                            (
                                                                  (
                                                                        (((var52 & 61440) >> 12 | var52 << 4) & 61440) >> 12
                                                                           | ((var52 & 61440) >> 12 | var52 << 4) << 4
                                                                     )
                                                                     ^ 245
                                                               )
                                                               & 65520
                                                         )
                                                         >> 4
                                                      | (
                                                            ((((var52 & 61440) >> 12 | var52 << 4) & 61440) >> 12 | ((var52 & 61440) >> 12 | var52 << 4) << 4)
                                                               ^ 245
                                                         )
                                                         << 12
                                                )
                                                + 253
                                             & 61440
                                       )
                                       >> 12
                                    | (
                                             (
                                                      (((((var52 & 61440) >> 12 | var52 << 4) & 61440) >> 12 | ((var52 & 61440) >> 12 | var52 << 4) << 4) ^ 245)
                                                         & 65520
                                                   )
                                                   >> 4
                                                | (((((var52 & 61440) >> 12 | var52 << 4) & 61440) >> 12 | ((var52 & 61440) >> 12 | var52 << 4) << 4) ^ 245)
                                                   << 12
                                          )
                                          + 253
                                       << 4
                              )
                              + 106
                           << 11
                  )
                  ^ 169
            );
            var16.setCharAt(
               var29,
               (char)(
                  (
                        (
                                 (
                                          (
                                                   (
                                                            (
                                                                     (
                                                                           (
                                                                                 (((var52 & 61440) >> 12 | var52 << 4) & 61440) >> 12
                                                                                    | ((var52 & 61440) >> 12 | var52 << 4) << 4
                                                                              )
                                                                              ^ 245
                                                                        )
                                                                        & 65520
                                                                  )
                                                                  >> 4
                                                               | (
                                                                     (
                                                                           (((var52 & 61440) >> 12 | var52 << 4) & 61440) >> 12
                                                                              | ((var52 & 61440) >> 12 | var52 << 4) << 4
                                                                        )
                                                                        ^ 245
                                                                  )
                                                                  << 12
                                                         )
                                                         + 253
                                                      & 61440
                                                )
                                                >> 12
                                             | (
                                                      (
                                                               (
                                                                     (
                                                                           (((var52 & 61440) >> 12 | var52 << 4) & 61440) >> 12
                                                                              | ((var52 & 61440) >> 12 | var52 << 4) << 4
                                                                        )
                                                                        ^ 245
                                                                  )
                                                                  & 65520
                                                            )
                                                            >> 4
                                                         | (
                                                               (
                                                                     (((var52 & 61440) >> 12 | var52 << 4) & 61440) >> 12
                                                                        | ((var52 & 61440) >> 12 | var52 << 4) << 4
                                                                  )
                                                                  ^ 245
                                                            )
                                                            << 12
                                                   )
                                                   + 253
                                                << 4
                                       )
                                       + 106
                                    & 65504
                              )
                              >> 5
                           | (
                                    (
                                             (
                                                      (
                                                               (
                                                                     (
                                                                           (((var52 & 61440) >> 12 | var52 << 4) & 61440) >> 12
                                                                              | ((var52 & 61440) >> 12 | var52 << 4) << 4
                                                                        )
                                                                        ^ 245
                                                                  )
                                                                  & 65520
                                                            )
                                                            >> 4
                                                         | (
                                                               (
                                                                     (((var52 & 61440) >> 12 | var52 << 4) & 61440) >> 12
                                                                        | ((var52 & 61440) >> 12 | var52 << 4) << 4
                                                                  )
                                                                  ^ 245
                                                            )
                                                            << 12
                                                   )
                                                   + 253
                                                & 61440
                                          )
                                          >> 12
                                       | (
                                                (
                                                         (
                                                               (
                                                                     (((var52 & 61440) >> 12 | var52 << 4) & 61440) >> 12
                                                                        | ((var52 & 61440) >> 12 | var52 << 4) << 4
                                                                  )
                                                                  ^ 245
                                                            )
                                                            & 65520
                                                      )
                                                      >> 4
                                                   | (((((var52 & 61440) >> 12 | var52 << 4) & 61440) >> 12 | ((var52 & 61440) >> 12 | var52 << 4) << 4) ^ 245)
                                                      << 12
                                             )
                                             + 253
                                          << 4
                                 )
                                 + 106
                              << 11
                     )
                     ^ 169
               )
            );
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_80.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = (-56526254 | 855610743) ^ -16777353; var35 < var19.length(); var35 += 702445514 << 1685885572 ^ -1645773663) {
            int var62 = var19.charAt(var35);
            int var98 = (var62 & 65504) >> 5;
            int var63 = (var62 & 65504) >> 5 | var62 << 11;
            int var99 = (((var62 & 65504) >> 5 | var62 << 11) & 65534) >> 1;
            var62 = ((((var98 | var62 << 11) & 65534) >> 1 | ((var62 & 65504) >> 5 | var62 << 11) << 15) ^ 103) - 214 + 18 + 42 - 1 + 37;
            var98 = (((var99 | var63 << 15) ^ 103) - 214 + 18 + 42 - 1 + 37 & 57344) >> 13;
            int var65 = (((var99 | var63 << 15) ^ 103) - 214 + 18 + 42 - 1 + 37 & 57344) >> 13 | var62 << 3;
            int var101 = (((((var99 | var63 << 15) ^ 103) - 214 + 18 + 42 - 1 + 37 & 57344) >> 13 | var62 << 3) & 65024) >> 9;
            char var66 = (char)(
               ((var98 | var62 << 3) & 65024) >> 9 | ((((var99 | var63 << 15) ^ 103) - 214 + 18 + 42 - 1 + 37 & 57344) >> 13 | var62 << 3) << 7
            );
            var19.setCharAt(var35, (char)(var101 | var65 << 7));
         }

         Class var7 = Class.forName(var19.toString(), false, Class_80.class.getClassLoader());
         switch (((var4 ^ 681724823) + 1682077126 ^ 614885249) - 191534310 - 787179281 - 1649948933 + 1031373540 + 1719680536 + 434947288 ^ 1421095347) {
            case 57782068:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            case 68166517:
            case 1750001959:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 86884965:
               var10000 = var0.findSpecial(var7, var5, var6, Class_80.class);
               break;
            case 814354588:
               var10000 = var0.findConstructor(var7, var6);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_2188[var10 + 132096506 + 388028217 + 1716299915 - 1156483294 + 1872169865 - 353855297 + 418648231 + 1534414761 ^ 653537549 ^ 708260050] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1414(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 + 2117115484 ^ 1968867816 ^ 1048229072) + 881026391 + 1439123113 ^ 137360653) - 352782655 ^ 776625249 ^ 69510965;
      MethodHandle var10000 = field_2188[((var10 + 2117115484 ^ 1968867816 ^ 1048229072) + 881026391 + 1439123113 ^ 137360653) - 352782655
         ^ 776625249
         ^ 69510965
         ^ 36746935];
      if (field_2188[var10001 ^ 36746935] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = (228604121 << -370142416 | 0) & -1021280159; var24 < var14.length(); var24 += (1040963777 | -696750603 >>> 1701603154) ^ 1040973278) {
            int var43 = var14.charAt(var24) - 'G' + 120;
            int var10004 = (var43 & 65504) >> 5;
            int var44 = ((var43 & 65504) >> 5 | var43 << 11) ^ 105;
            int var86 = ((((var43 & 65504) >> 5 | var43 << 11) ^ 105) & 65534) >> 1;
            var43 = (((((var10004 | var43 << 11) ^ 105) & 65534) >> 1 | (((var43 & 65504) >> 5 | var43 << 11) ^ 105) << 15) ^ 93) + 210;
            var10004 = (((var86 | var44 << 15) ^ 93) + 210 & 49152) >> 14;
            int var46 = ((((var86 | var44 << 15) ^ 93) + 210 & 49152) >> 14 | var43 << 2) + 71;
            int var88 = (((((var86 | var44 << 15) ^ 93) + 210 & 49152) >> 14 | var43 << 2) + 71 & 49152) >> 14;
            char var47 = (char)(((var10004 | var43 << 2) + 71 & 49152) >> 14 | ((((var86 | var44 << 15) ^ 93) + 210 & 49152) >> 14 | var43 << 2) + 71 << 2);
            var14.setCharAt(var24, (char)(var88 | var46 << 2));
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = -168530474 >> 1549000885 ^ -81; var30 < var17.length(); var30 += (301089985 << 697333028 | 1) & -523062971) {
            int var52 = var17.charAt(var30);
            int var89 = (var52 & 65024) >> 9;
            int var53 = ((var52 & 65024) >> 9 | var52 << 7) - 50;
            int var90 = (((var52 & 65024) >> 9 | var52 << 7) - 50 & 65532) >> 2;
            var52 = ((var89 | var52 << 7) - 50 & 65532) >> 2 | ((var52 & 65024) >> 9 | var52 << 7) - 50 << 14;
            var89 = ((var90 | var53 << 14) & 65408) >> 7;
            int var55 = (((var90 | var53 << 14) & 65408) >> 7 | var52 << 9) + 229;
            int var92 = ((((var90 | var53 << 14) & 65408) >> 7 | var52 << 9) + 229 & 65408) >> 7;
            var52 = ((var89 | var52 << 9) + 229 & 65408) >> 7 | (((var90 | var53 << 14) & 65408) >> 7 | var52 << 9) + 229 << 9;
            var89 = ((var92 | var55 << 9) & 65408) >> 7;
            int var57 = ((var92 | var55 << 9) & 65408) >> 7 | var52 << 9;
            int var94 = ((((var92 | var55 << 9) & 65408) >> 7 | var52 << 9) & 65520) >> 4;
            char var58 = (char)((((var89 | var52 << 9) & 65520) >> 4 | (((var92 | var55 << 9) & 65408) >> 7 | var52 << 9) << 12) ^ 140 ^ 42);
            var17.setCharAt(var30, (char)((var94 | var57 << 12) ^ 140 ^ 42));
         }

         Class var6 = Class.forName(var17.toString(), false, Class_80.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = 251740797 << 1250932061 ^ -1610612736; var36 < var20.length(); var36 += (-1219107286 * -1186567097 | 1) & -2147155879) {
            int var63 = (var20.charAt(var36) ^ 'd') + 227 ^ 75;
            int var95 = (var63 & 49152) >> 14;
            int var64 = ((((var63 & 49152) >> 14 | var63 << 2) + 238 ^ 158) - 236 ^ 198) + 95;
            int var96 = (((((var63 & 49152) >> 14 | var63 << 2) + 238 ^ 158) - 236 ^ 198) + 95 & 64512) >> 10;
            char var65 = (char)(
               ((((var95 | var63 << 2) + 238 ^ 158) - 236 ^ 198) + 95 & 64512) >> 10
                  | ((((var63 & 49152) >> 14 | var63 << 2) + 238 ^ 158) - 236 ^ 198) + 95 << 6
            );
            var20.setCharAt(var36, (char)(var96 | var64 << 6));
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_80.class.getClassLoader()).returnType();
         switch ((((var4 - 244901070 ^ 1656335221) + 445755533 ^ 1147957993) + 2083368316 ^ 430605109) - 1840318525 - 1947447452 + 759710070 + 1584854101) {
            case 105985206:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            case 1110834371:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            case 1638082336:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            case 1955224820:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_2188[((var10 + 2117115484 ^ 1968867816 ^ 1048229072) + 881026391 + 1439123113 ^ 137360653) - 352782655 ^ 776625249 ^ 69510965 ^ 36746935] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
