import dev.krypton.native.Loader;
import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;
import java.util.List;
import net.minecraft.class_2561;
import net.minecraft.class_2583;
import net.minecraft.class_5250;

public class Class_385 extends Class_342 {
   // $VF: renamed from: pmq Class_168
   public Class_168 field_1591;
   // $VF: renamed from: mk Class_168
   public Class_168 field_1592;
   // $VF: renamed from: nrr Class_168
   public Class_168 field_1593;
   // $VF: renamed from: bj Class_168
   public Class_168 field_1594;
   // $VF: renamed from: gto Class_168
   public Class_168 field_1595;
   // $VF: renamed from: rdd Class_168
   public Class_168 field_1596;
   // $VF: renamed from: jav java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_1597 = new MethodHandle[-453263872 >> -453263872 ^ -453263728];

   public Class_385() {
      int var10001 = (-934588176 << -934588176 | 0) & 159;

      StringBuilder var10002;
      for (var10002 = (StringBuilder)0<"JNT",-2133023535,"㠻頸퀸頸8䠻","蔕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚씕ԥ","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878634>(
            "缳\ueb33ጬדּ\ue732댳㜬\ueb33㜬㌬"
         );
         var10001 < (-1899686004 << 543776267 ^ 683433994);
         var10001 += 317118053 * -685853647 ^ -540799660
      ) {
         int var48 = (0<"JNT",1850254157,"核ꀸ堸\uf038堇8","蔕씝씕䔠","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878632>(var10002, var10001) ^ 188) + 111;
         char var49 = (char)(((var48 & 64512) >> 10 | var48 << 6) + 249 - 82);
         0<"JNT",1850254157,"\ue838砸8标ꀸ堸\uf038堇8","蔕씝䔠씕ԥ","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878631>(
            var10002, var10001, (char)(((var48 & 64512) >> 10 | var48 << 6) + 249 - 82)
         );
      }

      String var2 = 0<"JNT",1850254157,"8져\ue8078\uf038頸퀸蠸","蔕씕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878517>(var10002);
      int var22 = 1136240721 >> 1136240721 ^ 8668;

      StringBuilder var51;
      for (var51 = (StringBuilder)0<"JNT",-2133023535,"㠻頸퀸頸8䠻","蔕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚씕ԥ","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878516>(
            "﹩繷繼繹﹖纀ﺀ繷ﺀ繻纀ﺀ繻繸纀﹖繾ﹽ﹖纀繸繾ﹿ繹ﹷ繾繷ﹿﹸ"
         );
         var22 < ((-163575516 >>> -163575516 + -163575516 | 20) & 420059007);
         var22 += (1077653764 | -1052443237) ^ -1048576610
      ) {
         int var95 = 0<"JNT",1850254157,"核ꀸ堸\uf038堇8","蔕씝씕䔠","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878592>(var51, var22) - '.' + 191 + 205;
         char var96 = (char)(((var95 & 32768) >> 15 | var95 << 1) + 183);
         0<"JNT",1850254157,"\ue838砸8标ꀸ堸\uf038堇8","蔕씝䔠씕ԥ","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878591>(
            var51, var22, (char)(((var95 & 32768) >> 15 | var95 << 1) + 183)
         );
      }

      super(
         var2,
         0<"JNT",1850254157,"8져\ue8078\uf038頸퀸蠸","蔕씕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878479>(var51),
         -1,
         1<"JNT",-1745846513,"\u1978馂饸","릖꒖","ϛλ࡛රಛջ",2036174960>()
      );
      var10001 = (1496756138 >> 529911192 | 0) & 122627488;

      for (var10002 = (StringBuilder)0<"JNT",-2133023535,"㠻頸퀸頸8䠻","蔕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚씕ԥ","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878477>("漀䴀䰀圀㬀");
         var10001 < (49383546 & -1914227541 ^ 14745647);
         var10001 += (509442792 - 1434642953 | 1) & 824208417
      ) {
         char var54 = 0<"JNT",1850254157,"核ꀸ堸\uf038堇8","蔕씝씕䔠","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878633>(var10002, var10001);
         char var57 = (char)(
            (
                  (
                        (((((var54 & '쀀') >> 14 | var54 << 2) & 32768) >> 15 | ((var54 & '쀀') >> 14 | var54 << 2) << 1) & 63488) >> 11
                           | ((((var54 & '쀀') >> 14 | var54 << 2) & 32768) >> 15 | ((var54 & '쀀') >> 14 | var54 << 2) << 1) << 5
                     )
                     ^ 122
               )
               + 56
         );
         0<"JNT",1850254157,"\ue838砸8标ꀸ堸\uf038堇8","蔕씝䔠씕ԥ","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878552>(
            var10002,
            var10001,
            (char)(
               (
                     (
                           (((((var54 & '쀀') >> 14 | var54 << 2) & 32768) >> 15 | ((var54 & '쀀') >> 14 | var54 << 2) << 1) & 63488) >> 11
                              | ((((var54 & '쀀') >> 14 | var54 << 2) & 32768) >> 15 | ((var54 & '쀀') >> 14 | var54 << 2) << 1) << 5
                        )
                        ^ 122
                  )
                  + 56
            )
         );
      }

      String var5 = 0<"JNT",1850254157,"8져\ue8078\uf038頸퀸蠸","蔕씕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878556>(var10002);
      int var26 = -2089103997 - -2134187198 ^ 45083201;

      for (var51 = (StringBuilder)0<"JNT",-2133023535,"㠻頸퀸頸8䠻","蔕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚씕ԥ","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878635>("ɆɆɆɮ");
         var26 < (1854482964 - 1854482964 ^ 4);
         var26 += -1658097824 ^ 263838500 ^ -1835879355
      ) {
         char var102 = 0<"JNT",1850254157,"核ꀸ堸\uf038堇8","蔕씝씕䔠","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878650>(var51, var26);
         char var103 = (char)((((var102 & '\ufffe') >> 1 | var102 << 15) - 209 + 111 ^ 194) + 54);
         0<"JNT",1850254157,"\ue838砸8标ꀸ堸\uf038堇8","蔕씝䔠씕ԥ","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878649>(
            var51, var26, (char)((((var102 & '\ufffe') >> 1 | var102 << 15) - 209 + 111 ^ 194) + 54)
         );
      }

      this.field_1591 = (Class_168)0<"JNT",-2133023535,"㠻頸퀸頸8䠻","蔕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚씕ԥ","椐鴐",-1811878589>(
         var5, 0<"JNT",1850254157,"8져\ue8078\uf038頸퀸蠸","蔕씕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878590>(var51)
      );
      var10001 = (280535193 >>> 280535193 | 0) & -336297225;

      for (var10002 = (StringBuilder)0<"JNT",-2133023535,"㠻頸퀸頸8䠻","蔕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚씕ԥ","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878588>("ʌˠ˄̈ː̌");
         var10001 < ((-568986889 << -742557950 | 2) & -2078264314);
         var10001 += (-244505586 | 394808725) ^ -135434850
      ) {
         char var62 = 0<"JNT",1850254157,"核ꀸ堸\uf038堇8","蔕씝씕䔠","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878630>(var10002, var10001);
         int var147 = (var62 & '\uffc0') >> 6;
         int var63 = (var62 & '\uffc0') >> 6 | var62 << '\n';
         int var148 = (((var62 & '\uffc0') >> 6 | var62 << '\n') & 63488) >> 11;
         int var64 = ((var147 | var62 << '\n') & 63488) >> 11 | ((var62 & '\uffc0') >> 6 | var62 << '\n') << 5;
         var147 = ((var148 | var63 << 5) & 65534) >> 1;
         int var65 = ((var148 | var63 << 5) & 65534) >> 1 | var64 << 15;
         int var150 = ((((var148 | var63 << 5) & 65534) >> 1 | var64 << 15) & 0) >> 16;
         char var66 = (char)((((var147 | var64 << 15) & 0) >> 16 | (((var148 | var63 << 5) & 65534) >> 1 | var64 << 15) << 0) - 80);
         0<"JNT",1850254157,"\ue838砸8标ꀸ堸\uf038堇8","蔕씝䔠씕ԥ","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878629>(
            var10002, var10001, (char)((var150 | var65 << 0) - 80)
         );
      }

      String var8 = 0<"JNT",1850254157,"8져\ue8078\uf038頸퀸蠸","蔕씕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878578>(var10002);
      int var30 = -1537999665 - 1127850709 ^ 1629116922;

      for (var51 = (StringBuilder)0<"JNT",-2133023535,"㠻頸퀸頸8䠻","蔕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚씕ԥ","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878577>("ṟṟṟ鹝");
         var30 < ((1962899172 | -853644172 | 4) & 32773);
         var30 += (-324747232 << -1758893882 | 1) & -1811700299
      ) {
         char var110 = 0<"JNT",1850254157,"核ꀸ堸\uf038堇8","蔕씝씕䔠","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878582>(var51, var30);
         char var113 = (char)(
            ((((((var110 & '\ufffe') >> 1 | var110 << 15) ^ 159) + 83 & 65534) >> 1 | (((var110 & '\ufffe') >> 1 | var110 << 15) ^ 159) + 83 << 15) & 63488)
                  >> 11
               | (((((var110 & '\ufffe') >> 1 | var110 << 15) ^ 159) + 83 & 65534) >> 1 | (((var110 & '\ufffe') >> 1 | var110 << 15) ^ 159) + 83 << 15) << 5
         );
         0<"JNT",1850254157,"\ue838砸8标ꀸ堸\uf038堇8","蔕씝䔠씕ԥ","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878581>(
            var51,
            var30,
            (char)(
               ((((((var110 & '\ufffe') >> 1 | var110 << 15) ^ 159) + 83 & 65534) >> 1 | (((var110 & '\ufffe') >> 1 | var110 << 15) ^ 159) + 83 << 15) & 63488)
                     >> 11
                  | (((((var110 & '\ufffe') >> 1 | var110 << 15) ^ 159) + 83 & 65534) >> 1 | (((var110 & '\ufffe') >> 1 | var110 << 15) ^ 159) + 83 << 15) << 5
            )
         );
      }

      this.field_1592 = (Class_168)0<"JNT",-2133023535,"㠻頸퀸頸8䠻","蔕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚씕ԥ","椐鴐",-1811878626>(
         var8, 0<"JNT",1850254157,"8져\ue8078\uf038頸퀸蠸","蔕씕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878627>(var51)
      );
      var10001 = (-1498352710 - -2027398461 | 0) & 541550344;

      for (var10002 = (StringBuilder)0<"JNT",-2133023535,"㠻頸퀸頸8䠻","蔕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚씕ԥ","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878625>("뀊逌쀌쀌」");
         var10001 < (-1679688625 * 515233503 ^ 1486869204);
         var10001 += -275413474 - -1388928785 ^ 1113515310
      ) {
         int var71 = 0<"JNT",1850254157,"核ꀸ堸\uf038堇8","蔕씝씕䔠","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878638>(var10002, var10001) - 6;
         int var154 = (var71 & 61440) >> 12;
         int var72 = (var71 & 61440) >> 12 | var71 << 4;
         int var155 = (((var71 & 61440) >> 12 | var71 << 4) & 0) >> 16;
         int var73 = ((var154 | var71 << 4) & 0) >> 16 | ((var71 & 61440) >> 12 | var71 << 4) << 0;
         var154 = ((var155 | var72 << 0) & 65024) >> 9;
         int var74 = ((var155 | var72 << 0) & 65024) >> 9 | var73 << 7;
         int var157 = ((((var155 | var72 << 0) & 65024) >> 9 | var73 << 7) & 65408) >> 7;
         char var75 = (char)(((var154 | var73 << 7) & 65408) >> 7 | (((var155 | var72 << 0) & 65024) >> 9 | var73 << 7) << 9);
         0<"JNT",1850254157,"\ue838砸8标ꀸ堸\uf038堇8","蔕씝䔠씕ԥ","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878637>(var10002, var10001, (char)(var157 | var74 << 9));
      }

      String var11 = 0<"JNT",1850254157,"8져\ue8078\uf038頸퀸蠸","蔕씕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878465>(var10002);
      int var34 = (-1106935696 - -1163615835 | 0) & -133029628;

      for (var51 = (StringBuilder)0<"JNT",-2133023535,"㠻頸퀸頸8䠻","蔕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚씕ԥ","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878480>("䔰䔰䔰儰");
         var34 < ((-254535829 ^ -1797834710 | 4) & 426512396);
         var34 += (-507685884 << -1416133054 - -507685884 | 1) & -651109151
      ) {
         char var120 = 0<"JNT",1850254157,"核ꀸ堸\uf038堇8","蔕씝씕䔠","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878529>(var51, var34);
         char var123 = (char)(
            ((((((var120 & '￼') >> 2 | var120 << 14) & 65534) >> 1 | ((var120 & '￼') >> 2 | var120 << 14) << 15) ^ 173) - 235 & 65504) >> 5
               | (((((var120 & '￼') >> 2 | var120 << 14) & 65534) >> 1 | ((var120 & '￼') >> 2 | var120 << 14) << 15) ^ 173) - 235 << 11
         );
         0<"JNT",1850254157,"\ue838砸8标ꀸ堸\uf038堇8","蔕씝䔠씕ԥ","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878544>(
            var51,
            var34,
            (char)(
               ((((((var120 & '￼') >> 2 | var120 << 14) & 65534) >> 1 | ((var120 & '￼') >> 2 | var120 << 14) << 15) ^ 173) - 235 & 65504) >> 5
                  | (((((var120 & '￼') >> 2 | var120 << 14) & 65534) >> 1 | ((var120 & '￼') >> 2 | var120 << 14) << 15) ^ 173) - 235 << 11
            )
         );
      }

      this.field_1593 = (Class_168)0<"JNT",-2133023535,"㠻頸퀸頸8䠻","蔕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚씕ԥ","椐鴐",-1811878489>(
         var11, 0<"JNT",1850254157,"8져\ue8078\uf038頸퀸蠸","蔕씕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878490>(var51)
      );
      var10001 = -368589398 ^ 1243584204 ^ -1609018522;

      for (var10002 = (StringBuilder)0<"JNT",-2133023535,"㠻頸퀸頸8䠻","蔕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚씕ԥ","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878472>("௸មᐘᇸ\u1778ᇘ");
         var10001 < 6;
         var10001 += (-1007574624 | 1) & 604526091
      ) {
         char var80 = 0<"JNT",1850254157,"核ꀸ堸\uf038堇8","蔕씝씕䔠","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878467>(var10002, var10001);
         int var161 = (var80 & '\ufff8') >> 3;
         int var81 = (((var80 & '\ufff8') >> 3 | var80 << '\r') ^ 20 ^ 174) - 181;
         int var162 = ((((var80 & '\ufff8') >> 3 | var80 << '\r') ^ 20 ^ 174) - 181 & 65532) >> 2;
         char var82 = (char)((((var161 | var80 << '\r') ^ 20 ^ 174) - 181 & 65532) >> 2 | (((var80 & '\ufff8') >> 3 | var80 << '\r') ^ 20 ^ 174) - 181 << 14);
         0<"JNT",1850254157,"\ue838砸8标ꀸ堸\uf038堇8","蔕씝䔠씕ԥ","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878466>(
            var10002, var10001, (char)(var162 | var81 << 14)
         );
      }

      String var14 = 0<"JNT",1850254157,"8져\ue8078\uf038頸퀸蠸","蔕씕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878636>(var10002);
      int var38 = (1191620075 | 1191620075 | 0) & -2003742188;

      for (var51 = (StringBuilder)0<"JNT",-2133023535,"㠻頸퀸頸8䠻","蔕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚씕ԥ","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878651>("聮聮聮聤");
         var38 < (-584270359 >>> -584270359 ^ 7247450);
         var38 += (818752462 << 818752462 | 1) & -1610066505
      ) {
         char var128 = 0<"JNT",1850254157,"核ꀸ堸\uf038堇8","蔕씝씕䔠","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878476>(var51, var38);
         char var129 = (char)((((var128 & '耀') >> 15 | var128 << 1) - 182 ^ 61) - 110 + 141);
         0<"JNT",1850254157,"\ue838砸8标ꀸ堸\uf038堇8","蔕씝䔠씕ԥ","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878491>(
            var51, var38, (char)((((var128 & '耀') >> 15 | var128 << 1) - 182 ^ 61) - 110 + 141)
         );
      }

      this.field_1594 = (Class_168)0<"JNT",-2133023535,"㠻頸퀸頸8䠻","蔕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚씕ԥ","椐鴐",-1811878584>(
         var14, 0<"JNT",1850254157,"8져\ue8078\uf038頸퀸蠸","蔕씕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878537>(var51)
      );
      var10001 = (-72107502 - -1637708207 | 0) & 44336174;

      for (var10002 = (StringBuilder)0<"JNT",-2133023535,"㠻頸퀸頸8䠻","蔕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚씕ԥ","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878583>("°ÌÁÙÔÉÍÅ");
         var10001 < ((1329117233 | -1406474461) ^ -281346245);
         var10001 += (-1204995336 + -1204995336 | 1) & -2103375869
      ) {
         0<"JNT",1850254157,"\ue838砸8标ꀸ堸\uf038堇8","蔕씝䔠씕ԥ","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878548>(
            var10002,
            var10001,
            (char)(0<"JNT",1850254157,"核ꀸ堸\uf038堇8","蔕씝씕䔠","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878549>(var10002, var10001) + '^' - 246 - 56 - 4 + 116)
         );
      }

      String var17 = 0<"JNT",1850254157,"8져\ue8078\uf038頸퀸蠸","蔕씕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878628>(var10002);
      int var42 = (1923914802 | 795861393) ^ 2146434483;

      for (var51 = (StringBuilder)0<"JNT",-2133023535,"㠻頸퀸頸8䠻","蔕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚씕ԥ","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878579>(">>>䀩䀸>>>䀪");
         var42 < ((1316651076 | 767269823 | 0) & 268460041);
         var42 += (1265199660 | -776144352 | 1) & 604110993
      ) {
         char var132 = 0<"JNT",1850254157,"核ꀸ堸\uf038堇8","蔕씝씕䔠","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878539>(var51, var42);
         char var135 = (char)(
            (
                  (((((var132 & '\ufffe') >> 1 | var132 << 15) & 0) >> 16 | ((var132 & '\ufffe') >> 1 | var132 << 15) << 0) & 57344) >> 13
                     | ((((var132 & '\ufffe') >> 1 | var132 << 15) & 0) >> 16 | ((var132 & '\ufffe') >> 1 | var132 << 15) << 0) << 3
               )
               ^ 16
               ^ 209
         );
         0<"JNT",1850254157,"\ue838砸8标ꀸ堸\uf038堇8","蔕씝䔠씕ԥ","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878538>(
            var51,
            var42,
            (char)(
               (
                     (((((var132 & '\ufffe') >> 1 | var132 << 15) & 0) >> 16 | ((var132 & '\ufffe') >> 1 | var132 << 15) << 0) & 57344) >> 13
                        | ((((var132 & '\ufffe') >> 1 | var132 << 15) & 0) >> 16 | ((var132 & '\ufffe') >> 1 | var132 << 15) << 0) << 3
                  )
                  ^ 16
                  ^ 209
            )
         );
      }

      this.field_1595 = (Class_168)0<"JNT",-2133023535,"㠻頸퀸頸8䠻","蔕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚씕ԥ","椐鴐",-1811878531>(
         var17, 0<"JNT",1850254157,"8져\ue8078\uf038頸퀸蠸","蔕씕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878580>(var51)
      );
      var10001 = (-724620604 | -724620604 | 0) & 572540194;

      for (var10002 = (StringBuilder)0<"JNT",-2133023535,"㠻頸퀸頸8䠻","蔕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚씕ԥ","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878530>("5FBN");
         var10001 < (-1184711372 & 1734072056 ^ 558011444);
         var10001 += 728988823 - -1607373739 ^ -1958604733
      ) {
         0<"JNT",1850254157,"\ue838砸8标ꀸ堸\uf038堇8","蔕씝䔠씕ԥ","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878550>(
            var10002,
            var10001,
            (char)(
               0<"JNT",1850254157,"核ꀸ堸\uf038堇8","蔕씝씕䔠","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878551>(var10002, var10001) - 211 + 127 - 51 + 187 - 21
            )
         );
      }

      String var20 = 0<"JNT",1850254157,"8져\ue8078\uf038頸퀸蠸","蔕씕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878558>(var10002);
      int var46 = (-1713801012 >>> -975846954 | 0) & 2001639816;

      for (var51 = (StringBuilder)0<"JNT",-2133023535,"㠻頸퀸頸8䠻","蔕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚씕ԥ","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878557>(
            "\uf30fﰿﱿﲿ\uf29fﵯ﷿﵏ﴏﵟﲯ"
         );
         var46 < ((-1583037012 | 1806243868 | 11) & 67239947);
         var46 += -1031640943 + -1632659985 ^ 1630666369
      ) {
         char var138 = 0<"JNT",1850254157,"核ꀸ堸\uf038堇8","蔕씝씕䔠","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878640>(var51, var46);
         int var180 = (var138 & '￼') >> 2;
         int var139 = (var138 & '￼') >> 2 | var138 << 14;
         int var181 = (((var138 & '￼') >> 2 | var138 << 14) & 65532) >> 2;
         var138 = (char)(((((var180 | var138 << 14) & 65532) >> 2 | ((var138 & '￼') >> 2 | var138 << 14) << 14) ^ 69) + 226 - 3);
         0<"JNT",1850254157,"\ue838砸8标ꀸ堸\uf038堇8","蔕씝䔠씕ԥ","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878639>(
            var51, var46, (char)(((var181 | var139 << 14) ^ 69) + 226 - 3)
         );
      }

      this.field_1596 = (Class_168)0<"JNT",-2133023535,"㠻頸퀸頸8䠻","蔕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚씕ԥ","椐鴐",-1811878470>(
         var20, 0<"JNT",1850254157,"8져\ue8078\uf038頸퀸蠸","蔕씕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878471>(var51)
      );
      0<"JNT",1850254157,"\ud838\uf838","蔕䔢蔞씫씨씨䔚씕ԥ","輐紐輐",-1811878559>(
         this,
         new Class_271[]{
            1<"JNT",-318005366,"\u1978馃饹","몖ꆖ몖","ϛλ࡛\u0b7bົջ",2036174905>(this),
            1<"JNT",-318005366,"馃饦","몖ꆖ몖","ϛλ࡛\u0b7bົջ",2036174946>(this),
            1<"JNT",-318005366,"ᦃ\u1979\u1979","몖ꆖ몖","ϛλ࡛\u0b7bົջ",2036174947>(this),
            1<"JNT",-318005366,"ᦁᦅ","몖ꆖ몖","ϛλ࡛\u0b7bົջ",2036174948>(this),
            1<"JNT",-318005366,"馀\u1976馄","몖ꆖ몖","ϛλ࡛\u0b7bົջ",2036174933>(this),
            1<"JNT",-318005366,"\u1979\u197e\u197e","몖ꆖ몖","ϛλ࡛\u0b7bົջ",2036174942>(this)
         }
      );
   }

   // $VF: renamed from: ln (net.minecraft.class_2561) net.minecraft.class_2561
   public class_2561 method_1452(class_2561 var1) {
      int var11 = -1329559103;
      String var2 = 0<"JNT",778569832,"蠸砸8\ue8078\uf038頸퀸蠸","蔕씕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚","挐甐霐\ue30e攐洐挐甐礐鬐紐猐霐\ue30e礐朐紐餐餐脐ᬏᔏጏᴏ",-1811878443>(var1);
      String var3 = null;
      String var10000 = var2;
      int var10001 = (-859944436 + (-1819556237 & 1258501765) | 0) & 807415378;
      StringBuilder var10002 = (StringBuilder)0<"JNT",-2133023535,"㠻頸퀸頸8䠻","蔕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚씕ԥ","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878442>(
         "쫲䫻ૻ쫸쫽"
      );

      label157:
      while (true) {
         var11 = (-241439767 * -736726844 | -1295539247) & -1159220237;

         while (true) {
            label153:
            while (true) {
               label151:
               while (true) {
                  label149:
                  while (true) {
                     label147:
                     while (true) {
                        label161: {
                           StringBuilder var19;
                           switch ((var11 - 898751428 + 1069992769 + 389933631 + 1165037235 ^ 1598765042) + 249062865) {
                              case -1917247133:
                              default:
                                 var19 = var10002;
                                 if (var10001 < ((1845515251 << 2033613588 + -2120893233 | 5) & -2124144633)) {
                                    int var52 = 0<"JNT",1850254157,"核ꀸ堸\uf038堇8","蔕씝씕䔠","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878448>(
                                          var10002, var10001
                                       )
                                       + '!';
                                    char var55 = (char)(
                                       (((((var52 & 65504) >> 5 | var52 << 11) & 65528) >> 3 | ((var52 & 65504) >> 5 | var52 << 11) << 13) - 139 & 65472) >> 6
                                          | ((((var52 & 65504) >> 5 | var52 << 11) & 65528) >> 3 | ((var52 & 65504) >> 5 | var52 << 11) << 13) - 139 << 10
                                    );
                                    0<"JNT",1850254157,"\ue838砸8标ꀸ堸\uf038堇8","蔕씝䔠씕ԥ","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878447>(
                                       var10002,
                                       var10001,
                                       (char)(
                                          (((((var52 & 65504) >> 5 | var52 << 11) & 65528) >> 3 | ((var52 & 65504) >> 5 | var52 << 11) << 13) - 139 & 65472)
                                                >> 6
                                             | ((((var52 & 65504) >> 5 | var52 << 11) & 65528) >> 3 | ((var52 & 65504) >> 5 | var52 << 11) << 13) - 139 << 10
                                       )
                                    );
                                    var10001 += (2011432129 + 699343409 | 1) & 1074581761;
                                    continue label157;
                                 }

                                 var11 = (-1515533382 + 1925026645 | 65241129) & -202399427;
                                 break;
                              case -1915443084:
                                 var19 = var10002;
                                 if (var10001 < ((2114707751 - (2103560492 >>> 2103560492) | 4) & 32022646)) {
                                    char var46 = 0<"JNT",1850254157,"核ꀸ堸\uf038堇8","蔕씝씕䔠","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878437>(
                                       var10002, var10001
                                    );
                                    char var49 = (char)(
                                       (((((var46 & '耀') >> 15 | var46 << 1) & 32768) >> 15 | ((var46 & '耀') >> 15 | var46 << 1) << 1) - 125 + 57 & 65532) >> 2
                                          | ((((var46 & '耀') >> 15 | var46 << 1) & 32768) >> 15 | ((var46 & '耀') >> 15 | var46 << 1) << 1) - 125 + 57 << 14
                                    );
                                    0<"JNT",1850254157,"\ue838砸8标ꀸ堸\uf038堇8","蔕씝䔠씕ԥ","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878436>(
                                       var10002,
                                       var10001,
                                       (char)(
                                          (((((var46 & '耀') >> 15 | var46 << 1) & 32768) >> 15 | ((var46 & '耀') >> 15 | var46 << 1) << 1) - 125 + 57 & 65532)
                                                >> 2
                                             | ((((var46 & '耀') >> 15 | var46 << 1) & 32768) >> 15 | ((var46 & '耀') >> 15 | var46 << 1) << 1) - 125 + 57 << 14
                                       )
                                    );
                                    var10001 += (1505395957 | 867728377) ^ 2075852796;
                                    break label153;
                                 }

                                 var11 = -1094244151 - 194842065 ^ 1170865141;
                                 break;
                              case -1468974244:
                                 var19 = var10002;
                                 if (var10001 < (181987359 + 2105673365 ^ -2007306574)) {
                                    char var41 = 0<"JNT",1850254157,"核ꀸ堸\uf038堇8","蔕씝씕䔠","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878602>(
                                       var10002, var10001
                                    );
                                    int var75 = (var41 & '￠') >> 5;
                                    int var42 = ((var41 & '￠') >> 5 | var41 << 11) ^ 53;
                                    int var76 = ((((var41 & '￠') >> 5 | var41 << 11) ^ 53) & 65535) >> 0;
                                    var41 = (char)((((((var75 | var41 << 11) ^ 53) & 65535) >> 0 | (((var41 & '￠') >> 5 | var41 << 11) ^ 53) << 16) ^ 210) - 45);
                                    0<"JNT",1850254157,"\ue838砸8标ꀸ堸\uf038堇8","蔕씝䔠씕ԥ","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878601>(
                                       var10002, var10001, (char)(((var76 | var42 << 16) ^ 210) - 45)
                                    );
                                    var10001 += (1166363288 >>> -695090204 | 0) & 330517;
                                    break label151;
                                 }

                                 var11 = 990278292 * 1842010489 ^ 1557306649;
                                 break;
                              case -332478118:
                                 var19 = var10002;
                                 if (var10001 < ((-677893353 + (1769711986 >>> -677893353) | 5) & 138579973)) {
                                    char var35 = 0<"JNT",1850254157,"核ꀸ堸\uf038堇8","蔕씝씕䔠","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878656>(
                                       var10002, var10001
                                    );
                                    char var38 = (char)(
                                       (
                                                (
                                                         (((var35 & '\uf800') >> 11 | var35 << 5) + 185 & 65472) >> 6
                                                            | ((var35 & '\uf800') >> 11 | var35 << 5) + 185 << 10
                                                      )
                                                      + 83
                                                   & 65520
                                             )
                                             >> 4
                                          | ((((var35 & '\uf800') >> 11 | var35 << 5) + 185 & 65472) >> 6 | ((var35 & '\uf800') >> 11 | var35 << 5) + 185 << 10)
                                                + 83
                                             << 12
                                    );
                                    0<"JNT",1850254157,"\ue838砸8标ꀸ堸\uf038堇8","蔕씝䔠씕ԥ","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878655>(
                                       var10002,
                                       var10001,
                                       (char)(
                                          (
                                                   (
                                                            (((var35 & '\uf800') >> 11 | var35 << 5) + 185 & 65472) >> 6
                                                               | ((var35 & '\uf800') >> 11 | var35 << 5) + 185 << 10
                                                         )
                                                         + 83
                                                      & 65520
                                                )
                                                >> 4
                                             | (
                                                      (((var35 & '\uf800') >> 11 | var35 << 5) + 185 & 65472) >> 6
                                                         | ((var35 & '\uf800') >> 11 | var35 << 5) + 185 << 10
                                                   )
                                                   + 83
                                                << 12
                                       )
                                    );
                                    var10001 += -856845268 >>> 910580485 ^ 107441312;
                                    break label149;
                                 }

                                 var11 = 1734755921 * 80342144 ^ -2100599930;
                                 break;
                              case 286411556:
                                 var19 = var10002;
                                 if (var10001 < ((1770956415 >> (1770956415 >>> -1223693800) | 8) & 792801324)) {
                                    int var31 = 0<"JNT",1850254157,"核ꀸ堸\uf038堇8","蔕씝씕䔠","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878613>(
                                          var10002, var10001
                                       )
                                       ^ '\''
                                       ^ 27;
                                    char var32 = (char)((((var31 & 65528) >> 3 | var31 << 13) ^ 8) - 173);
                                    0<"JNT",1850254157,"\ue838砸8标ꀸ堸\uf038堇8","蔕씝䔠씕ԥ","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878612>(
                                       var10002, var10001, (char)((((var31 & 65528) >> 3 | var31 << 13) ^ 8) - 173)
                                    );
                                    var10001 += 896962121 - 896962121 ^ 1;
                                    break label147;
                                 }

                                 var11 = (557538617 >> 557538617 | -682803262) & -3194881;
                                 break;
                              case 1795660171:
                                 var19 = var10002;
                                 if (var10001 < ((-703101213 << (272472048 ^ -703101213) | 4) & -2132329395)) {
                                    int var26 = 0<"JNT",1850254157,"核ꀸ堸\uf038堇8","蔕씝씕䔠","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878435>(
                                          var10002, var10001
                                       )
                                       + 'W'
                                       + 217
                                       + 204;
                                    int var10005 = (var26 & 65532) >> 2;
                                    int var27 = (var26 & 65532) >> 2 | var26 << 14;
                                    int var70 = (((var26 & 65532) >> 2 | var26 << 14) & 63488) >> 11;
                                    char var28 = (char)(((var10005 | var26 << 14) & 63488) >> 11 | ((var26 & 65532) >> 2 | var26 << 14) << 5);
                                    0<"JNT",1850254157,"\ue838砸8标ꀸ堸\uf038堇8","蔕씝䔠씕ԥ","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878434>(
                                       var10002, var10001, (char)(var70 | var27 << 5)
                                    );
                                    var10001 += (-1482130034 + (1109599619 ^ 1109599619) | 1) & 138445377;
                                    break label161;
                                 }

                                 var11 = -432846252 ^ (2010937002 | -240161806) ^ 1326433906;
                           }

                           switch (((var11 ^ 122873603) - 1582344612 ^ 1482183696) - 1546141923 - 265257027 - 1725497797) {
                              case -1716868753:
                                 if (0<"JNT",1850254157,"核져퀸8堸頸퀸\ue838","蔕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔠蔥씧Ԭ䔤씨씫씬씨ԧ䔨씨䔚씕Ԣ","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐",-1811878595>(
                                    var10000,
                                    0<"JNT",1850254157,"8져\ue8078\uf038頸퀸蠸","蔕씕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878644>(var19)
                                 )) {
                                    var3 = 0<"JNT",1850254157,"꠸꠸","蔕씕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚","椐鴐",-1811878593>(
                                       1<"JNT",-318005366,"ᦁᦅ","몖ꆖ몖","ϛλ࡛\u0b7bົջ",2036177140>(this)
                                    );
                                    break label157;
                                 }

                                 var11 = (-871107890 >> 2130709295 | 268699464) & 286572393;
                                 break;
                              case -800621504:
                              default:
                                 if (0<"JNT",1850254157,"核져퀸8堸頸퀸\ue838","蔕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔠蔥씧Ԭ䔤씨씫씬씨ԧ䔨씨䔚씕Ԣ","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐",-1811878611>(
                                    var10000,
                                    0<"JNT",1850254157,"8져\ue8078\uf038頸퀸蠸","蔕씕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878532>(var19)
                                 )) {
                                    var3 = 0<"JNT",1850254157,"꠸꠸","蔕씕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚","椐鴐",-1811878609>(
                                       1<"JNT",-318005366,"\u1979\u197e\u197e","몖ꆖ몖","ϛλ࡛\u0b7bົջ",2036178212>(this)
                                    );
                                 }
                                 break label157;
                              case -154259578:
                                 if (0<"JNT",1850254157,"核져퀸8堸頸퀸\ue838","蔕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔠蔥씧Ԭ䔤씨씫씬씨ԧ䔨씨䔚씕Ԣ","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐",-1811878457>(
                                    var10000,
                                    0<"JNT",1850254157,"8져\ue8078\uf038頸퀸蠸","蔕씕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878458>(var19)
                                 )) {
                                    var3 = 0<"JNT",1850254157,"꠸꠸","蔕씕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚","椐鴐",-1811878439>(
                                       1<"JNT",-318005366,"ᦃ\u1979\u1979","몖ꆖ몖","ϛλ࡛\u0b7bົջ",2036178262>(this)
                                    );
                                    break label157;
                                 }

                                 var11 = (-1235858878 - -62075437 | 1357619626) & 1476108779;
                                 break;
                              case -127449713:
                                 if (0<"JNT",1850254157,"核져퀸8堸頸퀸\ue838","蔕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔠蔥씧Ԭ䔤씨씫씬씨ԧ䔨씨䔚씕Ԣ","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐",-1811878616>(
                                    var10000,
                                    0<"JNT",1850254157,"8져\ue8078\uf038頸퀸蠸","蔕씕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878441>(var19)
                                 )) {
                                    var3 = 0<"JNT",1850254157,"꠸꠸","蔕씕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚","椐鴐",-1811878614>(
                                       1<"JNT",-318005366,"馃饦","몖ꆖ몖","ϛλ࡛\u0b7bົջ",2036177127>(this)
                                    );
                                    break label157;
                                 }

                                 var11 = -284745023 >> 1744799487 * -806896452 ^ 1314753278;
                                 break;
                              case 459285935:
                                 if (0<"JNT",1850254157,"核져퀸8堸頸퀸\ue838","蔕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔠蔥씧Ԭ䔤씨씫씬씨ԧ䔨씨䔚씕Ԣ","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐",-1811878623>(
                                    var10000,
                                    0<"JNT",1850254157,"8져\ue8078\uf038頸퀸蠸","蔕씕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878624>(var19)
                                 )) {
                                    var3 = 0<"JNT",1850254157,"꠸꠸","蔕씕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚","椐鴐",-1811878621>(
                                       1<"JNT",-318005366,"\u1978馃饹","몖ꆖ몖","ϛλ࡛\u0b7bົջ",2036178208>(this)
                                    );
                                    break label157;
                                 }

                                 var11 = 679310937 >> -266697691 ^ 412543197;
                                 break;
                              case 1455863890:
                                 if (0<"JNT",1850254157,"核져퀸8堸頸퀸\ue838","蔕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔠蔥씧Ԭ䔤씨씫씬씨ԧ䔨씨䔚씕Ԣ","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐",-1811878653>(
                                    var10000,
                                    0<"JNT",1850254157,"8져\ue8078\uf038頸퀸蠸","蔕씕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878654>(var19)
                                 )) {
                                    var3 = 0<"JNT",1850254157,"꠸꠸","蔕씕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚","椐鴐",-1811878603>(
                                       1<"JNT",-318005366,"馀\u1976馄","몖ꆖ몖","ϛλ࡛\u0b7bົջ",2036178186>(this)
                                    );
                                    break label157;
                                 }

                                 var11 = (462750011 | 1768130881) ^ 638606767;
                           }

                           switch (((var11 ^ 1893416038) + 1404354759 ^ 2001202851) + 492292463 + 14450676 + 2071504895) {
                              case -1855768260:
                                 var10000 = var2;
                                 var10001 = 1845891605 << 246235341 ^ -1035821056;
                                 var10002 = (StringBuilder)0<"JNT",-2133023535,"㠻頸퀸頸8䠻","蔕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚씕ԥ","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878433>(
                                    "縎鸐Ḑ鸑"
                                 );
                                 break;
                              case -1672502695:
                                 var10000 = var2;
                                 var10001 = (402065858 ^ 662397976 | 0) & -1023245819;
                                 var10002 = (StringBuilder)0<"JNT",-2133023535,"㠻頸퀸頸8䠻","蔕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚씕ԥ","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878620>(
                                    "ዀຠഠࣀเ࣠"
                                 );
                                 break label151;
                              case -48669382:
                              default:
                                 var10000 = var2;
                                 var10001 = (-603702271 | -603702271 | -603702271 | 0) & 599507748;
                                 var10002 = (StringBuilder)0<"JNT",-2133023535,"㠻頸퀸頸8䠻","蔕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚씕ԥ","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878540>(
                                    "䂴䑴䓔䓔䖴"
                                 );
                                 break label149;
                              case 1550876375:
                                 var10000 = var2;
                                 var10001 = (929472265 | -1572892794 | 0) & 1082130448;
                                 var10002 = (StringBuilder)0<"JNT",-2133023535,"㠻頸퀸頸8䠻","蔕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚씕ԥ","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878446>(
                                    "ޔࢴࠌौॴ࣌ࢬ࣬"
                                 );
                                 break label147;
                              case 1697776341:
                                 var10000 = var2;
                                 var10001 = (791019088 & 1665145098 | 0) & -1064189811;
                                 var10002 = (StringBuilder)0<"JNT",-2133023535,"㠻頸퀸頸8䠻","蔕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚씕ԥ","欐紐錐紐\ue30e朐紐挐焐\ue30e\ud910霐鬐洐挐焐묐锐洐朐眐甐鬐",-1811878645>(
                                    "dyr\u0083u\u0084"
                                 );
                                 break label153;
                           }
                        }

                        var11 = 1014794169 << 1014794169 ^ -293594151;
                     }

                     var11 = -1626087429 >>> -1059225950 ^ -783671860;
                  }

                  var11 = -1877687307 + (1591486102 ^ 1591486102) ^ -1959940103;
               }

               var11 = 693734269 >> 103593476 ^ 1568301757;
            }

            var11 = -1090798362 & -69742606;
         }
      }

      var11 = -1719845445;

      while (true) {
         switch ((var11 ^ 1778704202) + 209537270 + 1745425330 + 956888852 - 244784044 - 1455992301) {
            case -1325205552:
            default:
               class_2583 var4 = 0<"JNT",1850254157,"核뀸\ue038","蔕蔞ԧ씨蔬䔗씦씥ԧ씨䔨Ԭ씧ԩ蔬䔗䔨蔦씧䔬䔬䔣Ԝ씜ԝ씛䔚씕蔞ԧ씨蔬䔗씦씥ԧ씨䔨Ԭ씧ԩ蔬䔗䔨蔦씧䔬䔬䔣Ԝ씜蔙䔜䔚","輐紐輐",-1811878445>(this, var1);
               List var5 = 0<"JNT",778569832,"렸砸8ꀸ져耸䠸퀺\ud83aᠻ\uf03a\uf03a","蔕씕蔞Ԧ씧ԭ씧䔗씬蔬씥蔦䔗蔞씥䔬蔬䔚","挐甐霐\ue30e攐洐挐甐礐鬐紐猐霐\ue30e礐朐紐餐餐脐ᬏᔏጏᴏ",-1811878444>(var1);
               if (0<"JNT",778569832,"頸\ue838砇렸\ue0388ᠹ","蔕씕Ԣ","欐紐錐紐\ue30e锐霐洐朐\ue30e꜐洐餐霐",-1811878459>(var5)) {
                  return var1;
               } else {
                  class_2561 var6 = (class_2561)0<"JNT",778569832,"蠸砸8","蔕씝씕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔟ԨԦ씨䔨蔬䔚","欐紐錐紐\ue30e锐霐洐朐\ue30e꜐洐餐霐",-1811878648>(var5, 0);
                  List var7 = 0<"JNT",778569832,"렸砸8ꀸ져耸䠸퀺\ud83aᠻ\uf03a\uf03a","蔕씕蔞Ԧ씧ԭ씧䔗씬蔬씥蔦䔗蔞씥䔬蔬䔚","挐甐霐\ue30e攐洐挐甐礐鬐紐猐霐\ue30e礐朐紐餐餐脐ᬏᔏጏᴏ",-1811878647>(var6);
                  if (0<"JNT",778569832,"\ue838頸〹砸","蔕씕씝","欐紐錐紐\ue30e锐霐洐朐\ue30e꜐洐餐霐",-1811878646>(var7) < 2) {
                     return var1;
                  } else {
                     class_5250 var8 = 0<"JNT",1749568459,"렸砸8ꀸ져耸䠸\uf83a\ue03a\uf83a;\ue03a","蔕씕蔞ԧ씨蔬䔗씦씥ԧ씨䔨Ԭ씧ԩ蔬䔗䔨蔦씧䔬䔬䔣씜Ԝ씜蔛䔚","挐甐霐\ue30e攐洐挐甐礐鬐紐猐霐\ue30e礐朐紐餐餐脐ᬏᔏጏᴏ",-1811878438>();
                     int var9 = 0;

                     label105:
                     while (true) {
                        var11 = (-304026614 ^ -858161355 | -425441759) & -408623581;

                        while (true) {
                           switch (((var11 - 1487909712 ^ 760343272) - 1950818679 + 2128183200 ^ 1783008184) + 97567539) {
                              case -901603057:
                              default:
                                 if (var9 < 0<"JNT",778569832,"\ue838頸〹砸","蔕씕씝","欐紐錐紐\ue30e锐霐洐朐\ue30e꜐洐餐霐",-1811878643>(var7) - 1) {
                                    0<"JNT",1850254157,"렸砸8ꀸ져耸䠸퀺\ud83aᠻ\uf03a\ue83a","蔕蔞ԧ씨蔬䔗씦씥ԧ씨䔨Ԭ씧ԩ蔬䔗䔨蔦씧䔬䔬䔣Ԝ씜ԝ씛䔚씕蔞ԧ씨蔬䔗씦씥ԧ씨䔨Ԭ씧ԩ蔬䔗䔨蔦씧䔬䔬䔣씜Ԝ씜蔛䔚","挐甐霐\ue30e攐洐挐甐礐鬐紐猐霐\ue30e礐朐紐餐餐脐ᔏᬏᔏἏ",-1811878641>(
                                       var8, (class_2561)0<"JNT",778569832,"蠸砸8","蔕씝씕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔟ԨԦ씨䔨蔬䔚","欐紐錐紐\ue30e锐霐洐朐\ue30e꜐洐餐霐",-1811878642>(var7, var9)
                                    );
                                    var9++;
                                    continue label105;
                                 }

                                 var11 = (937575617 - -1640123824 | -1435334523) & -1426063481;
                                 break;
                              case -373249295:
                                 0<"JNT",1850254157,"렸砸8ꀸ져耸䠸퀺\ud83aᠻ\uf03a\ue83a","蔕蔞ԧ씨蔬䔗씦씥ԧ씨䔨Ԭ씧ԩ蔬䔗䔨蔦씧䔬䔬䔣Ԝ씜ԝ씛䔚씕蔞ԧ씨蔬䔗씦씥ԧ씨䔨Ԭ씧ԩ蔬䔗䔨蔦씧䔬䔬䔣씜Ԝ씜蔛䔚","挐甐霐\ue30e攐洐挐甐礐鬐紐猐霐\ue30e礐朐紐餐餐脐ᔏᬏᔏἏ",-1811878553>(
                                    var8,
                                    0<"JNT",1850254157,"렸砸8ꀸ져耸䠸퀺\ud83aᠻ࠻\ue83a","蔕蔞ԧ씨蔬䔗씦씥ԧ씨䔨Ԭ씧ԩ蔬䔗䔨蔦씧䔬䔬䔣Ԝ씜蔙䔜䔚씕蔞ԧ씨蔬䔗씦씥ԧ씨䔨Ԭ씧ԩ蔬䔗䔨蔦씧䔬䔬䔣씜Ԝ씜蔛䔚","挐甐霐\ue30e攐洐挐甐礐鬐紐猐霐\ue30e礐朐紐餐餐脐ᔏᬏᔏἏ",-1811878554>(
                                       0<"JNT",1749568459,"렸砸8ꀸ져耸䠸\uf83a\ue03a\uf83a;\ud83a","蔕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔤蔬Ԭ씥ԧ䔩䔚씕蔞ԧ씨蔬䔗씦씥ԧ씨䔨Ԭ씧ԩ蔬䔗䔨蔦씧䔬䔬䔣씜Ԝ씜蔛䔚","挐甐霐\ue30e攐洐挐甐礐鬐紐猐霐\ue30e礐朐紐餐餐脐ᬏᔏጏᴏ",-1811878555>(
                                          var3
                                       ),
                                       var4
                                    )
                                 );
                                 class_5250 var12 = 0<"JNT",1850254157,"렸砸8ꀸ져耸䠸퀺\ud83aᠻ࠻\ue83a","蔕蔞ԧ씨蔬䔗씦씥ԧ씨䔨Ԭ씧ԩ蔬䔗䔨蔦씧䔬䔬䔣Ԝ씜蔙䔜䔚씕蔞ԧ씨蔬䔗씦씥ԧ씨䔨Ԭ씧ԩ蔬䔗䔨蔦씧䔬䔬䔣씜Ԝ씜蔛䔚","挐甐霐\ue30e攐洐挐甐礐鬐紐猐霐\ue30e礐朐紐餐餐脐ᔏᬏᔏἏ",-1811878534>(
                                    0<"JNT",1749568459,"렸砸8ꀸ져耸䠸\uf83a\ue03a\uf83a;\ue03a","蔕씕蔞ԧ씨蔬䔗씦씥ԧ씨䔨Ԭ씧ԩ蔬䔗䔨蔦씧䔬䔬䔣씜Ԝ씜蔛䔚","挐甐霐\ue30e攐洐挐甐礐鬐紐猐霐\ue30e礐朐紐餐餐脐ᬏᔏጏᴏ",-1811878536>(),
                                    0<"JNT",778569832,"렸砸8ꀸ져耸䠸퀺\ud83aᠻ࠻࠻","蔕씕蔞ԧ씨蔬䔗씦씥ԧ씨䔨Ԭ씧ԩ蔬䔗䔨蔦씧䔬䔬䔣Ԝ씜蔙䔜䔚","挐甐霐\ue30e攐洐挐甐礐鬐紐猐霐\ue30e礐朐紐餐餐脐ᬏᔏጏᴏ",-1811878535>(var1)
                                 );
                                 0<"JNT",1850254157,"렸砸8ꀸ져耸䠸퀺\ud83aᠻ\uf03a\ue83a","蔕蔞ԧ씨蔬䔗씦씥ԧ씨䔨Ԭ씧ԩ蔬䔗䔨蔦씧䔬䔬䔣Ԝ씜ԝ씛䔚씕蔞ԧ씨蔬䔗씦씥ԧ씨䔨Ԭ씧ԩ蔬䔗䔨蔦씧䔬䔬䔣씜Ԝ씜蔛䔚","挐甐霐\ue30e攐洐挐甐礐鬐紐猐霐\ue30e礐朐紐餐餐脐ᔏᬏᔏἏ",-1811878533>(
                                    var12, var8
                                 );
                                 int var10 = 1;

                                 while (true) {
                                    var11 = 360016014 - 360016014 ^ 672012997;

                                    while (true) {
                                       switch ((((var11 ^ 1302130533) + 904358729 ^ 1869106816) - 787215594 ^ 1157472579) + 2027412245) {
                                          case -230845603:
                                             return var12;
                                          case -88902831:
                                       }

                                       if (var10 < 0<"JNT",778569832,"\ue838頸〹砸","蔕씕씝","欐紐錐紐\ue30e锐霐洐朐\ue30e꜐洐餐霐",-1811878543>(var5)) {
                                          0<"JNT",1850254157,"렸砸8ꀸ져耸䠸퀺\ud83aᠻ\uf03a\ue83a","蔕蔞ԧ씨蔬䔗씦씥ԧ씨䔨Ԭ씧ԩ蔬䔗䔨蔦씧䔬䔬䔣Ԝ씜ԝ씛䔚씕蔞ԧ씨蔬䔗씦씥ԧ씨䔨Ԭ씧ԩ蔬䔗䔨蔦씧䔬䔬䔣씜Ԝ씜蔛䔚","挐甐霐\ue30e攐洐挐甐礐鬐紐猐霐\ue30e礐朐紐餐餐脐ᔏᬏᔏἏ",-1811878541>(
                                             var12,
                                             (class_2561)0<"JNT",778569832,"蠸砸8","蔕씝씕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔟ԨԦ씨䔨蔬䔚","欐紐錐紐\ue30e锐霐洐朐\ue30e꜐洐餐霐",-1811878542>(var5, var10)
                                          );
                                          var10++;
                                          break;
                                       }

                                       var11 = (-1787205018 | -1223094925) ^ 887183422;
                                    }
                                 }
                           }
                        }
                     }
                  }
               }
            case 1000959252:
               if (var3 == null) {
                  return var1;
               }

               var11 = (-2103920052 - -1989961032 | 46637667) & 48231143;
         }
      }
   }

   // $VF: renamed from: mrm () Class_168
   public Class_168 method_1453() {
      return 1<"JNT",-318005366,"\u1978馃饹","몖ꆖ몖","ϛλ࡛\u0b7bົջ",2036177134>(this);
   }

   // $VF: renamed from: cjp (net.minecraft.class_2561) net.minecraft.class_2583
   public class_2583 method_1454(class_2561 var1) {
      List var2 = 0<"JNT",778569832,"렸砸8ꀸ져耸䠸퀺\ud83aᠻ\uf03a\uf03a","蔕씕蔞Ԧ씧ԭ씧䔗씬蔬씥蔦䔗蔞씥䔬蔬䔚","挐甐霐\ue30e攐洐挐甐礐鬐紐猐霐\ue30e礐朐紐餐餐脐ᬏᔏጏᴏ",-1811878607>(var1);
      if (0<"JNT",778569832,"頸\ue838砇렸\ue0388ᠹ","蔕씕Ԣ","欐紐錐紐\ue30e锐霐洐朐\ue30e꜐洐餐霐",-1811878606>(var2)) {
         return 0<"JNT",778569832,"렸砸8ꀸ져耸䠸퀺\ud83aᠻ࠻࠻","蔕씕蔞ԧ씨蔬䔗씦씥ԧ씨䔨Ԭ씧ԩ蔬䔗䔨蔦씧䔬䔬䔣Ԝ씜蔙䔜䔚","挐甐霐\ue30e攐洐挐甐礐鬐紐猐霐\ue30e礐朐紐餐餐脐ᬏᔏጏᴏ",-1811878605>(var1);
      } else {
         class_2561 var3 = (class_2561)0<"JNT",778569832,"蠸砸8","蔕씝씕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔟ԨԦ씨䔨蔬䔚","欐紐錐紐\ue30e锐霐洐朐\ue30e꜐洐餐霐",-1811878604>(var2, 0);
         List var4 = 0<"JNT",778569832,"렸砸8ꀸ져耸䠸퀺\ud83aᠻ\uf03a\uf03a","蔕씕蔞Ԧ씧ԭ씧䔗씬蔬씥蔦䔗蔞씥䔬蔬䔚","挐甐霐\ue30e攐洐挐甐礐鬐紐猐霐\ue30e礐朐紐餐餐脐ᬏᔏጏᴏ",-1811878619>(var3);
         return !0<"JNT",778569832,"頸\ue838砇렸\ue0388ᠹ","蔕씕Ԣ","欐紐錐紐\ue30e锐霐洐朐\ue30e꜐洐餐霐",-1811878618>(var4)
            ? 0<"JNT",778569832,"렸砸8ꀸ져耸䠸퀺\ud83aᠻ࠻࠻","蔕씕蔞ԧ씨蔬䔗씦씥ԧ씨䔨Ԭ씧ԩ蔬䔗䔨蔦씧䔬䔬䔣Ԝ씜蔙䔜䔚","挐甐霐\ue30e攐洐挐甐礐鬐紐猐霐\ue30e礐朐紐餐餐脐ᬏᔏጏᴏ",-1811878599>(
               (class_2561)0<"JNT",778569832,"蠸砸8","蔕씝씕蔞Ԧ씧ԭ씧䔗蔦씧ԧ䔩䔗䔟ԨԦ씨䔨蔬䔚","欐紐錐紐\ue30e锐霐洐朐\ue30e꜐洐餐霐",-1811878600>(
                  var4, 0<"JNT",778569832,"\ue838頸〹砸","蔕씕씝","欐紐錐紐\ue30e锐霐洐朐\ue30e꜐洐餐霐",-1811878617>(var4) - 1
               )
            )
            : 0<"JNT",778569832,"렸砸8ꀸ져耸䠸퀺\ud83aᠻ࠻࠻","蔕씕蔞ԧ씨蔬䔗씦씥ԧ씨䔨Ԭ씧ԩ蔬䔗䔨蔦씧䔬䔬䔣Ԝ씜蔙䔜䔚","挐甐霐\ue30e攐洐挐甐礐鬐紐猐霐\ue30e礐朐紐餐餐脐ᬏᔏጏᴏ",-1811878598>(var1);
      }
   }

   static {
      Loader.init(Class_385.class);
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1413(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = (var10 ^ 1592556968) + 958227278 + 461233407 + 947757750 - 355239920 ^ 1214943804 ^ 382140722 ^ 1747961492 ^ 878854338;
      MethodHandle var10000 = field_1597[(
            (var10 ^ 1592556968) + 958227278 + 461233407 + 947757750 - 355239920 ^ 1214943804 ^ 382140722 ^ 1747961492 ^ 878854338
         )
         - 1077476974];
      if (field_1597[var10001 - 1077476974] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = (1631696652 >> -1046981131 | 0) & 1810754560; var23 < var13.length(); var23 += (-983573624 - -1189941812 | 1) & 588447809) {
            int var42 = (var13.charAt(var23) ^ ']' ^ 197) - 162;
            char var43 = (char)(((var42 & 63488) >> 11 | var42 << 5) - 134 + 74 + 146 ^ 42 ^ 25 ^ 114);
            var13.setCharAt(var23, (char)(((var42 & 63488) >> 11 | var42 << 5) - 134 + 74 + 146 ^ 42 ^ 25 ^ 114));
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = (-491792112 ^ -1492229179 | 0) & -1978661622; var29 < var16.length(); var29 += (-1330132302 - -1962331158 | 1) & 139544853) {
            int var48 = var16.charAt(var29) - 14;
            char var53 = (char)(
               (
                        (
                              (
                                       (
                                                (
                                                      (
                                                               (
                                                                     ((((var48 & 64512) >> 10 | var48 << 6) + 40 ^ 184) & 0) >> 16
                                                                        | (((var48 & 64512) >> 10 | var48 << 6) + 40 ^ 184) << 0
                                                                  )
                                                                  & 49152
                                                            )
                                                            >> 14
                                                         | (
                                                               ((((var48 & 64512) >> 10 | var48 << 6) + 40 ^ 184) & 0) >> 16
                                                                  | (((var48 & 64512) >> 10 | var48 << 6) + 40 ^ 184) << 0
                                                            )
                                                            << 2
                                                   )
                                                   ^ 253
                                             )
                                             - 56
                                          & 64512
                                    )
                                    >> 10
                                 | (
                                          (
                                                (
                                                         (
                                                               ((((var48 & 64512) >> 10 | var48 << 6) + 40 ^ 184) & 0) >> 16
                                                                  | (((var48 & 64512) >> 10 | var48 << 6) + 40 ^ 184) << 0
                                                            )
                                                            & 49152
                                                      )
                                                      >> 14
                                                   | (
                                                         ((((var48 & 64512) >> 10 | var48 << 6) + 40 ^ 184) & 0) >> 16
                                                            | (((var48 & 64512) >> 10 | var48 << 6) + 40 ^ 184) << 0
                                                      )
                                                      << 2
                                             )
                                             ^ 253
                                       )
                                       - 56
                                    << 6
                           )
                           & 61440
                     )
                     >> 12
                  | (
                        (
                                 (
                                          (
                                                (
                                                         (
                                                               ((((var48 & 64512) >> 10 | var48 << 6) + 40 ^ 184) & 0) >> 16
                                                                  | (((var48 & 64512) >> 10 | var48 << 6) + 40 ^ 184) << 0
                                                            )
                                                            & 49152
                                                      )
                                                      >> 14
                                                   | (
                                                         ((((var48 & 64512) >> 10 | var48 << 6) + 40 ^ 184) & 0) >> 16
                                                            | (((var48 & 64512) >> 10 | var48 << 6) + 40 ^ 184) << 0
                                                      )
                                                      << 2
                                             )
                                             ^ 253
                                       )
                                       - 56
                                    & 64512
                              )
                              >> 10
                           | (
                                    (
                                          (
                                                   (
                                                         ((((var48 & 64512) >> 10 | var48 << 6) + 40 ^ 184) & 0) >> 16
                                                            | (((var48 & 64512) >> 10 | var48 << 6) + 40 ^ 184) << 0
                                                      )
                                                      & 49152
                                                )
                                                >> 14
                                             | (
                                                   ((((var48 & 64512) >> 10 | var48 << 6) + 40 ^ 184) & 0) >> 16
                                                      | (((var48 & 64512) >> 10 | var48 << 6) + 40 ^ 184) << 0
                                                )
                                                << 2
                                       )
                                       ^ 253
                                 )
                                 - 56
                              << 6
                     )
                     << 4
            );
            var16.setCharAt(
               var29,
               (char)(
                  (
                           (
                                 (
                                          (
                                                   (
                                                         (
                                                                  (
                                                                        ((((var48 & 64512) >> 10 | var48 << 6) + 40 ^ 184) & 0) >> 16
                                                                           | (((var48 & 64512) >> 10 | var48 << 6) + 40 ^ 184) << 0
                                                                     )
                                                                     & 49152
                                                               )
                                                               >> 14
                                                            | (
                                                                  ((((var48 & 64512) >> 10 | var48 << 6) + 40 ^ 184) & 0) >> 16
                                                                     | (((var48 & 64512) >> 10 | var48 << 6) + 40 ^ 184) << 0
                                                               )
                                                               << 2
                                                      )
                                                      ^ 253
                                                )
                                                - 56
                                             & 64512
                                       )
                                       >> 10
                                    | (
                                             (
                                                   (
                                                            (
                                                                  ((((var48 & 64512) >> 10 | var48 << 6) + 40 ^ 184) & 0) >> 16
                                                                     | (((var48 & 64512) >> 10 | var48 << 6) + 40 ^ 184) << 0
                                                               )
                                                               & 49152
                                                         )
                                                         >> 14
                                                      | (
                                                            ((((var48 & 64512) >> 10 | var48 << 6) + 40 ^ 184) & 0) >> 16
                                                               | (((var48 & 64512) >> 10 | var48 << 6) + 40 ^ 184) << 0
                                                         )
                                                         << 2
                                                )
                                                ^ 253
                                          )
                                          - 56
                                       << 6
                              )
                              & 61440
                        )
                        >> 12
                     | (
                           (
                                    (
                                             (
                                                   (
                                                            (
                                                                  ((((var48 & 64512) >> 10 | var48 << 6) + 40 ^ 184) & 0) >> 16
                                                                     | (((var48 & 64512) >> 10 | var48 << 6) + 40 ^ 184) << 0
                                                               )
                                                               & 49152
                                                         )
                                                         >> 14
                                                      | (
                                                            ((((var48 & 64512) >> 10 | var48 << 6) + 40 ^ 184) & 0) >> 16
                                                               | (((var48 & 64512) >> 10 | var48 << 6) + 40 ^ 184) << 0
                                                         )
                                                         << 2
                                                )
                                                ^ 253
                                          )
                                          - 56
                                       & 64512
                                 )
                                 >> 10
                              | (
                                       (
                                             (
                                                      (
                                                            ((((var48 & 64512) >> 10 | var48 << 6) + 40 ^ 184) & 0) >> 16
                                                               | (((var48 & 64512) >> 10 | var48 << 6) + 40 ^ 184) << 0
                                                         )
                                                         & 49152
                                                   )
                                                   >> 14
                                                | (
                                                      ((((var48 & 64512) >> 10 | var48 << 6) + 40 ^ 184) & 0) >> 16
                                                         | (((var48 & 64512) >> 10 | var48 << 6) + 40 ^ 184) << 0
                                                   )
                                                   << 2
                                          )
                                          ^ 253
                                    )
                                    - 56
                                 << 6
                        )
                        << 4
               )
            );
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_385.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = (-1306139297 * -1023384722 | 0) & 1308696588; var35 < var19.length(); var35 += 1668439325 << 1668439325 ^ -1610612735) {
            int var58 = var19.charAt(var35) - '\t';
            char var61 = (char)(
               (
                     (
                           (
                                    (((((var58 & 65532) >> 2 | var58 << 14) ^ 24 ^ 102) & 65504) >> 5 | (((var58 & 65532) >> 2 | var58 << 14) ^ 24 ^ 102) << 11)
                                          + 187
                                          - 125
                                       & 65532
                                 )
                                 >> 2
                              | (((((var58 & 65532) >> 2 | var58 << 14) ^ 24 ^ 102) & 65504) >> 5 | (((var58 & 65532) >> 2 | var58 << 14) ^ 24 ^ 102) << 11)
                                    + 187
                                    - 125
                                 << 14
                        )
                        ^ 111
                  )
                  + 191
            );
            var19.setCharAt(
               var35,
               (char)(
                  (
                        (
                              (
                                       (
                                                ((((var58 & 65532) >> 2 | var58 << 14) ^ 24 ^ 102) & 65504) >> 5
                                                   | (((var58 & 65532) >> 2 | var58 << 14) ^ 24 ^ 102) << 11
                                             )
                                             + 187
                                             - 125
                                          & 65532
                                    )
                                    >> 2
                                 | (((((var58 & 65532) >> 2 | var58 << 14) ^ 24 ^ 102) & 65504) >> 5 | (((var58 & 65532) >> 2 | var58 << 14) ^ 24 ^ 102) << 11)
                                       + 187
                                       - 125
                                    << 14
                           )
                           ^ 111
                     )
                     + 191
               )
            );
         }

         Class var7 = Class.forName(var19.toString(), false, Class_385.class.getClassLoader());
         switch (((var4 + 1978371793 ^ 1868239540) + 1763660330 - 1872356423 - 1309494154 - 523724343 - 425059048 - 1446645997 ^ 1650394909) - 1971532833) {
            case 274929318:
            case 1421720521:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 860975286:
               var10000 = var0.findSpecial(var7, var5, var6, Class_385.class);
               break;
            case 918774599:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            case 1587133021:
               var10000 = var0.findConstructor(var7, var6);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_1597[((var10 ^ 1592556968) + 958227278 + 461233407 + 947757750 - 355239920 ^ 1214943804 ^ 382140722 ^ 1747961492 ^ 878854338) - 1077476974] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1414(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = ((((var10 - 1150367286 ^ 1808431140) + 885861752 ^ 1522252176) + 782294708 ^ 377721592) - 609955471 ^ 1851888102) - 1915262076;
      MethodHandle var10000 = field_1597[((((var10 - 1150367286 ^ 1808431140) + 885861752 ^ 1522252176) + 782294708 ^ 377721592) - 609955471 ^ 1851888102)
            - 1915262076
         ^ 841347550];
      if (field_1597[var10001 ^ 841347550] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = 1702540798 + 1702540798 ^ -889885700; var24 < var14.length(); var24 += (383956547 - (383956547 << 383956547) | 0) & -1609369519) {
            int var43 = var14.charAt(var24) + 232;
            int var10004 = (var43 & 65024) >> 9;
            int var44 = ((var43 & 65024) >> 9 | var43 << 7) + 243;
            int var90 = (((var43 & 65024) >> 9 | var43 << 7) + 243 & 65408) >> 7;
            var43 = ((var10004 | var43 << 7) + 243 & 65408) >> 7 | ((var43 & 65024) >> 9 | var43 << 7) + 243 << 9;
            var10004 = ((var90 | var44 << 9) & 49152) >> 14;
            int var46 = ((var90 | var44 << 9) & 49152) >> 14 | var43 << 2;
            int var92 = ((((var90 | var44 << 9) & 49152) >> 14 | var43 << 2) & 65534) >> 1;
            char var47 = (char)(((((var10004 | var43 << 2) & 65534) >> 1 | (((var90 | var44 << 9) & 49152) >> 14 | var43 << 2) << 15) ^ 97) - 161 ^ 211 ^ 167);
            var14.setCharAt(var24, (char)(((var92 | var46 << 15) ^ 97) - 161 ^ 211 ^ 167));
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = -355014083 * 1950482136 ^ 2134583672; var30 < var17.length(); var30 += (1823433910 - 684319047 | 0) & 939552785) {
            char var52 = var17.charAt(var30);
            char var57 = (char)(
               (
                     (
                              (
                                    (
                                             (
                                                   (
                                                         (
                                                                  (
                                                                        ((((var52 & '\uffff') >> 0 | var52 << 16) ^ 31 ^ 141) - 132 & 65408) >> 7
                                                                           | (((var52 & '\uffff') >> 0 | var52 << 16) ^ 31 ^ 141) - 132 << 9
                                                                     )
                                                                     & 0
                                                               )
                                                               >> 16
                                                            | (
                                                                  ((((var52 & '\uffff') >> 0 | var52 << 16) ^ 31 ^ 141) - 132 & 65408) >> 7
                                                                     | (((var52 & '\uffff') >> 0 | var52 << 16) ^ 31 ^ 141) - 132 << 9
                                                               )
                                                               << 0
                                                      )
                                                      ^ 219
                                                )
                                                & 63488
                                          )
                                          >> 11
                                       | (
                                             (
                                                   (
                                                            (
                                                                  ((((var52 & '\uffff') >> 0 | var52 << 16) ^ 31 ^ 141) - 132 & 65408) >> 7
                                                                     | (((var52 & '\uffff') >> 0 | var52 << 16) ^ 31 ^ 141) - 132 << 9
                                                               )
                                                               & 0
                                                         )
                                                         >> 16
                                                      | (
                                                            ((((var52 & '\uffff') >> 0 | var52 << 16) ^ 31 ^ 141) - 132 & 65408) >> 7
                                                               | (((var52 & '\uffff') >> 0 | var52 << 16) ^ 31 ^ 141) - 132 << 9
                                                         )
                                                         << 0
                                                )
                                                ^ 219
                                          )
                                          << 5
                                 )
                                 & 65472
                           )
                           >> 6
                        | (
                              (
                                       (
                                             (
                                                   (
                                                            (
                                                                  ((((var52 & '\uffff') >> 0 | var52 << 16) ^ 31 ^ 141) - 132 & 65408) >> 7
                                                                     | (((var52 & '\uffff') >> 0 | var52 << 16) ^ 31 ^ 141) - 132 << 9
                                                               )
                                                               & 0
                                                         )
                                                         >> 16
                                                      | (
                                                            ((((var52 & '\uffff') >> 0 | var52 << 16) ^ 31 ^ 141) - 132 & 65408) >> 7
                                                               | (((var52 & '\uffff') >> 0 | var52 << 16) ^ 31 ^ 141) - 132 << 9
                                                         )
                                                         << 0
                                                )
                                                ^ 219
                                          )
                                          & 63488
                                    )
                                    >> 11
                                 | (
                                       (
                                             (
                                                      (
                                                            ((((var52 & '\uffff') >> 0 | var52 << 16) ^ 31 ^ 141) - 132 & 65408) >> 7
                                                               | (((var52 & '\uffff') >> 0 | var52 << 16) ^ 31 ^ 141) - 132 << 9
                                                         )
                                                         & 0
                                                   )
                                                   >> 16
                                                | (
                                                      ((((var52 & '\uffff') >> 0 | var52 << 16) ^ 31 ^ 141) - 132 & 65408) >> 7
                                                         | (((var52 & '\uffff') >> 0 | var52 << 16) ^ 31 ^ 141) - 132 << 9
                                                   )
                                                   << 0
                                          )
                                          ^ 219
                                    )
                                    << 5
                           )
                           << 10
                  )
                  ^ 172
            );
            var17.setCharAt(
               var30,
               (char)(
                  (
                        (
                                 (
                                       (
                                                (
                                                      (
                                                            (
                                                                     (
                                                                           ((((var52 & '\uffff') >> 0 | var52 << 16) ^ 31 ^ 141) - 132 & 65408) >> 7
                                                                              | (((var52 & '\uffff') >> 0 | var52 << 16) ^ 31 ^ 141) - 132 << 9
                                                                        )
                                                                        & 0
                                                                  )
                                                                  >> 16
                                                               | (
                                                                     ((((var52 & '\uffff') >> 0 | var52 << 16) ^ 31 ^ 141) - 132 & 65408) >> 7
                                                                        | (((var52 & '\uffff') >> 0 | var52 << 16) ^ 31 ^ 141) - 132 << 9
                                                                  )
                                                                  << 0
                                                         )
                                                         ^ 219
                                                   )
                                                   & 63488
                                             )
                                             >> 11
                                          | (
                                                (
                                                      (
                                                               (
                                                                     ((((var52 & '\uffff') >> 0 | var52 << 16) ^ 31 ^ 141) - 132 & 65408) >> 7
                                                                        | (((var52 & '\uffff') >> 0 | var52 << 16) ^ 31 ^ 141) - 132 << 9
                                                                  )
                                                                  & 0
                                                            )
                                                            >> 16
                                                         | (
                                                               ((((var52 & '\uffff') >> 0 | var52 << 16) ^ 31 ^ 141) - 132 & 65408) >> 7
                                                                  | (((var52 & '\uffff') >> 0 | var52 << 16) ^ 31 ^ 141) - 132 << 9
                                                            )
                                                            << 0
                                                   )
                                                   ^ 219
                                             )
                                             << 5
                                    )
                                    & 65472
                              )
                              >> 6
                           | (
                                 (
                                          (
                                                (
                                                      (
                                                               (
                                                                     ((((var52 & '\uffff') >> 0 | var52 << 16) ^ 31 ^ 141) - 132 & 65408) >> 7
                                                                        | (((var52 & '\uffff') >> 0 | var52 << 16) ^ 31 ^ 141) - 132 << 9
                                                                  )
                                                                  & 0
                                                            )
                                                            >> 16
                                                         | (
                                                               ((((var52 & '\uffff') >> 0 | var52 << 16) ^ 31 ^ 141) - 132 & 65408) >> 7
                                                                  | (((var52 & '\uffff') >> 0 | var52 << 16) ^ 31 ^ 141) - 132 << 9
                                                            )
                                                            << 0
                                                   )
                                                   ^ 219
                                             )
                                             & 63488
                                       )
                                       >> 11
                                    | (
                                          (
                                                (
                                                         (
                                                               ((((var52 & '\uffff') >> 0 | var52 << 16) ^ 31 ^ 141) - 132 & 65408) >> 7
                                                                  | (((var52 & '\uffff') >> 0 | var52 << 16) ^ 31 ^ 141) - 132 << 9
                                                            )
                                                            & 0
                                                      )
                                                      >> 16
                                                   | (
                                                         ((((var52 & '\uffff') >> 0 | var52 << 16) ^ 31 ^ 141) - 132 & 65408) >> 7
                                                            | (((var52 & '\uffff') >> 0 | var52 << 16) ^ 31 ^ 141) - 132 << 9
                                                      )
                                                      << 0
                                             )
                                             ^ 219
                                       )
                                       << 5
                              )
                              << 10
                     )
                     ^ 172
               )
            );
         }

         Class var6 = Class.forName(var17.toString(), false, Class_385.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = (-1003080033 ^ -1003080033 | 0) & -2138465203; var36 < var20.length(); var36 += 307267871 << 307267871 ^ -2147483647) {
            int var62 = var20.charAt(var36) + '#' + 67 + 31;
            char var67 = (char)(
               (
                        (
                              (
                                       (
                                             (
                                                   (((((var62 & 57344) >> 13 | var62 << 3) & 65528) >> 3 | ((var62 & 57344) >> 13 | var62 << 3) << 13) & 65520)
                                                         >> 4
                                                      | ((((var62 & 57344) >> 13 | var62 << 3) & 65528) >> 3 | ((var62 & 57344) >> 13 | var62 << 3) << 13)
                                                         << 12
                                                )
                                                ^ 149
                                                ^ 131
                                          )
                                          & 65408
                                    )
                                    >> 7
                                 | (
                                       (
                                             (((((var62 & 57344) >> 13 | var62 << 3) & 65528) >> 3 | ((var62 & 57344) >> 13 | var62 << 3) << 13) & 65520) >> 4
                                                | ((((var62 & 57344) >> 13 | var62 << 3) & 65528) >> 3 | ((var62 & 57344) >> 13 | var62 << 3) << 13) << 12
                                          )
                                          ^ 149
                                          ^ 131
                                    )
                                    << 9
                           )
                           & 64512
                     )
                     >> 10
                  | (
                        (
                                 (
                                       (
                                             (((((var62 & 57344) >> 13 | var62 << 3) & 65528) >> 3 | ((var62 & 57344) >> 13 | var62 << 3) << 13) & 65520) >> 4
                                                | ((((var62 & 57344) >> 13 | var62 << 3) & 65528) >> 3 | ((var62 & 57344) >> 13 | var62 << 3) << 13) << 12
                                          )
                                          ^ 149
                                          ^ 131
                                    )
                                    & 65408
                              )
                              >> 7
                           | (
                                 (
                                       (((((var62 & 57344) >> 13 | var62 << 3) & 65528) >> 3 | ((var62 & 57344) >> 13 | var62 << 3) << 13) & 65520) >> 4
                                          | ((((var62 & 57344) >> 13 | var62 << 3) & 65528) >> 3 | ((var62 & 57344) >> 13 | var62 << 3) << 13) << 12
                                    )
                                    ^ 149
                                    ^ 131
                              )
                              << 9
                     )
                     << 6
            );
            var20.setCharAt(
               var36,
               (char)(
                  (
                           (
                                 (
                                          (
                                                (
                                                      (
                                                               (
                                                                     (((var62 & 57344) >> 13 | var62 << 3) & 65528) >> 3
                                                                        | ((var62 & 57344) >> 13 | var62 << 3) << 13
                                                                  )
                                                                  & 65520
                                                            )
                                                            >> 4
                                                         | ((((var62 & 57344) >> 13 | var62 << 3) & 65528) >> 3 | ((var62 & 57344) >> 13 | var62 << 3) << 13)
                                                            << 12
                                                   )
                                                   ^ 149
                                                   ^ 131
                                             )
                                             & 65408
                                       )
                                       >> 7
                                    | (
                                          (
                                                (((((var62 & 57344) >> 13 | var62 << 3) & 65528) >> 3 | ((var62 & 57344) >> 13 | var62 << 3) << 13) & 65520)
                                                      >> 4
                                                   | ((((var62 & 57344) >> 13 | var62 << 3) & 65528) >> 3 | ((var62 & 57344) >> 13 | var62 << 3) << 13) << 12
                                             )
                                             ^ 149
                                             ^ 131
                                       )
                                       << 9
                              )
                              & 64512
                        )
                        >> 10
                     | (
                           (
                                    (
                                          (
                                                (((((var62 & 57344) >> 13 | var62 << 3) & 65528) >> 3 | ((var62 & 57344) >> 13 | var62 << 3) << 13) & 65520)
                                                      >> 4
                                                   | ((((var62 & 57344) >> 13 | var62 << 3) & 65528) >> 3 | ((var62 & 57344) >> 13 | var62 << 3) << 13) << 12
                                             )
                                             ^ 149
                                             ^ 131
                                       )
                                       & 65408
                                 )
                                 >> 7
                              | (
                                    (
                                          (((((var62 & 57344) >> 13 | var62 << 3) & 65528) >> 3 | ((var62 & 57344) >> 13 | var62 << 3) << 13) & 65520) >> 4
                                             | ((((var62 & 57344) >> 13 | var62 << 3) & 65528) >> 3 | ((var62 & 57344) >> 13 | var62 << 3) << 13) << 12
                                       )
                                       ^ 149
                                       ^ 131
                                 )
                                 << 9
                        )
                        << 6
               )
            );
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_385.class.getClassLoader()).returnType();
         switch (((var4 - 856682024 - 1264988619 ^ 1105852976 ^ 2004018822) + 1299485892 ^ 1254242832) - 874845852 + 1327599760 ^ 1593482609 ^ 1890232104) {
            case 611155376:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            case 769390410:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            case 1001508413:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            case 2093245995:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_1597[((((var10 - 1150367286 ^ 1808431140) + 885861752 ^ 1522252176) + 782294708 ^ 377721592) - 609955471 ^ 1851888102) - 1915262076 ^ 841347550] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }

   public static native void guard();
}
