import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;
import java.util.ArrayList;
import java.util.Iterator;
import java.util.List;
import net.minecraft.class_11908;
import net.minecraft.class_11909;
import net.minecraft.class_310;

public abstract class Class_285 {
   // $VF: renamed from: ro int
   public static int field_686 = 6;
   // $VF: renamed from: nj java.util.List
   public List field_687 = (ArrayList)0<"JNT",-1020061259,"㙾;ࡾ;繾㡾","埓墓䕓","ɚɾǪɾƊǮǒɞɲƊǾƺƺɾƞǲɞǖǒ",-1334058685>();
   // $VF: renamed from: la int
   public int field_688;
   // $VF: renamed from: uf int
   public int field_689;
   // $VF: renamed from: og Class_262
   public Class_262 field_690;
   // $VF: renamed from: hw boolean
   public boolean field_691;
   // $VF: renamed from: zo boolean
   public boolean field_692;
   // $VF: renamed from: md Class_359
   public Class_359 field_693;
   // $VF: renamed from: od int
   public int field_694;
   // $VF: renamed from: lh int
   public int field_695;
   // $VF: renamed from: my int
   public int field_696;
   // $VF: renamed from: vg int
   public int field_697;
   // $VF: renamed from: lq int
   public int field_698;
   // $VF: renamed from: qfl float
   public float field_699 = 0.0F;
   // $VF: renamed from: mlu int
   public int field_700 = -1;
   // $VF: renamed from: utf boolean
   public boolean field_701 = true;
   public static final MethodHandle[] jasf = new MethodHandle[184];

   public Class_285(int var1, int var2, int var3, Class_359 var4) {
      this.field_688 = var1;
      this.field_689 = var2;
      this.field_694 = var3;
      this.field_691 = false;
      this.field_692 = true;
      this.field_693 = var4;
      this.field_695 = var1;
      this.field_696 = var2;
   }

   // $VF: renamed from: op () void
   public void method_676() {
      0<"JNT",805057116,"ᅾ\u0e7e穾","埓墓䕓","ƺǆʊ",-1334058684>(this);
   }

   // $VF: renamed from: gdp () void
   public abstract void method_677();

   // $VF: renamed from: mat (RenderEngine_216, int, int, float) void
   public abstract void method_678(RenderEngine_216 var1, int var2, int var3, float var4);

   // $VF: renamed from: fb (int) Class_262
   public abstract Class_262 method_679(int var1);

   // $VF: renamed from: ya () int
   public abstract int method_680();

   // $VF: renamed from: eyg () int
   public abstract int method_681();

   // $VF: renamed from: hy (RenderEngine_216, int, int, float) void
   public void method_682(RenderEngine_216 var1, int var2, int var3, float var4) {
      int var10 = -1009954713;
      int var5 = 0<"JNT",805057116,"ၾ瑾ᅾ","埓墓傓","ƒƖ",-1334058450>(1<"JNT",358914796,"\ue769\ue7f9","ꓕ웕룕","ξή\u05feݾݎӎ",1166203116>());
      if (var5 != 1<"JNT",1868762903,"\ue7e9\ue7d9\ue869","뛕ꃕ껕","ξή֮",1166203118>(this)) {
         1<"JNT",1482136877,"\ue869\ue859\ue779","뛕ꃕ껕","ξή۞",1166203119>(this, true);
         1<"JNT",1482136877,"\ue7e9\ue7d9\ue869","뛕ꃕ껕","ξή֮",1166203120>(this, var5);
      }

      var10 = -1441173219;

      float var10000;
      label47:
      while (true) {
         switch ((var10 + 195467487 - 1689947952 + 948853824 + 466526983 ^ 1531942551) + 1958312582) {
            case 1927767818:
            default:
               if (1<"JNT",1868762903,"\ue869\ue859\ue779","뛕ꃕ껕","ξή۞",1166202644>(this)) {
                  Class_262 var11 = (Class_262)0<"JNT",-1020061259,"㙾;ࡾ;繾㡾","埓傓傓傓傓墓䕓","ǢȆ",-1334058682>(25, 25, 30, var5);
                  if (1<"JNT",1868762903,"\ue809\ue789","뛕ꃕ껕","ξή\u05fe࠾ࢎӎ",1166202646>(this) == null) {
                     1<"JNT",1482136877,"\ue809\ue789","뛕ꃕ껕","ξή\u05fe࠾ࢎӎ",1166202648>(
                        this, (Class_262)0<"JNT",-1020061259,"㙾;ࡾ;繾㡾","埓傓傓傓傓墓䕓","ǢȆ",-1334058680>(25, 25, 30, 0)
                     );
                  } else {
                     1<"JNT",1482136877,"\ue809\ue789","뛕ꃕ껕","ξή\u05fe࠾ࢎӎ",1166203110>(
                        this,
                        0<"JNT",-1109056731,"聾౾","埓兓仓䗓㰓䬓仓䗓㰓䬓墓仓䗓㰓䬓","ɺƖ",-1334058666>(
                           0.05F, var11, 1<"JNT",1868762903,"\ue809\ue789","뛕ꃕ껕","ξή\u05fe࠾ࢎӎ",1166203108>(this)
                        )
                     );
                     if (0<"JNT",-1109056731,"\u0b7e౾絾","埓傓墓傓","ɚɾǪɾƊɲɾʊǆƊȎɾǒʂ",-1334058454>(
                           0<"JNT",805057116,"پ獾","埓墓傓","ǢȆ",-1334058663>(1<"JNT",1868762903,"\ue809\ue789","뛕ꃕ껕","ξή\u05fe࠾ࢎӎ",1166203111>(this)) - var5
                        )
                        < 2) {
                        1<"JNT",1482136877,"\ue809\ue789","뛕ꃕ껕","ξή\u05fe࠾ࢎӎ",1166203114>(this, var11);
                        1<"JNT",1482136877,"\ue869\ue859\ue779","뛕ꃕ껕","ξή۞",1166203115>(this, false);
                     }
                  }
               }

               var10 = 500257617 << 500257617 + -1376533521 ^ 1077906476;
               break;
            case 1999763818:
               if (0<"JNT",805057116,"\u0e7e\u0e7e","埓僓僓墓䑓","ƺǆʊ",-1334058435>(this, (double)var2, (double)var3)
                  && !1<"JNT",1868762903,"\ue799\ue889","뛕ꃕ껕","ξή۞",1166203133>(this)) {
                  var10000 = 1.0F;
                  break label47;
               }

               var10 = 1688307313;
               break;
            case 2036241526:
               var10000 = 0.0F;
               break label47;
         }
      }

      float var6 = var10000;
      1<"JNT",1482136877,"\ue829\ue779\ue7d9","뛕ꃕ껕","ξή֞",1166202651>(
         this,
         (float)0<"JNT",-1109056731,"聾ཾ穾","埓兓僓僓墓僓","ƾʦɶ",-1334058661>(
            var4 * 0.1F, (double)1<"JNT",1868762903,"\ue829\ue779\ue7d9","뛕ꃕ껕","ξή֞",1166202649>(this), (double)var6
         )
      );
      Class_262 var7 = 0<"JNT",-1109056731,"Ѿ獾签","埓仓䗓㰓䬓仓䗓㰓䬓兓墓仓䗓㰓䬓","ɺƖ",-1334058670>(
         (Class_262)0<"JNT",-1020061259,"㙾;ࡾ;繾㡾","埓傓傓傓傓墓䕓","ǢȆ",-1334058657>(
            25, 25, 30, 0<"JNT",805057116,"پ獾","埓墓傓","ǢȆ",-1334058658>(1<"JNT",1868762903,"\ue809\ue789","뛕ꃕ껕","ξή\u05fe࠾ࢎӎ",1166202652>(this))
         ),
         (Class_262)0<"JNT",-1020061259,"㙾;ࡾ;繾㡾","埓傓傓傓傓墓䕓","ǢȆ",-1334058656>(255, 255, 255, 20),
         1<"JNT",1868762903,"\ue829\ue779\ue7d9","뛕ꃕ껕","ξή֞",1166203104>(this)
      );
      float var8 = 1<"JNT",1868762903,"\ue8b9\ue809","뛕ꃕ껕","ξή۞",1166203106>(this) ? 0.0F : 6.0F;
      float var9 = 1<"JNT",1868762903,"\ue8b9\ue809","뛕ꃕ껕","ξή۞",1166203107>(this) ? 0.0F : 6.0F;
      0<"JNT",805057116,"ࡾൾ\u0e7e","埓仓䗓㰓䬓僓僓僓僓僓僓僓僓墓䕓","ʎǪ",-1334058456>(
         var1,
         var7,
         (double)1<"JNT",1868762903,"\ue7d9\ue799","뛕ꃕ껕","ξή֮",1166203121>(this),
         (double)1<"JNT",1868762903,"\ue7e9\ue8a9","뛕ꃕ껕","ξή֮",1166203122>(this),
         (double)(1<"JNT",1868762903,"\ue7d9\ue799","뛕ꃕ껕","ξή֮",1166203123>(this) + 1<"JNT",1868762903,"\ue809\ue759","뛕ꃕ껕","ξή֮",1166203124>(this)),
         (double)(1<"JNT",1868762903,"\ue7e9\ue8a9","뛕ꃕ껕","ξή֮",1166203125>(this) + 0<"JNT",805057116,"獾\u0b7e","埓墓傓","ƺǆʊ",-1334058457>(this)),
         6.0,
         6.0,
         (double)var8,
         (double)var9
      );
      0<"JNT",805057116,"ݾ\u0b7e繾","埓仓䞓㵓䬓傓傓兓墓䕓","ƺǆʊ",-1334058455>(this, var1, var2, var3, var4);
      if (1<"JNT",1868762903,"\ue8b9\ue809","뛕ꃕ껕","ξή۞",1166203129>(this)) {
         0<"JNT",805057116,"پ繾","埓兓墓䕓","ƺǆʊ",-1334058437>(this, var4);
         0<"JNT",805057116,"瑾ၾ","埓仓䞓㵓䬓傓傓兓墓䕓","ƺǆʊ",-1334058436>(this, var1, var2, var3, var4);
      }
   }

   // $VF: renamed from: zf (RenderEngine_216, int, int, float) void
   public void method_683(RenderEngine_216 var1, int var2, int var3, float var4) {
      int var11 = -984464037;
      int var5 = 1<"JNT",1868762903,"\ue7d9\ue799","뛕ꃕ껕","ξή֮",1166203071>(this);
      int var6 = 1<"JNT",1868762903,"\ue7e9\ue8a9","뛕ꃕ껕","ξή֮",1166203072>(this) + 0<"JNT",805057116,"獾\u0b7e","埓墓傓","ƺǆʊ",-1334058446>(this);
      int var7 = 1<"JNT",1868762903,"\ue809\ue759","뛕ꃕ껕","ξή֮",1166203074>(this);
      int var8 = 0<"JNT",805057116,"ݾཾ繾ɾॾ\u0e7e\u197e㹾㽾㩾䁾","埓墓傓","ʊƮǒƊʎɞʊƮƖƺɾƪǒƊƖɲɾǖǖŦﳁﳥﳕﳁ",-1334058442>(
            0<"JNT",805057116,"ݾཾ繾ɾॾ\u0e7e\u197e㱾㱾䁾㉾㵾","埓墓仓䝓䦓㳓嘓䞓䢓䝓䦓䤓䙓䊓䥓㳓嘓䤓䛓䊓㴓㴓䈓嚓嗓䳓嚓䬓","ʊƮǒƊʎɞʊƮƖƺɾƪǒƊƖɲɾǖǖŦﳙﳁﳥ",-1334058443>(
               (class_310)1<"JNT",358914796,"\ue7d9\ue839","黕铕","ξή\u05feߞܮ࢞ܮЎ߾ܮࠞގЎ؎ݞߞݮݎࡾӎ",1166203075>()
            )
         )
         - var6;
      if (var8 > 0) {
         0<"JNT",805057116,"獾ᅾ","埓僓僓僓僓墓䕓","ʎǪ",-1334058441>(var1, (double)var5, (double)var6, (double)var7, (double)var8);
         Iterator var9 = 0<"JNT",-89111510,";繾ཾ籾\u0b7e繾ॾ籾","埓墓仓䡓䊓㵓䊓嘓㶓㳓䢓䛓嘓傓㳓䦓䙓䊓㳓䘓䙓䬓","ɚɾǪɾƊǮǒɞɲƊǲɞǖǒ",-1334058439>(
            1<"JNT",1868762903,"\ue7f9\ue7b9","뛕ꃕ껕","ξή\u05feߞܮ࢞ܮЎ\u086eࡾޮ߾Ў\u05feޮࡎࡾӎ",1166203079>(this)
         );

         while (true) {
            var11 = 394451014;

            while (true) {
               switch (var11 + 443670964 + 1369421652 + 2119983241 - 1409734886 + 1762741231 + 981538117) {
                  case -1168882626:
                     0<"JNT",805057116,"Ѿ;\u0b7e","埓墓䕓","ʎǪ",-1334058433>(var1);
                     return;
                  case 1367104037:
               }

               if (0<"JNT",-89111510,"ɾ\u0b7e絾⡾ཾ牾繾","埓墓䑓","ɚɾǪɾƊǮǒɞɲƊǞǒƮƺɾǒʦƺ",-1334058486>(var9)) {
                  Class_199 var10 = (Class_199)0<"JNT",-89111510,"ࡾཾ牾繾","埓墓仓䡓䊓㵓䊓嘓䛓䊓䝓䠓嘓专䉓䡓䦓䤓㳓䬓","ɚɾǪɾƊǮǒɞɲƊǞǒƮƺɾǒʦƺ",-1334058485>(var9);
                  if (0<"JNT",805057116,"ݾ瑾繾","埓墓䑓","ʎɺ",-1334058484>(var10)) {
                     0<"JNT",805057116,";;","埓仓䞓㵓䬓傓傓兓墓䕓","ʎɺ",-1334058483>(var10, var1, var2, var3, var4);
                  }
                  break;
               }

               var11 = (347003192 >> 347003192 | -2141535669) & -874582017;
            }
         }
      }
   }

   // $VF: renamed from: lt (float) void
   // $VF: Irreducible bytecode was duplicated to produce valid code
   public void method_684(float var1) {
      int var9 = -1448185425;
      int var2 = 0<"JNT",805057116,"ཾ獾ᅾ","埓墓傓","ƺǆʊ",-1334058490>(this);
      Iterator var3 = 0<"JNT",-89111510,";繾ཾ籾\u0b7e繾ॾ籾","埓墓仓䡓䊓㵓䊓嘓㶓㳓䢓䛓嘓傓㳓䦓䙓䊓㳓䘓䙓䬓","ɚɾǪɾƊǮǒɞɲƊǲɞǖǒ",-1334058488>(
         1<"JNT",1868762903,"\ue7f9\ue7b9","뛕ꃕ껕","ξή\u05feߞܮ࢞ܮЎ\u086eࡾޮ߾Ў\u05feޮࡎࡾӎ",1166203094>(this)
      );

      label87:
      while (true) {
         var9 = 1266729661;

         while (true) {
            switch ((var9 - 1265114624 ^ 296024091) + 1406252943 - 1087146060 + 1161758877 - 1733321450) {
               case 45101468:
               default:
                  if (0<"JNT",-89111510,"ɾ\u0b7e絾⡾ཾ牾繾","埓墓䑓","ɚɾǪɾƊǮǒɞɲƊǞǒƮƺɾǒʦƺ",-1334058482>(var3)) {
                     Class_199 var4 = (Class_199)0<"JNT",-89111510,"ࡾཾ牾繾","埓墓仓䡓䊓㵓䊓嘓䛓䊓䝓䠓嘓专䉓䡓䦓䤓㳓䬓","ɚɾǪɾƊǮǒɞɲƊǞǒƮƺɾǒʦƺ",-1334058481>(var3);
                     double var5;
                     if (0<"JNT",805057116,"ݾ瑾繾","埓墓䑓","ʎɺ",-1334058480>(var4)) {
                        if (1<"JNT",1868762903,"\ue8b9\ue809","곕雕","ξή۞",1166203088>(var4)) {
                           var5 = (double)1<"JNT",1868762903,"\ue769\ue819","곕雕","ξή֮",1166203089>(var4);
                           if (0<"JNT",805057116,"瑾վཾ","埓仓䡓䊓㵓䊓嘓䛓䊓䝓䠓嘓冓䝓㶓䞓䬓墓䑓","ǒʦ",-1334058469>(
                              1<"JNT",358914796,"\ue849\ue7b9\ue729","ꓕ웕룕","ξή\u05feࡾࠎӎ",1166203096>(),
                              1<"JNT",358914796,"\ue7c9\ue799\ue729","꣕髕ꃕ","ξή\u05feߎݾގӎ",1166203097>()
                           )) {
                              1<"JNT",1482136877,"\ue8b9\ue729","곕雕","ξήվ",1166203099>(var4, var5);
                              var9 = 385537320;
                           } else {
                              var9 = -572314880 + -1854019574 ^ 505681113;
                           }
                        } else {
                           var9 = -752607843 + (69126054 | -752607843 << 69126054) ^ -941720446;
                           switch ((var9 + 2063650851 ^ 78002763 ^ 2094652388 ^ 1136361683) + 919296126 ^ 327940625) {
                              case 60914375:
                              default:
                                 var5 = (double)0<"JNT",805057116,"獾\u0b7e","埓墓傓","ƺǆʊ",-1334058467>(this);
                                 if (0<"JNT",805057116,"瑾վཾ","埓仓䡓䊓㵓䊓嘓䛓䊓䝓䠓嘓冓䝓㶓䞓䬓墓䑓","ǒʦ",-1334058469>(
                                    1<"JNT",358914796,"\ue849\ue7b9\ue729","ꓕ웕룕","ξή\u05feࡾࠎӎ",1166203096>(),
                                    1<"JNT",358914796,"\ue7c9\ue799\ue729","꣕髕ꃕ","ξή\u05feߎݾގӎ",1166203097>()
                                 )) {
                                    1<"JNT",1482136877,"\ue8b9\ue729","곕雕","ξήվ",1166203099>(var4, var5);
                                    var9 = 385537320;
                                 } else {
                                    var9 = -572314880 + -1854019574 ^ 505681113;
                                 }
                                 break;
                              case 1797058566:
                                 continue label87;
                           }
                        }
                     } else {
                        var9 = -1217529892 ^ -1217529892 >>> -1217529892 ^ 1214445333;
                        switch ((var9 + 2063650851 ^ 78002763 ^ 2094652388 ^ 1136361683) + 919296126 ^ 327940625) {
                           case 60914375:
                           default:
                              var5 = (double)0<"JNT",805057116,"獾\u0b7e","埓墓傓","ƺǆʊ",-1334058467>(this);
                              if (0<"JNT",805057116,"瑾վཾ","埓仓䡓䊓㵓䊓嘓䛓䊓䝓䠓嘓冓䝓㶓䞓䬓墓䑓","ǒʦ",-1334058469>(
                                 1<"JNT",358914796,"\ue849\ue7b9\ue729","ꓕ웕룕","ξή\u05feࡾࠎӎ",1166203096>(),
                                 1<"JNT",358914796,"\ue7c9\ue799\ue729","꣕髕ꃕ","ξή\u05feߎݾގӎ",1166203097>()
                              )) {
                                 1<"JNT",1482136877,"\ue8b9\ue729","곕雕","ξήվ",1166203099>(var4, var5);
                                 var9 = 385537320;
                              } else {
                                 var9 = -572314880 + -1854019574 ^ 505681113;
                              }
                              break;
                           case 1797058566:
                              continue label87;
                        }
                     }

                     label84:
                     while (true) {
                        switch ((var9 - 2130832589 ^ 613787807) - 465696884 - 1890046650 + 1176736161 - 1470974298) {
                           case 360299997:
                              double var7 = 1<"JNT",1868762903,"\ue8b9\ue729","곕雕","ξήվ",1166203101>(var4);
                              1<"JNT",1482136877,"\ue7c9\ue839\ue849","곕雕","ξή֮",1166203102>(var4, var2);
                              var2 += (int)var7;
                              var9 = -1217529892 ^ -1217529892 >>> -1217529892 ^ 1214445333;
                              switch ((var9 + 2063650851 ^ 78002763 ^ 2094652388 ^ 1136361683) + 919296126 ^ 327940625) {
                                 case 60914375:
                                 default:
                                    var5 = (double)0<"JNT",805057116,"獾\u0b7e","埓墓傓","ƺǆʊ",-1334058467>(this);
                                    if (0<"JNT",805057116,"瑾վཾ","埓仓䡓䊓㵓䊓嘓䛓䊓䝓䠓嘓冓䝓㶓䞓䬓墓䑓","ǒʦ",-1334058469>(
                                       1<"JNT",358914796,"\ue849\ue7b9\ue729","ꓕ웕룕","ξή\u05feࡾࠎӎ",1166203096>(),
                                       1<"JNT",358914796,"\ue7c9\ue799\ue729","꣕髕ꃕ","ξή\u05feߎݾގӎ",1166203097>()
                                    )) {
                                       1<"JNT",1482136877,"\ue8b9\ue729","곕雕","ξήվ",1166203099>(var4, var5);
                                       var9 = 385537320;
                                    } else {
                                       var9 = -572314880 + -1854019574 ^ 505681113;
                                    }
                                    continue;
                                 case 1797058566:
                                    continue label87;
                              }
                           case 954413234:
                           default:
                              1<"JNT",1482136877,"\ue8b9\ue729","곕雕","ξήվ",1166203092>(
                                 var4,
                                 0<"JNT",-1109056731,"聾ཾ穾","埓兓僓僓墓僓","ƾʦɶ",-1334058492>(
                                    (float)(0.5 * (double)var1), 1<"JNT",1868762903,"\ue8b9\ue729","곕雕","ξήվ",1166203090>(var4), var5
                                 )
                              );
                              var9 = 385537320;
                        }
                     }
                  }

                  var9 = (-2081012594 << -2081012594 | 383279321) & -1762106119;
                  break;
               case 1260949432:
                  return;
            }
         }
      }
   }

   // $VF: renamed from: fw (net.minecraft.class_11908) void
   public void method_685(class_11908 var1) {
      int var4 = -1441828766;
      Iterator var2 = 0<"JNT",-89111510,";繾ཾ籾\u0b7e繾ॾ籾","埓墓仓䡓䊓㵓䊓嘓㶓㳓䢓䛓嘓傓㳓䦓䙓䊓㳓䘓䙓䬓","ɚɾǪɾƊǮǒɞɲƊǲɞǖǒ",-1334058475>(
         1<"JNT",1868762903,"\ue7f9\ue7b9","뛕ꃕ껕","ξή\u05feߞܮ࢞ܮЎ\u086eࡾޮ߾Ў\u05feޮࡎࡾӎ",1166203043>(this)
      );

      label25:
      while (true) {
         var4 = -289115989;

         while (true) {
            switch ((var4 ^ 524724096 ^ 90778229) - 1955662221 + 286155888 + 1007909137 + 901005084) {
               case 53547118:
                  if (0<"JNT",-89111510,"ɾ\u0b7e絾⡾ཾ牾繾","埓墓䑓","ɚɾǪɾƊǮǒɞɲƊǞǒƮƺɾǒʦƺ",-1334058464>(var2)) {
                     Class_199 var3 = (Class_199)0<"JNT",-89111510,"ࡾཾ牾繾","埓墓仓䡓䊓㵓䊓嘓䛓䊓䝓䠓嘓专䉓䡓䦓䤓㳓䬓","ɚɾǪɾƊǮǒɞɲƊǞǒƮƺɾǒʦƺ",-1334058463>(var2);
                     if (0<"JNT",805057116,"ݾ瑾繾","埓墓䑓","ʎɺ",-1334058478>(var3)) {
                        0<"JNT",805057116,"聾絾౾","埓仓䝓䦓㳓嘓䞓䢓䝓䦓䤓䙓䊓䥓㳓嘓䤓䛓䊓㴓㴓䈓嚓嚓䲓嗓䯓䬓墓䕓","ʎɺ",-1334058477>(var3, var1);
                     }
                     continue label25;
                  }

                  var4 = 1481403822;
                  break;
               case 1353249643:
               default:
                  return;
            }
         }
      }
   }

   // $VF: renamed from: rr () void
   public void method_686() {
      int var3 = -978288677;
      1<"JNT",1482136877,"\ue809\ue789","뛕ꃕ껕","ξή\u05fe࠾ࢎӎ",1166203049>(this, null);
      1<"JNT",1482136877,"\ue869\ue859\ue779","뛕ꃕ껕","ξή۞",1166203050>(this, true);
      1<"JNT",1482136877,"\ue7e9\ue7d9\ue869","뛕ꃕ껕","ξή֮",1166203051>(this, -1);
      Iterator var1 = 0<"JNT",-89111510,";繾ཾ籾\u0b7e繾ॾ籾","埓墓仓䡓䊓㵓䊓嘓㶓㳓䢓䛓嘓傓㳓䦓䙓䊓㳓䘓䙓䬓","ɚɾǪɾƊǮǒɞɲƊǲɞǖǒ",-1334058514>(
         1<"JNT",1868762903,"\ue7f9\ue7b9","뛕ꃕ껕","ξή\u05feߞܮ࢞ܮЎ\u086eࡾޮ߾Ў\u05feޮࡎࡾӎ",1166203052>(this)
      );

      while (true) {
         var3 = (-1347730281 >>> -1347730281 | 1306835769) & 1610070909;

         while (true) {
            switch ((var3 + 1943756853 + 25384230 - 666508293 - 1538915059 ^ 1180300149) - 534491095) {
               case -1004677452:
                  1<"JNT",1482136877,"\ue799\ue889","뛕ꃕ껕","ξή۞",1166203045>(this, false);
                  return;
               case 1505426110:
            }

            if (0<"JNT",-89111510,"ɾ\u0b7e絾⡾ཾ牾繾","埓墓䑓","ɚɾǪɾƊǮǒɞɲƊǞǒƮƺɾǒʦƺ",-1334058473>(var1)) {
               Class_199 var2 = (Class_199)0<"JNT",-89111510,"ࡾཾ牾繾","埓墓仓䡓䊓㵓䊓嘓䛓䊓䝓䠓嘓专䉓䡓䦓䤓㳓䬓","ɚɾǪɾƊǮǒɞɲƊǞǒƮƺɾǒʦƺ",-1334058472>(var1);
               0<"JNT",805057116,"罾౾ൾ","埓墓䕓","ʎɺ",-1334058471>(var2);
               break;
            }

            var3 = -1279928421;
         }
      }
   }

   // $VF: renamed from: mwf (net.minecraft.class_11909, boolean) void
   public void method_687(class_11909 var1, boolean var2) {
      int var6 = -1656868794;
      label95:
      if (0<"JNT",805057116,"\u0e7e\u0e7e","埓僓僓墓䑓","ƺǆʊ",-1334058511>(
         this,
         0<"JNT",805057116,"ൾॾݾ穾\u197e㹾䅾㍾㉾","埓墓僓","ʊƮǒƊʎɞʊƮƖƺɾƪǒƊƖɲɾǖǖŦﳁﳁﲡﳥﲡ",-1334058513>(var1),
         0<"JNT",805057116,"ൾॾݾ穾\u197e㹾䅾㍾㍾","埓墓僓","ʊƮǒƊʎɞʊƮƖƺɾƪǒƊƖɲɾǖǖŦﳁﳁﲡﳥﲡ",-1334058512>(var1)
      )) {
         int var3 = 1<"JNT",1868762903,"\ue7d9\ue799","뛕ꃕ껕","ξή֮",1166203057>(this) + 1<"JNT",1868762903,"\ue809\ue759","뛕ꃕ껕","ξή֮",1166203058>(this) - 20;
         int var4 = 1<"JNT",1868762903,"\ue7e9\ue8a9","뛕ꃕ껕","ξή֮",1166203059>(this);
         boolean var5 = 0<"JNT",805057116,"ൾॾݾ穾\u197e㹾䅾㍾㉾","埓墓僓","ʊƮǒƊʎɞʊƮƖƺɾƪǒƊƖɲɾǖǖŦﳁﳁﲡﳥﲡ",-1334058523>(var1) >= (double)var3
            && 0<"JNT",805057116,"ൾॾݾ穾\u197e㹾䅾㍾㉾","埓墓僓","ʊƮǒƊʎɞʊƮƖƺɾƪǒƊƖɲɾǖǖŦﳁﳁﲡﳥﲡ",-1334058522>(var1) <= (double)(var3 + 15)
            && 0<"JNT",805057116,"ൾॾݾ穾\u197e㹾䅾㍾㍾","埓墓僓","ʊƮǒƊʎɞʊƮƖƺɾƪǒƊƖɲɾǖǖŦﳁﳁﲡﳥﲡ",-1334058521>(var1) >= (double)var4
            && 0<"JNT",805057116,"ൾॾݾ穾\u197e㹾䅾㍾㍾","埓墓僓","ʊƮǒƊʎɞʊƮƖƺɾƪǒƊƖɲɾǖǖŦﳁﳁﲡﳥﲡ",-1334058520>(var1)
               <= (double)(var4 + 0<"JNT",805057116,"獾\u0b7e","埓墓傓","ƺǆʊ",-1334058519>(this));
         switch ((
               (0<"JNT",805057116,"ݾཾ繾ɾॾ\u0e7e\u197e䅾㹾㱾㹾㽾","埓墓傓","ʊƮǒƊʎɞʊƮƖƺɾƪǒƊƖɲɾǖǖŦﳁﳁﲡﳥﲡ",-1334058497>(var1) - 708426116 + 1020081776 ^ 1295841337)
                     - 1203311756
                  ^ 1212578681
            )
            + 1334188734) {
            case -1355405842:
               var6 = 1601486888 ^ -1793863239 ^ -1179448940 ^ -1325847473;
               break;
            case -1355405841:
               var6 = 1327743973;
               break;
            default:
               break label95;
         }

         Class_285 var10000;
         boolean var10001;
         label84: {
            label83: {
               label82:
               while (true) {
                  switch ((var6 + 731953522 ^ 911596705) + 1131922757 + 1005754440 ^ 993227199 ^ 1219759145) {
                     case -1812004473:
                        if (!0<"JNT",805057116,"Ѿ瑾ݾ","埓墓䑓","ǪǢ",-1334058506>(1<"JNT",1868762903,"\ue7e9\ue759","뛕ꃕ껕","ξή\u05fe࢞࠾ӎ",1166203012>(this))) {
                           1<"JNT",1482136877,"\ue799\ue889","뛕ꃕ껕","ξή۞",1166203014>(this, true);
                           1<"JNT",1482136877,"\ue879\ue789","뛕ꃕ껕","ξή֮",1166203017>(
                              this,
                              (int)(
                                 0<"JNT",805057116,"ൾॾݾ穾\u197e㹾䅾㍾㉾","埓墓僓","ʊƮǒƊʎɞʊƮƖƺɾƪǒƊƖɲɾǖǖŦﳁﳁﲡﳥﲡ",-1334058504>(var1)
                                    - (double)1<"JNT",1868762903,"\ue7d9\ue729","뛕ꃕ껕","ξή֮",1166203016>(this)
                              )
                           );
                           1<"JNT",1482136877,"\ue7d9\ue829","뛕ꃕ껕","ξή֮",1166203020>(
                              this,
                              (int)(
                                 0<"JNT",805057116,"ൾॾݾ穾\u197e㹾䅾㍾㍾","埓墓僓","ʊƮǒƊʎɞʊƮƖƺɾƪǒƊƖɲɾǖǖŦﳁﳁﲡﳥﲡ",-1334058549>(var1)
                                    - (double)1<"JNT",1868762903,"\ue869\ue779","뛕ꃕ껕","ξή֮",1166203019>(this)
                              )
                           );
                        }
                        break label95;
                     case -1199799787:
                     default:
                        if (1<"JNT",1868762903,"\ue799\ue889","뛕ꃕ껕","ξή۞",1166203021>(this)) {
                           break label95;
                        }

                        var10000 = this;
                        if (!1<"JNT",1868762903,"\ue8b9\ue809","뛕ꃕ껕","ξή۞",1166203022>(this)) {
                           var10001 = true;
                           break label82;
                        }

                        var6 = (965692352 | -622682689) ^ 879216131;
                        break;
                     case 730198844:
                        if (!var5) {
                           var6 = 1995938412 >> 1995938412 ^ 733767626;
                           continue;
                        }

                        var10000 = this;
                        if (!1<"JNT",1868762903,"\ue8b9\ue809","뛕ꃕ껕","ξή۞",1166203068>(this)) {
                           var10001 = true;
                           break label83;
                        }

                        var6 = 90925886 << 1109706924 ^ 728695396;
                  }

                  switch ((var6 - 398276871 ^ 1297563597) + 1929616785 ^ 431310292 ^ 618302598 ^ 1450575013) {
                     case 112767294:
                        var10001 = false;
                        break label82;
                     case 1431697878:
                     default:
                        var10001 = false;
                        break label83;
                  }
               }

               var6 = (-1531983060 ^ 232272146 | -1070452335) & -50712109;
               break label84;
            }

            var6 = -1928875690;
         }

         switch ((var6 - 1039778525 + 637461123 ^ 301489939 ^ 1760605254) - 421345149 ^ 1953605924) {
            case -2036945656:
            default:
               1<"JNT",1482136877,"\ue8b9\ue809","뛕ꃕ껕","ξή۞",1166203069>(var10000, var10001);
               break;
            case -468505653:
               1<"JNT",1482136877,"\ue8b9\ue809","뛕ꃕ껕","ξή۞",1166203007>(var10000, var10001);
         }
      }

      var6 = 1405369427 & 1451165111 ^ -1593408467;

      while (true) {
         switch (var6 - 1330653807 + 196374919 - 1075578301 + 1081067624 + 177707178 - 160336830) {
            case -1325164819:
               if (1<"JNT",1868762903,"\ue8b9\ue809","뛕ꃕ껕","ξή۞",1166203065>(this)) {
                  Iterator var7 = 0<"JNT",-89111510,";繾ཾ籾\u0b7e繾ॾ籾","埓墓仓䡓䊓㵓䊓嘓㶓㳓䢓䛓嘓傓㳓䦓䙓䊓㳓䘓䙓䬓","ɚɾǪɾƊǮǒɞɲƊǲɞǖǒ",-1334058500>(
                     1<"JNT",1868762903,"\ue7f9\ue7b9","뛕ꃕ껕","ξή\u05feߞܮ࢞ܮЎ\u086eࡾޮ߾Ў\u05feޮࡎࡾӎ",1166203066>(this)
                  );

                  while (0<"JNT",-89111510,"ɾ\u0b7e絾⡾ཾ牾繾","埓墓䑓","ɚɾǪɾƊǮǒɞɲƊǞǒƮƺɾǒʦƺ",-1334058495>(var7)) {
                     Class_199 var8 = (Class_199)0<"JNT",-89111510,"ࡾཾ牾繾","埓墓仓䡓䊓㵓䊓嘓䛓䊓䝓䠓嘓专䉓䡓䦓䤓㳓䬓","ɚɾǪɾƊǮǒɞɲƊǞǒƮƺɾǒʦƺ",-1334058510>(var7);
                     if (0<"JNT",805057116,"ݾ瑾繾","埓墓䑓","ʎɺ",-1334058509>(var8)) {
                        0<"JNT",805057116,"牾ݾ穾","埓仓䝓䦓㳓嘓䞓䢓䝓䦓䤓䙓䊓䥓㳓嘓䤓䛓䊓㴓㴓䈓嚓嚓䲓嗓䲓䬓䑓墓䕓","ʎɺ",-1334058508>(var8, var1, var2);
                     }
                  }
               }

               var6 = -1249594232 + 606216789 ^ -380376081;
               break;
            case -290040863:
            default:
               return;
         }
      }
   }

   // $VF: renamed from: oe (net.minecraft.class_11909, double, double) void
   public void method_688(class_11909 var1, double var2, double var4) {
      int var8 = -693071898;
      if (1<"JNT",1868762903,"\ue8b9\ue809","뛕ꃕ껕","ξή۞",1166203029>(this)) {
         Iterator var6 = 0<"JNT",-89111510,";繾ཾ籾\u0b7e繾ॾ籾","埓墓仓䡓䊓㵓䊓嘓㶓㳓䢓䛓嘓傓㳓䦓䙓䊓㳓䘓䙓䬓","ɚɾǪɾƊǮǒɞɲƊǲɞǖǒ",-1334058555>(
            1<"JNT",1868762903,"\ue7f9\ue7b9","뛕ꃕ껕","ξή\u05feߞܮ࢞ܮЎ\u086eࡾޮ߾Ў\u05feޮࡎࡾӎ",1166203027>(this)
         );

         label29:
         while (true) {
            var8 = 1124484165;

            while (true) {
               switch ((var8 + 797973160 + 360439064 ^ 2028423987) - 1975641790 + 1820780205 - 149697760) {
                  case -556907963:
                  default:
                     if (0<"JNT",-89111510,"ɾ\u0b7e絾⡾ཾ牾繾","埓墓䑓","ɚɾǪɾƊǮǒɞɲƊǞǒƮƺɾǒʦƺ",-1334058544>(var6)) {
                        Class_199 var7 = (Class_199)0<"JNT",-89111510,"ࡾཾ牾繾","埓墓仓䡓䊓㵓䊓嘓䛓䊓䝓䠓嘓专䉓䡓䦓䤓㳓䬓","ɚɾǪɾƊǮǒɞɲƊǞǒƮƺɾǒʦƺ",-1334058543>(var6);
                        if (0<"JNT",805057116,"ݾ瑾繾","埓墓䑓","ʎɺ",-1334058558>(var7)) {
                           0<"JNT",805057116,"౾ᅾॾ","埓仓䝓䦓㳓嘓䞓䢓䝓䦓䤓䙓䊓䥓㳓嘓䤓䛓䊓㴓㴓䈓嚓嚓䲓嗓䲓䬓僓僓墓䕓","ʎɺ",-1334058557>(var7, var1, var2, var4);
                        }
                        continue label29;
                     }

                     var8 = (-737204689 + -737204689 | 448905972) & 467785462;
                     break;
                  case 352567444:
                     return;
               }
            }
         }
      }
   }

   // $VF: renamed from: bf (net.minecraft.class_11909) void
   public void method_689(class_11909 var1) {
      int var4 = 1579940843;
      if (0<"JNT",805057116,"ݾཾ繾ɾॾ\u0e7e\u197e䅾㹾㱾㹾㽾","埓墓傓","ʊƮǒƊʎɞʊƮƖƺɾƪǒƊƖɲɾǖǖŦﳁﳁﲡﳥﲡ",-1334058533>(var1) == 0
         && 1<"JNT",1868762903,"\ue799\ue889","뛕ꃕ껕","ξή۞",1166203035>(this)) {
         1<"JNT",1482136877,"\ue799\ue889","뛕ꃕ껕","ξή۞",1166203036>(this, false);
      }

      Iterator var2 = 0<"JNT",-89111510,";繾ཾ籾\u0b7e繾ॾ籾","埓墓仓䡓䊓㵓䊓嘓㶓㳓䢓䛓嘓傓㳓䦓䙓䊓㳓䘓䙓䬓","ɚɾǪɾƊǮǒɞɲƊǲɞǖǒ",-1334058529>(
         1<"JNT",1868762903,"\ue7f9\ue7b9","뛕ꃕ껕","ξή\u05feߞܮ࢞ܮЎ\u086eࡾޮ߾Ў\u05feޮࡎࡾӎ",1166203037>(this)
      );

      while (true) {
         var4 = -232368502;

         while (true) {
            switch (var4 - 581020766 + 135828140 - 845777643 + 634294746 - 1412376942 - 36496536) {
               case -1345045250:
                  return;
               case 1957049793:
            }

            if (0<"JNT",-89111510,"ɾ\u0b7e絾⡾ཾ牾繾","埓墓䑓","ɚɾǪɾƊǮǒɞɲƊǞǒƮƺɾǒʦƺ",-1334058553>(var2)) {
               Class_199 var3 = (Class_199)0<"JNT",-89111510,"ࡾཾ牾繾","埓墓仓䡓䊓㵓䊓嘓䛓䊓䝓䠓嘓专䉓䡓䦓䤓㳓䬓","ɚɾǪɾƊǮǒɞɲƊǞǒƮƺɾǒʦƺ",-1334058552>(var2);
               if (0<"JNT",805057116,"ݾ瑾繾","埓墓䑓","ʎɺ",-1334058551>(var3)) {
                  0<"JNT",805057116,"\u0b7e;瑾","埓仓䝓䦓㳓嘓䞓䢓䝓䦓䤓䙓䊓䥓㳓嘓䤓䛓䊓㴓㴓䈓嚓嚓䲓嗓䲓䬓墓䕓","ʎɺ",-1334058534>(var3, var1);
               }
               break;
            }

            var4 = 1870585807 & 760569335;
         }
      }
   }

   // $VF: renamed from: pg (double, double, double, double) void
   public void method_690(double var1, double var3, double var5, double var7) {
      1<"JNT",1482136877,"\ue7d9\ue799","뛕ꃕ껕","ξή֮",1166202976>(this, 1<"JNT",1868762903,"\ue7d9\ue729","뛕ꃕ껕","ξή֮",1166202975>(this));
      1<"JNT",1482136877,"\ue7e9\ue8a9","뛕ꃕ껕","ξή֮",1166202978>(this, 1<"JNT",1868762903,"\ue869\ue779","뛕ꃕ껕","ξή֮",1166202977>(this));
      1<"JNT",1482136877,"\ue7e9\ue8a9","뛕ꃕ껕","ξή֮",1166202980>(
         this, (int)((double)1<"JNT",1868762903,"\ue7e9\ue8a9","뛕ꃕ껕","ξή֮",1166202979>(this) + var7 * 20.0)
      );
      0<"JNT",805057116,"牾腾","埓傓墓䕓","ƺǆʊ",-1334058537>(this, (int)((double)1<"JNT",1868762903,"\ue869\ue779","뛕ꃕ껕","ξή֮",1166202981>(this) + var7 * 20.0));
   }

   // $VF: renamed from: oqe (double, double, float) void
   // $VF: Irreducible bytecode was duplicated to produce valid code
   public void method_691(double var1, double var3, float var5) {
      int var6 = 936553548;
      1<"JNT",1482136877,"\ue7d9\ue799","뛕ꃕ껕","ξή֮",1166202994>(this, 1<"JNT",1868762903,"\ue7d9\ue729","뛕ꃕ껕","ξή֮",1166202993>(this));
      1<"JNT",1482136877,"\ue7e9\ue8a9","뛕ꃕ껕","ξή֮",1166202996>(this, 1<"JNT",1868762903,"\ue869\ue779","뛕ꃕ껕","ξή֮",1166202995>(this));
      if (1<"JNT",1868762903,"\ue799\ue889","뛕ꃕ껕","ξή۞",1166202997>(this)) {
         Class_285 var10000 = this;
         float var10001 = 0.3F * var5;
         double var10002;
         if (0<"JNT",805057116,"\u0e7e\u0e7e","埓僓僓墓䑓","ƺǆʊ",-1334059353>(this, var1, var3)) {
            var10002 = (double)1<"JNT",1868762903,"\ue7d9\ue729","뛕ꃕ껕","ξή֮",1166202999>(this);
            var6 = 72501669;
         } else {
            var6 = 628811889 >>> -781198120 ^ -243361299;
            switch ((var6 + 1391431416 + 514949022 ^ 439176550) + 1439475964 + 548405420 - 1012931967) {
               case -1286639263:
                  var10002 = (double)1<"JNT",1868762903,"\ue7d9\ue799","뛕ꃕ껕","ξή֮",1166202987>(this);
                  var6 = 72501669;
                  break;
               case 627588314:
               default:
                  var10002 = (double)1<"JNT",1868762903,"\ue7e9\ue8a9","뛕ꃕ껕","ξή֮",1166202983>(this);
                  var6 = -1061889 & 1826641994;
            }
         }

         while (true) {
            switch (((var6 ^ 908361444 ^ 779763549) - 1669706890 ^ 1172306090) + 943376349 + 1446372176) {
               case -1949673883:
                  1<"JNT",1482136877,"\ue7d9\ue729","뛕ꃕ껕","ξή֮",1166202990>(
                     var10000,
                     (int)0<"JNT",-1109056731,"聾ཾ穾","埓兓僓僓墓僓","ƾʦɶ",-1334059346>(
                        var10001, var10002, var1 - (double)1<"JNT",1868762903,"\ue879\ue789","뛕ꃕ껕","ξή֮",1166202988>(this)
                     )
                  );
                  var10000 = this;
                  var10001 = 0.3F * var5;
                  if (0<"JNT",805057116,"\u0e7e\u0e7e","埓僓僓墓䑓","ƺǆʊ",-1334059344>(this, var1, var3)) {
                     var10002 = (double)1<"JNT",1868762903,"\ue869\ue779","뛕ꃕ껕","ξή֮",1166202992>(this);
                     var6 = -1061889 & 1826641994;
                  } else {
                     var6 = (-1848057866 | 1347127 | 2126620225) & 2145775425;
                     switch ((var6 + 1391431416 + 514949022 ^ 439176550) + 1439475964 + 548405420 - 1012931967) {
                        case -1286639263:
                           var10002 = (double)1<"JNT",1868762903,"\ue7d9\ue799","뛕ꃕ껕","ξή֮",1166202987>(this);
                           var6 = 72501669;
                           break;
                        case 627588314:
                        default:
                           var10002 = (double)1<"JNT",1868762903,"\ue7e9\ue8a9","뛕ꃕ껕","ξή֮",1166202983>(this);
                           var6 = -1061889 & 1826641994;
                     }
                  }
                  break;
               case -480749328:
               default:
                  1<"JNT",1482136877,"\ue869\ue779","뛕ꃕ껕","ξή֮",1166202986>(
                     var10000,
                     (int)0<"JNT",-1109056731,"聾ཾ穾","埓兓僓僓墓僓","ƾʦɶ",-1334059350>(
                        var10001, var10002, var3 - (double)1<"JNT",1868762903,"\ue7d9\ue829","뛕ꃕ껕","ξή֮",1166202984>(this)
                     )
                  );
                  return;
            }
         }
      }
   }

   // $VF: renamed from: vt () int
   public int method_692() {
      return 1<"JNT",1868762903,"\ue7d9\ue799","뛕ꃕ껕","ξή֮",1166203000>(this);
   }

   // $VF: renamed from: pi (int) void
   public void method_693(int var1) {
      1<"JNT",1482136877,"\ue7d9\ue729","뛕ꃕ껕","ξή֮",1166203001>(this, var1);
   }

   // $VF: renamed from: zy () int
   public int method_694() {
      return 1<"JNT",1868762903,"\ue7e9\ue8a9","뛕ꃕ껕","ξή֮",1166203002>(this);
   }

   // $VF: renamed from: xw (int) void
   public void method_695(int var1) {
      1<"JNT",1482136877,"\ue869\ue779","뛕ꃕ껕","ξή֮",1166203003>(this, var1);
   }

   // $VF: renamed from: agm () int
   public int method_696() {
      return 1<"JNT",1868762903,"\ue809\ue759","뛕ꃕ껕","ξή֮",1166203004>(this);
   }

   // $VF: renamed from: cf () int
   public int method_697() {
      return 0<"JNT",805057116,"獾\u0b7e","埓墓傓","ƺǆʊ",-1334059330>(this);
   }

   // $VF: renamed from: dd (double, double) boolean
   public boolean method_698(double var1, double var3) {
      return var1 > (double)1<"JNT",1868762903,"\ue7d9\ue799","뛕ꃕ껕","ξή֮",1166203006>(this)
         && var1 < (double)(1<"JNT",1868762903,"\ue7d9\ue799","뛕ꃕ껕","ξή֮",1166202943>(this) + 1<"JNT",1868762903,"\ue809\ue759","뛕ꃕ껕","ξή֮",1166202944>(this))
         && var3 > (double)1<"JNT",1868762903,"\ue7e9\ue8a9","뛕ꃕ껕","ξή֮",1166202945>(this)
         && var3 < (double)(1<"JNT",1868762903,"\ue7e9\ue8a9","뛕ꃕ껕","ξή֮",1166202946>(this) + 0<"JNT",805057116,"獾\u0b7e","埓墓傓","ƺǆʊ",-1334059340>(this));
   }

   // $VF: renamed from: wt (double, double) boolean
   public boolean method_699(double var1, double var3) {
      return var1 > (double)1<"JNT",1868762903,"\ue7d9\ue799","뛕ꃕ껕","ξή֮",1166202948>(this)
         && var1 < (double)(1<"JNT",1868762903,"\ue7d9\ue799","뛕ꃕ껕","ξή֮",1166202949>(this) + 1<"JNT",1868762903,"\ue809\ue759","뛕ꃕ껕","ξή֮",1166202950>(this))
         && var3 > (double)1<"JNT",1868762903,"\ue7e9\ue8a9","뛕ꃕ껕","ξή֮",1166202951>(this)
         && var3 < (double)(1<"JNT",1868762903,"\ue7e9\ue8a9","뛕ꃕ껕","ξή֮",1166202952>(this) + 0<"JNT",805057116,"獾\u0b7e","埓墓傓","ƺǆʊ",-1334059382>(this));
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_700(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = (var10 + 135334171 - 1755628528 - 1553896807 - 409831689 + 744187498 + 530705044 - 293294587 ^ 658409064) + 941318444;
      MethodHandle var10000 = jasf[(var10 + 135334171 - 1755628528 - 1553896807 - 409831689 + 744187498 + 530705044 - 293294587 ^ 658409064)
         + 941318444
         - 1786503829];
      if (jasf[var10001 - 1786503829] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = 923682535 >>> 923682535 ^ 7216269; var23 < var13.length(); var23 += -1974771711 * 312120655 ^ 1589458254) {
            int var42 = var13.charAt(var23) + '!';
            char var47 = (char)(
               (
                        (
                                 (
                                          (
                                                   (
                                                         (
                                                                  (
                                                                           (((var42 & 61440) >> 12 | var42 << 4) & 65472) >> 6
                                                                              | ((var42 & 61440) >> 12 | var42 << 4) << 10
                                                                        )
                                                                        - 162
                                                                     & 65024
                                                               )
                                                               >> 9
                                                            | ((((var42 & 61440) >> 12 | var42 << 4) & 65472) >> 6 | ((var42 & 61440) >> 12 | var42 << 4) << 10)
                                                                  - 162
                                                               << 7
                                                      )
                                                      ^ 71
                                                )
                                                - 218
                                             & 65528
                                       )
                                       >> 3
                                    | (
                                             (
                                                   (
                                                            ((((var42 & 61440) >> 12 | var42 << 4) & 65472) >> 6 | ((var42 & 61440) >> 12 | var42 << 4) << 10)
                                                                  - 162
                                                               & 65024
                                                         )
                                                         >> 9
                                                      | ((((var42 & 61440) >> 12 | var42 << 4) & 65472) >> 6 | ((var42 & 61440) >> 12 | var42 << 4) << 10)
                                                            - 162
                                                         << 7
                                                )
                                                ^ 71
                                          )
                                          - 218
                                       << 13
                              )
                              - 56
                           & 64512
                     )
                     >> 10
                  | (
                           (
                                    (
                                             (
                                                   (
                                                            ((((var42 & 61440) >> 12 | var42 << 4) & 65472) >> 6 | ((var42 & 61440) >> 12 | var42 << 4) << 10)
                                                                  - 162
                                                               & 65024
                                                         )
                                                         >> 9
                                                      | ((((var42 & 61440) >> 12 | var42 << 4) & 65472) >> 6 | ((var42 & 61440) >> 12 | var42 << 4) << 10)
                                                            - 162
                                                         << 7
                                                )
                                                ^ 71
                                          )
                                          - 218
                                       & 65528
                                 )
                                 >> 3
                              | (
                                       (
                                             (((((var42 & 61440) >> 12 | var42 << 4) & 65472) >> 6 | ((var42 & 61440) >> 12 | var42 << 4) << 10) - 162 & 65024)
                                                   >> 9
                                                | ((((var42 & 61440) >> 12 | var42 << 4) & 65472) >> 6 | ((var42 & 61440) >> 12 | var42 << 4) << 10) - 162 << 7
                                          )
                                          ^ 71
                                    )
                                    - 218
                                 << 13
                        )
                        - 56
                     << 6
            );
            var13.setCharAt(
               var23,
               (char)(
                  (
                           (
                                    (
                                             (
                                                      (
                                                            (
                                                                     (
                                                                              (((var42 & 61440) >> 12 | var42 << 4) & 65472) >> 6
                                                                                 | ((var42 & 61440) >> 12 | var42 << 4) << 10
                                                                           )
                                                                           - 162
                                                                        & 65024
                                                                  )
                                                                  >> 9
                                                               | (
                                                                        (((var42 & 61440) >> 12 | var42 << 4) & 65472) >> 6
                                                                           | ((var42 & 61440) >> 12 | var42 << 4) << 10
                                                                     )
                                                                     - 162
                                                                  << 7
                                                         )
                                                         ^ 71
                                                   )
                                                   - 218
                                                & 65528
                                          )
                                          >> 3
                                       | (
                                                (
                                                      (
                                                               (
                                                                        (((var42 & 61440) >> 12 | var42 << 4) & 65472) >> 6
                                                                           | ((var42 & 61440) >> 12 | var42 << 4) << 10
                                                                     )
                                                                     - 162
                                                                  & 65024
                                                            )
                                                            >> 9
                                                         | ((((var42 & 61440) >> 12 | var42 << 4) & 65472) >> 6 | ((var42 & 61440) >> 12 | var42 << 4) << 10)
                                                               - 162
                                                            << 7
                                                   )
                                                   ^ 71
                                             )
                                             - 218
                                          << 13
                                 )
                                 - 56
                              & 64512
                        )
                        >> 10
                     | (
                              (
                                       (
                                                (
                                                      (
                                                               (
                                                                        (((var42 & 61440) >> 12 | var42 << 4) & 65472) >> 6
                                                                           | ((var42 & 61440) >> 12 | var42 << 4) << 10
                                                                     )
                                                                     - 162
                                                                  & 65024
                                                            )
                                                            >> 9
                                                         | ((((var42 & 61440) >> 12 | var42 << 4) & 65472) >> 6 | ((var42 & 61440) >> 12 | var42 << 4) << 10)
                                                               - 162
                                                            << 7
                                                   )
                                                   ^ 71
                                             )
                                             - 218
                                          & 65528
                                    )
                                    >> 3
                                 | (
                                          (
                                                (
                                                         ((((var42 & 61440) >> 12 | var42 << 4) & 65472) >> 6 | ((var42 & 61440) >> 12 | var42 << 4) << 10)
                                                               - 162
                                                            & 65024
                                                      )
                                                      >> 9
                                                   | ((((var42 & 61440) >> 12 | var42 << 4) & 65472) >> 6 | ((var42 & 61440) >> 12 | var42 << 4) << 10) - 162
                                                      << 7
                                             )
                                             ^ 71
                                       )
                                       - 218
                                    << 13
                           )
                           - 56
                        << 6
               )
            );
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = 1410860845 >>> -1280726336 ^ 1410860845; var29 < var16.length(); var29 += (-20360798 * 211081309 | 1) & 262145) {
            int var52 = var16.charAt(var29) + 249 - 204 ^ 96;
            char var55 = (char)(
               (
                     (
                           (((((var52 & 65504) >> 5 | var52 << 11) - 209 & 65472) >> 6 | ((var52 & 65504) >> 5 | var52 << 11) - 209 << 10) & 63488) >> 11
                              | ((((var52 & 65504) >> 5 | var52 << 11) - 209 & 65472) >> 6 | ((var52 & 65504) >> 5 | var52 << 11) - 209 << 10) << 5
                        )
                        ^ 236
                  )
                  - 157
                  + 176
            );
            var16.setCharAt(
               var29,
               (char)(
                  (
                        (
                              (((((var52 & 65504) >> 5 | var52 << 11) - 209 & 65472) >> 6 | ((var52 & 65504) >> 5 | var52 << 11) - 209 << 10) & 63488) >> 11
                                 | ((((var52 & 65504) >> 5 | var52 << 11) - 209 & 65472) >> 6 | ((var52 & 65504) >> 5 | var52 << 11) - 209 << 10) << 5
                           )
                           ^ 236
                     )
                     - 157
                     + 176
               )
            );
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_285.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = (1203929548 | 1440134798) ^ 1473689550; var35 < var19.length(); var35 += (170359908 << 170359908 | 1) & 1141387525) {
            int var60 = var19.charAt(var35) - '|' - 10;
            char var61 = (char)(((((var60 & 65532) >> 2 | var60 << 14) + 101 ^ 133) + 246 ^ 29) + 117 - 192 ^ 151);
            var19.setCharAt(var35, (char)(((((var60 & 65532) >> 2 | var60 << 14) + 101 ^ 133) + 246 ^ 29) + 117 - 192 ^ 151));
         }

         Class var7 = Class.forName(var19.toString(), false, Class_285.class.getClassLoader());
         switch ((var4 - 1898562431 + 1346612014 + 1522173464 - 1200398937 + 451155468 + 1998815190 + 1142203052 ^ 1504280918 ^ 25081930) - 1604072716) {
            case 753856636:
               var10000 = var0.findSpecial(var7, var5, var6, Class_285.class);
               break;
            case 1009204270:
            case 1092278840:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 1940123553:
               var10000 = var0.findConstructor(var7, var6);
               break;
            case 2130831665:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      jasf[(var10 + 135334171 - 1755628528 - 1553896807 - 409831689 + 744187498 + 530705044 - 293294587 ^ 658409064) + 941318444 - 1786503829] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_701(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = var10 - 1420797887 + 1588000130 - 1791341372 - 356986149 + 810285286 - 869467145 - 1348485812 + 995695734 ^ 1627787488;
      MethodHandle var10000 = jasf[(var10 - 1420797887 + 1588000130 - 1791341372 - 356986149 + 810285286 - 869467145 - 1348485812 + 995695734 ^ 1627787488)
         + 673643533];
      if (jasf[var10001 + 673643533] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = (-188317724 * 802200227 | 0) & -2046295600; var24 < var14.length(); var24 += 1610894659 << 1167248884 ^ -735051775) {
            int var43 = var14.charAt(var24) + 243 - 40;
            char var46 = (char)(
               (
                     (((((var43 & 64512) >> 10 | var43 << 6) & 65528) >> 3 | ((var43 & 64512) >> 10 | var43 << 6) << 13) + 146 + 12 + 59 & 65408) >> 7
                        | ((((var43 & 64512) >> 10 | var43 << 6) & 65528) >> 3 | ((var43 & 64512) >> 10 | var43 << 6) << 13) + 146 + 12 + 59 << 9
                  )
                  - 70
                  + 38
            );
            var14.setCharAt(
               var24,
               (char)(
                  (
                        (((((var43 & 64512) >> 10 | var43 << 6) & 65528) >> 3 | ((var43 & 64512) >> 10 | var43 << 6) << 13) + 146 + 12 + 59 & 65408) >> 7
                           | ((((var43 & 64512) >> 10 | var43 << 6) & 65528) >> 3 | ((var43 & 64512) >> 10 | var43 << 6) << 13) + 146 + 12 + 59 << 9
                     )
                     - 70
                     + 38
               )
            );
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = (1220448892 * 1220448892 | 0) & 1074024676; var30 < var17.length(); var30 += (-243917150 | 892442549 | 1) & 1) {
            int var51 = var17.charAt(var30) - 153 - 113 - 8;
            char var56 = (char)(
               (
                     (
                              (
                                    (
                                             (
                                                      (
                                                               (
                                                                     (((var51 & 65472) >> 6 | var51 << 10) & 57344) >> 13
                                                                        | ((var51 & 65472) >> 6 | var51 << 10) << 3
                                                                  )
                                                                  & 63488
                                                            )
                                                            >> 11
                                                         | ((((var51 & 65472) >> 6 | var51 << 10) & 57344) >> 13 | ((var51 & 65472) >> 6 | var51 << 10) << 3)
                                                            << 5
                                                   )
                                                   + 240
                                                & 65504
                                          )
                                          >> 5
                                       | (
                                                (((((var51 & 65472) >> 6 | var51 << 10) & 57344) >> 13 | ((var51 & 65472) >> 6 | var51 << 10) << 3) & 63488)
                                                      >> 11
                                                   | ((((var51 & 65472) >> 6 | var51 << 10) & 57344) >> 13 | ((var51 & 65472) >> 6 | var51 << 10) << 3) << 5
                                             )
                                             + 240
                                          << 11
                                 )
                                 & 65472
                           )
                           >> 6
                        | (
                              (
                                       (
                                                (((((var51 & 65472) >> 6 | var51 << 10) & 57344) >> 13 | ((var51 & 65472) >> 6 | var51 << 10) << 3) & 63488)
                                                      >> 11
                                                   | ((((var51 & 65472) >> 6 | var51 << 10) & 57344) >> 13 | ((var51 & 65472) >> 6 | var51 << 10) << 3) << 5
                                             )
                                             + 240
                                          & 65504
                                    )
                                    >> 5
                                 | (
                                          (((((var51 & 65472) >> 6 | var51 << 10) & 57344) >> 13 | ((var51 & 65472) >> 6 | var51 << 10) << 3) & 63488) >> 11
                                             | ((((var51 & 65472) >> 6 | var51 << 10) & 57344) >> 13 | ((var51 & 65472) >> 6 | var51 << 10) << 3) << 5
                                       )
                                       + 240
                                    << 11
                           )
                           << 10
                  )
                  + 152
            );
            var17.setCharAt(
               var30,
               (char)(
                  (
                        (
                                 (
                                       (
                                                (
                                                         (
                                                                  (
                                                                        (((var51 & 65472) >> 6 | var51 << 10) & 57344) >> 13
                                                                           | ((var51 & 65472) >> 6 | var51 << 10) << 3
                                                                     )
                                                                     & 63488
                                                               )
                                                               >> 11
                                                            | ((((var51 & 65472) >> 6 | var51 << 10) & 57344) >> 13 | ((var51 & 65472) >> 6 | var51 << 10) << 3)
                                                               << 5
                                                      )
                                                      + 240
                                                   & 65504
                                             )
                                             >> 5
                                          | (
                                                   (((((var51 & 65472) >> 6 | var51 << 10) & 57344) >> 13 | ((var51 & 65472) >> 6 | var51 << 10) << 3) & 63488)
                                                         >> 11
                                                      | ((((var51 & 65472) >> 6 | var51 << 10) & 57344) >> 13 | ((var51 & 65472) >> 6 | var51 << 10) << 3) << 5
                                                )
                                                + 240
                                             << 11
                                    )
                                    & 65472
                              )
                              >> 6
                           | (
                                 (
                                          (
                                                   (((((var51 & 65472) >> 6 | var51 << 10) & 57344) >> 13 | ((var51 & 65472) >> 6 | var51 << 10) << 3) & 63488)
                                                         >> 11
                                                      | ((((var51 & 65472) >> 6 | var51 << 10) & 57344) >> 13 | ((var51 & 65472) >> 6 | var51 << 10) << 3) << 5
                                                )
                                                + 240
                                             & 65504
                                       )
                                       >> 5
                                    | (
                                             (((((var51 & 65472) >> 6 | var51 << 10) & 57344) >> 13 | ((var51 & 65472) >> 6 | var51 << 10) << 3) & 63488) >> 11
                                                | ((((var51 & 65472) >> 6 | var51 << 10) & 57344) >> 13 | ((var51 & 65472) >> 6 | var51 << 10) << 3) << 5
                                          )
                                          + 240
                                       << 11
                              )
                              << 10
                     )
                     + 152
               )
            );
         }

         Class var6 = Class.forName(var17.toString(), false, Class_285.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = -1551727350 + -79524164 ^ -1631251514; var36 < var20.length(); var36 += 703233050 << (-1306795743 ^ -1306795743) ^ 703233051) {
            int var61 = var20.charAt(var36);
            int var93 = (var61 & 65532) >> 2;
            int var62 = ((var61 & 65532) >> 2 | var61 << 14) - 189 + 90;
            int var94 = (((var61 & 65532) >> 2 | var61 << 14) - 189 + 90 & 32768) >> 15;
            var61 = ((var93 | var61 << 14) - 189 + 90 & 32768) >> 15 | ((var61 & 65532) >> 2 | var61 << 14) - 189 + 90 << 1;
            var93 = ((var94 | var62 << 1) & 49152) >> 14;
            int var64 = (((var94 | var62 << 1) & 49152) >> 14 | var61 << 2) + 59 + 248 - 92 ^ 59;
            int var96 = (((((var94 | var62 << 1) & 49152) >> 14 | var61 << 2) + 59 + 248 - 92 ^ 59) & 65504) >> 5;
            char var65 = (char)(
               (((var93 | var61 << 2) + 59 + 248 - 92 ^ 59) & 65504) >> 5 | ((((var94 | var62 << 1) & 49152) >> 14 | var61 << 2) + 59 + 248 - 92 ^ 59) << 11
            );
            var20.setCharAt(var36, (char)(var96 | var64 << 11));
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_285.class.getClassLoader()).returnType();
         switch (((var4 ^ 1268874348) - 441644304 + 448611709 ^ 983433765 ^ 1057583654 ^ 2020352063 ^ 2018853317) + 1319320478 + 1745781099 + 1554583713) {
            case 97722816:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            case 623504897:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            case 870162363:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            case 1845032126:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         jasf[(var10 - 1420797887 + 1588000130 - 1791341372 - 356986149 + 810285286 - 869467145 - 1348485812 + 995695734 ^ 1627787488) + 673643533] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
