import dev.krypton.native.Loader;
import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;
import net.minecraft.class_1937;
import net.minecraft.class_2680;
import net.minecraft.class_2791;
import net.minecraft.class_2826;
import net.minecraft.class_310;

public class Class_229 {
   // $VF: renamed from: vf net.minecraft.class_1937
   public class_1937 field_473 = 1<"JNT",-581501162,"쾏쾿콿쿯콯켟찿첏첯첟","◯뗯여㗫㗯\uf5ee◯뗯嗯旬痯ꗯ여㗫嗯䗯痯嗬嗬ᗮ懨臨釨","ﶷﶧ\ufff7Ǩｸ\bﷇǸƸǨｸ８(Ｘｨ\bﷇ８ƈＸ\u0018\u0018Øﱗﰇﺷﺇ",1597276200>(
      (class_310)1<"JNT",-1050131587,"쿯졏","ꗯ痯","ﶷﶧ\ufff7ƨＸhＸﷇƈＸǨｘﷇￇＨƨｸ８\bﺇ",1597276203>()
   );
   // $VF: renamed from: xqv net.minecraft.class_2791
   public class_2791 field_474;
   // $VF: renamed from: svz java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_475 = new MethodHandle[(-712470017 << -712470017 | 25) & 1074501787];

   // $VF: renamed from: ux (int, int, int) net.minecraft.class_2680
   public class_2680 method_471(int var1, int var2, int var3) {
      int var8 = -287087952;
      if (0<"JNT",-815503021,"ﴎﵮﴪﵺﴖﵪﵖﰦﰞﰲﰚﰞ","ᅡ내ᄓ","\u1ae3ᢣᱣૣ᪣ᦣ\u1ae3ᢣᠣᯣឣᣣᱣૣᠣᩣឣᰣᰣᜣணඣణണ",-159400706>(
         1<"JNT",-581501162,"좏쾏","◯嗬","ﶷﶧ\ufff7Ǩｸ\bﷇǸƸǨｸ８(Ｘｨ\bﷇ８ƈＸ\u0018\u0018Øﰧﺧﰇﱇﺇ",1597276222>(this), var2
      )) {
         return 0<"JNT",-815503021,"ﴎﵮﴪﵺﴖﵪﵖﰾﰮﰲﰪ","ᅡᅢᄅᄧᄞᄭᅨᄦᄢᄧᄞᄜᄫᄚᄟᄭᅨᄜᄥᄚᄬᄬᄘᅫᅯᅱᅩᅴ","\u1ae3ᢣᱣૣ᪣ᦣ\u1ae3ᢣᠣᯣឣᣣᱣૣᠣᩣឣᰣᰣᜣ\u0be3\u0be3ౣൣ",-159400708>(
            1<"JNT",-1050131587,"쾏쾿콿쿯콯켟찿찯챏챯챟","◯뗯여㗫㗯\uf5ee◯뗯嗯旬痯ꗯ여㗫嗯䗯痯嗬嗬ᗮ燨燨엨ꗨ","ﶷﶧ\ufff7Ǩｸ\bﷇǸƸǨｸ８(Ｘｨ\bﷇ８ƈＸ\u0018\u0018Øﰗﰗﱷﺷﺇ",1597276216>()
         );
      } else {
         int var4 = var1 >> 4;
         int var5 = var3 >> 4;
         class_2791 var6;
         if (1<"JNT",-581501162,"좯젿좏","◯嗬","ﶷﶧ\ufff7Ǩｸ\bﷇǸƸǨｸ８(Ｘｨ\bﷇ８ƈＸ\u0018\u0018Øﰗﱇﺧﰧﺇ",1597276180>(this) != null
            && 1<"JNT",-581501162,"쾏쾿콿쿯콯켟첿찿첯찿","◯뗯여㗫㗯\uf5ee◯뗯嗯旬痯ꗯ여㗫嗯䗯痯嗬嗬ᗮ臨Ǩ燨懨","ﶷﶧﾧ",1597276211>(
                  0<"JNT",-815503021,"ﴎﵮﴪﵺﴖﵪﵖﰞﰢﰚﰚﰪ","ᅡᅢᄅᄧᄞᄭᅨᄦᄢᄧᄞᄜᄫᄚᄟᄭᅨᄜᄥᄚᄬᄬᄘᅪᅲᅫᅬᅴ","\u1ae3ᢣᱣૣ᪣ᦣ\u1ae3ᢣᠣᯣឣᣣᱣૣᠣᩣឣᰣᰣᜣ\u0be3ണඣண",-159400669>(
                     1<"JNT",-581501162,"좯젿좏","◯嗬","ﶷﶧ\ufff7Ǩｸ\bﷇǸƸǨｸ８(Ｘｨ\bﷇ８ƈＸ\u0018\u0018Øﰗﱇﺧﰧﺇ",1597276193>(this)
                  )
               )
               == var4
            && 1<"JNT",-581501162,"쾏쾿콿쿯콯켟첿찿첯찯","◯뗯여㗫㗯\uf5ee◯뗯嗯旬痯ꗯ여㗫嗯䗯痯嗬嗬ᗮ臨Ǩ燨懨","ﶷﶧﾧ",1597276210>(
                  0<"JNT",-815503021,"ﴎﵮﴪﵺﴖﵪﵖﰞﰢﰚﰚﰪ","ᅡᅢᄅᄧᄞᄭᅨᄦᄢᄧᄞᄜᄫᄚᄟᄭᅨᄜᄥᄚᄬᄬᄘᅪᅲᅫᅬᅴ","\u1ae3ᢣᱣૣ᪣ᦣ\u1ae3ᢣᠣᯣឣᣣᱣૣᠣᩣឣᰣᰣᜣ\u0be3ണඣண",-159400668>(
                     1<"JNT",-581501162,"좯젿좏","◯嗬","ﶷﶧ\ufff7Ǩｸ\bﷇǸƸǨｸ８(Ｘｨ\bﷇ８ƈＸ\u0018\u0018Øﰗﱇﺧﰧﺇ",1597276208>(this)
                  )
               )
               == var5) {
            var6 = 1<"JNT",-581501162,"좯젿좏","◯嗬","ﶷﶧ\ufff7Ǩｸ\bﷇǸƸǨｸ８(Ｘｨ\bﷇ８ƈＸ\u0018\u0018Øﰗﱇﺧﰧﺇ",1597276223>(this);
         } else {
            var6 = 0<"JNT",-815503021,"ﴎﵮﴪﵺﴖﵪﵖﰺﰪﰚﰢ","ᅡᄂᄂᄅᄧᄞᄭᅨᄦᄢᄧᄞᄜᄫᄚᄟᄭᅨᄜᄥᄚᄬᄬᄘᅫᅱᅩᅯᅴᄓᅢᄅᄧᄞᄭᅨᄦᄢᄧᄞᄜᄫᄚᄟᄭᅨᄜᄥᄚᄬᄬᄘᅫᅰᅲᅪᅴ","\u1ae3ᢣᱣૣ᪣ᦣ\u1ae3ᢣᠣᯣឣᣣᱣૣᠣᩣឣᰣᰣᜣணඣణണ",-159400670>(
               1<"JNT",-581501162,"좏쾏","◯嗬","ﶷﶧ\ufff7Ǩｸ\bﷇǸƸǨｸ８(Ｘｨ\bﷇ８ƈＸ\u0018\u0018Øﰧﺧﰇﱇﺇ",1597276181>(this),
               var4,
               var5,
               1<"JNT",-1050131587,"쾏쾿콿쿯콯켟찿챏첯찯챟","◯뗯여㗫㗯\uf5ee◯뗯嗯旬痯ꗯ여㗫嗯䗯痯嗬嗬ᗮ燨ᇨ釨ꗨ","ﶷﶧ\ufff7Ǩｸ\bﷇǸƸǨｸ８(Ｘｨ\bﷇ８ƈＸ\u0018\u0018Øﰗﺷﰷﱗﺇ",1597276202>(),
               false
            );
         }

         var8 = 1235988622;

         while (true) {
            switch ((var8 - 150651141 ^ 723618207) - 849454163 - 843190087 - 590211086 ^ 2029195082) {
               case -1685273308:
                  if (var6 == null) {
                     return 0<"JNT",-815503021,"ﴎﵮﴪﵺﴖﵪﵖﰾﰮﰲﰪ","ᅡᅢᄅᄧᄞᄭᅨᄦᄢᄧᄞᄜᄫᄚᄟᄭᅨᄜᄥᄚᄬᄬᄘᅫᅯᅱᅩᅴ","\u1ae3ᢣᱣૣ᪣ᦣ\u1ae3ᢣᠣᯣឣᣣᱣૣᠣᩣឣᰣᰣᜣ\u0be3\u0be3ౣൣ",-159400712>(
                        1<"JNT",-1050131587,"쾏쾿콿쿯콯켟찿찯챏챯챟","◯뗯여㗫㗯\uf5ee◯뗯嗯旬痯ꗯ여㗫嗯䗯痯嗬嗬ᗮ燨燨엨ꗨ","ﶷﶧ\ufff7Ǩｸ\bﷇǸƸǨｸ８(Ｘｨ\bﷇ８ƈＸ\u0018\u0018Øﰗﰗﱷﺷﺇ",1597276220>()
                     );
                  }

                  var8 = -37915851 & 2042460023;
                  break;
               case -1423790259:
               default:
                  class_2826 var7 = 0<"JNT",-815503021,"ﴎﵮﴪﵺﴖﵪﵖﰞﰢﰚﰚﰲ","ᅡᅢᄔᄅᄧᄞᄭᅨᄦᄢᄧᄞᄜᄫᄚᄟᄭᅨᄜᄥᄚᄬᄬᄘᅫᅱᅫᅯᅴ","\u1ae3ᢣᱣૣ᪣ᦣ\u1ae3ᢣᠣᯣឣᣣᱣૣᠣᩣឣᰣᰣᜣ\u0be3ണඣண",-159400689>(
                     var6
                  )[0<"JNT",-815503021,"ﴎﵮﴪﵺﴖﵪﵖﰦﰞﰲﰚﰢ","ᅡ내ᄂ","\u1ae3ᢣᱣૣ᪣ᦣ\u1ae3ᢣᠣᯣឣᣣᱣૣᠣᩣឣᰣᰣᜣ\u0be3ണඣண",-159400686>(var6, var2)];
                  if (var7 == null) {
                     return 0<"JNT",-815503021,"ﴎﵮﴪﵺﴖﵪﵖﰾﰮﰲﰪ","ᅡᅢᄅᄧᄞᄭᅨᄦᄢᄧᄞᄜᄫᄚᄟᄭᅨᄜᄥᄚᄬᄬᄘᅫᅯᅱᅩᅴ","\u1ae3ᢣᱣૣ᪣ᦣ\u1ae3ᢣᠣᯣឣᣣᱣૣᠣᩣឣᰣᰣᜣ\u0be3\u0be3ౣൣ",-159400688>(
                        1<"JNT",-1050131587,"쾏쾿콿쿯콯켟찿찯챏챯챟","◯뗯여㗫㗯\uf5ee◯뗯嗯旬痯ꗯ여㗫嗯䗯痯嗬嗬ᗮ燨燨엨ꗨ","ﶷﶧ\ufff7Ǩｸ\bﷇǸƸǨｸ８(Ｘｨ\bﷇ８ƈＸ\u0018\u0018Øﰗﰗﱷﺷﺇ",1597276196>()
                     );
                  }

                  1<"JNT",-1122454741,"좯젿좏","◯嗬","ﶷﶧ\ufff7Ǩｸ\bﷇǸƸǨｸ８(Ｘｨ\bﷇ８ƈＸ\u0018\u0018Øﰗﱇﺧﰧﺇ",1597276198>(this, var6);
                  return 0<"JNT",-815503021,"ﴎﵮﴪﵺﴖﵪﵖﰞﰢﰢﰮﰪ","ᅡᄂᄂ내ᄅᄧᄞᄭᅨᄦᄢᄧᄞᄜᄫᄚᄟᄭᅨᄜᄥᄚᄬᄬᄘᅫᅯᅱᅩᅴ","\u1ae3ᢣᱣૣ᪣ᦣ\u1ae3ᢣᠣᯣឣᣣᱣૣᠣᩣឣᰣᰣᜣ\u0be3ൣ\u0be3ೣ",-159400682>(
                     var7, var1 & 15, var2 & 15, var3 & 15
                  );
            }
         }
      }
   }

   static {
      Loader.init(Class_229.class);
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_472(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 + 303624194 - 853203049 ^ 1625079665) + 810579947 - 650055766 + 853228324 ^ 1542937578) - 1548984926 - 2066587395;
      MethodHandle var10000 = field_475[((var10 + 303624194 - 853203049 ^ 1625079665) + 810579947 - 650055766 + 853228324 ^ 1542937578)
         - 1548984926
         - 2066587395
         + 759688188];
      if (field_475[var10001 + 759688188] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = -1753164663 >>> -1241981907 ^ 310278; var23 < var13.length(); var23 += (-548355898 | -548355898) ^ -548355897) {
            int var42 = (var13.charAt(var23) + '6' ^ 193) + 235 - 149;
            char var45 = (char)(
               (
                     (((((var42 & 65532) >> 2 | var42 << 14) + 71 + 243 & 57344) >> 13 | ((var42 & 65532) >> 2 | var42 << 14) + 71 + 243 << 3) & 65528) >> 3
                        | ((((var42 & 65532) >> 2 | var42 << 14) + 71 + 243 & 57344) >> 13 | ((var42 & 65532) >> 2 | var42 << 14) + 71 + 243 << 3) << 13
                  )
                  - 67
            );
            var13.setCharAt(
               var23,
               (char)(
                  (
                        (((((var42 & 65532) >> 2 | var42 << 14) + 71 + 243 & 57344) >> 13 | ((var42 & 65532) >> 2 | var42 << 14) + 71 + 243 << 3) & 65528) >> 3
                           | ((((var42 & 65532) >> 2 | var42 << 14) + 71 + 243 & 57344) >> 13 | ((var42 & 65532) >> 2 | var42 << 14) + 71 + 243 << 3) << 13
                     )
                     - 67
               )
            );
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = (497340881 - 497340881 | 0) & 2094403435; var29 < var16.length(); var29 += 716413808 >> -1719046642 ^ 43727) {
            int var50 = (var16.charAt(var29) ^ '@') + 203 - 223 - 197;
            int var87 = (var50 & 65534) >> 1;
            int var51 = (var50 & 65534) >> 1 | var50 << 15;
            int var88 = (((var50 & 65534) >> 1 | var50 << 15) & 65520) >> 4;
            var50 = (((var87 | var50 << 15) & 65520) >> 4 | ((var50 & 65534) >> 1 | var50 << 15) << 12) - 198 + 69;
            var87 = ((var88 | var51 << 12) - 198 + 69 & 64512) >> 10;
            int var53 = ((var88 | var51 << 12) - 198 + 69 & 64512) >> 10 | var50 << 6;
            int var90 = ((((var88 | var51 << 12) - 198 + 69 & 64512) >> 10 | var50 << 6) & 65534) >> 1;
            char var54 = (char)(((var87 | var50 << 6) & 65534) >> 1 | (((var88 | var51 << 12) - 198 + 69 & 64512) >> 10 | var50 << 6) << 15);
            var16.setCharAt(var29, (char)(var90 | var53 << 15));
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_229.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = (-1167526979 + -1831472863 | 0) & 809503489; var35 < var19.length(); var35 += 1734111105 & -1621421568 ^ 123208193) {
            char var59 = var19.charAt(var35);
            char var64 = (char)(
               (
                        (
                              (
                                       (
                                             (
                                                      ((((var59 & 0) >> 16 | var59 << 0) + 140 & 61440) >> 12 | ((var59 & 0) >> 16 | var59 << 0) + 140 << 4)
                                                            + 12
                                                            + 189
                                                            + 250
                                                            - 179
                                                         & 61440
                                                   )
                                                   >> 12
                                                | ((((var59 & 0) >> 16 | var59 << 0) + 140 & 61440) >> 12 | ((var59 & 0) >> 16 | var59 << 0) + 140 << 4)
                                                      + 12
                                                      + 189
                                                      + 250
                                                      - 179
                                                   << 4
                                          )
                                          & 32768
                                    )
                                    >> 15
                                 | (
                                       (
                                                ((((var59 & 0) >> 16 | var59 << 0) + 140 & 61440) >> 12 | ((var59 & 0) >> 16 | var59 << 0) + 140 << 4)
                                                      + 12
                                                      + 189
                                                      + 250
                                                      - 179
                                                   & 61440
                                             )
                                             >> 12
                                          | ((((var59 & 0) >> 16 | var59 << 0) + 140 & 61440) >> 12 | ((var59 & 0) >> 16 | var59 << 0) + 140 << 4)
                                                + 12
                                                + 189
                                                + 250
                                                - 179
                                             << 4
                                    )
                                    << 1
                           )
                           & 32768
                     )
                     >> 15
                  | (
                        (
                                 (
                                       (
                                                ((((var59 & 0) >> 16 | var59 << 0) + 140 & 61440) >> 12 | ((var59 & 0) >> 16 | var59 << 0) + 140 << 4)
                                                      + 12
                                                      + 189
                                                      + 250
                                                      - 179
                                                   & 61440
                                             )
                                             >> 12
                                          | ((((var59 & 0) >> 16 | var59 << 0) + 140 & 61440) >> 12 | ((var59 & 0) >> 16 | var59 << 0) + 140 << 4)
                                                + 12
                                                + 189
                                                + 250
                                                - 179
                                             << 4
                                    )
                                    & 32768
                              )
                              >> 15
                           | (
                                 (
                                          ((((var59 & 0) >> 16 | var59 << 0) + 140 & 61440) >> 12 | ((var59 & 0) >> 16 | var59 << 0) + 140 << 4)
                                                + 12
                                                + 189
                                                + 250
                                                - 179
                                             & 61440
                                       )
                                       >> 12
                                    | ((((var59 & 0) >> 16 | var59 << 0) + 140 & 61440) >> 12 | ((var59 & 0) >> 16 | var59 << 0) + 140 << 4)
                                          + 12
                                          + 189
                                          + 250
                                          - 179
                                       << 4
                              )
                              << 1
                     )
                     << 1
            );
            var19.setCharAt(
               var35,
               (char)(
                  (
                           (
                                 (
                                          (
                                                (
                                                         ((((var59 & 0) >> 16 | var59 << 0) + 140 & 61440) >> 12 | ((var59 & 0) >> 16 | var59 << 0) + 140 << 4)
                                                               + 12
                                                               + 189
                                                               + 250
                                                               - 179
                                                            & 61440
                                                      )
                                                      >> 12
                                                   | ((((var59 & 0) >> 16 | var59 << 0) + 140 & 61440) >> 12 | ((var59 & 0) >> 16 | var59 << 0) + 140 << 4)
                                                         + 12
                                                         + 189
                                                         + 250
                                                         - 179
                                                      << 4
                                             )
                                             & 32768
                                       )
                                       >> 15
                                    | (
                                          (
                                                   ((((var59 & 0) >> 16 | var59 << 0) + 140 & 61440) >> 12 | ((var59 & 0) >> 16 | var59 << 0) + 140 << 4)
                                                         + 12
                                                         + 189
                                                         + 250
                                                         - 179
                                                      & 61440
                                                )
                                                >> 12
                                             | ((((var59 & 0) >> 16 | var59 << 0) + 140 & 61440) >> 12 | ((var59 & 0) >> 16 | var59 << 0) + 140 << 4)
                                                   + 12
                                                   + 189
                                                   + 250
                                                   - 179
                                                << 4
                                       )
                                       << 1
                              )
                              & 32768
                        )
                        >> 15
                     | (
                           (
                                    (
                                          (
                                                   ((((var59 & 0) >> 16 | var59 << 0) + 140 & 61440) >> 12 | ((var59 & 0) >> 16 | var59 << 0) + 140 << 4)
                                                         + 12
                                                         + 189
                                                         + 250
                                                         - 179
                                                      & 61440
                                                )
                                                >> 12
                                             | ((((var59 & 0) >> 16 | var59 << 0) + 140 & 61440) >> 12 | ((var59 & 0) >> 16 | var59 << 0) + 140 << 4)
                                                   + 12
                                                   + 189
                                                   + 250
                                                   - 179
                                                << 4
                                       )
                                       & 32768
                                 )
                                 >> 15
                              | (
                                    (
                                             ((((var59 & 0) >> 16 | var59 << 0) + 140 & 61440) >> 12 | ((var59 & 0) >> 16 | var59 << 0) + 140 << 4)
                                                   + 12
                                                   + 189
                                                   + 250
                                                   - 179
                                                & 61440
                                          )
                                          >> 12
                                       | ((((var59 & 0) >> 16 | var59 << 0) + 140 & 61440) >> 12 | ((var59 & 0) >> 16 | var59 << 0) + 140 << 4)
                                             + 12
                                             + 189
                                             + 250
                                             - 179
                                          << 4
                                 )
                                 << 1
                        )
                        << 1
               )
            );
         }

         Class var7 = Class.forName(var19.toString(), false, Class_229.class.getClassLoader());
         switch ((((var4 ^ 1612580712) - 1340302152 + 36731881 + 369210357 + 529862561 ^ 1811010137) + 1450868584 ^ 1737268108) + 280516537 + 549687901) {
            case 1369493604:
            case 1713534517:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 1593683814:
               var10000 = var0.findConstructor(var7, var6);
               break;
            case 1673026787:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            case 2001865932:
               var10000 = var0.findSpecial(var7, var5, var6, Class_229.class);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_475[((var10 + 303624194 - 853203049 ^ 1625079665) + 810579947 - 650055766 + 853228324 ^ 1542937578) - 1548984926 - 2066587395 + 759688188] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_473(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 - 1093805264 ^ 715701898) - 1871868833 + 549304092 - 1427203431 ^ 467134353 ^ 272163302) - 1977977977 ^ 991218828;
      MethodHandle var10000 = field_475[((var10 - 1093805264 ^ 715701898) - 1871868833 + 549304092 - 1427203431 ^ 467134353 ^ 272163302) - 1977977977
         ^ 991218828
         ^ 508753301];
      if (field_475[var10001 ^ 508753301] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = (-1125553174 << -2021357647 | 0) & 673883488; var24 < var14.length(); var24 += 1708344646 + 1708344646 ^ -878278003) {
            char var43 = var14.charAt(var24);
            char var48 = (char)(
               (
                     (
                              (
                                    (
                                             (
                                                   (
                                                         (
                                                                  (
                                                                        (
                                                                              ((((var43 & '쀀') >> 14 | var43 << 2) ^ 143 ^ 72) & 65528) >> 3
                                                                                 | (((var43 & '쀀') >> 14 | var43 << 2) ^ 143 ^ 72) << 13
                                                                           )
                                                                           ^ 63
                                                                     )
                                                                     & 65532
                                                               )
                                                               >> 2
                                                            | (
                                                                  (
                                                                        ((((var43 & '쀀') >> 14 | var43 << 2) ^ 143 ^ 72) & 65528) >> 3
                                                                           | (((var43 & '쀀') >> 14 | var43 << 2) ^ 143 ^ 72) << 13
                                                                     )
                                                                     ^ 63
                                                               )
                                                               << 14
                                                      )
                                                      ^ 136
                                                )
                                                & 65520
                                          )
                                          >> 4
                                       | (
                                             (
                                                   (
                                                            (
                                                                  (
                                                                        ((((var43 & '쀀') >> 14 | var43 << 2) ^ 143 ^ 72) & 65528) >> 3
                                                                           | (((var43 & '쀀') >> 14 | var43 << 2) ^ 143 ^ 72) << 13
                                                                     )
                                                                     ^ 63
                                                               )
                                                               & 65532
                                                         )
                                                         >> 2
                                                      | (
                                                            (
                                                                  ((((var43 & '쀀') >> 14 | var43 << 2) ^ 143 ^ 72) & 65528) >> 3
                                                                     | (((var43 & '쀀') >> 14 | var43 << 2) ^ 143 ^ 72) << 13
                                                               )
                                                               ^ 63
                                                         )
                                                         << 14
                                                )
                                                ^ 136
                                          )
                                          << 12
                                 )
                                 & 57344
                           )
                           >> 13
                        | (
                              (
                                       (
                                             (
                                                   (
                                                            (
                                                                  (
                                                                        ((((var43 & '쀀') >> 14 | var43 << 2) ^ 143 ^ 72) & 65528) >> 3
                                                                           | (((var43 & '쀀') >> 14 | var43 << 2) ^ 143 ^ 72) << 13
                                                                     )
                                                                     ^ 63
                                                               )
                                                               & 65532
                                                         )
                                                         >> 2
                                                      | (
                                                            (
                                                                  ((((var43 & '쀀') >> 14 | var43 << 2) ^ 143 ^ 72) & 65528) >> 3
                                                                     | (((var43 & '쀀') >> 14 | var43 << 2) ^ 143 ^ 72) << 13
                                                               )
                                                               ^ 63
                                                         )
                                                         << 14
                                                )
                                                ^ 136
                                          )
                                          & 65520
                                    )
                                    >> 4
                                 | (
                                       (
                                             (
                                                      (
                                                            (
                                                                  ((((var43 & '쀀') >> 14 | var43 << 2) ^ 143 ^ 72) & 65528) >> 3
                                                                     | (((var43 & '쀀') >> 14 | var43 << 2) ^ 143 ^ 72) << 13
                                                               )
                                                               ^ 63
                                                         )
                                                         & 65532
                                                   )
                                                   >> 2
                                                | (
                                                      (
                                                            ((((var43 & '쀀') >> 14 | var43 << 2) ^ 143 ^ 72) & 65528) >> 3
                                                               | (((var43 & '쀀') >> 14 | var43 << 2) ^ 143 ^ 72) << 13
                                                         )
                                                         ^ 63
                                                   )
                                                   << 14
                                          )
                                          ^ 136
                                    )
                                    << 12
                           )
                           << 3
                  )
                  - 82
            );
            var14.setCharAt(
               var24,
               (char)(
                  (
                        (
                                 (
                                       (
                                                (
                                                      (
                                                            (
                                                                     (
                                                                           (
                                                                                 ((((var43 & '쀀') >> 14 | var43 << 2) ^ 143 ^ 72) & 65528) >> 3
                                                                                    | (((var43 & '쀀') >> 14 | var43 << 2) ^ 143 ^ 72) << 13
                                                                              )
                                                                              ^ 63
                                                                        )
                                                                        & 65532
                                                                  )
                                                                  >> 2
                                                               | (
                                                                     (
                                                                           ((((var43 & '쀀') >> 14 | var43 << 2) ^ 143 ^ 72) & 65528) >> 3
                                                                              | (((var43 & '쀀') >> 14 | var43 << 2) ^ 143 ^ 72) << 13
                                                                        )
                                                                        ^ 63
                                                                  )
                                                                  << 14
                                                         )
                                                         ^ 136
                                                   )
                                                   & 65520
                                             )
                                             >> 4
                                          | (
                                                (
                                                      (
                                                               (
                                                                     (
                                                                           ((((var43 & '쀀') >> 14 | var43 << 2) ^ 143 ^ 72) & 65528) >> 3
                                                                              | (((var43 & '쀀') >> 14 | var43 << 2) ^ 143 ^ 72) << 13
                                                                        )
                                                                        ^ 63
                                                                  )
                                                                  & 65532
                                                            )
                                                            >> 2
                                                         | (
                                                               (
                                                                     ((((var43 & '쀀') >> 14 | var43 << 2) ^ 143 ^ 72) & 65528) >> 3
                                                                        | (((var43 & '쀀') >> 14 | var43 << 2) ^ 143 ^ 72) << 13
                                                                  )
                                                                  ^ 63
                                                            )
                                                            << 14
                                                   )
                                                   ^ 136
                                             )
                                             << 12
                                    )
                                    & 57344
                              )
                              >> 13
                           | (
                                 (
                                          (
                                                (
                                                      (
                                                               (
                                                                     (
                                                                           ((((var43 & '쀀') >> 14 | var43 << 2) ^ 143 ^ 72) & 65528) >> 3
                                                                              | (((var43 & '쀀') >> 14 | var43 << 2) ^ 143 ^ 72) << 13
                                                                        )
                                                                        ^ 63
                                                                  )
                                                                  & 65532
                                                            )
                                                            >> 2
                                                         | (
                                                               (
                                                                     ((((var43 & '쀀') >> 14 | var43 << 2) ^ 143 ^ 72) & 65528) >> 3
                                                                        | (((var43 & '쀀') >> 14 | var43 << 2) ^ 143 ^ 72) << 13
                                                                  )
                                                                  ^ 63
                                                            )
                                                            << 14
                                                   )
                                                   ^ 136
                                             )
                                             & 65520
                                       )
                                       >> 4
                                    | (
                                          (
                                                (
                                                         (
                                                               (
                                                                     ((((var43 & '쀀') >> 14 | var43 << 2) ^ 143 ^ 72) & 65528) >> 3
                                                                        | (((var43 & '쀀') >> 14 | var43 << 2) ^ 143 ^ 72) << 13
                                                                  )
                                                                  ^ 63
                                                            )
                                                            & 65532
                                                      )
                                                      >> 2
                                                   | (
                                                         (
                                                               ((((var43 & '쀀') >> 14 | var43 << 2) ^ 143 ^ 72) & 65528) >> 3
                                                                  | (((var43 & '쀀') >> 14 | var43 << 2) ^ 143 ^ 72) << 13
                                                            )
                                                            ^ 63
                                                      )
                                                      << 14
                                             )
                                             ^ 136
                                       )
                                       << 12
                              )
                              << 3
                     )
                     - 82
               )
            );
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = (199765732 ^ 199765732 | 0) & -798330397; var30 < var17.length(); var30 += (-1291955004 | 143207189 | 0) & 1073741865) {
            int var53 = (var17.charAt(var30) ^ 'j') + 62;
            int var92 = (var53 & 32768) >> 15;
            int var54 = (var53 & 32768) >> 15 | var53 << 1;
            int var93 = (((var53 & 32768) >> 15 | var53 << 1) & 65504) >> 5;
            var53 = (((var92 | var53 << 1) & 65504) >> 5 | ((var53 & 32768) >> 15 | var53 << 1) << 11) + 36;
            var92 = ((var93 | var54 << 11) + 36 & 65472) >> 6;
            int var56 = (((var93 | var54 << 11) + 36 & 65472) >> 6 | var53 << 10) - 42;
            int var95 = ((((var93 | var54 << 11) + 36 & 65472) >> 6 | var53 << 10) - 42 & 65532) >> 2;
            char var57 = (char)((((var92 | var53 << 10) - 42 & 65532) >> 2 | (((var93 | var54 << 11) + 36 & 65472) >> 6 | var53 << 10) - 42 << 14) + 189 ^ 139);
            var17.setCharAt(var30, (char)((var95 | var56 << 14) + 189 ^ 139));
         }

         Class var6 = Class.forName(var17.toString(), false, Class_229.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = (23942206 | 23942206 | 0) & 412256576; var36 < var20.length(); var36 += (186306501 | 186306501 & 186306501 | 0) & -1272893437) {
            int var62 = var20.charAt(var36);
            int var96 = (var62 & 65408) >> 7;
            int var63 = (var62 & 65408) >> 7 | var62 << 9;
            int var97 = (((var62 & 65408) >> 7 | var62 << 9) & 65528) >> 3;
            var62 = ((var96 | var62 << 9) & 65528) >> 3 | ((var62 & 65408) >> 7 | var62 << 9) << 13;
            var96 = ((var97 | var63 << 13) & 65472) >> 6;
            int var65 = (((((var97 | var63 << 13) & 65472) >> 6 | var62 << 10) ^ 128) + 190 + 195 ^ 176) - 137;
            int var99 = ((((((var97 | var63 << 13) & 65472) >> 6 | var62 << 10) ^ 128) + 190 + 195 ^ 176) - 137 & 65520) >> 4;
            char var66 = (char)(
               (
                     ((((var96 | var62 << 10) ^ 128) + 190 + 195 ^ 176) - 137 & 65520) >> 4
                        | (((((var97 | var63 << 13) & 65472) >> 6 | var62 << 10) ^ 128) + 190 + 195 ^ 176) - 137 << 12
                  )
                  + 81
            );
            var20.setCharAt(var36, (char)((var99 | var65 << 12) + 81));
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_229.class.getClassLoader()).returnType();
         switch (((var4 ^ 665224907) + 904353163 ^ 1423021621) + 842557461 - 369562325 - 1127201106 - 2016399155 - 1763233621 + 952418628 - 943418199) {
            case 1084874951:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            case 1548266672:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            case 2028304615:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            case 2092331185:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_475[((var10 - 1093805264 ^ 715701898) - 1871868833 + 549304092 - 1427203431 ^ 467134353 ^ 272163302) - 1977977977 ^ 991218828 ^ 508753301] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }

   public static native void guard();
}
