import com.google.gson.JsonArray;
import com.google.gson.JsonElement;
import com.google.gson.JsonObject;
import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;
import java.util.ArrayList;
import java.util.Iterator;
import java.util.List;

public class Class_378 extends Class_271 {
   // $VF: renamed from: vn java.util.List
   public List field_902 = (ArrayList)0<"JNT",573101199,"\uf6fa⏅⣅⏅⻅\uf8fa","㋼닼㋃","쌀시쌰시숐쌬쌨싼쌈숐쉜쌠쌠시쌼슈싼쌤쌨",191502556>();
   // $VF: renamed from: brs java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_903 = new MethodHandle[88];

   public Class_378(String var1) {
      super(var1);
   }

   // $VF: renamed from: du () java.util.List
   public List method_990() {
      return (ArrayList)0<"JNT",573101199,"\uf6fa⏅⣅⏅⻅\uf8fa","㋼㋎㋝님㋓님닿닒㋒닜㋞닿닉닟㋞㋞닚닙㋒닜닟㋟답닼㋃","쌀시쌰시숐쌬쌨싼쌈숐쉜쌠쌠시쌼슈싼쌤쌨",191502502>(
         1<"JNT",-1336979454,"쇐솯","㟃㏃","Μάߜݼܬ࠼ܬ\u05cc\u086c\u085cެড়\u05ccߜެࠌ\u085cҌ",-478815406>(this)
      );
   }

   // $VF: renamed from: pzy (java.util.List) void
   public void method_991(List var1) {
      0<"JNT",-500397143,"᷅⛅\u1fc5ᯅⳅ","㋼닼㋃","쌀시쌰시숐쌬쌨싼쌈숐슈싼쌤쌨",191502504>(
         1<"JNT",-1336979454,"쇐솯","㟃㏃","Μάߜݼܬ࠼ܬ\u05cc\u086c\u085cެড়\u05ccߜެࠌ\u085cҌ",-478815408>(this)
      );
      0<"JNT",-500397143,"ᯅễễﯺ⛅⛅","㋼㋎㋝님㋓님닿닒㋒닜㋞닿닉닟㋞㋞닚닙㋒닜닟㋟답닼㋅","쌀시쌰시숐쌬쌨싼쌈숐슈싼쌤쌨",191502498>(
         1<"JNT",-1336979454,"쇐솯","㟃㏃","Μάߜݼܬ࠼ܬ\u05cc\u086c\u085cެড়\u05ccߜެࠌ\u085cҌ",-478815402>(this), var1
      );
      0<"JNT",569988714,"ễᯅ⯅","㋼닼㋃","쌴쌔",191502559>(this);
   }

   public List ifyy() {
      return 1<"JNT",-1336979454,"쇐솯","㟃㏃","Μάߜݼܬ࠼ܬ\u05cc\u086c\u085cެড়\u05ccߜެࠌ\u085cҌ",-478815413>(this);
   }

   // $VF: renamed from: ph (java.lang.String, int) void
   public void method_992(String var1, int var2) {
      0<"JNT",-500397143,"ᯅễễ","㋼㋎㋝님㋓님닿㋞님㋟닛닿닏㋙㋝닚닙㋒답닼㋅","쌀시쌰시숐쌬쌨싼쌈숐슈싼쌤쌨",191502507>(
         1<"JNT",-1336979454,"쇐솯","㟃㏃","Μάߜݼܬ࠼ܬ\u05cc\u086c\u085cެড়\u05ccߜެࠌ\u085cҌ",-478815414>(this),
         (Class_352)0<"JNT",573101199,"\uf6fa⏅⣅⏅⻅\uf8fa","㋼㋎㋝님㋓님닿㋞님㋟닛닿닁㋒㋑닜㋟닛답닌닼㋃","쌰심",191502510>(var1, var2)
      );
      0<"JNT",569988714,"ễᯅ⯅","㋼닼㋃","쌴쌔",191502512>(this);
   }

   // $VF: renamed from: co (int) void
   public void method_993(int var1) {
      if (var1 >= 0
         && var1
            < 0<"JNT",-500397143,"ⷅ⏅㓅\u1fc5","㋼닼닌","쌀시쌰시숐쌬쌨싼쌈숐슈싼쌤쌨",191502506>(
               1<"JNT",-1336979454,"쇐솯","㟃㏃","Μάߜݼܬ࠼ܬ\u05cc\u086c\u085cެড়\u05ccߜެࠌ\u085cҌ",-478815410>(this)
            )) {
         0<"JNT",-500397143,"ⳅ\u1fc5⟅⧅ヅ\u1fc5","㋼닌닼㋎㋝님㋓님닿㋞님㋟닛닿닏㋙㋝닚닙㋒답","쌀시쌰시숐쌬쌨싼쌈숐슈싼쌤쌨",191502508>(
            1<"JNT",-1336979454,"쇐솯","㟃㏃","Μάߜݼܬ࠼ܬ\u05cc\u086c\u085cެড়\u05ccߜެࠌ\u085cҌ",-478815412>(this), var1
         );
         0<"JNT",569988714,"ễᯅ⯅","㋼닼㋃","쌴쌔",191502505>(this);
      }
   }

   // $VF: renamed from: fm () int
   public int method_994() {
      return 0<"JNT",-500397143,"ⷅ⏅㓅\u1fc5","㋼닼닌","쌀시쌰시숐쌬쌨싼쌈숐슈싼쌤쌨",191502515>(
         1<"JNT",-1336979454,"쇐솯","㟃㏃","Μάߜݼܬ࠼ܬ\u05cc\u086c\u085cެড়\u05ccߜެࠌ\u085cҌ",-478815423>(this)
      );
   }

   // $VF: renamed from: bo () void
   public void method_995() {
      0<"JNT",-500397143,"᷅⛅\u1fc5ᯅⳅ","㋼닼㋃","쌀시쌰시숐쌬쌨싼쌈숐슈싼쌤쌨",191502517>(
         1<"JNT",-1336979454,"쇐솯","㟃㏃","Μάߜݼܬ࠼ܬ\u05cc\u086c\u085cެড়\u05ccߜެࠌ\u085cҌ",-478815417>(this)
      );
      0<"JNT",569988714,"ễᯅ⯅","㋼닼㋃","쌴쌔",191502514>(this);
   }

   // $VF: renamed from: tfw (int) Class_352
   public Class_352 method_996(int var1) {
      return var1 >= 0
            && var1
               < 0<"JNT",-500397143,"ⷅ⏅㓅\u1fc5","㋼닼닌","쌀시쌰시숐쌬쌨싼쌈숐슈싼쌤쌨",191502516>(
                  1<"JNT",-1336979454,"쇐솯","㟃㏃","Μάߜݼܬ࠼ܬ\u05cc\u086c\u085cެড়\u05ccߜެࠌ\u085cҌ",-478815420>(this)
               )
         ? (Class_352)0<"JNT",-500397143,"⇅\u1fc5⻅","㋼닌닼㋎㋝님㋓님닿㋞님㋟닛닿닏㋙㋝닚닙㋒답","쌀시쌰시숐쌬쌨싼쌈숐슈싼쌤쌨",191503038>(
            1<"JNT",-1336979454,"쇐솯","㟃㏃","Μάߜݼܬ࠼ܬ\u05cc\u086c\u085cެড়\u05ccߜެࠌ\u085cҌ",-478815430>(this), var1
         )
         : null;
   }

   // $VF: renamed from: s () boolean
   @Override
   public boolean method_923() {
      return 0<"JNT",-500397143,"⏅ⷅ\ufffa⟅⫅⻅㏅","㋼닼㋅","쌀시쌰시숐쌬쌨싼쌈숐슈싼쌤쌨",191503040>(
         1<"JNT",-1336979454,"쇐솯","㟃㏃","Μάߜݼܬ࠼ܬ\u05cc\u086c\u085cެড়\u05ccߜެࠌ\u085cҌ",-478815432>(this)
      );
   }

   // $VF: renamed from: r () com.google.gson.JsonElement
   @Override
   public JsonElement method_924() {
      int var5 = -1153458684;
      JsonArray var1 = (JsonArray)0<"JNT",573101199,"\uf6fa⏅⣅⏅⻅\uf8fa","㋼닼㋃","실쌔쌌숐싴쌔쌔싴쌈심숐싴쌤쌔쌐숐슀쌤쌔쌐쉜쌠쌠시쌼",191503031>();
      Iterator var2 = 0<"JNT",-500397143,"⏅⻅\u1fc5ⳅᯅ⻅⧅ⳅ","㋼닼㋎㋝님㋓님닿닒㋒닜㋞닿닌㋒닚㋑님㋒닟㋑답","쌀시쌰시숐쌬쌨싼쌈숐슈싼쌤쌨",191503033>(
         1<"JNT",-1336979454,"쇐솯","㟃㏃","Μάߜݼܬ࠼ܬ\u05cc\u086c\u085cެড়\u05ccߜެࠌ\u085cҌ",-478815373>(this)
      );

      label52:
      while (true) {
         var5 = -1362383263 >> -1362383263 ^ 1231891660;

         while (true) {
            switch (((var5 + 1776526479 ^ 1015232783) + 1512123323 ^ 1130209628) - 644577900 + 1047178140) {
               case -1869879816:
                  return var1;
               case -288582253:
            }

            if (0<"JNT",-500397143,"⋅ᯅⷅࣅ\u1fc5㋅⻅","㋼닼㋅","쌀시쌰시숐쌬쌨싼쌈숐쉼쌨심쌠시쌨쌔쌠",191503117>(var2)) {
               Class_352 var3 = (Class_352)0<"JNT",-500397143,"⣅\u1fc5㋅⻅","㋼닼㋎㋝님㋓님닿㋞님㋟닛닿닏㋙㋝닚닙㋒답","쌀시쌰시숐쌬쌨싼쌈숐쉼쌨심쌠시쌨쌔쌠",191503114>(var2);
               JsonObject var4 = (JsonObject)0<"JNT",573101199,"\uf6fa⏅⣅⏅⻅\uf8fa","㋼닼㋃","실쌔쌌숐싴쌔쌔싴쌈심숐싴쌤쌔쌐숐슀쌤쌔쌐슔신쌀심실쌨",191503111>();
               JsonObject var10000 = var4;
               int var10001 = -1966031028 << 1328730009 ^ -1744830464;
               StringBuilder var10002 = (StringBuilder)0<"JNT",573101199,"\uf6fa⏅⣅⏅⻅\uf8fa","㋼㋎㋝님㋓님닿㋞님㋟닛닿닁㋒㋑닜㋟닛답닼㋃","쌀시쌰시숐쌈시쌐싴숐스쌨쌠싼쌐싴쉠쌬싼쌈싨심쌠",191503116>("ģŧēģ");

               label49:
               while (true) {
                  var5 = 1603761432 & 1603761432 ^ 296041686;

                  while (true) {
                     label44: {
                        StringBuilder var9;
                        switch ((var5 + 1074095138 + 1705342107 ^ 2037631124) + 1456079205 + 66757671 + 1045421159) {
                           case -558833418:
                           default:
                              var9 = var10002;
                              if (var10001 < ((-1663845816 >> -1576937941 + -1663845816 | 3) & 3111)) {
                                 char var18 = 0<"JNT",569988714,"᷅⋅ᯅⳅﯺ⻅","㋼닌닼닉","쌀시쌰시숐쌈시쌐싴숐스쌨쌠싼쌐싴쉠쌬싼쌈싨심쌠",191503115>(var10002, var10001);
                                 char var21 = (char)(
                                    (
                                             (
                                                      (((var18 & '\ufff8') >> 3 | var18 << '\r') - 229 & 65504) >> 5
                                                         | ((var18 & '\ufff8') >> 3 | var18 << '\r') - 229 << 11
                                                   )
                                                   - 244
                                                & 64512
                                          )
                                          >> 10
                                       | (
                                                (((var18 & '\ufff8') >> 3 | var18 << '\r') - 229 & 65504) >> 5
                                                   | ((var18 & '\ufff8') >> 3 | var18 << '\r') - 229 << 11
                                             )
                                             - 244
                                          << 6
                                 );
                                 0<"JNT",569988714,"ⷅ\u1fc5⻅ﷺ⋅ᯅⳅﯺ⻅","㋼닌닉닼㋃","쌀시쌰시숐쌈시쌐싴숐스쌨쌠싼쌐싴쉠쌬싼쌈싨심쌠",191503120>(
                                    var10002,
                                    var10001,
                                    (char)(
                                       (
                                                (
                                                         (((var18 & '\ufff8') >> 3 | var18 << '\r') - 229 & 65504) >> 5
                                                            | ((var18 & '\ufff8') >> 3 | var18 << '\r') - 229 << 11
                                                      )
                                                      - 244
                                                   & 64512
                                             )
                                             >> 10
                                          | (
                                                   (((var18 & '\ufff8') >> 3 | var18 << '\r') - 229 & 65504) >> 5
                                                      | ((var18 & '\ufff8') >> 3 | var18 << '\r') - 229 << 11
                                                )
                                                - 244
                                             << 6
                                    )
                                 );
                                 var10001 += -621836691 >> 1416657840 * -621836691 ^ -9490;
                                 break label44;
                              }

                              var5 = 1968612646;
                              break;
                           case 600009746:
                              var9 = var10002;
                              if (var10001 < ((-1456131397 + (-787647075 | -787647075) | 4) & -2053023868)) {
                                 int var12 = 0<"JNT",569988714,"᷅⋅ᯅⳅﯺ⻅","㋼닌닼닉","쌀시쌰시숐쌈시쌐싴숐스쌨쌠싼쌐싴쉠쌬싼쌈싨심쌠",191503037>(var10002, var10001) ^ 's' ^ 128;
                                 char var15 = (char)(
                                    (((((var12 & 49152) >> 14 | var12 << 2) & 65408) >> 7 | ((var12 & 49152) >> 14 | var12 << 2) << 9) & 57344) >> 13
                                       | ((((var12 & 49152) >> 14 | var12 << 2) & 65408) >> 7 | ((var12 & 49152) >> 14 | var12 << 2) << 9) << 3
                                 );
                                 0<"JNT",569988714,"ⷅ\u1fc5⻅ﷺ⋅ᯅⳅﯺ⻅","㋼닌닉닼㋃","쌀시쌰시숐쌈시쌐싴숐스쌨쌠싼쌐싴쉠쌬싼쌈싨심쌠",191503034>(
                                    var10002,
                                    var10001,
                                    (char)(
                                       (((((var12 & 49152) >> 14 | var12 << 2) & 65408) >> 7 | ((var12 & 49152) >> 14 | var12 << 2) << 9) & 57344) >> 13
                                          | ((((var12 & 49152) >> 14 | var12 << 2) & 65408) >> 7 | ((var12 & 49152) >> 14 | var12 << 2) << 9) << 3
                                    )
                                 );
                                 var10001 += (-1658728853 - -1658728853 | 1) & -2027934031;
                                 continue label49;
                              }

                              var5 = (-1452293446 & -1452293446 | 1144292935) & 1320988623;
                        }

                        switch (var5 + 1691639356 + 2047160874 - 738999724 - 1860086554 - 443321424 - 1921135076) {
                           case 54292539:
                              0<"JNT",569988714,"ᯅễễૅⳅ⧅⫅\u1fc5ⳅ⻅㏅","㋼㋎㋝님㋓님닿㋞님㋟닛닿닁㋒㋑닜㋟닛답㋎㋝님㋓님닿㋞님㋟닛닿닁㋒㋑닜㋟닛답닼㋃","실쌔쌌숐싴쌔쌔싴쌈심숐싴쌤쌔쌐숐슀쌤쌔쌐슔신쌀심실쌨",191503112>(
                                 var10000,
                                 0<"JNT",569988714,"⻅⧅ළ⻅ⳅ⏅⣅⇅","㋼닼㋎㋝님㋓님닿㋞님㋟닛닿닁㋒㋑닜㋟닛답","쌀시쌰시숐쌈시쌐싴숐스쌨쌠싼쌐싴쉠쌬싼쌈싨심쌠",191503110>(var9),
                                 1<"JNT",-1336979454,"憯ꆮ","㙃⻃","Μάߜݼܬ࠼ܬ\u05ccড়ܬ়\u074c\u05cc،\u085cৼެ়\u074cҌ",-478815376>(var3)
                              );
                              var10000 = var4;
                              var10001 = (-455668596 & -455668596 | 0) & 421532195;
                              var10002 = (StringBuilder)0<"JNT",573101199,"\uf6fa⏅⣅⏅⻅\uf8fa","㋼㋎㋝님㋓님닿㋞님㋟닛닿닁㋒㋑닜㋟닛답닼㋃","쌀시쌰시숐쌈시쌐싴숐스쌨쌠싼쌐싴쉠쌬싼쌈싨심쌠",191503109>("ﳔﲼﴌ");
                              break;
                           case 743870098:
                           default:
                              0<"JNT",569988714,"ᯅễễૅⳅ⧅⫅\u1fc5ⳅ⻅㏅","㋼㋎㋝님㋓님닿㋞님㋟닛닿닁㋒㋑닜㋟닛답㋎㋝님㋓님닿㋞님㋟닛닿㋏닒닞㋙닚㋑답닼㋃","실쌔쌌숐싴쌔쌔싴쌈심숐싴쌤쌔쌐숐슀쌤쌔쌐슔신쌀심실쌨",191503105>(
                                 var10000,
                                 0<"JNT",569988714,"⻅⧅ළ⻅ⳅ⏅⣅⇅","㋼닼㋎㋝님㋓님닿㋞님㋟닛닿닁㋒㋑닜㋟닛답","쌀시쌰시숐쌈시쌐싴숐스쌨쌠싼쌐싴쉠쌬싼쌈싨심쌠",191503106>(var9),
                                 0<"JNT",-1015333403,"ヅᯅ⛅⿅\u1fc5\u09c5\u20c5","㋼닌닼㋎㋝님㋓님닿㋞님㋟닛닿닌㋟㋒닚닛닚㋑답","쌀시쌰시숐쌈시쌐싴숐쉼쌐쌨심싴심쌠",191503108>(
                                    1<"JNT",-1336979454,"ꇐǐ쇐","㙃⻃","Μά֬",-478815372>(var3)
                                 )
                              );
                              0<"JNT",569988714,"ᯅễễ","㋼㋎닙닟닞닿닛닟닟닛㋞닚닿닛닑닟㋟닿㋍닑닟㋟닊㋞닚닞닚㋟㋒답닼㋃","실쌔쌌숐싴쌔쌔싴쌈심숐싴쌤쌔쌐숐슀쌤쌔쌐쉜쌠쌠시쌼",191503118>(var1, var4);
                              continue label52;
                        }
                     }

                     var5 = (-844280608 * -844280608 | 306461402) & -680738849;
                  }
               }
            }

            var5 = 1934175303;
         }
      }
   }

   // $VF: renamed from: vz (com.google.gson.JsonElement) void
   @Override
   public void method_925(JsonElement var1) {
      int var8 = 443357835;
      if (0<"JNT",569988714,"⏅ⷅӅⷅ⧅⣅ﯺⳅⳅᯅ㏅","㋼닼㋅","실쌔쌌숐싴쌔쌔싴쌈심숐싴쌤쌔쌐숐슀쌤쌔쌐쉬쌈심쌌심쌐쌨",191503079>(var1)) {
         JsonArray var2 = 0<"JNT",569988714,"⇅\u1fc5⻅ﯺⷅӅⷅ⧅⣅ﯺⳅⳅᯅ㏅","㋼닼㋎닙닟닞닿닛닟닟닛㋞닚닿닛닑닟㋟닿㋍닑닟㋟니㋑㋑님닔답","실쌔쌌숐싴쌔쌔싴쌈심숐싴쌤쌔쌐숐슀쌤쌔쌐쉬쌈심쌌심쌐쌨",191503084>(var1);
         0<"JNT",569988714,"᳅⧅","㋼닼㋃","쌴쌔",191503081>(this);
         Iterator var3 = 0<"JNT",569988714,"⏅⻅\u1fc5ⳅᯅ⻅⧅ⳅ","㋼닼㋎㋝님㋓님닿닒㋒닜㋞닿닌㋒닚㋑님㋒닟㋑답","실쌔쌌숐싴쌔쌔싴쌈심숐싴쌤쌔쌐숐슀쌤쌔쌐쉜쌠쌠시쌼",191503094>(var2);

         label104:
         while (true) {
            var8 = (-550101590 << -106704916 | -2144334499) & -1951060131;

            while (true) {
               switch ((var8 ^ 1326056257) - 1167711270 - 217962699 + 2019183996 + 1827112589 - 2082114594) {
                  case -448151278:
                     if (0<"JNT",-500397143,"⋅ᯅⷅࣅ\u1fc5㋅⻅","㋼닼㋅","쌀시쌰시숐쌬쌨싼쌈숐쉼쌨심쌠시쌨쌔쌠",191503122>(var3)) {
                        JsonElement var4 = (JsonElement)0<"JNT",-500397143,"⣅\u1fc5㋅⻅","㋼닼㋎㋝님㋓님닿㋞님㋟닛닿닏㋙㋝닚닙㋒답","쌀시쌰시숐쌬쌨싼쌈숐쉼쌨심쌠시쌨쌔쌠",191503119>(var3);
                        if (0<"JNT",569988714,"⏅ⷅӅⷅ⧅⣅\u09c5᳅Ⓟ\u1fc5᷅⻅","㋼닼㋅","실쌔쌌숐싴쌔쌔싴쌈심숐싴쌤쌔쌐숐슀쌤쌔쌐쉬쌈심쌌심쌐쌨",191503124>(var4)) {
                           JsonObject var5 = 0<"JNT",569988714,"⇅\u1fc5⻅ﯺⷅӅⷅ⧅⣅\u09c5᳅Ⓟ\u1fc5᷅⻅","㋼닼㋎닙닟닞닿닛닟닟닛㋞닚닿닛닑닟㋟닿㋍닑닟㋟닏㋙㋝닚닙㋒답","실쌔쌌숐싴쌔쌔싴쌈심숐싴쌤쌔쌐숐슀쌤쌔쌐쉬쌈심쌌심쌐쌨",191503121>(
                              var4
                           );
                           JsonObject var10000 = var5;
                           int var10001 = (975354606 >>> 1415855364 | 0) & 672158737;
                           StringBuilder var10002 = (StringBuilder)0<"JNT",573101199,"\uf6fa⏅⣅⏅⻅\uf8fa","㋼㋎㋝님㋓님닿㋞님㋟닛닿닁㋒㋑닜㋟닛답닼㋃","쌀시쌰시숐쌈시쌐싴숐스쌨쌠싼쌐싴쉠쌬싼쌈싨심쌠",191503134>(
                              "翺ￂ翼翺"
                           );

                           label80:
                           while (true) {
                              var8 = -1120303279 - -1282328788 ^ 1331738634;

                              while (true) {
                                 label114: {
                                    StringBuilder var17;
                                    switch ((var8 + 683267445 ^ 1202968456) + 426282932 + 269845791 - 1093079599 - 787147678) {
                                       case -509771470:
                                          var17 = var10002;
                                          if (var10001 < (18168463 + 222745243 ^ 240913710)) {
                                             int var43 = 0<"JNT",569988714,"᷅⋅ᯅⳅﯺ⻅","㋼닌닼닉","쌀시쌰시숐쌈시쌐싴숐스쌨쌠싼쌐싴쉠쌬싼쌈싨심쌠",191503088>(var10002, var10001) ^ '&';
                                             char var44 = (char)(((var43 & 32768) >> 15 | var43 << 1) + 254 + 50 ^ 156);
                                             0<"JNT",569988714,"ⷅ\u1fc5⻅ﷺ⋅ᯅⳅﯺ⻅","㋼닌닉닼㋃","쌀시쌰시숐쌈시쌐싴숐스쌨쌠싼쌐싴쉠쌬싼쌈싨심쌠",191503085>(
                                                var10002, var10001, (char)(((var43 & 32768) >> 15 | var43 << 1) + 254 + 50 ^ 156)
                                             );
                                             var10001 += (-606408401 >>> -725408432 | 1) & 998966277;
                                             continue label80;
                                          }

                                          var8 = (1805232746 >> -399831611 | -1701820633) & -84482241;
                                          break;
                                       case 1100824822:
                                       default:
                                          var17 = var10002;
                                          if (var10001 < (-1171176567 + -1171176567 ^ 1952614166)) {
                                             int var25 = 0<"JNT",569988714,"᷅⋅ᯅⳅﯺ⻅","㋼닌닼닉","쌀시쌰시숐쌈시쌐싴숐스쌨쌠싼쌐싴쉠쌬싼쌈싨심쌠",191503080>(var10002, var10001) - 134;
                                             int var10005 = (var25 & 65520) >> 4;
                                             int var26 = (var25 & 65520) >> 4 | var25 << 12;
                                             int var55 = (((var25 & 65520) >> 4 | var25 << 12) & 65472) >> 6;
                                             char var27 = (char)(
                                                (((var10005 | var25 << 12) & 65472) >> 6 | ((var25 & 65520) >> 4 | var25 << 12) << 10) ^ 29 ^ 102
                                             );
                                             0<"JNT",569988714,"ⷅ\u1fc5⻅ﷺ⋅ᯅⳅﯺ⻅","㋼닌닉닼㋃","쌀시쌰시숐쌈시쌐싴숐스쌨쌠싼쌐싴쉠쌬싼쌈싨심쌠",191503077>(
                                                var10002, var10001, (char)((var55 | var26 << 10) ^ 29 ^ 102)
                                             );
                                             var10001 += 1742678818 * -532779111 ^ 173049171;
                                             break label114;
                                          }

                                          var8 = (976617567 >>> 1459673121 | 649121962) & 1727658682;
                                    }

                                    switch ((var8 - 621977281 - 1450689039 ^ 2083714637) + 16361964 - 2054248927 + 2095287840) {
                                       case -628525116:
                                       default:
                                          var14 = 0<"JNT",569988714,"⇅\u1fc5⻅ﯺⷅළ⻅ⳅ⏅⣅⇅","㋼닼㋎㋝님㋓님닿㋞님㋟닛닿닁㋒㋑닜㋟닛답","실쌔쌌숐싴쌔쌔싴쌈심숐싴쌤쌔쌐숐슀쌤쌔쌐쉬쌈심쌌심쌐쌨",191503076>(
                                             0<"JNT",569988714,"⇅\u1fc5⻅","㋼㋎㋝님㋓님닿㋞님㋟닛닿닁㋒㋑닜㋟닛답닼㋎닙닟닞닿닛닟닟닛㋞닚닿닛닑닟㋟닿㋍닑닟㋟닊㋞닚닞닚㋟㋒답","실쌔쌌숐싴쌔쌔싴쌈심숐싴쌤쌔쌐숐슀쌤쌔쌐슔신쌀심실쌨",191503135>(
                                                var10000, 0<"JNT",569988714,"⻅⧅ළ⻅ⳅ⏅⣅⇅","㋼닼㋎㋝님㋓님닿㋞님㋟닛닿닁㋒㋑닜㋟닛답","쌀시쌰시숐쌈시쌐싴숐스쌨쌠싼쌐싴쉠쌬싼쌈싨심쌠",191503074>(var17)
                                             )
                                          );
                                          break label80;
                                       case 1726246487:
                                    }

                                    if (!0<"JNT",569988714,"⋅ᯅⷅ","㋼㋎㋝님㋓님닿㋞님㋟닛닿닁㋒㋑닜㋟닛답닼㋅","실쌔쌌숐싴쌔쌔싴쌈심숐싴쌤쌔쌐숐슀쌤쌔쌐슔신쌀심실쌨",191503086>(
                                       var10000, 0<"JNT",569988714,"⻅⧅ළ⻅ⳅ⏅⣅⇅","㋼닼㋎㋝님㋓님닿㋞님㋟닛닿닁㋒㋑닜㋟닛답","쌀시쌰시숐쌈시쌐싴숐스쌨쌠싼쌐싴쉠쌬싼쌈싨심쌠",191503073>(var17)
                                    )) {
                                       var14 = "";
                                       break label80;
                                    }

                                    var10000 = var5;
                                    var10001 = (1187477066 & -2053249687 | 0) & 1129878418;
                                    var10002 = (StringBuilder)0<"JNT",573101199,"\uf6fa⏅⣅⏅⻅\uf8fa","㋼㋎㋝님㋓님닿㋞님㋟닛닿닁㋒㋑닜㋟닛답닼㋃","쌀시쌰시숐쌈시쌐싴숐스쌨쌠싼쌐싴쉠쌬싼쌈싨심쌠",191503083>(
                                       "㲆碆ಆ㲆"
                                    );
                                 }

                                 var8 = -1100951396 & 987330234 ^ -1668712037;
                              }
                           }

                           String var6 = var14;
                           var10000 = var5;
                           var10001 = (-224748310 << 83048753 | 0) & -2147287627;
                           var10002 = (StringBuilder)0<"JNT",573101199,"\uf6fa⏅⣅⏅⻅\uf8fa","㋼㋎㋝님㋓님닿㋞님㋟닛닿닁㋒㋑닜㋟닛답닼㋃","쌀시쌰시숐쌈시쌐싴숐스쌨쌠싼쌐싴쉠쌬싼쌈싨심쌠",191503075>("椀枀沀");

                           label101:
                           while (true) {
                              var8 = -2120608682 << 460318109 ^ -596849742;

                              while (true) {
                                 label116: {
                                    StringBuilder var19;
                                    switch ((var8 + 985126955 ^ 476721362) - 1290138017 + 2010448917 + 1071177716 ^ 424353921) {
                                       case -1352817162:
                                          var19 = var10002;
                                          if (var10001 < ((-1186969412 * 1465912757 | 3) & -1756888045)) {
                                             char var38 = 0<"JNT",569988714,"᷅⋅ᯅⳅﯺ⻅","㋼닌닼닉","쌀시쌰시숐쌈시쌐싴숐스쌨쌠싼쌐싴쉠쌬싼쌈싨심쌠",191503131>(var10002, var10001);
                                             char var41 = (char)(
                                                (
                                                         (
                                                               (((var38 & '\uffc0') >> 6 | var38 << '\n') - 110 - 203 & 65534) >> 1
                                                                  | ((var38 & '\uffc0') >> 6 | var38 << '\n') - 110 - 203 << 15
                                                            )
                                                            & 32768
                                                      )
                                                      >> 15
                                                   | (
                                                         (((var38 & '\uffc0') >> 6 | var38 << '\n') - 110 - 203 & 65534) >> 1
                                                            | ((var38 & '\uffc0') >> 6 | var38 << '\n') - 110 - 203 << 15
                                                      )
                                                      << 1
                                             );
                                             0<"JNT",569988714,"ⷅ\u1fc5⻅ﷺ⋅ᯅⳅﯺ⻅","㋼닌닉닼㋃","쌀시쌰시숐쌈시쌐싴숐스쌨쌠싼쌐싴쉠쌬싼쌈싨심쌠",191503136>(
                                                var10002,
                                                var10001,
                                                (char)(
                                                   (
                                                            (
                                                                  (((var38 & '\uffc0') >> 6 | var38 << '\n') - 110 - 203 & 65534) >> 1
                                                                     | ((var38 & '\uffc0') >> 6 | var38 << '\n') - 110 - 203 << 15
                                                               )
                                                               & 32768
                                                         )
                                                         >> 15
                                                      | (
                                                            (((var38 & '\uffc0') >> 6 | var38 << '\n') - 110 - 203 & 65534) >> 1
                                                               | ((var38 & '\uffc0') >> 6 | var38 << '\n') - 110 - 203 << 15
                                                         )
                                                         << 1
                                                )
                                             );
                                             var10001 += (-1534800936 >> -1627275957 | 1) & 535585;
                                             continue label101;
                                          }

                                          var8 = -1614158892 >> -851635357 ^ 65597480;
                                          break;
                                       case 1768485530:
                                       default:
                                          var19 = var10002;
                                          if (var10001 < 3) {
                                             int var31 = 0<"JNT",569988714,"᷅⋅ᯅⳅﯺ⻅","㋼닌닼닉","쌀시쌰시숐쌈시쌐싴숐스쌨쌠싼쌐싴쉠쌬싼쌈싨심쌠",191503128>(var10002, var10001);
                                             int var56 = (var31 & 61440) >> 12;
                                             int var32 = (var31 & 61440) >> 12 | var31 << 4;
                                             int var57 = (((var31 & 61440) >> 12 | var31 << 4) & 65520) >> 4;
                                             var31 = ((var56 | var31 << 4) & 65520) >> 4 | ((var31 & 61440) >> 12 | var31 << 4) << 12;
                                             var56 = ((var57 | var32 << 12) & 61440) >> 12;
                                             int var34 = (((var57 | var32 << 12) & 61440) >> 12 | var31 << 4) - 117;
                                             int var59 = ((((var57 | var32 << 12) & 61440) >> 12 | var31 << 4) - 117 & 65528) >> 3;
                                             char var35 = (char)(
                                                ((var56 | var31 << 4) - 117 & 65528) >> 3 | (((var57 | var32 << 12) & 61440) >> 12 | var31 << 4) - 117 << 13
                                             );
                                             0<"JNT",569988714,"ⷅ\u1fc5⻅ﷺ⋅ᯅⳅﯺ⻅","㋼닌닉닼㋃","쌀시쌰시숐쌈시쌐싴숐스쌨쌠싼쌐싴쉠쌬싼쌈싨심쌠",191503125>(
                                                var10002, var10001, (char)(var59 | var34 << 13)
                                             );
                                             var10001 += 601681537 & -1677721527;
                                             break label116;
                                          }

                                          var8 = (1764075582 >> (-447012089 << 1764075582) | 336839510) & -1097336874;
                                    }

                                    switch (var8 + 2595337 - 1011292723 + 1044783421 - 933650786 - 496587546 - 426881110) {
                                       case -2088302445:
                                          if (!0<"JNT",569988714,"⋅ᯅⷅ","㋼㋎㋝님㋓님닿㋞님㋟닛닿닁㋒㋑닜㋟닛답닼㋅","실쌔쌌숐싴쌔쌔싴쌈심숐싴쌤쌔쌐숐슀쌤쌔쌐슔신쌀심실쌨",191503129>(
                                             var10000, 0<"JNT",569988714,"⻅⧅ළ⻅ⳅ⏅⣅⇅","㋼닼㋎㋝님㋓님닿㋞님㋟닛닿닁㋒㋑닜㋟닛답","쌀시쌰시숐쌈시쌐싴숐스쌨쌠싼쌐싴쉠쌬싼쌈싨심쌠",191503132>(var19)
                                          )) {
                                             var16 = -1;
                                             break label101;
                                          }

                                          var10000 = var5;
                                          var10001 = -938353585 - (-938353585 | -938353585 * -938353585) ^ -805576736;
                                          var10002 = (StringBuilder)0<"JNT",573101199,"\uf6fa⏅⣅⏅⻅\uf8fa","㋼㋎㋝님㋓님닿㋞님㋟닛닿닁㋒㋑닜㋟닛답닼㋃","쌀시쌰시숐쌈시쌐싴숐스쌨쌠싼쌐싴쉠쌬싼쌈싨심쌠",191503078>(
                                             "퀼퀹큃"
                                          );
                                          break;
                                       case -812834921:
                                       default:
                                          var16 = 0<"JNT",569988714,"⇅\u1fc5⻅ﯺⷅυ⣅⻅","㋼닼닌","실쌔쌌숐싴쌔쌔싴쌈심숐싴쌤쌔쌐숐슀쌤쌔쌐쉬쌈심쌌심쌐쌨",191503127>(
                                             0<"JNT",569988714,"⇅\u1fc5⻅","㋼㋎㋝님㋓님닿㋞님㋟닛닿닁㋒㋑닜㋟닛답닼㋎닙닟닞닿닛닟닟닛㋞닚닿닛닑닟㋟닿㋍닑닟㋟닊㋞닚닞닚㋟㋒답","실쌔쌌숐싴쌔쌔싴쌈심숐싴쌤쌔쌐숐슀쌤쌔쌐슔신쌀심실쌨",191503130>(
                                                var10000, 0<"JNT",569988714,"⻅⧅ළ⻅ⳅ⏅⣅⇅","㋼닼㋎㋝님㋓님닿㋞님㋟닛닿닁㋒㋑닜㋟닛답","쌀시쌰시숐쌈시쌐싴숐스쌨쌠싼쌐싴쉠쌬싼쌈싨심쌠",191503133>(var19)
                                             )
                                          );
                                          break label101;
                                    }
                                 }

                                 var8 = (829332436 >>> -2124005514 | -562424014) & -65738;
                              }
                           }

                           int var7 = var16;
                           0<"JNT",-500397143,"ᯅễễ","㋼㋎㋝님㋓님닿㋞님㋟닛닿닏㋙㋝닚닙㋒답닼㋅","쌀시쌰시숐쌬쌨싼쌈숐슈싼쌤쌨",191503123>(
                              1<"JNT",-1336979454,"쇐솯","㟃㏃","Μάߜݼܬ࠼ܬ\u05cc\u086c\u085cެড়\u05ccߜެࠌ\u085cҌ",-478815390>(this),
                              (Class_352)0<"JNT",573101199,"\uf6fa⏅⣅⏅⻅\uf8fa","㋼㋎㋝님㋓님닿㋞님㋟닛닿닁㋒㋑닜㋟닛답닌닼㋃","쌰심",191503126>(var6, var7)
                           );
                        }
                        continue label104;
                     }

                     var8 = -217580117 >> -217580117 ^ -1784052252;
                     break;
                  case 1005418832:
                  default:
                     0<"JNT",569988714,"ễᯅ⯅","㋼닼㋃","쌴쌔",191503082>(this);
                     return;
               }
            }
         }
      }
   }

   // $VF: renamed from: l () void
   @Override
   public void method_926() {
      0<"JNT",569988714,"᳅⧅","㋼닼㋃","쌴쌔",191503091>(this);
   }

   // $VF: renamed from: ngr (java.lang.String) Class_378
   public Class_378 method_997(String var1) {
      0<"JNT",489281795,"⫅","㋼㋎㋝님㋓님닿㋞님㋟닛닿닁㋒㋑닜㋟닛답닼㋎닐닚닚답","쌜심심",191503096>(this, var1);
      return this;
   }

   // $VF: renamed from: yo () Class_378
   public Class_378 method_998() {
      0<"JNT",489281795,"⏅᳅","㋼닼㋎닐닚닚답","쌜심심",191503093>(this);
      return this;
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_937(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 + 1902940895 ^ 110563694 ^ 1819159631) - 474434084 + 688041663 - 1076847698 ^ 1802290437) + 125741417 + 110660319;
      MethodHandle var10000 = field_903[((var10 + 1902940895 ^ 110563694 ^ 1819159631) - 474434084 + 688041663 - 1076847698 ^ 1802290437)
         + 125741417
         + 110660319
         + 1745975250];
      if (field_903[var10001 + 1745975250] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = -1882323902 & -204668021 ^ -2083782654; var23 < var13.length(); var23 += (-215639805 | -215639805) ^ -215639806) {
            int var42 = ((var13.charAt(var23) ^ 227 ^ 57) + 117 ^ 27) - 161 + 17 - 254;
            int var10004 = (var42 & 65408) >> 7;
            int var43 = (var42 & 65408) >> 7 | var42 << 9;
            int var89 = (((var42 & 65408) >> 7 | var42 << 9) & 65534) >> 1;
            char var44 = (char)((((var10004 | var42 << 9) & 65534) >> 1 | ((var42 & 65408) >> 7 | var42 << 9) << 15) - 185);
            var13.setCharAt(var23, (char)((var89 | var43 << 15) - 185));
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = (-135393370 | 1797942554 & 1797942554 | 0) & 65536; var29 < var16.length(); var29 += (-1666879953 + -1666879953 | 1) & 1116021281) {
            int var49 = var16.charAt(var29);
            int var90 = (var49 & 61440) >> 12;
            int var50 = (var49 & 61440) >> 12 | var49 << 4;
            int var91 = (((var49 & 61440) >> 12 | var49 << 4) & 64512) >> 10;
            var49 = (((var90 | var49 << 4) & 64512) >> 10 | ((var49 & 61440) >> 12 | var49 << 4) << 6) - 186 - 1;
            var90 = ((var91 | var50 << 6) - 186 - 1 & 57344) >> 13;
            int var52 = (((var91 | var50 << 6) - 186 - 1 & 57344) >> 13 | var49 << 3) ^ 246;
            int var93 = (((((var91 | var50 << 6) - 186 - 1 & 57344) >> 13 | var49 << 3) ^ 246) & 61440) >> 12;
            var49 = (((var90 | var49 << 3) ^ 246) & 61440) >> 12 | ((((var91 | var50 << 6) - 186 - 1 & 57344) >> 13 | var49 << 3) ^ 246) << 4;
            var90 = ((var93 | var52 << 4) & 65528) >> 3;
            int var54 = (((var93 | var52 << 4) & 65528) >> 3 | var49 << 13) ^ 230;
            int var95 = (((((var93 | var52 << 4) & 65528) >> 3 | var49 << 13) ^ 230) & 57344) >> 13;
            char var55 = (char)((((var90 | var49 << 13) ^ 230) & 57344) >> 13 | ((((var93 | var52 << 4) & 65528) >> 3 | var49 << 13) ^ 230) << 3);
            var16.setCharAt(var29, (char)(var95 | var54 << 3));
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_378.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = (-367299137 | -1795022325 | 0) & 2392064; var35 < var19.length(); var35 += 131507313 >>> (128701993 >>> 131507313) ^ 63) {
            int var60 = var19.charAt(var35);
            int var96 = (var60 & 49152) >> 14;
            int var61 = ((var60 & 49152) >> 14 | var60 << 2) - 201 + 6;
            int var97 = (((var60 & 49152) >> 14 | var60 << 2) - 201 + 6 & 65534) >> 1;
            var60 = ((var96 | var60 << 2) - 201 + 6 & 65534) >> 1 | ((var60 & 49152) >> 14 | var60 << 2) - 201 + 6 << 15;
            var96 = ((var97 | var61 << 15) & 65535) >> 0;
            int var63 = ((var97 | var61 << 15) & 65535) >> 0 | var60 << 16;
            int var99 = ((((var97 | var61 << 15) & 65535) >> 0 | var60 << 16) & 63488) >> 11;
            var60 = ((var96 | var60 << 16) & 63488) >> 11 | (((var97 | var61 << 15) & 65535) >> 0 | var60 << 16) << 5;
            var96 = ((var99 | var63 << 5) & 32768) >> 15;
            int var65 = ((var99 | var63 << 5) & 32768) >> 15 | var60 << 1;
            int var101 = ((((var99 | var63 << 5) & 32768) >> 15 | var60 << 1) & 65024) >> 9;
            char var66 = (char)((((var96 | var60 << 1) & 65024) >> 9 | (((var99 | var63 << 5) & 32768) >> 15 | var60 << 1) << 7) - 100 + 26);
            var19.setCharAt(var35, (char)((var101 | var65 << 7) - 100 + 26));
         }

         Class var7 = Class.forName(var19.toString(), false, Class_378.class.getClassLoader());
         switch (((var4 + 1816358209 + 1654566901 + 686076705 ^ 1165289310 ^ 801478642) + 1246807927 ^ 2021466263 ^ 2054180154) + 1239205689 ^ 2032095875) {
            case 289054816:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            case 811807300:
            case 1890804993:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 1835254138:
               var10000 = var0.findSpecial(var7, var5, var6, Class_378.class);
               break;
            case 1885400870:
               var10000 = var0.findConstructor(var7, var6);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_903[((var10 + 1902940895 ^ 110563694 ^ 1819159631) - 474434084 + 688041663 - 1076847698 ^ 1802290437) + 125741417 + 110660319 + 1745975250] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_938(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = var10 + 1734313669 + 968311660 - 1734804455 - 1024822957 + 1094043369 + 553887807 + 1567486486 + 1898357818 + 135233395;
      MethodHandle var10000 = field_903[var10 + 1734313669 + 968311660 - 1734804455 - 1024822957 + 1094043369 + 553887807 + 1567486486 + 1898357818 + 135233395
         ^ 418224091];
      if (field_903[var10001 ^ 418224091] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = (-1429834313 ^ 383493911 | 0) & 1111621968; var24 < var14.length(); var24 += (-165797462 * 129145673 | 1) & -2137905147) {
            int var43 = (var14.charAt(var24) ^ 144) + 78;
            int var10004 = (var43 & 0) >> 16;
            int var44 = ((var43 & 0) >> 16 | var43 << 0) ^ 64;
            int var84 = ((((var43 & 0) >> 16 | var43 << 0) ^ 64) & 65534) >> 1;
            var43 = ((((var10004 | var43 << 0) ^ 64) & 65534) >> 1 | (((var43 & 0) >> 16 | var43 << 0) ^ 64) << 15) ^ 138 ^ 38;
            var10004 = (((var84 | var44 << 15) ^ 138 ^ 38) & 65532) >> 2;
            int var46 = ((((var84 | var44 << 15) ^ 138 ^ 38) & 65532) >> 2 | var43 << 14) - 17;
            int var86 = (((((var84 | var44 << 15) ^ 138 ^ 38) & 65532) >> 2 | var43 << 14) - 17 & 64512) >> 10;
            char var47 = (char)(((var10004 | var43 << 14) - 17 & 64512) >> 10 | ((((var84 | var44 << 15) ^ 138 ^ 38) & 65532) >> 2 | var43 << 14) - 17 << 6);
            var14.setCharAt(var24, (char)(var86 | var46 << 6));
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = (1039882997 | -1043918281 - 329383790 | 0) & 1073742082; var30 < var17.length(); var30 += (1865478598 & -947184572 | 1) & 812302355) {
            int var52 = var17.charAt(var30) + 'o' + 110;
            int var87 = (var52 & 65520) >> 4;
            int var53 = ((((var52 & 65520) >> 4 | var52 << 12) - 175 + 79 ^ 153) + 254 ^ 144) - 105;
            int var88 = (((((var52 & 65520) >> 4 | var52 << 12) - 175 + 79 ^ 153) + 254 ^ 144) - 105 & 65528) >> 3;
            char var54 = (char)(
               ((((var87 | var52 << 12) - 175 + 79 ^ 153) + 254 ^ 144) - 105 & 65528) >> 3
                  | ((((var52 & 65520) >> 4 | var52 << 12) - 175 + 79 ^ 153) + 254 ^ 144) - 105 << 13
            );
            var17.setCharAt(var30, (char)(var88 | var53 << 13));
         }

         Class var6 = Class.forName(var17.toString(), false, Class_378.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = (1514200103 << 619644708 | 0) & 1347428750; var36 < var20.length(); var36 += (-391280470 - -391280470 | 1) & 2128034597) {
            int var59 = var20.charAt(var36) ^ 254;
            char var64 = (char)(
               (
                        (
                              (
                                       (
                                             (
                                                      (
                                                               ((((var59 & 65534) >> 1 | var59 << 15) - 38 ^ 104) & 65535) >> 0
                                                                  | (((var59 & 65534) >> 1 | var59 << 15) - 38 ^ 104) << 16
                                                            )
                                                            - 73
                                                            - 90
                                                         & 32768
                                                   )
                                                   >> 15
                                                | (
                                                         ((((var59 & 65534) >> 1 | var59 << 15) - 38 ^ 104) & 65535) >> 0
                                                            | (((var59 & 65534) >> 1 | var59 << 15) - 38 ^ 104) << 16
                                                      )
                                                      - 73
                                                      - 90
                                                   << 1
                                          )
                                          & 49152
                                    )
                                    >> 14
                                 | (
                                       (
                                                (
                                                         ((((var59 & 65534) >> 1 | var59 << 15) - 38 ^ 104) & 65535) >> 0
                                                            | (((var59 & 65534) >> 1 | var59 << 15) - 38 ^ 104) << 16
                                                      )
                                                      - 73
                                                      - 90
                                                   & 32768
                                             )
                                             >> 15
                                          | (
                                                   ((((var59 & 65534) >> 1 | var59 << 15) - 38 ^ 104) & 65535) >> 0
                                                      | (((var59 & 65534) >> 1 | var59 << 15) - 38 ^ 104) << 16
                                                )
                                                - 73
                                                - 90
                                             << 1
                                    )
                                    << 2
                           )
                           & 65472
                     )
                     >> 6
                  | (
                        (
                                 (
                                       (
                                                (
                                                         ((((var59 & 65534) >> 1 | var59 << 15) - 38 ^ 104) & 65535) >> 0
                                                            | (((var59 & 65534) >> 1 | var59 << 15) - 38 ^ 104) << 16
                                                      )
                                                      - 73
                                                      - 90
                                                   & 32768
                                             )
                                             >> 15
                                          | (
                                                   ((((var59 & 65534) >> 1 | var59 << 15) - 38 ^ 104) & 65535) >> 0
                                                      | (((var59 & 65534) >> 1 | var59 << 15) - 38 ^ 104) << 16
                                                )
                                                - 73
                                                - 90
                                             << 1
                                    )
                                    & 49152
                              )
                              >> 14
                           | (
                                 (
                                          (
                                                   ((((var59 & 65534) >> 1 | var59 << 15) - 38 ^ 104) & 65535) >> 0
                                                      | (((var59 & 65534) >> 1 | var59 << 15) - 38 ^ 104) << 16
                                                )
                                                - 73
                                                - 90
                                             & 32768
                                       )
                                       >> 15
                                    | (
                                             ((((var59 & 65534) >> 1 | var59 << 15) - 38 ^ 104) & 65535) >> 0
                                                | (((var59 & 65534) >> 1 | var59 << 15) - 38 ^ 104) << 16
                                          )
                                          - 73
                                          - 90
                                       << 1
                              )
                              << 2
                     )
                     << 10
            );
            var20.setCharAt(
               var36,
               (char)(
                  (
                           (
                                 (
                                          (
                                                (
                                                         (
                                                                  ((((var59 & 65534) >> 1 | var59 << 15) - 38 ^ 104) & 65535) >> 0
                                                                     | (((var59 & 65534) >> 1 | var59 << 15) - 38 ^ 104) << 16
                                                               )
                                                               - 73
                                                               - 90
                                                            & 32768
                                                      )
                                                      >> 15
                                                   | (
                                                            ((((var59 & 65534) >> 1 | var59 << 15) - 38 ^ 104) & 65535) >> 0
                                                               | (((var59 & 65534) >> 1 | var59 << 15) - 38 ^ 104) << 16
                                                         )
                                                         - 73
                                                         - 90
                                                      << 1
                                             )
                                             & 49152
                                       )
                                       >> 14
                                    | (
                                          (
                                                   (
                                                            ((((var59 & 65534) >> 1 | var59 << 15) - 38 ^ 104) & 65535) >> 0
                                                               | (((var59 & 65534) >> 1 | var59 << 15) - 38 ^ 104) << 16
                                                         )
                                                         - 73
                                                         - 90
                                                      & 32768
                                                )
                                                >> 15
                                             | (
                                                      ((((var59 & 65534) >> 1 | var59 << 15) - 38 ^ 104) & 65535) >> 0
                                                         | (((var59 & 65534) >> 1 | var59 << 15) - 38 ^ 104) << 16
                                                   )
                                                   - 73
                                                   - 90
                                                << 1
                                       )
                                       << 2
                              )
                              & 65472
                        )
                        >> 6
                     | (
                           (
                                    (
                                          (
                                                   (
                                                            ((((var59 & 65534) >> 1 | var59 << 15) - 38 ^ 104) & 65535) >> 0
                                                               | (((var59 & 65534) >> 1 | var59 << 15) - 38 ^ 104) << 16
                                                         )
                                                         - 73
                                                         - 90
                                                      & 32768
                                                )
                                                >> 15
                                             | (
                                                      ((((var59 & 65534) >> 1 | var59 << 15) - 38 ^ 104) & 65535) >> 0
                                                         | (((var59 & 65534) >> 1 | var59 << 15) - 38 ^ 104) << 16
                                                   )
                                                   - 73
                                                   - 90
                                                << 1
                                       )
                                       & 49152
                                 )
                                 >> 14
                              | (
                                    (
                                             (
                                                      ((((var59 & 65534) >> 1 | var59 << 15) - 38 ^ 104) & 65535) >> 0
                                                         | (((var59 & 65534) >> 1 | var59 << 15) - 38 ^ 104) << 16
                                                   )
                                                   - 73
                                                   - 90
                                                & 32768
                                          )
                                          >> 15
                                       | (
                                                ((((var59 & 65534) >> 1 | var59 << 15) - 38 ^ 104) & 65535) >> 0
                                                   | (((var59 & 65534) >> 1 | var59 << 15) - 38 ^ 104) << 16
                                             )
                                             - 73
                                             - 90
                                          << 1
                                 )
                                 << 2
                        )
                        << 10
               )
            );
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_378.class.getClassLoader()).returnType();
         switch (((var4 + 1174867808 ^ 759181689 ^ 283302055) + 526450172 + 1729515522 + 605885860 - 1408690238 ^ 469251586) - 1504797826 + 594328623) {
            case 52779983:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            case 218544563:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            case 660193753:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            case 1767658652:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_903[var10 + 1734313669 + 968311660 - 1734804455 - 1024822957 + 1094043369 + 553887807 + 1567486486 + 1898357818 + 135233395 ^ 418224091] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
