import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;
import net.minecraft.class_639;
import net.minecraft.class_642;

public class Class_17 extends Class_342 {
   // $VF: renamed from: wb Class_49
   public Class_49 field_2281;
   // $VF: renamed from: icx Class_105
   public Class_105 field_2282;
   // $VF: renamed from: jd Class_105
   public Class_105 field_2283;
   // $VF: renamed from: avt Class_168
   public Class_168 field_2284;
   // $VF: renamed from: wxd net.minecraft.class_639
   public class_639 field_2285;
   // $VF: renamed from: fc net.minecraft.class_642
   public class_642 field_2286;
   // $VF: renamed from: rqu int
   public int field_2287;
   // $VF: renamed from: jps java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_2288 = new MethodHandle[98];

   public Class_17() {
      int var1 = 1989611165;
      int var10001 = (-1293226999 << (-792442957 ^ -1293226999) | 0) & 1385024794;

      StringBuilder var10002;
      for (var10002 = (StringBuilder)0<"JNT",-1817406556,"\u07bc蟖ߑ蟖ߐ\u07b9","甿疇疻疭痓疭畁症疭痃疱畁疉痗痋疽痃疱留甽疓","\u0098tÈtﾨ t¨\u008cﾨ<À¸\u0094¨\u008c\ufff8Ä\u0094 \u0080\u0084¸",795607256>(
            "㎂\u0381ﾁ\ueb81꾂瞂쎁뮁\ueb81\ue781\ue781쎁뮁ﾁ"
         );
         var10001 < (-39689690 ^ -39689688);
         var10001 += 757913005 >>> -1534211625 ^ 91
      ) {
         int var39 = 0<"JNT",-2038060259,"蟇ߖ蟊ߏ螺ߐ","甿畽甽畩","\u0098tÈtﾨ t¨\u008cﾨ<À¸\u0094¨\u008c\ufff8Ä\u0094 \u0080\u0084¸",795607309>(var10002, var10001) + 'I';
         int var10005 = (var39 & 32768) >> 15;
         int var40 = ((var39 & 32768) >> 15 | var39 << 1) ^ 107;
         int var110 = ((((var39 & 32768) >> 15 | var39 << 1) ^ 107) & 63488) >> 11;
         char var41 = (char)(((((var10005 | var39 << 1) ^ 107) & 63488) >> 11 | (((var39 & 32768) >> 15 | var39 << 1) ^ 107) << 5) + 149);
         0<"JNT",-2038060259,"蟏蟈ߐ螷ߖ蟊ߏ螺ߐ","甿畽畩甽疓","\u0098tÈtﾨ t¨\u008cﾨ<À¸\u0094¨\u008c\ufff8Ä\u0094 \u0080\u0084¸",795607306>(
            var10002, var10001, (char)((var110 | var40 << 5) + 149)
         );
      }

      String var6 = 0<"JNT",-2038060259,"ߐ蟑螿ߐߏ蟖ߑ蟕","甿甽疇疻疭痓疭畁症疭痃疱畁疉痗痋疽痃疱留","\u0098tÈtﾨ t¨\u008cﾨ<À¸\u0094¨\u008c\ufff8Ä\u0094 \u0080\u0084¸",795607258>(var10002);
      int var21 = (1703609426 - -1842650706 | 0) & 77617219;

      StringBuilder var43;
      for (var43 = (StringBuilder)0<"JNT",-1817406556,"\u07bc蟖ߑ蟖ߐ\u07b9","甿疇疻疭痓疭畁症疭痃疱畁疉痗痋疽痃疱留甽疓","\u0098tÈtﾨ t¨\u008cﾨ<À¸\u0094¨\u008c\ufff8Ä\u0094 \u0080\u0084¸",795607299>(
            "胨胷䃷ô胵胰䃷胲ó胰䃵䃵胶䃠샴胳óô샵샵胳ó䃷÷䃠ö䃲胳샵䃠䃳胲÷óô샵샵胳ó䃷胳䃳䃠샳샴ô胵䃠胰䃠÷胳샴샷胳샴"
         );
         var21 < ((209665750 + 1295350284 | 24) & 642465849);
         var21 += -2110885923 & 1085359334 ^ 2114757
      ) {
         int var72 = 0<"JNT",-2038060259,"蟇ߖ蟊ߏ螺ߐ","甿畽甽畩","\u0098tÈtﾨ t¨\u008cﾨ<À¸\u0094¨\u008c\ufff8Ä\u0094 \u0080\u0084¸",795607302>(var43, var21) ^ 193;
         int var10006 = (var72 & 65534) >> 1;
         int var73 = (var72 & 65534) >> 1 | var72 << 15;
         int var132 = (((var72 & 65534) >> 1 | var72 << 15) & 57344) >> 13;
         char var74 = (char)((((var10006 | var72 << 15) & 57344) >> 13 | ((var72 & 65534) >> 1 | var72 << 15) << 3) - 46 - 55);
         0<"JNT",-2038060259,"蟏蟈ߐ螷ߖ蟊ߏ螺ߐ","甿畽畩甽疓","\u0098tÈtﾨ t¨\u008cﾨ<À¸\u0094¨\u008c\ufff8Ä\u0094 \u0080\u0084¸",795607311>(
            var43, var21, (char)((var132 | var73 << 3) - 46 - 55)
         );
      }

      super(
         var6,
         0<"JNT",-2038060259,"ߐ蟑螿ߐߏ蟖ߑ蟕","甿甽疇疻疭痓疭畁症疭痃疱畁疉痗痋疽痃疱留","\u0098tÈtﾨ t¨\u008cﾨ<À¸\u0094¨\u008c\ufff8Ä\u0094 \u0080\u0084¸",795607273>(var43),
         -1,
         1<"JNT",389717904,"㬬䀬䎬","\uf1af\uf11f","ҭҝݭঝ࣍ؽ",539880959>()
      );
      var10001 = (-304484602 | 623454928 | 0) & 268701705;

      for (var10002 = (StringBuilder)0<"JNT",-1817406556,"\u07bc蟖ߑ蟖ߐ\u07b9","甿疇疻疭痓疭畁症疭痃疱畁疉痗痋疽痃疱留甽疓","\u0098tÈtﾨ t¨\u008cﾨ<À¸\u0094¨\u008c\ufff8Ä\u0094 \u0080\u0084¸",795607279>(
            "䀟怣䀤\ue022\ue025"
         );
         var10001 < 5;
         var10001 += 1
      ) {
         int var46 = 0<"JNT",-2038060259,"蟇ߖ蟊ߏ螺ߐ","甿畽甽畩","\u0098tÈtﾨ t¨\u008cﾨ<À¸\u0094¨\u008c\ufff8Ä\u0094 \u0080\u0084¸",795607287>(var10002, var10001)
            + 179
            - 179;
         char var47 = (char)(((var46 & 57344) >> 13 | var46 << 3) + 72 - 254);
         0<"JNT",-2038060259,"蟏蟈ߐ螷ߖ蟊ߏ螺ߐ","甿畽畩甽疓","\u0098tÈtﾨ t¨\u008cﾨ<À¸\u0094¨\u008c\ufff8Ä\u0094 \u0080\u0084¸",795607308>(
            var10002, var10001, (char)(((var46 & 57344) >> 13 | var46 << 3) + 72 - 254)
         );
      }

      Class_49 var9 = (Class_49)0<"JNT",-1817406556,"\u07bc蟖ߑ蟖ߐ\u07b9","甿疇疻疭痓疭畁症疭痃疱畁疉痗痋疽痃疱留畷畷畷畷甽疓","\u0080|",795607286>(
         0<"JNT",-2038060259,"ߐ蟑螿ߐߏ蟖ߑ蟕","甿甽疇疻疭痓疭畁症疭痃疱畁疉痗痋疽痃疱留","\u0098tÈtﾨ t¨\u008cﾨ<À¸\u0094¨\u008c\ufff8Ä\u0094 \u0080\u0084¸",795607289>(var10002),
         3.5,
         60.0,
         0.0,
         0.1
      );
      int var25 = 1939265496 * 623558311 ^ -49734168;

      for (var43 = (StringBuilder)0<"JNT",-1817406556,"\u07bc蟖ߑ蟖ߐ\u07b9","甿疇疻疭痓疭畁症疭痃疱畁疉痗痋疽痃疱留甽疓","\u0098tÈtﾨ t¨\u008cﾨ<À¸\u0094¨\u008c\ufff8Ä\u0094 \u0080\u0084¸",795607295>(
            "㊫㔫㓋Ⱛ㑋㗋㘋㛋㗫㚫Ⱛ㘋㓫Ⱛ㚋㓋㒋㘋㗫㒫㚋Ⱛ㚫㘋Ⱛ㜋㑋㕋㚫Ⱛ㑫㓋㓫㘋㙫㓋Ⱛ㙫㓋㒋㘋㗫㗫㓋㒋㚫㕋㗫㔋Ⱛ㚫㘋Ⱛ㚫㔫㓋Ⱛ㚋㓋㙫㛫㓋㙫"
         );
         var25 < ((370435727 >> 2045066169 | 63) & 1016361215);
         var25 += (1166657960 - 921118405 | 0) & -247442415
      ) {
         char var78 = 0<"JNT",-2038060259,"蟇ߖ蟊ߏ螺ߐ","甿畽甽畩","\u0098tÈtﾨ t¨\u008cﾨ<À¸\u0094¨\u008c\ufff8Ä\u0094 \u0080\u0084¸",795607257>(var43, var25);
         char var81 = (char)(
            (
                  ((((((var78 & '\uf000') >> 12 | var78 << 4) ^ 178) & 65528) >> 3 | (((var78 & '\uf000') >> 12 | var78 << 4) ^ 178) << 13) & 65472) >> 6
                     | (((((var78 & '\uf000') >> 12 | var78 << 4) ^ 178) & 65528) >> 3 | (((var78 & '\uf000') >> 12 | var78 << 4) ^ 178) << 13) << 10
               )
               - 65
         );
         0<"JNT",-2038060259,"蟏蟈ߐ螷ߖ蟊ߏ螺ߐ","甿畽畩甽疓","\u0098tÈtﾨ t¨\u008cﾨ<À¸\u0094¨\u008c\ufff8Ä\u0094 \u0080\u0084¸",795607254>(
            var43,
            var25,
            (char)(
               (
                     ((((((var78 & '\uf000') >> 12 | var78 << 4) ^ 178) & 65528) >> 3 | (((var78 & '\uf000') >> 12 | var78 << 4) ^ 178) << 13) & 65472) >> 6
                        | (((((var78 & '\uf000') >> 12 | var78 << 4) ^ 178) & 65528) >> 3 | (((var78 & '\uf000') >> 12 | var78 << 4) ^ 178) << 13) << 10
                  )
                  - 65
            )
         );
      }

      this.field_2281 = 0<"JNT",-2038060259,"蟑蟖ߖ","甿疇疻疭痓疭畁症疭痃疱畁疉痗痋疽痃疱留甽疇疷疩留","\u0080|",795607297>(
         var9, 0<"JNT",-2038060259,"ߐ蟑螿ߐߏ蟖ߑ蟕","甿甽疇疻疭痓疭畁症疭痃疱畁疉痗痋疽痃疱留","\u0098tÈtﾨ t¨\u008cﾨ<À¸\u0094¨\u008c\ufff8Ä\u0094 \u0080\u0084¸",795607296>(var43)
      );
      Class_17 var10000 = this;
      var10001 = -2112783238 << -1691377795 ^ 1073741824;

      for (var10002 = (StringBuilder)0<"JNT",-1817406556,"\u07bc蟖ߑ蟖ߐ\u07b9","甿疇疻疭痓疭畁症疭痃疱畁疉痗痋疽痃疱留甽疓","\u0098tÈtﾨ t¨\u008cﾨ<À¸\u0094¨\u008c\ufff8Ä\u0094 \u0080\u0084¸",795607294>(
            "ﾘﾹﾬﾭｰﾒﾽﾼﾼﾷﾶￃ"
         );
         var10001 < ((-1060981098 >> -1813245950 | 12) & 25494046);
         var10001 += (621028658 - -1922205834 | 1) & 1751187521
      ) {
         0<"JNT",-2038060259,"蟏蟈ߐ螷ߖ蟊ߏ螺ߐ","甿畽畩甽疓","\u0098tÈtﾨ t¨\u008cﾨ<À¸\u0094¨\u008c\ufff8Ä\u0094 \u0080\u0084¸",795607269>(
            var10002,
            var10001,
            (char)(
               0<"JNT",-2038060259,"蟇ߖ蟊ߏ螺ߐ","甿畽甽畩","\u0098tÈtﾨ t¨\u008cﾨ<À¸\u0094¨\u008c\ufff8Ä\u0094 \u0080\u0084¸",795607268>(var10002, var10001) + 180
                  ^ 77
                  ^ 212
                  ^ 240
                  ^ 109
            )
         );
      }

      Class_105 var12 = (Class_105)0<"JNT",-1817406556,"\u07bc蟖ߑ蟖ߐ\u07b9","甿疇疻疭痓疭畁症疭痃疱畁疉痗痋疽痃疱留疛甽疓","\u008c¸",795607260>(
         0<"JNT",-2038060259,"ߐ蟑螿ߐߏ蟖ߑ蟕","甿甽疇疻疭痓疭畁症疭痃疱畁疉痗痋疽痃疱留","\u0098tÈtﾨ t¨\u008cﾨ<À¸\u0094¨\u008c\ufff8Ä\u0094 \u0080\u0084¸",795607303>(var10002), false
      );
      int var29 = (1716084303 << 1716084303 | 0) & 1346390828;
      var43 = (StringBuilder)0<"JNT",-1817406556,"\u07bc蟖ߑ蟖ߐ\u07b9","甿疇疻疭痓疭畁症疭痃疱畁疉痗痋疽痃疱留甽疓","\u0098tÈtﾨ t¨\u008cﾨ<À¸\u0094¨\u008c\ufff8Ä\u0094 \u0080\u0084¸",795607261>(
         "쀕䀚\u001b\u001b\b\u001a䀚\u0019䀙\b\u001d\u001a䀙\b耘䀝\u001d\u001d쀛耛쀜\b耜䀙\u001b䀘\u001d䀙\u0019\b\u001d쀛\b䀐䀝\u001d쀛\b耔䀙쀘쀛耛耛䀙쀘\u001d"
      );

      label83:
      while (true) {
         var1 = (-348308317 - -348308317 | 1873109433) & 1873772025;

         while (true) {
            label117: {
               switch (((var1 + 1040312038 ^ 2023196024) - 1606658469 ^ 1587958302) + 1781921680 - 1268745932) {
                  case -1311775664:
                  default:
                     var10002 = var43;
                     if (var29 < ((492319588 * 273725231 | 39) & 1180719)) {
                        char var105 = 0<"JNT",-2038060259,"蟇ߖ蟊ߏ螺ߐ","甿畽甽畩","\u0098tÈtﾨ t¨\u008cﾨ<À¸\u0094¨\u008c\ufff8Ä\u0094 \u0080\u0084¸",795607298>(
                           var43, var29
                        );
                        char var108 = (char)(
                           (
                                 ((((((var105 & '︀') >> 9 | var105 << 7) & 65504) >> 5 | ((var105 & '︀') >> 9 | var105 << 7) << 11) ^ 12) & 65534) >> 1
                                    | (((((var105 & '︀') >> 9 | var105 << 7) & 65504) >> 5 | ((var105 & '︀') >> 9 | var105 << 7) << 11) ^ 12) << 15
                              )
                              + 27
                        );
                        0<"JNT",-2038060259,"蟏蟈ߐ螷ߖ蟊ߏ螺ߐ","甿畽畩甽疓","\u0098tÈtﾨ t¨\u008cﾨ<À¸\u0094¨\u008c\ufff8Ä\u0094 \u0080\u0084¸",795607307>(
                           var43,
                           var29,
                           (char)(
                              (
                                    ((((((var105 & '︀') >> 9 | var105 << 7) & 65504) >> 5 | ((var105 & '︀') >> 9 | var105 << 7) << 11) ^ 12) & 65534) >> 1
                                       | (((((var105 & '︀') >> 9 | var105 << 7) & 65504) >> 5 | ((var105 & '︀') >> 9 | var105 << 7) << 11) ^ 12) << 15
                                 )
                                 + 27
                           )
                        );
                        var29 += 807124985 & 1332508244 >>> -1952837076 ^ 46784;
                        break label117;
                     }

                     var1 = (-254926906 >>> -254926906 | 1556108832) & 1609127840;
                     break;
                  case 1247930144:
                     var10002 = var43;
                     if (var29 < ((1327951128 * 227699168 * -332165247 | 47) & 855650943)) {
                        char var84 = 0<"JNT",-2038060259,"蟇ߖ蟊ߏ螺ߐ","甿畽甽畩","\u0098tÈtﾨ t¨\u008cﾨ<À¸\u0094¨\u008c\ufff8Ä\u0094 \u0080\u0084¸",795607284>(
                           var43, var29
                        );
                        char var89 = (char)(
                           (
                                    (
                                          (
                                                   (
                                                         (((((var84 & '￼') >> 2 | var84 << 14) & 64512) >> 10 | ((var84 & '￼') >> 2 | var84 << 14) << 6) & 0)
                                                               >> 16
                                                            | ((((var84 & '￼') >> 2 | var84 << 14) & 64512) >> 10 | ((var84 & '￼') >> 2 | var84 << 14) << 6)
                                                               << 0
                                                      )
                                                      & 61440
                                                )
                                                >> 12
                                             | (
                                                   (((((var84 & '￼') >> 2 | var84 << 14) & 64512) >> 10 | ((var84 & '￼') >> 2 | var84 << 14) << 6) & 0) >> 16
                                                      | ((((var84 & '￼') >> 2 | var84 << 14) & 64512) >> 10 | ((var84 & '￼') >> 2 | var84 << 14) << 6) << 0
                                                )
                                                << 4
                                       )
                                       & 65472
                                 )
                                 >> 6
                              | (
                                    (
                                             (
                                                   (((((var84 & '￼') >> 2 | var84 << 14) & 64512) >> 10 | ((var84 & '￼') >> 2 | var84 << 14) << 6) & 0) >> 16
                                                      | ((((var84 & '￼') >> 2 | var84 << 14) & 64512) >> 10 | ((var84 & '￼') >> 2 | var84 << 14) << 6) << 0
                                                )
                                                & 61440
                                          )
                                          >> 12
                                       | (
                                             (((((var84 & '￼') >> 2 | var84 << 14) & 64512) >> 10 | ((var84 & '￼') >> 2 | var84 << 14) << 6) & 0) >> 16
                                                | ((((var84 & '￼') >> 2 | var84 << 14) & 64512) >> 10 | ((var84 & '￼') >> 2 | var84 << 14) << 6) << 0
                                          )
                                          << 4
                                 )
                                 << 10
                        );
                        0<"JNT",-2038060259,"蟏蟈ߐ螷ߖ蟊ߏ螺ߐ","甿畽畩甽疓","\u0098tÈtﾨ t¨\u008cﾨ<À¸\u0094¨\u008c\ufff8Ä\u0094 \u0080\u0084¸",795607285>(
                           var43,
                           var29,
                           (char)(
                              (
                                       (
                                             (
                                                      (
                                                            (((((var84 & '￼') >> 2 | var84 << 14) & 64512) >> 10 | ((var84 & '￼') >> 2 | var84 << 14) << 6) & 0)
                                                                  >> 16
                                                               | ((((var84 & '￼') >> 2 | var84 << 14) & 64512) >> 10 | ((var84 & '￼') >> 2 | var84 << 14) << 6)
                                                                  << 0
                                                         )
                                                         & 61440
                                                   )
                                                   >> 12
                                                | (
                                                      (((((var84 & '￼') >> 2 | var84 << 14) & 64512) >> 10 | ((var84 & '￼') >> 2 | var84 << 14) << 6) & 0)
                                                            >> 16
                                                         | ((((var84 & '￼') >> 2 | var84 << 14) & 64512) >> 10 | ((var84 & '￼') >> 2 | var84 << 14) << 6) << 0
                                                   )
                                                   << 4
                                          )
                                          & 65472
                                    )
                                    >> 6
                                 | (
                                       (
                                                (
                                                      (((((var84 & '￼') >> 2 | var84 << 14) & 64512) >> 10 | ((var84 & '￼') >> 2 | var84 << 14) << 6) & 0)
                                                            >> 16
                                                         | ((((var84 & '￼') >> 2 | var84 << 14) & 64512) >> 10 | ((var84 & '￼') >> 2 | var84 << 14) << 6) << 0
                                                   )
                                                   & 61440
                                             )
                                             >> 12
                                          | (
                                                (((((var84 & '￼') >> 2 | var84 << 14) & 64512) >> 10 | ((var84 & '￼') >> 2 | var84 << 14) << 6) & 0) >> 16
                                                   | ((((var84 & '￼') >> 2 | var84 << 14) & 64512) >> 10 | ((var84 & '￼') >> 2 | var84 << 14) << 6) << 0
                                             )
                                             << 4
                                    )
                                    << 10
                           )
                        );
                        var29 += (1819967408 * -1009904046 | 1) & -1073714815;
                        continue label83;
                     }

                     var1 = (1651884724 - -1383688097 | -2089269232) & -344405858;
               }

               switch ((var1 ^ 1414725901 ^ 1283372290 ^ 704011547) - 184923280 + 1764420937 ^ 1651972843) {
                  case -1832926382:
                     var10000.field_2282 = 0<"JNT",-2038060259,"蟊蟐߈","甿疇疻疭痓疭畁症疭痃疱畁疉痗痋疽痃疱留甽疇疱痋留","\u008c¸",795607274>(
                        var12,
                        0<"JNT",-2038060259,"ߐ蟑螿ߐߏ蟖ߑ蟕","甿甽疇疻疭痓疭畁症疭痃疱畁疉痗痋疽痃疱留","\u0098tÈtﾨ t¨\u008cﾨ<À¸\u0094¨\u008c\ufff8Ä\u0094 \u0080\u0084¸",795607277>(
                           var10002
                        )
                     );
                     var10000 = this;
                     var10001 = -309778134 >> 957003334 ^ -4840284;

                     for (var10002 = (StringBuilder)0<"JNT",-1817406556,"\u07bc蟖ߑ蟖ߐ\u07b9","甿疇疻疭痓疭畁症疭痃疱畁疉痗痋疽痃疱留甽疓","\u0098tÈtﾨ t¨\u008cﾨ<À¸\u0094¨\u008c\ufff8Ä\u0094 \u0080\u0084¸",795607251>(
                           "ጴ쬴꼴휴\ue4cb⌴꼴\ue4cb㼴ꌴ무꼴"
                        );
                        var10001 < ((-1855471805 | -1584882520 | 12) & 167772172);
                        var10001 += (60762537 >> 46185438 | 1) & 1295492333
                     ) {
                        int var66 = 0<"JNT",-2038060259,"蟇ߖ蟊ߏ螺ߐ","甿畽甽畩","\u0098tÈtﾨ t¨\u008cﾨ<À¸\u0094¨\u008c\ufff8Ä\u0094 \u0080\u0084¸",795607312>(
                              var10002, var10001
                           )
                           ^ 180;
                        int var127 = (var66 & 65408) >> 7;
                        int var67 = ((var66 & 65408) >> 7 | var66 << 9) ^ 247;
                        int var128 = ((((var66 & 65408) >> 7 | var66 << 9) ^ 247) & 65528) >> 3;
                        char var68 = (char)(((((var127 | var66 << 9) ^ 247) & 65528) >> 3 | (((var66 & 65408) >> 7 | var66 << 9) ^ 247) << 13) + 57);
                        0<"JNT",-2038060259,"蟏蟈ߐ螷ߖ蟊ߏ螺ߐ","甿畽畩甽疓","\u0098tÈtﾨ t¨\u008cﾨ<À¸\u0094¨\u008c\ufff8Ä\u0094 \u0080\u0084¸",795607313>(
                           var10002, var10001, (char)((var128 | var67 << 13) + 57)
                        );
                     }

                     var12 = (Class_105)0<"JNT",-1817406556,"\u07bc蟖ߑ蟖ߐ\u07b9","甿疇疻疭痓疭畁症疭痃疱畁疉痗痋疽痃疱留疛甽疓","\u008c¸",795607275>(
                        0<"JNT",-2038060259,"ߐ蟑螿ߐߏ蟖ߑ蟕","甿甽疇疻疭痓疭畁症疭痃疱畁疉痗痋疽痃疱留","\u0098tÈtﾨ t¨\u008cﾨ<À¸\u0094¨\u008c\ufff8Ä\u0094 \u0080\u0084¸",795607266>(
                           var10002
                        ),
                        false
                     );
                     var29 = -946580875 - (-1442756552 | 100691963) ^ 429056634;
                     var43 = (StringBuilder)0<"JNT",-1817406556,"\u07bc蟖ߑ蟖ߐ\u07b9","甿疇疻疭痓疭畁症疭痃疱畁疉痗痋疽痃疱留甽疓","\u0098tÈtﾨ t¨\u008cﾨ<À¸\u0094¨\u008c\ufff8Ä\u0094 \u0080\u0084¸",795607280>(
                        "\u001f&耪耧老 老')** 耪耧老-耥&耪老,).老耨&')耪耪&'耯老耯)老耯耥&老/&耨耮&耨"
                     );
                     break;
                  case -1370952442:
                  default:
                     var10000.field_2283 = 0<"JNT",-2038060259,"蟊蟐߈","甿疇疻疭痓疭畁症疭痃疱畁疉痗痋疽痃疱留甽疇疱痋留","\u008c¸",795607255>(
                        var12,
                        0<"JNT",-2038060259,"ߐ蟑螿ߐߏ蟖ߑ蟕","甿甽疇疻疭痓疭畁症疭痃疱畁疉痗痋疽痃疱留","\u0098tÈtﾨ t¨\u008cﾨ<À¸\u0094¨\u008c\ufff8Ä\u0094 \u0080\u0084¸",795607310>(
                           var10002
                        )
                     );
                     var10001 = (-624548076 << -1597852625 | 0) & 208974211;

                     for (var10002 = (StringBuilder)0<"JNT",-1817406556,"\u07bc蟖ߑ蟖ߐ\u07b9","甿疇疻疭痓疭畁症疭痃疱畁疉痗痋疽痃疱留甽疓","\u0098tÈtﾨ t¨\u008cﾨ<À¸\u0094¨\u008c\ufff8Ä\u0094 \u0080\u0084¸",795607276>(
                           "۴ݰظ۠ݴݜݰظۄݴݬݬܼݰ݈"
                        );
                        var10001 < ((523645702 + 2083069272 | 13) & 1151345679);
                        var10001 += 630816285 + (-609911141 >>> 340659822) ^ 631041203
                     ) {
                        char var57 = 0<"JNT",-2038060259,"蟇ߖ蟊ߏ螺ߐ","甿畽甽畩","\u0098tÈtﾨ t¨\u008cﾨ<À¸\u0094¨\u008c\ufff8Ä\u0094 \u0080\u0084¸",795607300>(
                           var10002, var10001
                        );
                        int var122 = (var57 & '￼') >> 2;
                        int var58 = ((var57 & '￼') >> 2 | var57 << 14) - 248 + 25;
                        int var123 = (((var57 & '￼') >> 2 | var57 << 14) - 248 + 25 & 65535) >> 0;
                        char var59 = (char)((((var122 | var57 << 14) - 248 + 25 & 65535) >> 0 | ((var57 & '￼') >> 2 | var57 << 14) - 248 + 25 << 16) - 143);
                        0<"JNT",-2038060259,"蟏蟈ߐ螷ߖ蟊ߏ螺ߐ","甿畽畩甽疓","\u0098tÈtﾨ t¨\u008cﾨ<À¸\u0094¨\u008c\ufff8Ä\u0094 \u0080\u0084¸",795607301>(
                           var10002, var10001, (char)((var123 | var58 << 16) - 143)
                        );
                     }

                     String var15 = 0<"JNT",-2038060259,"ߐ蟑螿ߐߏ蟖ߑ蟕","甿甽疇疻疭痓疭畁症疭痃疱畁疉痗痋疽痃疱留","\u0098tÈtﾨ t¨\u008cﾨ<À¸\u0094¨\u008c\ufff8Ä\u0094 \u0080\u0084¸",795607283>(
                        var10002
                     );
                     int var33 = 412779859 * -724730673 ^ 1023214109;

                     for (var43 = (StringBuilder)0<"JNT",-1817406556,"\u07bc蟖ߑ蟖ߐ\u07b9","甿疇疻疭痓疭畁症疭痃疱畁疉痗痋疽痃疱留甽疓","\u0098tÈtﾨ t¨\u008cﾨ<À¸\u0094¨\u008c\ufff8Ä\u0094 \u0080\u0084¸",795607288>(
                           "罹ὢ罡뽡뽞ί㽹"
                        );
                        var33 < (-1248699935 >> (-65788589 >>> -1248699935) ^ -2438869);
                        var33 += 975068297 * -418347722 ^ 1879749095
                     ) {
                        int var95 = 0<"JNT",-2038060259,"蟇ߖ蟊ߏ螺ߐ","甿畽甽畩","\u0098tÈtﾨ t¨\u008cﾨ<À¸\u0094¨\u008c\ufff8Ä\u0094 \u0080\u0084¸",795607282>(
                              var43, var33
                           )
                           + 'o';
                        char var96 = (char)((((var95 & 57344) >> 13 | var95 << 3) + 150 ^ 142) + 216);
                        0<"JNT",-2038060259,"蟏蟈ߐ螷ߖ蟊ߏ螺ߐ","甿畽畩甽疓","\u0098tÈtﾨ t¨\u008cﾨ<À¸\u0094¨\u008c\ufff8Ä\u0094 \u0080\u0084¸",795607291>(
                           var43, var33, (char)((((var95 & 57344) >> 13 | var95 << 3) + 150 ^ 142) + 216)
                        );
                     }

                     Class_168 var16 = (Class_168)0<"JNT",-1817406556,"\u07bc蟖ߑ蟖ߐ\u07b9","甿疇疻疭痓疭畁症疭痃疱畁疉痗痋疽痃疱留疇疻疭痓疭畁症疭痃疱畁疉痗痋疽痃疱留甽疓","\u009c´",795607252>(
                        var15,
                        0<"JNT",-2038060259,"ߐ蟑螿ߐߏ蟖ߑ蟕","甿甽疇疻疭痓疭畁症疭痃疱畁疉痗痋疽痃疱留","\u0098tÈtﾨ t¨\u008cﾨ<À¸\u0094¨\u008c\ufff8Ä\u0094 \u0080\u0084¸",795607263>(
                           var43
                        )
                     );
                     int var35 = 828874457 ^ 828874457 ^ 0;

                     for (var43 = (StringBuilder)0<"JNT",-1817406556,"\u07bc蟖ߑ蟖ߐ\u07b9","甿疇疻疭痓疭畁症疭痃疱畁疉痗痋疽痃疱留甽疓","\u0098tÈtﾨ t¨\u008cﾨ<À¸\u0094¨\u008c\ufff8Ä\u0094 \u0080\u0084¸",795607253>(
                           "ƎƢƟŚƝƩƧƧƛƨƞŚƮƩŚƭƟƨƞŚƱƢƟƨŚƳƩƯŚƬƟƝƩƨƨƟƝƮ"
                        );
                        var35 < (1142236340 * -87735420 ^ -1442445066);
                        var35 += (-1494118700 << -1494118700 | 1) & 314277247
                     ) {
                        int var99 = 0<"JNT",-2038060259,"蟇ߖ蟊ߏ螺ߐ","甿畽甽畩","\u0098tÈtﾨ t¨\u008cﾨ<À¸\u0094¨\u008c\ufff8Ä\u0094 \u0080\u0084¸",795607304>(
                              var43, var35
                           )
                           + '9'
                           - 144
                           - 227;
                        int var142 = (var99 & 0) >> 16;
                        int var100 = (var99 & 0) >> 16 | var99 << 0;
                        int var143 = (((var99 & 0) >> 16 | var99 << 0) & 65535) >> 0;
                        char var101 = (char)(((var142 | var99 << 0) & 65535) >> 0 | ((var99 & 0) >> 16 | var99 << 0) << 16);
                        0<"JNT",-2038060259,"蟏蟈ߐ螷ߖ蟊ߏ螺ߐ","甿畽畩甽疓","\u0098tÈtﾨ t¨\u008cﾨ<À¸\u0094¨\u008c\ufff8Ä\u0094 \u0080\u0084¸",795607305>(
                           var43, var35, (char)(var143 | var100 << 16)
                        );
                     }

                     this.field_2284 = 0<"JNT",-2038060259,"蟒ߔ","甿疇疻疭痓疭畁症疭痃疱畁疉痗痋疽痃疱留甽疇疹痍留","\u009c´",795607259>(
                        var16,
                        0<"JNT",-2038060259,"ߐ蟑螿ߐߏ蟖ߑ蟕","甿甽疇疻疭痓疭畁症疭痃疱畁疉痗痋疽痃疱留","\u0098tÈtﾨ t¨\u008cﾨ<À¸\u0094¨\u008c\ufff8Ä\u0094 \u0080\u0084¸",795607250>(
                           var43
                        )
                     );
                     this.field_2287 = -1;
                     Class_168 var4 = 1<"JNT",-833791763,"㠬䊬䆬","\uf12f\uf19f\uf19f","ҭҝݭऽझؽ",539880961>(this);
                     Class_105 var17 = 1<"JNT",-833791763,"㲬㦬","\uf12f\uf19f\uf19f","ҭҝݭࡽ্ؽ",539880966>(this);
                     0<"JNT",-911206568,"ߏ蟈蟒蟐蟖ߏ蟈߁蟑ߑ߁蟐ߔߔ","甿疇疻疭痓疭畁症疭痃疱畁疁疫疻疵疩痗留甽疇疻疭痓疭畁症疭痃疱畁疁疫疻疵疩痗留","\u0098tÈtﾨÄÀ\u0094 ﾨ,x\u0098\u0084|À¼",795607262>(var17);
                     0<"JNT",-2038060259,"ߑࠛ蟏","甿疇疻疭痓疭畁痕痗疽症畁疳痕痃疩痗疽痁痃畁疉痕痏痏症疽疵痋留甽疇痍疵疵留","\u009c´",795607271>(var4, var17::ax);
                     0<"JNT",-2038060259,"蟒蟐","甿疙疇痍疵疵留甽疓","tØØ",795607272>(
                        this,
                        new Class_271[]{
                           1<"JNT",-833791763,"䌬㢬","\uf12f\uf19f\uf19f","ҭҝݭ࣭ࢽؽ",539881013>(this),
                           1<"JNT",-833791763,"㰬㤬䎬","\uf12f\uf19f\uf19f","ҭҝݭࡽ্ؽ",539881002>(this),
                           1<"JNT",-833791763,"㲬㦬","\uf12f\uf19f\uf19f","ҭҝݭࡽ্ؽ",539880955>(this),
                           1<"JNT",-833791763,"㠬䊬䆬","\uf12f\uf19f\uf19f","ҭҝݭऽझؽ",539880952>(this)
                        }
                     );
                     return;
               }
            }

            var1 = (1396541759 + -1154211397 | 334645001) & 938702701;
         }
      }
   }

   // $VF: renamed from: xbd () double
   public double method_1909() {
      return 0<"JNT",-2038060259,"蟊ߒߑ","甿甽畷","\u0080|",795607278>(1<"JNT",-833791763,"䌬㢬","\uf12f\uf19f\uf19f","ҭҝݭ࣭ࢽؽ",539881014>(this));
   }

   // $VF: renamed from: dyh () boolean
   public boolean method_1910() {
      return 0<"JNT",-2038060259,"蟊ࠞ","甿甽疛","\u008c¸",795607244>(1<"JNT",-833791763,"㰬㤬䎬","\uf12f\uf19f\uf19f","ҭҝݭࡽ্ؽ",539880996>(this));
   }

   // $VF: renamed from: er (Class_85) void
   @Class_21
   public void method_1911(Class_85 var1) {
      1<"JNT",278683473,"䌬䎬㦬","\uf12f\uf19f\uf19f","ҭҝݭऍࣝ৭ӽढ़࢝ऍࣝࢽ্ࠝࢍ৭ӽࢽ७ࠝঽঽ߽֍ֽ֝ؽ",539881003>(
         this, 0<"JNT",-2038060259,"蟕蠝蟈","甿甽疇痃疵痗畁病疽痃疵疩痋疭疳痗畁疩症疭痉痉疡畓畉畝留","\u0088¬´",795607245>(var1)
      );
      1<"JNT",278683473,"㪬㤬","\uf12f\uf19f\uf19f","ҭҝݭऍࣝ৭ӽढ़࢝ऍࣝࢽ্ࠝࢍ৭ӽࢽ७ࠝঽঽ߽֍\u05ed\u05cdؽ",539881001>(
         this, 0<"JNT",-2038060259,"蠝蠞蟈","甿甽疇痃疵痗畁病疽痃疵疩痋疭疳痗畁疩症疭痉痉疡畓畗畋留","\u0088¬´",795607219>(var1)
      );
   }

   // $VF: renamed from: aw (Class_123) void
   @Class_21
   public void method_1912(Class_123 var1) {
      int var2 = 113145317;
      if (0<"JNT",-2038060259,"蟊ࠞ","甿甽疛","\u008c¸",795607221>(1<"JNT",-833791763,"㲬㦬","\uf12f\uf19f\uf19f","ҭҝݭࡽ্ؽ",539880989>(this))) {
         var2 = 2089278310;

         while (true) {
            switch (((var2 + 1036145400 ^ 811266288) - 769628238 + 741393067 ^ 1210815665) - 1620939718) {
               case 1560698227:
                  1<"JNT",278683473,"䂬䀬䈬","\uf12f\uf19f\uf19f","ҭҝڝ",539880995>(this, 20);
                  return;
               case 1605110260:
               default:
                  if (0<"JNT",-2038060259,"蟖蟏螸蟔ߒߐ蠞","甿甽疛","\u0098tÈtﾨ t¨\u008cﾨ<À¸\u0094¨\u008c",795607231>(
                     0<"JNT",-2038060259,"蟓蟓","甿甽疇疻疭痓疭畁症疭痃疱畁疉痗痋疽痃疱留","\u009c´",795607222>(
                        1<"JNT",-833791763,"㠬䊬䆬","\uf12f\uf19f\uf19f","ҭҝݭऽझؽ",539881006>(this)
                     )
                  )) {
                     return;
                  }

                  var2 = -773831868 * -773831868 ^ 1493684979;
            }
         }
      }
   }

   // $VF: renamed from: gd (Class_207) void
   @Class_21
   public void method_1913(Class_207 var1) {
      int var3 = 1589556068;
      if (1<"JNT",-833791763,"䂬䀬䈬","\uf12f\uf19f\uf19f","ҭҝڝ",539880919>(this) >= 0) {
         var3 = 339363201 << -1193304345 ^ 189551661;

         while (true) {
            switch ((var3 + 1798965846 + 933428808 - 384531288 - 1709105259 ^ 1140279417) + 1643883039) {
               case -512642032:
                  if (1<"JNT",-833791763,"䂬䀬䈬","\uf12f\uf19f\uf19f","ҭҝڝ",539880906>(this) > 0) {
                     1<"JNT",278683473,"䂬䀬䈬","\uf12f\uf19f\uf19f","ҭҝڝ",539880984>(
                        this, 1<"JNT",-833791763,"䂬䀬䈬","\uf12f\uf19f\uf19f","ҭҝڝ",539880987>(this) - 1
                     );
                     return;
                  }

                  var3 = 256002529 + (347716945 >>> -1538448790) ^ 1632184143;
                  break;
               case 970059170:
               default:
                  1<"JNT",278683473,"䂬䀬䈬","\uf12f\uf19f\uf19f","ҭҝڝ",539880992>(this, -1);
                  String var2 = 0<"JNT",-2038060259,"蟓蟓","甿甽疇疻疭痓疭畁症疭痃疱畁疉痗痋疽痃疱留","\u009c´",795607233>(
                     1<"JNT",-833791763,"㠬䊬䆬","\uf12f\uf19f\uf19f","ҭҝݭऽझؽ",539880993>(this)
                  );
                  if (1<"JNT",-833791763,"㪬㰬㨬㶬㦬㜬\u202c⌬€↬","\uecdf\ued6f\uf1ff\ue8df\uecef\uecaf\uecdf\ued6f\uf10f\uf21f\uf12f\ued5f\uf1ff\ue8df\uf10f\uec7f\uf12f\uf20f\uf20f\uf7cf\uee0f\uee2f\uedbf","ҭҝݭऍࣝ৭ӽढ़࢝ऍࣝࢽ্ࠝࢍ৭ӽࢽ७ࠝঽঽ߽ս\u05ed֍ؽ",539880916>(
                           1<"JNT",-833791763,"㶬䂬","\uf12f\uf19f\uf19f","ҭҝݭऍࣝ৭ӽढ़࢝ऍࣝࢽ্ࠝࢍ৭ӽࢽ७ࠝঽঽֽ߽ԝԭؽ",539880999>(this)
                        )
                        != null
                     && !0<"JNT",-2038060259,"蟖蟏螸蟔ߒߐ蠞","甿甽疛","\u0098tÈtﾨ t¨\u008cﾨ<À¸\u0094¨\u008c",795607196>(var2)) {
                     var3 = -458895333 ^ 1932152987;
                  } else {
                     var3 = (-1214153573 & -1214153573 | 808686410) & -1099705490;
                  }

                  while (true) {
                     switch (var3 - 1381868914 - 364383453 - 1122096950 - 483226564 - 592896893 + 778813161) {
                        case -1417776512:
                           return;
                        case -622895453:
                           if (!0<"JNT",-2038060259,"蟏ߐ蟊ߏߐ蟏蟍蟖ߐߖ","甿疇疻疭痓疭畁症疭痃疱畁疉痗痋疽痃疱留甽疛","\u0098tÈtﾨ t¨\u008cﾨ<À¸\u0094¨\u008c",795607240>(var2, "/")) {
                              var3 = (887497186 & 1926151796 & 887497186 >> 1926151796 | -693602805) & -21334389;
                              continue;
                           }

                           0<"JNT",-2038060259,"蟔蟈ߐߖ蟑߈蟉߰蟰螽蟯߲","甿疇疻疭痓疭畁症疭痃疱畁疉痗痋疽痃疱留甽疓","¨\u0084Àﾨ¤\u0094¨\u0084|¸t\u0088Àﾨ| t¼¼l\uffc8ﾼ\uffc0",795607237>(
                              1<"JNT",-833791763,"㪬㰬㨬㶬㦬㜬ℬ\u242c↬↬","\uecdf\ued6f\uf1ff\ue8df\uecef\uecaf\uecdf\ued6f\uf10f\uf21f\uf12f\ued5f\uf1ff\ue8df\uf10f\uec7f\uf12f\uf20f\uf20f\uf7cf\uee4f\uedff\uee5f","ҭҝݭऍࣝ৭ӽढ़࢝ऍࣝࢽ্ࠝࢍ৭ӽࢽ७ࠝঽঽ߽֍ֽ\u05edؽ",539880908>(
                                 1<"JNT",-833791763,"㪬㰬㨬㶬㦬㜬\u202c⌬€↬","\uecdf\ued6f\uf1ff\ue8df\uecef\uecaf\uecdf\ued6f\uf10f\uf21f\uf12f\ued5f\uf1ff\ue8df\uf10f\uec7f\uf12f\uf20f\uf20f\uf7cf\uee0f\uee2f\uedbf","ҭҝݭऍࣝ৭ӽढ़࢝ऍࣝࢽ্ࠝࢍ৭ӽࢽ७ࠝঽঽ߽ս\u05ed֍ؽ",539880991>(
                                    1<"JNT",-833791763,"㶬䂬","\uf12f\uf19f\uf19f","ҭҝݭऍࣝ৭ӽढ़࢝ऍࣝࢽ্ࠝࢍ৭ӽࢽ७ࠝঽঽֽ߽ԝԭؽ",539880990>(this)
                                 )
                              ),
                              0<"JNT",-2038060259,"蟏蟐߇蟏ߐߏ蟖ߑ蟕","甿畽甽疇疻疭痓疭畁症疭痃疱畁疉痗痋疽痃疱留","\u0098tÈtﾨ t¨\u008cﾨ<À¸\u0094¨\u008c",795607236>(var2, 1)
                           );
                           break;
                        case -108809875:
                        default:
                           return;
                        case 435704878:
                           0<"JNT",-2038060259,"蟔蟈ߐߖ蟑߈蟉߰蟰螽߯螾","甿疇疻疭痓疭畁症疭痃疱畁疉痗痋疽痃疱留甽疓","¨\u0084Àﾨ¤\u0094¨\u0084|¸t\u0088Àﾨ| t¼¼l\uffc8ﾼ\uffc0",795607249>(
                              1<"JNT",-833791763,"㪬㰬㨬㶬㦬㜬ℬ\u242c↬↬","\uecdf\ued6f\uf1ff\ue8df\uecef\uecaf\uecdf\ued6f\uf10f\uf21f\uf12f\ued5f\uf1ff\ue8df\uf10f\uec7f\uf12f\uf20f\uf20f\uf7cf\uee4f\uedff\uee5f","ҭҝݭऍࣝ৭ӽढ़࢝ऍࣝࢽ্ࠝࢍ৭ӽࢽ७ࠝঽঽ߽֍ֽ\u05edؽ",539880913>(
                                 1<"JNT",-833791763,"㪬㰬㨬㶬㦬㜬\u202c⌬€↬","\uecdf\ued6f\uf1ff\ue8df\uecef\uecaf\uecdf\ued6f\uf10f\uf21f\uf12f\ued5f\uf1ff\ue8df\uf10f\uec7f\uf12f\uf20f\uf20f\uf7cf\uee0f\uee2f\uedbf","ҭҝݭऍࣝ৭ӽढ़࢝ऍࣝࢽ্ࠝࢍ৭ӽࢽ७ࠝঽঽ߽ս\u05ed֍ؽ",539880912>(
                                    1<"JNT",-833791763,"㶬䂬","\uf12f\uf19f\uf19f","ҭҝݭऍࣝ৭ӽढ़࢝ऍࣝࢽ্ࠝࢍ৭ӽࢽ७ࠝঽঽֽ߽ԝԭؽ",539880915>(this)
                                 )
                              ),
                              var2
                           );
                     }

                     var3 = 1747883101;
                  }
            }
         }
      }
   }

   // $VF: renamed from: btr () net.minecraft.class_639
   public class_639 method_1914() {
      return 1<"JNT",-833791763,"䌬䎬㦬","\uf12f\uf19f\uf19f","ҭҝݭऍࣝ৭ӽढ़࢝ऍࣝࢽ্ࠝࢍ৭ӽࢽ७ࠝঽঽ߽֍ֽ֝ؽ",539880900>(this);
   }

   // $VF: renamed from: mwv () net.minecraft.class_642
   public class_642 method_1915() {
      return 1<"JNT",-833791763,"㪬㤬","\uf12f\uf19f\uf19f","ҭҝݭऍࣝ৭ӽढ़࢝ऍࣝࢽ্ࠝࢍ৭ӽࢽ७ࠝঽঽ߽֍\u05ed\u05cdؽ",539880901>(this);
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1413(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = (var10 + 356930560 + 1870615681 + 822952197 + 792777079 + 480421684 + 447269437 ^ 1495819946) + 1167233626 + 115754915;
      MethodHandle var10000 = field_2288[(var10 + 356930560 + 1870615681 + 822952197 + 792777079 + 480421684 + 447269437 ^ 1495819946) + 1167233626 + 115754915
         ^ 1599874508];
      if (field_2288[var10001 ^ 1599874508] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = (1010450456 >>> -1448595765 | 0) & -1669310413; var23 < var13.length(); var23 += (-168459575 | -168459575 | 1) & 147767) {
            int var42 = var13.charAt(var23) + '3';
            int var10004 = (var42 & 0) >> 16;
            int var43 = (((var42 & 0) >> 16 | var42 << 0) + 86 ^ 38) + 219;
            int var87 = ((((var42 & 0) >> 16 | var42 << 0) + 86 ^ 38) + 219 & 64512) >> 10;
            var42 = (((var10004 | var42 << 0) + 86 ^ 38) + 219 & 64512) >> 10 | (((var42 & 0) >> 16 | var42 << 0) + 86 ^ 38) + 219 << 6;
            var10004 = ((var87 | var43 << 6) & 64512) >> 10;
            int var45 = (((var87 | var43 << 6) & 64512) >> 10 | var42 << 6) - 65 - 81;
            int var89 = ((((var87 | var43 << 6) & 64512) >> 10 | var42 << 6) - 65 - 81 & 63488) >> 11;
            char var46 = (char)(((var10004 | var42 << 6) - 65 - 81 & 63488) >> 11 | (((var87 | var43 << 6) & 64512) >> 10 | var42 << 6) - 65 - 81 << 5);
            var13.setCharAt(var23, (char)(var89 | var45 << 5));
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = -697680401 >>> -640422934 ^ 3512975; var29 < var16.length(); var29 += 2119520964 + 2119520964 ^ -55925367) {
            int var51 = (var16.charAt(var29) ^ 6) - 233;
            int var90 = (var51 & 65535) >> 0;
            int var52 = (var51 & 65535) >> 0 | var51 << 16;
            int var91 = (((var51 & 65535) >> 0 | var51 << 16) & 65024) >> 9;
            var51 = (((var90 | var51 << 16) & 65024) >> 9 | ((var51 & 65535) >> 0 | var51 << 16) << 7) + 170 - 220 ^ 81 ^ 89;
            var90 = (((var91 | var52 << 7) + 170 - 220 ^ 81 ^ 89) & 64512) >> 10;
            int var54 = (((var91 | var52 << 7) + 170 - 220 ^ 81 ^ 89) & 64512) >> 10 | var51 << 6;
            int var93 = (((((var91 | var52 << 7) + 170 - 220 ^ 81 ^ 89) & 64512) >> 10 | var51 << 6) & 49152) >> 14;
            char var55 = (char)(((var90 | var51 << 6) & 49152) >> 14 | ((((var91 | var52 << 7) + 170 - 220 ^ 81 ^ 89) & 64512) >> 10 | var51 << 6) << 2);
            var16.setCharAt(var29, (char)(var93 | var54 << 2));
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_17.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = (-446338771 >>> -409597789 | 0) & -1040056118; var35 < var19.length(); var35 += -1780545560 * -1470140216 ^ -657740479) {
            int var60 = var19.charAt(var35) - '4' - 169;
            char var65 = (char)(
               (
                        (
                              (
                                       (
                                             (
                                                      (
                                                            (((var60 & 65532) >> 2 | var60 << 14) + 124 - 90 + 90 & 57344) >> 13
                                                               | ((var60 & 65532) >> 2 | var60 << 14) + 124 - 90 + 90 << 3
                                                         )
                                                         & 65408
                                                   )
                                                   >> 7
                                                | (
                                                      (((var60 & 65532) >> 2 | var60 << 14) + 124 - 90 + 90 & 57344) >> 13
                                                         | ((var60 & 65532) >> 2 | var60 << 14) + 124 - 90 + 90 << 3
                                                   )
                                                   << 9
                                          )
                                          & 0
                                    )
                                    >> 16
                                 | (
                                       (
                                                (
                                                      (((var60 & 65532) >> 2 | var60 << 14) + 124 - 90 + 90 & 57344) >> 13
                                                         | ((var60 & 65532) >> 2 | var60 << 14) + 124 - 90 + 90 << 3
                                                   )
                                                   & 65408
                                             )
                                             >> 7
                                          | (
                                                (((var60 & 65532) >> 2 | var60 << 14) + 124 - 90 + 90 & 57344) >> 13
                                                   | ((var60 & 65532) >> 2 | var60 << 14) + 124 - 90 + 90 << 3
                                             )
                                             << 9
                                    )
                                    << 0
                           )
                           & 61440
                     )
                     >> 12
                  | (
                        (
                                 (
                                       (
                                                (
                                                      (((var60 & 65532) >> 2 | var60 << 14) + 124 - 90 + 90 & 57344) >> 13
                                                         | ((var60 & 65532) >> 2 | var60 << 14) + 124 - 90 + 90 << 3
                                                   )
                                                   & 65408
                                             )
                                             >> 7
                                          | (
                                                (((var60 & 65532) >> 2 | var60 << 14) + 124 - 90 + 90 & 57344) >> 13
                                                   | ((var60 & 65532) >> 2 | var60 << 14) + 124 - 90 + 90 << 3
                                             )
                                             << 9
                                    )
                                    & 0
                              )
                              >> 16
                           | (
                                 (
                                          (
                                                (((var60 & 65532) >> 2 | var60 << 14) + 124 - 90 + 90 & 57344) >> 13
                                                   | ((var60 & 65532) >> 2 | var60 << 14) + 124 - 90 + 90 << 3
                                             )
                                             & 65408
                                       )
                                       >> 7
                                    | (
                                          (((var60 & 65532) >> 2 | var60 << 14) + 124 - 90 + 90 & 57344) >> 13
                                             | ((var60 & 65532) >> 2 | var60 << 14) + 124 - 90 + 90 << 3
                                       )
                                       << 9
                              )
                              << 0
                     )
                     << 4
            );
            var19.setCharAt(
               var35,
               (char)(
                  (
                           (
                                 (
                                          (
                                                (
                                                         (
                                                               (((var60 & 65532) >> 2 | var60 << 14) + 124 - 90 + 90 & 57344) >> 13
                                                                  | ((var60 & 65532) >> 2 | var60 << 14) + 124 - 90 + 90 << 3
                                                            )
                                                            & 65408
                                                      )
                                                      >> 7
                                                   | (
                                                         (((var60 & 65532) >> 2 | var60 << 14) + 124 - 90 + 90 & 57344) >> 13
                                                            | ((var60 & 65532) >> 2 | var60 << 14) + 124 - 90 + 90 << 3
                                                      )
                                                      << 9
                                             )
                                             & 0
                                       )
                                       >> 16
                                    | (
                                          (
                                                   (
                                                         (((var60 & 65532) >> 2 | var60 << 14) + 124 - 90 + 90 & 57344) >> 13
                                                            | ((var60 & 65532) >> 2 | var60 << 14) + 124 - 90 + 90 << 3
                                                      )
                                                      & 65408
                                                )
                                                >> 7
                                             | (
                                                   (((var60 & 65532) >> 2 | var60 << 14) + 124 - 90 + 90 & 57344) >> 13
                                                      | ((var60 & 65532) >> 2 | var60 << 14) + 124 - 90 + 90 << 3
                                                )
                                                << 9
                                       )
                                       << 0
                              )
                              & 61440
                        )
                        >> 12
                     | (
                           (
                                    (
                                          (
                                                   (
                                                         (((var60 & 65532) >> 2 | var60 << 14) + 124 - 90 + 90 & 57344) >> 13
                                                            | ((var60 & 65532) >> 2 | var60 << 14) + 124 - 90 + 90 << 3
                                                      )
                                                      & 65408
                                                )
                                                >> 7
                                             | (
                                                   (((var60 & 65532) >> 2 | var60 << 14) + 124 - 90 + 90 & 57344) >> 13
                                                      | ((var60 & 65532) >> 2 | var60 << 14) + 124 - 90 + 90 << 3
                                                )
                                                << 9
                                       )
                                       & 0
                                 )
                                 >> 16
                              | (
                                    (
                                             (
                                                   (((var60 & 65532) >> 2 | var60 << 14) + 124 - 90 + 90 & 57344) >> 13
                                                      | ((var60 & 65532) >> 2 | var60 << 14) + 124 - 90 + 90 << 3
                                                )
                                                & 65408
                                          )
                                          >> 7
                                       | (
                                             (((var60 & 65532) >> 2 | var60 << 14) + 124 - 90 + 90 & 57344) >> 13
                                                | ((var60 & 65532) >> 2 | var60 << 14) + 124 - 90 + 90 << 3
                                          )
                                          << 9
                                 )
                                 << 0
                        )
                        << 4
               )
            );
         }

         Class var7 = Class.forName(var19.toString(), false, Class_17.class.getClassLoader());
         switch ((var4 + 588322165 - 2117992567 + 894019295 ^ 935323656) + 771215787 - 46378205 - 1198902477 - 13801954 + 417090961 - 1164467611) {
            case 226311431:
            case 1137570264:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 282482078:
               var10000 = var0.findConstructor(var7, var6);
               break;
            case 408467798:
               var10000 = var0.findSpecial(var7, var5, var6, Class_17.class);
               break;
            case 1255336274:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_2288[(var10 + 356930560 + 1870615681 + 822952197 + 792777079 + 480421684 + 447269437 ^ 1495819946) + 1167233626 + 115754915 ^ 1599874508] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1414(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 - 111784680 ^ 1534993795 ^ 762274626 ^ 219916987) + 86826383 ^ 1130965022 ^ 929465670) + 983995379 + 708018104;
      MethodHandle var10000 = field_2288[((var10 - 111784680 ^ 1534993795 ^ 762274626 ^ 219916987) + 86826383 ^ 1130965022 ^ 929465670) + 983995379 + 708018104
         ^ 2022583672];
      if (field_2288[var10001 ^ 2022583672] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = (1205363661 + -650055821 | 0) & -827937789; var24 < var14.length(); var24 += 1699406268 * 2037273899 ^ -1152428395) {
            char var43 = var14.charAt(var24);
            char var46 = (char)(
               (
                        (
                              (((((var43 & '￼') >> 2 | var43 << 14) - 57 - 101 - 130 ^ 45) - 31 - 146 ^ 53) & 65472) >> 6
                                 | ((((var43 & '￼') >> 2 | var43 << 14) - 57 - 101 - 130 ^ 45) - 31 - 146 ^ 53) << 10
                           )
                           & 32768
                     )
                     >> 15
                  | (
                        (((((var43 & '￼') >> 2 | var43 << 14) - 57 - 101 - 130 ^ 45) - 31 - 146 ^ 53) & 65472) >> 6
                           | ((((var43 & '￼') >> 2 | var43 << 14) - 57 - 101 - 130 ^ 45) - 31 - 146 ^ 53) << 10
                     )
                     << 1
            );
            var14.setCharAt(
               var24,
               (char)(
                  (
                           (
                                 (((((var43 & '￼') >> 2 | var43 << 14) - 57 - 101 - 130 ^ 45) - 31 - 146 ^ 53) & 65472) >> 6
                                    | ((((var43 & '￼') >> 2 | var43 << 14) - 57 - 101 - 130 ^ 45) - 31 - 146 ^ 53) << 10
                              )
                              & 32768
                        )
                        >> 15
                     | (
                           (((((var43 & '￼') >> 2 | var43 << 14) - 57 - 101 - 130 ^ 45) - 31 - 146 ^ 53) & 65472) >> 6
                              | ((((var43 & '￼') >> 2 | var43 << 14) - 57 - 101 - 130 ^ 45) - 31 - 146 ^ 53) << 10
                        )
                        << 1
               )
            );
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = 1594742433 >> 1594742433 * 1495032561 ^ 12166; var30 < var17.length(); var30 += (-862341384 >>> -862341384 | 1) & 1871244563) {
            char var51 = var17.charAt(var30);
            int var82 = (var51 & '\ufff0') >> 4;
            int var52 = ((((var51 & '\ufff0') >> 4 | var51 << '\f') ^ 59) - 147 + 70 ^ 28) + 141 + 49 + 207 ^ 44;
            int var83 = ((((((var51 & '\ufff0') >> 4 | var51 << '\f') ^ 59) - 147 + 70 ^ 28) + 141 + 49 + 207 ^ 44) & 65535) >> 0;
            var51 = (char)(
               (((((var82 | var51 << '\f') ^ 59) - 147 + 70 ^ 28) + 141 + 49 + 207 ^ 44) & 65535) >> 0
                  | (((((var51 & '\ufff0') >> 4 | var51 << '\f') ^ 59) - 147 + 70 ^ 28) + 141 + 49 + 207 ^ 44) << 16
            );
            var17.setCharAt(var30, (char)(var83 | var52 << 16));
         }

         Class var6 = Class.forName(var17.toString(), false, Class_17.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = (1029898061 << -1395120073 | 0) & 21369366; var36 < var20.length(); var36 += (-1962972173 & -31184097 | 1) & 810696773) {
            int var58 = var20.charAt(var36);
            int var84 = (var58 & 0) >> 16;
            int var59 = (((var58 & 0) >> 16 | var58 << 0) - 219 - 64 - 224 ^ 80) - 77 - 21;
            int var85 = ((((var58 & 0) >> 16 | var58 << 0) - 219 - 64 - 224 ^ 80) - 77 - 21 & 65504) >> 5;
            var58 = (((var84 | var58 << 0) - 219 - 64 - 224 ^ 80) - 77 - 21 & 65504) >> 5
               | (((var58 & 0) >> 16 | var58 << 0) - 219 - 64 - 224 ^ 80) - 77 - 21 << 11;
            var84 = ((var85 | var59 << 11) & 49152) >> 14;
            int var61 = ((var85 | var59 << 11) & 49152) >> 14 | var58 << 2;
            int var87 = ((((var85 | var59 << 11) & 49152) >> 14 | var58 << 2) & 65534) >> 1;
            char var62 = (char)(((var84 | var58 << 2) & 65534) >> 1 | (((var85 | var59 << 11) & 49152) >> 14 | var58 << 2) << 15);
            var20.setCharAt(var36, (char)(var87 | var61 << 15));
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_17.class.getClassLoader()).returnType();
         switch (((var4 ^ 1209779223) - 1405384634 - 1773355597 - 609570993 - 1872398734 - 417310239 - 1771190443 ^ 690981843 ^ 22548646) - 1866983883) {
            case 717408468:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            case 870877495:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            case 1032964472:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            case 1188796796:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_2288[((var10 - 111784680 ^ 1534993795 ^ 762274626 ^ 219916987) + 86826383 ^ 1130965022 ^ 929465670) + 983995379 + 708018104 ^ 2022583672] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
