import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;
import java.util.HashMap;
import java.util.Iterator;
import java.util.List;
import java.util.Map;
import net.minecraft.class_2248;
import net.minecraft.class_2338;
import net.minecraft.class_2586;
import net.minecraft.class_2627;
import net.minecraft.class_2669;
import net.minecraft.class_2818;

public class Class_124 extends Class_342 {
   // $VF: renamed from: qm java.util.List
   public static List field_2133 = 0<"JNT",-784734612,"㾺徹","㽍흊彊佋\u074b꽋\u074b睍彋\u074b潋㝋睍睊ཋ佋❋ᝋ齋흍䝍彊佋\u074b꽋\u074b睍ꝋ齋䝋彋睍彊䝋靋齋흍","藾腾课腾柾譾諾蕾蛾柾盾蕾詾諾",748128803>(
      new class_2248[]{
         1<"JNT",-289820086,"읎쩎왎쵎앎쁎鉎酎酎鑎镎","䐌䏨䐤䌐䐈䏸䐌䏨䏤䐜䏜䏬䐤䌐䏤䐄䏜䐠䐠䏔䌠䌠䌈䌰","勶囶\ue2f6櫷䛷苷滶曷囷櫷䛷㻷竷㛷䫷苷滶㻷拷㛷绷绷\u2ef7競競苶鋶黶",-1466488551>(),
         1<"JNT",-289820086,"읎쩎왎쵎앎쁎鉎酎鑎饎酎","䐌䏨䐤䌐䐈䏸䐌䏨䏤䐜䏜䏬䐤䌐䏤䐄䏜䐠䐠䏔䌠䌠䌈䌰","勶囶\ue2f6櫷䛷苷滶曷囷櫷䛷㻷竷㛷䫷苷滶㻷拷㛷绷绷\u2ef7競競苶鋶黶",-1466488708>(),
         1<"JNT",-289820086,"읎쩎왎쵎앎쁎鉎酎镎镎鑎","䐌䏨䐤䌐䐈䏸䐌䏨䏤䐜䏜䏬䐤䌐䏤䐄䏜䐠䐠䏔䌠䌠䌈䌰","勶囶\ue2f6櫷䛷苷滶曷囷櫷䛷㻷竷㛷䫷苷滶㻷拷㛷绷绷\u2ef7競競苶鋶黶",-1466488549>(),
         1<"JNT",-289820086,"읎쩎왎쵎앎쁎鉎酎靎酎鑎","䐌䏨䐤䌐䐈䏸䐌䏨䏤䐜䏜䏬䐤䌐䏤䐄䏜䐠䐠䏔䌠䌠䌈䌰","勶囶\ue2f6櫷䛷苷滶曷囷櫷䛷㻷竷㛷䫷苷滶㻷拷㛷绷绷\u2ef7競競苶鋶黶",-1466488706>(),
         1<"JNT",-289820086,"읎쩎왎쵎앎쁎鉎酎鉎驎驎","䐌䏨䐤䌐䐈䏸䐌䏨䏤䐜䏜䏬䐤䌐䏤䐄䏜䐠䐠䏔䌠䌠䌈䌰","勶囶\ue2f6櫷䛷苷滶曷囷櫷䛷㻷竷㛷䫷苷滶㻷拷㛷绷绷\u2ef7競競苶鋶黶",-1466488707>(),
         1<"JNT",-289820086,"읎쩎왎쵎앎쁎鉎酎镎酎顎","䐌䏨䐤䌐䐈䏸䐌䏨䏤䐜䏜䏬䐤䌐䏤䐄䏜䐠䐠䏔䌠䌠䌈䌰","勶囶\ue2f6櫷䛷苷滶曷囷櫷䛷㻷竷㛷䫷苷滶㻷拷㛷绷绷\u2ef7競競苶鋶黶",-1466488704>(),
         1<"JNT",-289820086,"읎쩎왎쵎앎쁎鉎酎酎靎鑎","䐌䏨䐤䌐䐈䏸䐌䏨䏤䐜䏜䏬䐤䌐䏤䐄䏜䐠䐠䏔䌠䌠䌈䌰","勶囶\ue2f6櫷䛷苷滶曷囷櫷䛷㻷竷㛷䫷苷滶㻷拷㛷绷绷\u2ef7競競苶鋶黶",-1466488705>(),
         1<"JNT",-289820086,"읎쩎왎쵎앎쁎鉎酎鍎酎鑎","䐌䏨䐤䌐䐈䏸䐌䏨䏤䐜䏜䏬䐤䌐䏤䐄䏜䐠䐠䏔䌠䌠䌈䌰","勶囶\ue2f6櫷䛷苷滶曷囷櫷䛷㻷竷㛷䫷苷滶㻷拷㛷绷绷\u2ef7競競苶鋶黶",-1466488702>(),
         1<"JNT",-289820086,"읎쩎왎쵎앎쁎鉎酎靎酎酎","䐌䏨䐤䌐䐈䏸䐌䏨䏤䐜䏜䏬䐤䌐䏤䐄䏜䐠䐠䏔䌠䌠䌈䌰","勶囶\ue2f6櫷䛷苷滶曷囷櫷䛷㻷竷㛷䫷苷滶㻷拷㛷绷绷\u2ef7競競苶鋶黶",-1466488703>(),
         1<"JNT",-289820086,"읎쩎왎쵎앎쁎鉎酎鍎顎陎","䐌䏨䐤䌐䐈䏸䐌䏨䏤䐜䏜䏬䐤䌐䏤䐄䏜䐠䐠䏔䌠䌠䌈䌰","勶囶\ue2f6櫷䛷苷滶曷囷櫷䛷㻷竷㛷䫷苷滶㻷拷㛷绷绷\u2ef7競競苶鋶黶",-1466488700>(),
         1<"JNT",-289820086,"읎쩎왎쵎앎쁎鉎酎酎陎鉎","䐌䏨䐤䌐䐈䏸䐌䏨䏤䐜䏜䏬䐤䌐䏤䐄䏜䐠䐠䏔䌠䌠䌈䌰","勶囶\ue2f6櫷䛷苷滶曷囷櫷䛷㻷竷㛷䫷苷滶㻷拷㛷绷绷\u2ef7競競苶鋶黶",-1466488701>(),
         1<"JNT",-289820086,"읎쩎왎쵎앎쁎鉎酎鉎镎酎","䐌䏨䐤䌐䐈䏸䐌䏨䏤䐜䏜䏬䐤䌐䏤䐄䏜䐠䐠䏔䌠䌠䌈䌰","勶囶\ue2f6櫷䛷苷滶曷囷櫷䛷㻷竷㛷䫷苷滶㻷拷㛷绷绷\u2ef7競競苶鋶黶",-1466488698>(),
         1<"JNT",-289820086,"읎쩎왎쵎앎쁎鉎酎鑎鍎酎","䐌䏨䐤䌐䐈䏸䐌䏨䏤䐜䏜䏬䐤䌐䏤䐄䏜䐠䐠䏔䌠䌠䌈䌰","勶囶\ue2f6櫷䛷苷滶曷囷櫷䛷㻷竷㛷䫷苷滶㻷拷㛷绷绷\u2ef7競競苶鋶黶",-1466488699>(),
         1<"JNT",-289820086,"읎쩎왎쵎앎쁎鉎酎陎鑎鍎","䐌䏨䐤䌐䐈䏸䐌䏨䏤䐜䏜䏬䐤䌐䏤䐄䏜䐠䐠䏔䌠䌠䌈䌰","勶囶\ue2f6櫷䛷苷滶曷囷櫷䛷㻷竷㛷䫷苷滶㻷拷㛷绷绷\u2ef7競競苶鋶黶",-1466488696>(),
         1<"JNT",-289820086,"읎쩎왎쵎앎쁎鉎酎鍎靎饎","䐌䏨䐤䌐䐈䏸䐌䏨䏤䐜䏜䏬䐤䌐䏤䐄䏜䐠䐠䏔䌠䌠䌈䌰","勶囶\ue2f6櫷䛷苷滶曷囷櫷䛷㻷竷㛷䫷苷滶㻷拷㛷绷绷\u2ef7競競苶鋶黶",-1466488697>(),
         1<"JNT",-289820086,"읎쩎왎쵎앎쁎鉎酎靎酎陎","䐌䏨䐤䌐䐈䏸䐌䏨䏤䐜䏜䏬䐤䌐䏤䐄䏜䐠䐠䏔䌠䌠䌈䌰","勶囶\ue2f6櫷䛷苷滶曷囷櫷䛷㻷竷㛷䫷苷滶㻷拷㛷绷绷\u2ef7競競苶鋶黶",-1466488694>(),
         1<"JNT",-289820086,"읎쩎왎쵎앎쁎鉎酎鑎顎鑎","䐌䏨䐤䌐䐈䏸䐌䏨䏤䐜䏜䏬䐤䌐䏤䐄䏜䐠䐠䏔䌠䌠䌈䌰","勶囶\ue2f6櫷䛷苷滶曷囷櫷䛷㻷竷㛷䫷苷滶㻷拷㛷绷绷\u2ef7競競苶鋶黶",-1466488695>(),
         1<"JNT",-289820086,"읎쩎왎쵎앎쁎鉎酎酎陎陎","䐌䏨䐤䌐䐈䏸䐌䏨䏤䐜䏜䏬䐤䌐䏤䐄䏜䐠䐠䏔䌠䌠䌈䌰","勶囶\ue2f6櫷䛷苷滶曷囷櫷䛷㻷竷㛷䫷苷滶㻷拷㛷绷绷\u2ef7競競苶鋶黶",-1466488724>(),
         1<"JNT",-289820086,"읎쩎왎쵎앎쁎鉎酎酎靎饎","䐌䏨䐤䌐䐈䏸䐌䏨䏤䐜䏜䏬䐤䌐䏤䐄䏜䐠䐠䏔䌠䌠䌈䌰","勶囶\ue2f6櫷䛷苷滶曷囷櫷䛷㻷竷㛷䫷苷滶㻷拷㛷绷绷\u2ef7競競苶鋶黶",-1466488693>(),
         1<"JNT",-289820086,"읎쩎왎쵎앎쁎鉎酎鑎顎鉎","䐌䏨䐤䌐䐈䏸䐌䏨䏤䐜䏜䏬䐤䌐䏤䐄䏜䐠䐠䏔䌠䌠䌈䌰","勶囶\ue2f6櫷䛷苷滶曷囷櫷䛷㻷竷㛷䫷苷滶㻷拷㛷绷绷\u2ef7競競苶鋶黶",-1466488722>(),
         1<"JNT",-289820086,"읎쩎왎쵎앎쁎鉎靎鑎鍎饎","䐌䏨䐤䌐䐈䏸䐌䏨䏤䐜䏜䏬䐤䌐䏤䐄䏜䐠䐠䏔䌠䌠䌈䌰","勶囶\ue2f6櫷䛷苷滶曷囷櫷䛷㻷竷㛷䫷苷滶㻷拷㛷绷绷\u2ef7競競苶鋶黶",-1466488723>(),
         1<"JNT",-289820086,"읎쩎왎쵎앎쁎鉎酎鉎饎鉎","䐌䏨䐤䌐䐈䏸䐌䏨䏤䐜䏜䏬䐤䌐䏤䐄䏜䐠䐠䏔䌠䌠䌈䌰","勶囶\ue2f6櫷䛷苷滶曷囷櫷䛷㻷竷㛷䫷苷滶㻷拷㛷绷绷\u2ef7競競苶鋶黶",-1466488720>(),
         1<"JNT",-289820086,"읎쩎왎쵎앎쁎鉎靎鑎鑎鑎","䐌䏨䐤䌐䐈䏸䐌䏨䏤䐜䏜䏬䐤䌐䏤䐄䏜䐠䐠䏔䌠䌠䌈䌰","勶囶\ue2f6櫷䛷苷滶曷囷櫷䛷㻷竷㛷䫷苷滶㻷拷㛷绷绷\u2ef7競競苶鋶黶",-1466488721>(),
         1<"JNT",-289820086,"읎쩎왎쵎앎쁎鉎靎鑎鑎镎","䐌䏨䐤䌐䐈䏸䐌䏨䏤䐜䏜䏬䐤䌐䏤䐄䏜䐠䐠䏔䌠䌠䌈䌰","勶囶\ue2f6櫷䛷苷滶曷囷櫷䛷㻷竷㛷䫷苷滶㻷拷㛷绷绷\u2ef7競競苶鋶黶",-1466488718>(),
         1<"JNT",-289820086,"읎쩎왎쵎앎쁎鉎酎鍎靎酎","䐌䏨䐤䌐䐈䏸䐌䏨䏤䐜䏜䏬䐤䌐䏤䐄䏜䐠䐠䏔䌠䌠䌈䌰","勶囶\ue2f6櫷䛷苷滶曷囷櫷䛷㻷竷㛷䫷苷滶㻷拷㛷绷绷\u2ef7競競苶鋶黶",-1466488719>(),
         1<"JNT",-289820086,"읎쩎왎쵎앎쁎鉎酎镎饎陎","䐌䏨䐤䌐䐈䏸䐌䏨䏤䐜䏜䏬䐤䌐䏤䐄䏜䐠䐠䏔䌠䌠䌈䌰","勶囶\ue2f6櫷䛷苷滶曷囷櫷䛷㻷竷㛷䫷苷滶㻷拷㛷绷绷\u2ef7競競苶鋶黶",-1466488716>(),
         1<"JNT",-289820086,"읎쩎왎쵎앎쁎鉎酎陎靎酎","䐌䏨䐤䌐䐈䏸䐌䏨䏤䐜䏜䏬䐤䌐䏤䐄䏜䐠䐠䏔䌠䌠䌈䌰","勶囶\ue2f6櫷䛷苷滶曷囷櫷䛷㻷竷㛷䫷苷滶㻷拷㛷绷绷\u2ef7競競苶鋶黶",-1466488717>(),
         1<"JNT",-289820086,"읎쩎왎쵎앎쁎鉎酎靎鉎陎","䐌䏨䐤䌐䐈䏸䐌䏨䏤䐜䏜䏬䐤䌐䏤䐄䏜䐠䐠䏔䌠䌠䌈䌰","勶囶\ue2f6櫷䛷苷滶曷囷櫷䛷㻷竷㛷䫷苷滶㻷拷㛷绷绷\u2ef7競競苶鋶黶",-1466488650>(),
         1<"JNT",-289820086,"읎쩎왎쵎앎쁎鉎酎鑎鉎鍎","䐌䏨䐤䌐䐈䏸䐌䏨䏤䐜䏜䏬䐤䌐䏤䐄䏜䐠䐠䏔䌠䌠䌈䌰","勶囶\ue2f6櫷䛷苷滶曷囷櫷䛷㻷竷㛷䫷苷滶㻷拷㛷绷绷\u2ef7競競苶鋶黶",-1466488651>(),
         1<"JNT",-289820086,"읎쩎왎쵎앎쁎鉎酎鍎鍎饎","䐌䏨䐤䌐䐈䏸䐌䏨䏤䐜䏜䏬䐤䌐䏤䐄䏜䐠䐠䏔䌠䌠䌈䌰","勶囶\ue2f6櫷䛷苷滶曷囷櫷䛷㻷竷㛷䫷苷滶㻷拷㛷绷绷\u2ef7競競苶鋶黶",-1466488648>(),
         1<"JNT",-289820086,"읎쩎왎쵎앎쁎鉎酎鍎酎酎","䐌䏨䐤䌐䐈䏸䐌䏨䏤䐜䏜䏬䐤䌐䏤䐄䏜䐠䐠䏔䌠䌠䌈䌰","勶囶\ue2f6櫷䛷苷滶曷囷櫷䛷㻷竷㛷䫷苷滶㻷拷㛷绷绷\u2ef7競競苶鋶黶",-1466488649>(),
         1<"JNT",-289820086,"읎쩎왎쵎앎쁎鉎酎鑎鑎鑎","䐌䏨䐤䌐䐈䏸䐌䏨䏤䐜䏜䏬䐤䌐䏤䐄䏜䐠䐠䏔䌠䌠䌈䌰","勶囶\ue2f6櫷䛷苷滶曷囷櫷䛷㻷竷㛷䫷苷滶㻷拷㛷绷绷\u2ef7競競苶鋶黶",-1466488646>()
      }
   );
   // $VF: renamed from: jv Class_49
   public Class_49 field_2134;
   // $VF: renamed from: zv Class_105
   public Class_105 field_2135;
   // $VF: renamed from: ue Class_65
   public Class_65 field_2136;
   // $VF: renamed from: bzb java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_2137 = new MethodHandle[161];

   public Class_124() {
      int var10001 = (1737527534 ^ (1891464323 | -62221263) | 0) & 75532802;

      StringBuilder var10002;
      for (var10002 = (StringBuilder)0<"JNT",528103410,"鿄ﾺ徺ﾺ龻忄","㽍彊佋\u074b꽋\u074b睍彋\u074b潋㝋睍靊齋轋䝋潋㝋흍䝍꽊","藾腾课腾柾蛾腾蟾葾柾穾諾觾蕾蟾葾燾譾蕾蛾苾荾觾",748129239>("D'@%286\ufff3VDC");
         var10001 < ((525717282 + 525717282 | 11) & 1074799035);
         var10001 += 1
      ) {
         0<"JNT",496757735,"뾻羹龻뾽Άﾹ\udfbbﾽ龻","㽍䝊ᝊ䝍꽊","藾腾课腾柾蛾腾蟾葾柾穾諾觾蕾蟾葾燾譾蕾蛾苾荾觾",748128829>(
            var10002,
            var10001,
            (char)(0<"JNT",496757735,"뾹Άﾹ\udfbbﾽ龻","㽍䝊䝍ᝊ","藾腾课腾柾蛾腾蟾葾柾穾諾觾蕾蟾葾燾譾蕾蛾苾荾觾",748128824>(var10002, var10001) + 233 - 165 + 90 ^ 206 ^ 127)
         );
      }

      String var2 = 0<"JNT",496757735,"龻㾺뾿龻\udfbbﾺ徺㾹","㽍䝍彊佋\u074b꽋\u074b睍彋\u074b潋㝋睍靊齋轋䝋潋㝋흍","藾腾课腾柾蛾腾蟾葾柾穾諾觾蕾蟾葾燾譾蕾蛾苾荾觾",748128835>(var10002);
      int var11 = 0;

      StringBuilder var22;
      for (var22 = (StringBuilder)0<"JNT",528103410,"鿄ﾺ徺ﾺ龻忄","㽍彊佋\u074b꽋\u074b睍彋\u074b潋㝋睍靊齋轋䝋潋㝋흍䝍꽊","藾腾课腾柾蛾腾蟾葾柾穾諾觾蕾蟾葾燾譾蕾蛾苾荾觾",748128828>(
            "ﺴ\uff00Ｄﻼ\uff00ＴＸ\ufdecＸ＼ＨＴﻰ（\uff00\ufdecﻴ＜Ｈﻸ８Ｘ\ufdec＼，ＴＨ｀（，\ufdecｈﻰ＜＜Ｘ"
         );
         var11 < (-498022304 >>> 1062083140 ^ 237309090);
         var11 += 2043718545 & -717658396 ^ 1360011905
      ) {
         int var44 = 0<"JNT",496757735,"뾹Άﾹ\udfbbﾽ龻","㽍䝊䝍ᝊ","藾腾课腾柾蛾腾蟾葾柾穾諾觾蕾蟾葾燾譾蕾蛾苾荾觾",748129226>(var22, var11) + 15;
         int var10006 = (var44 & 0) >> 16;
         int var45 = (var44 & 0) >> 16 | var44 << 0;
         int var76 = (((var44 & 0) >> 16 | var44 << 0) & 65532) >> 2;
         char var46 = (char)((((var10006 | var44 << 0) & 65532) >> 2 | ((var44 & 0) >> 16 | var44 << 0) << 14) + 161 + 1);
         0<"JNT",496757735,"뾻羹龻뾽Άﾹ\udfbbﾽ龻","㽍䝊ᝊ䝍꽊","藾腾课腾柾蛾腾蟾葾柾穾諾觾蕾蟾葾燾譾蕾蛾苾荾觾",748127399>(var22, var11, (char)((var76 | var45 << 14) + 161 + 1));
      }

      super(
         var2,
         0<"JNT",496757735,"龻㾺뾿龻\udfbbﾺ徺㾹","㽍䝍彊佋\u074b꽋\u074b睍彋\u074b潋㝋睍靊齋轋䝋潋㝋흍","藾腾课腾柾蛾腾蟾葾柾穾諾觾蕾蟾葾燾譾蕾蛾苾荾觾",748128820>(var22),
         -1,
         1<"JNT",-289820086,"쩎칎","䀸䏠","勶囶\ue2f6雷㫷黶",-1466486013>()
      );
      var10001 = (-1366967694 - -1366967694 | 0) & 1745940190;

      for (var10002 = (StringBuilder)0<"JNT",528103410,"鿄ﾺ徺ﾺ龻忄","㽍彊佋\u074b꽋\u074b睍彋\u074b潋㝋睍靊齋轋䝋潋㝋흍䝍꽊","藾腾课腾柾蛾腾蟾葾柾穾諾觾蕾蟾葾燾譾蕾蛾苾荾觾",748128826>("L9=5,");
         var10001 < (-608039276 >> 1837781552 ^ -9273);
         var10001 += (-58887107 - 1900554703 | 1) & 272633985
      ) {
         int var25 = 0<"JNT",496757735,"뾹Άﾹ\udfbbﾽ龻","㽍䝊䝍ᝊ","藾腾课腾柾蛾腾蟾葾柾穾諾觾蕾蟾葾燾譾蕾蛾苾荾觾",748129238>(var10002, var10001) ^ 157;
         int var64 = (var25 & 65520) >> 4;
         int var26 = (var25 & 65520) >> 4 | var25 << 12;
         int var65 = (((var25 & 65520) >> 4 | var25 << 12) & 61440) >> 12;
         char var27 = (char)(((((var64 | var25 << 12) & 61440) >> 12 | ((var25 & 65520) >> 4 | var25 << 12) << 4) ^ 126) - 110);
         0<"JNT",496757735,"뾻羹龻뾽Άﾹ\udfbbﾽ龻","㽍䝊ᝊ䝍꽊","藾腾课腾柾蛾腾蟾葾柾穾諾觾蕾蟾葾燾譾蕾蛾苾荾觾",748129235>(var10002, var10001, (char)(((var65 | var26 << 4) ^ 126) - 110));
      }

      this.field_2134 = (Class_49)0<"JNT",528103410,"鿄ﾺ徺ﾺ龻忄","㽍彊佋\u074b꽋\u074b睍彋\u074b潋㝋睍靊齋轋䝋潋㝋흍ὊὊὊὊ䝍꽊","苾艾",748128834>(
         0<"JNT",496757735,"龻㾺뾿龻\udfbbﾺ徺㾹","㽍䝍彊佋\u074b꽋\u074b睍彋\u074b潋㝋睍靊齋轋䝋潋㝋흍","藾腾课腾柾蛾腾蟾葾柾穾諾觾蕾蟾葾燾譾蕾蛾苾荾觾",748128833>(var10002), 1.0, 255.0, 125.0, 1.0
      );
      var10001 = -1591917705 + -1591917705 ^ 1111131886;

      for (var10002 = (StringBuilder)0<"JNT",528103410,"鿄ﾺ徺ﾺ龻忄","㽍彊佋\u074b꽋\u074b睍彋\u074b潋㝋睍靊齋轋䝋潋㝋흍䝍꽊","藾腾课腾柾蛾腾蟾葾柾穾諾觾蕾蟾葾燾譾蕾蛾苾荾觾",748128831>("ĒŎĬİĴŎŐ");
         var10001 < ((500882713 & 500882713 | 7) & -1576795609);
         var10001 += (-1915724055 | -1915724055 | 0) & 537395463
      ) {
         char var30 = 0<"JNT",496757735,"뾹Άﾹ\udfbbﾽ龻","㽍䝊䝍ᝊ","藾腾课腾柾蛾腾蟾葾柾穾諾觾蕾蟾葾燾譾蕾蛾苾荾觾",748129232>(var10002, var10001);
         int var66 = (var30 & '￼') >> 2;
         int var31 = (var30 & '￼') >> 2 | var30 << 14;
         int var67 = (((var30 & '￼') >> 2 | var30 << 14) & 0) >> 16;
         int var32 = ((var66 | var30 << 14) & 0) >> 16 | ((var30 & '￼') >> 2 | var30 << 14) << 0;
         var66 = ((var67 | var31 << 0) & 63488) >> 11;
         int var33 = ((var67 | var31 << 0) & 63488) >> 11 | var32 << 5;
         int var69 = ((((var67 | var31 << 0) & 63488) >> 11 | var32 << 5) & 65520) >> 4;
         char var34 = (char)((((var66 | var32 << 5) & 65520) >> 4 | (((var67 | var31 << 0) & 63488) >> 11 | var32 << 5) << 12) - 53);
         0<"JNT",496757735,"뾻羹龻뾽Άﾹ\udfbbﾽ龻","㽍䝊ᝊ䝍꽊","藾腾课腾柾蛾腾蟾葾柾穾諾觾蕾蟾葾燾譾蕾蛾苾荾觾",748129237>(var10002, var10001, (char)((var69 | var33 << 12) - 53));
      }

      Class_105 var7 = (Class_105)0<"JNT",528103410,"鿄ﾺ徺ﾺ龻忄","㽍彊佋\u074b꽋\u074b睍彋\u074b潋㝋睍靊齋轋䝋潋㝋흍콊䝍꽊","葾觾",748127388>(
         0<"JNT",496757735,"龻㾺뾿龻\udfbbﾺ徺㾹","㽍䝍彊佋\u074b꽋\u074b睍彋\u074b潋㝋睍靊齋轋䝋潋㝋흍","藾腾课腾柾蛾腾蟾葾柾穾諾觾蕾蟾葾燾譾蕾蛾苾荾觾",748127395>(var10002), false
      );
      int var17 = (1469674957 << 438637273 | 0) & 95988626;

      for (var22 = (StringBuilder)0<"JNT",528103410,"鿄ﾺ徺ﾺ龻忄","㽍彊佋\u074b꽋\u074b睍彋\u074b潋㝋睍靊齋轋䝋潋㝋흍䝍꽊","藾腾课腾柾蛾腾蟾葾柾穾諾觾蕾蟾葾燾譾蕾蛾苾荾觾",748127393>(
            "绤㻪Ứ\udeea廪ﻠỨﻠ绩ứ뻩黨ﻠ뻨㻪\udee9黩ﻠừ\udee9黪㻪ﻠﻪ绩Ứừ黨㻪ﻠ绪\udee9ﻠ绪ﻩ黨ﻠ廪绪\udee9㻪Ứ\udee8黨ﻠ㻨绩\udee9廨廩"
         );
         var17 < (-135986474 - -135986474 ^ 50);
         var17 += (1911008500 * -1035812585 | 1) & -2130575343
      ) {
         int var55 = 0<"JNT",496757735,"뾹Άﾹ\udfbbﾽ龻","㽍䝊䝍ᝊ","藾腾课腾柾蛾腾蟾葾柾穾諾觾蕾蟾葾燾譾蕾蛾苾荾觾",748129228>(var22, var17) + 254 + 38;
         char var58 = (char)(
            (((((var55 & 65534) >> 1 | var55 << 15) & 63488) >> 11 | ((var55 & 65534) >> 1 | var55 << 15) << 5) & 65534) >> 1
               | ((((var55 & 65534) >> 1 | var55 << 15) & 63488) >> 11 | ((var55 & 65534) >> 1 | var55 << 15) << 5) << 15
         );
         0<"JNT",496757735,"뾻羹龻뾽Άﾹ\udfbbﾽ龻","㽍䝊ᝊ䝍꽊","藾腾课腾柾蛾腾蟾葾柾穾諾觾蕾蟾葾燾譾蕾蛾苾荾觾",748129233>(
            var22,
            var17,
            (char)(
               (((((var55 & 65534) >> 1 | var55 << 15) & 63488) >> 11 | ((var55 & 65534) >> 1 | var55 << 15) << 5) & 65534) >> 1
                  | ((((var55 & 65534) >> 1 | var55 << 15) & 63488) >> 11 | ((var55 & 65534) >> 1 | var55 << 15) << 5) << 15
            )
         );
      }

      this.field_2135 = 0<"JNT",496757735,"ﾹ羻龹","㽍彊佋\u074b꽋\u074b睍彋\u074b潋㝋睍靊齋轋䝋潋㝋흍䝍彊㝋轋흍","葾觾",748127397>(
         var7, 0<"JNT",496757735,"龻㾺뾿龻\udfbbﾺ徺㾹","㽍䝍彊佋\u074b꽋\u074b睍彋\u074b潋㝋睍靊齋轋䝋潋㝋흍","藾腾课腾柾蛾腾蟾葾柾穾諾觾蕾蟾葾燾譾蕾蛾苾荾觾",748127392>(var22)
      );
      var10001 = 2082819197 ^ -518870727 ^ -1657281212;

      for (var10002 = (StringBuilder)0<"JNT",528103410,"鿄ﾺ徺ﾺ龻忄","㽍彊佋\u074b꽋\u074b睍彋\u074b潋㝋睍靊齋轋䝋潋㝋흍䝍꽊","藾腾课腾柾蛾腾蟾葾柾穾諾觾蕾蟾葾燾譾蕾蛾苾荾觾",748127398>(
            "\u200b」\ue00cဍ\f怌䀌\u200d"
         );
         var10001 < (241575275 * -1572043183 ^ -676603693);
         var10001 += 1408289286 - -1312038354 * -1312038354 ^ 992446915
      ) {
         char var39 = 0<"JNT",496757735,"뾹Άﾹ\udfbbﾽ龻","㽍䝊䝍ᝊ","藾腾课腾柾蛾腾蟾葾柾穾諾觾蕾蟾葾燾譾蕾蛾苾荾觾",748128830>(var10002, var10001);
         char var42 = (char)(
            (((((var39 & '\uf000') >> 12 | var39 << 4) - 82 - 13 & 49152) >> 14 | ((var39 & '\uf000') >> 12 | var39 << 4) - 82 - 13 << 2) & 65532) >> 2
               | ((((var39 & '\uf000') >> 12 | var39 << 4) - 82 - 13 & 49152) >> 14 | ((var39 & '\uf000') >> 12 | var39 << 4) - 82 - 13 << 2) << 14
         );
         0<"JNT",496757735,"뾻羹龻뾽Άﾹ\udfbbﾽ龻","㽍䝊ᝊ䝍꽊","藾腾课腾柾蛾腾蟾葾柾穾諾觾蕾蟾葾燾譾蕾蛾苾荾觾",748128827>(
            var10002,
            var10001,
            (char)(
               (((((var39 & '\uf000') >> 12 | var39 << 4) - 82 - 13 & 49152) >> 14 | ((var39 & '\uf000') >> 12 | var39 << 4) - 82 - 13 << 2) & 65532) >> 2
                  | ((((var39 & '\uf000') >> 12 | var39 << 4) - 82 - 13 & 49152) >> 14 | ((var39 & '\uf000') >> 12 | var39 << 4) - 82 - 13 << 2) << 14
            )
         );
      }

      this.field_2136 = (Class_65)0<"JNT",528103410,"鿄ﾺ徺ﾺ龻忄","㽍彊佋\u074b꽋\u074b睍彋\u074b潋㝋睍靊齋轋䝋潋㝋흍彊佋\u074b꽋\u074b睍ꝋ齋䝋彋睍杊\u074b罋흍彊佋\u074b꽋\u074b睍ꝋ齋䝋彋睍彊䝋靋齋흍䝍꽊","荾菾蕾",748129229>(
         0<"JNT",496757735,"龻㾺뾿龻\udfbbﾺ徺㾹","㽍䝍彊佋\u074b꽋\u074b睍彋\u074b潋㝋睍靊齋轋䝋潋㝋흍","藾腾课腾柾蛾腾蟾葾柾穾諾觾蕾蟾葾燾譾蕾蛾苾荾觾",748129234>(var10002),
         0<"JNT",-784734612,"㾺㾺","㽍䝍彊佋\u074b꽋\u074b睍ꝋ齋䝋彋睍杊\u074b罋흍","蕾藾襾",748129231>(),
         1<"JNT",-289820086,"퉎칎","䏸䏼䐘","勶囶\ue2f6嫷㛷諷㛷滶蛷苷囷拷滶\ue2f6囷绷苷黶",-1466486032>()
      );
      0<"JNT",496757735,"ﾻ羻","㽍흊彊蝋❋❋흍䝍꽊","蕾藾襾",748129225>(
         this,
         new Class_271[]{
            1<"JNT",-11034150,"쭎흎","䏸䏼䐘","勶囶\ue2f6䋷㻷黶",-1466486030>(this),
            1<"JNT",-11034150,"\udb4e흎","䏸䏼䐘","勶囶\ue2f6价竷黶",-1466486031>(this),
            1<"JNT",-11034150,"홎왎","䏸䏼䐘","勶囶\ue2f6䛷䫷囷黶",-1466486028>(this)
         }
      );
   }

   // $VF: renamed from: oo () java.util.Map
   public static Map method_1830() {
      HashMap var0 = (HashMap)0<"JNT",528103410,"鿄ﾺ徺ﾺ龻忄","㽍䝍꽊","藾腾课腾柾譾諾蕾蛾柾瓾腾詾蓾睾腾裾",748127394>();
      0<"JNT",623028493,"ᾼ羻龻","㽍彊佋\u074b꽋\u074b睍彋\u074b潋㝋睍睊ཋ佋❋ᝋ齋흍彊佋\u074b꽋\u074b睍彋\u074b潋㝋睍睊ཋ佋❋ᝋ齋흍䝍彊佋\u074b꽋\u074b睍彋\u074b潋㝋睍睊ཋ佋❋ᝋ齋흍","藾腾课腾柾譾諾蕾蛾柾睾腾裾",748127389>(
         var0,
         1<"JNT",-289820086,"읎쩎왎쵎앎쁎鉎酎酎鑎镎","䐌䏨䐤䌐䐈䏸䐌䏨䏤䐜䏜䏬䐤䌐䏤䐄䏜䐠䐠䏔䌠䌠䌈䌰","勶囶\ue2f6櫷䛷苷滶曷囷櫷䛷㻷竷㛷䫷苷滶㻷拷㛷绷绷\u2ef7競競苶鋶黶",-1466488547>(),
         (Class_262)0<"JNT",528103410,"鿄ﾺ徺ﾺ龻忄","㽍䝊䝊䝊䝍꽊","裾豾",748127384>(156, 91, 0)
      );
      0<"JNT",623028493,"ᾼ羻龻","㽍彊佋\u074b꽋\u074b睍彋\u074b潋㝋睍睊ཋ佋❋ᝋ齋흍彊佋\u074b꽋\u074b睍彋\u074b潋㝋睍睊ཋ佋❋ᝋ齋흍䝍彊佋\u074b꽋\u074b睍彋\u074b潋㝋睍睊ཋ佋❋ᝋ齋흍","藾腾课腾柾譾諾蕾蛾柾睾腾裾",748127380>(
         var0,
         1<"JNT",-289820086,"읎쩎왎쵎앎쁎鉎酎鑎饎酎","䐌䏨䐤䌐䐈䏸䐌䏨䏤䐜䏜䏬䐤䌐䏤䐄䏜䐠䐠䏔䌠䌠䌈䌰","勶囶\ue2f6櫷䛷苷滶曷囷櫷䛷㻷竷㛷䫷苷滶㻷拷㛷绷绷\u2ef7競競苶鋶黶",-1466488542>(),
         (Class_262)0<"JNT",528103410,"鿄ﾺ徺ﾺ龻忄","㽍䝊䝊䝊䝍꽊","裾豾",748127387>(200, 91, 0)
      );
      0<"JNT",623028493,"ᾼ羻龻","㽍彊佋\u074b꽋\u074b睍彋\u074b潋㝋睍睊ཋ佋❋ᝋ齋흍彊佋\u074b꽋\u074b睍彋\u074b潋㝋睍睊ཋ佋❋ᝋ齋흍䝍彊佋\u074b꽋\u074b睍彋\u074b潋㝋睍睊ཋ佋❋ᝋ齋흍","藾腾课腾柾譾諾蕾蛾柾睾腾裾",748127415>(
         var0,
         1<"JNT",-289820086,"읎쩎왎쵎앎쁎鉎酎镎镎鑎","䐌䏨䐤䌐䐈䏸䐌䏨䏤䐜䏜䏬䐤䌐䏤䐄䏜䐠䐠䏔䌠䌠䌈䌰","勶囶\ue2f6櫷䛷苷滶曷囷櫷䛷㻷竷㛷䫷苷滶㻷拷㛷绷绷\u2ef7競競苶鋶黶",-1466488541>(),
         (Class_262)0<"JNT",528103410,"鿄ﾺ徺ﾺ龻忄","㽍䝊䝊䝊䝍꽊","裾豾",748127386>(117, 0, 255)
      );
      0<"JNT",623028493,"ᾼ羻龻","㽍彊佋\u074b꽋\u074b睍彋\u074b潋㝋睍睊ཋ佋❋ᝋ齋흍彊佋\u074b꽋\u074b睍彋\u074b潋㝋睍睊ཋ佋❋ᝋ齋흍䝍彊佋\u074b꽋\u074b睍彋\u074b潋㝋睍睊ཋ佋❋ᝋ齋흍","藾腾课腾柾譾諾蕾蛾柾睾腾裾",748127414>(
         var0,
         1<"JNT",-289820086,"읎쩎왎쵎앎쁎鉎酎鍎靎酎","䐌䏨䐤䌐䐈䏸䐌䏨䏤䐜䏜䏬䐤䌐䏤䐄䏜䐠䐠䏔䌠䌠䌈䌰","勶囶\ue2f6櫷䛷苷滶曷囷櫷䛷㻷竷㛷䫷苷滶㻷拷㛷绷绷\u2ef7競競苶鋶黶",-1466488536>(),
         (Class_262)0<"JNT",528103410,"鿄ﾺ徺ﾺ龻忄","㽍䝊䝊䝊䝍꽊","裾豾",748127413>(138, 126, 166)
      );
      0<"JNT",623028493,"ᾼ羻龻","㽍彊佋\u074b꽋\u074b睍彋\u074b潋㝋睍睊ཋ佋❋ᝋ齋흍彊佋\u074b꽋\u074b睍彋\u074b潋㝋睍睊ཋ佋❋ᝋ齋흍䝍彊佋\u074b꽋\u074b睍彋\u074b潋㝋睍睊ཋ佋❋ᝋ齋흍","藾腾课腾柾譾諾蕾蛾柾睾腾裾",748127409>(
         var0,
         1<"JNT",-289820086,"읎쩎왎쵎앎쁎鉎酎靎酎鑎","䐌䏨䐤䌐䐈䏸䐌䏨䏤䐜䏜䏬䐤䌐䏤䐄䏜䐠䐠䏔䌠䌠䌈䌰","勶囶\ue2f6櫷䛷苷滶曷囷櫷䛷㻷竷㛷䫷苷滶㻷拷㛷绷绷\u2ef7競競苶鋶黶",-1466488535>(),
         (Class_262)0<"JNT",528103410,"鿄ﾺ徺ﾺ龻忄","㽍䝊䝊䝊䝍꽊","裾豾",748127404>(134, 0, 158)
      );
      0<"JNT",623028493,"ᾼ羻龻","㽍彊佋\u074b꽋\u074b睍彋\u074b潋㝋睍睊ཋ佋❋ᝋ齋흍彊佋\u074b꽋\u074b睍彋\u074b潋㝋睍睊ཋ佋❋ᝋ齋흍䝍彊佋\u074b꽋\u074b睍彋\u074b潋㝋睍睊ཋ佋❋ᝋ齋흍","藾腾课腾柾譾諾蕾蛾柾睾腾裾",748127400>(
         var0,
         1<"JNT",-289820086,"읎쩎왎쵎앎쁎鉎酎鉎饎鉎","䐌䏨䐤䌐䐈䏸䐌䏨䏤䐜䏜䏬䐤䌐䏤䐄䏜䐠䐠䏔䌠䌠䌈䌰","勶囶\ue2f6櫷䛷苷滶曷囷櫷䛷㻷竷㛷䫷苷滶㻷拷㛷绷绷\u2ef7競競苶鋶黶",-1466488562>(),
         (Class_262)0<"JNT",528103410,"鿄ﾺ徺ﾺ龻忄","㽍䝊䝊䝊䝍꽊","裾豾",748127407>(125, 125, 125)
      );
      0<"JNT",623028493,"ᾼ羻龻","㽍彊佋\u074b꽋\u074b睍彋\u074b潋㝋睍睊ཋ佋❋ᝋ齋흍彊佋\u074b꽋\u074b睍彋\u074b潋㝋睍睊ཋ佋❋ᝋ齋흍䝍彊佋\u074b꽋\u074b睍彋\u074b潋㝋睍睊ཋ佋❋ᝋ齋흍","藾腾课腾柾譾諾蕾蛾柾睾腾裾",748127403>(
         var0,
         1<"JNT",-289820086,"읎쩎왎쵎앎쁎鉎靎鑎鍎饎","䐌䏨䐤䌐䐈䏸䐌䏨䏤䐜䏜䏬䐤䌐䏤䐄䏜䐠䐠䏔䌠䌠䌈䌰","勶囶\ue2f6櫷䛷苷滶曷囷櫷䛷㻷竷㛷䫷苷滶㻷拷㛷绷绷\u2ef7競競苶鋶黶",-1466488561>(),
         (Class_262)0<"JNT",528103410,"鿄ﾺ徺ﾺ龻忄","㽍䝊䝊䝊䝍꽊","裾豾",748127406>(255, 140, 140)
      );
      0<"JNT",623028493,"ᾼ羻龻","㽍彊佋\u074b꽋\u074b睍彋\u074b潋㝋睍睊ཋ佋❋ᝋ齋흍彊佋\u074b꽋\u074b睍彋\u074b潋㝋睍睊ཋ佋❋ᝋ齋흍䝍彊佋\u074b꽋\u074b睍彋\u074b潋㝋睍睊ཋ佋❋ᝋ齋흍","藾腾课腾柾譾諾蕾蛾柾睾腾裾",748127402>(
         var0,
         1<"JNT",-289820086,"읎쩎왎쵎앎쁎鉎酎镎饎陎","䐌䏨䐤䌐䐈䏸䐌䏨䏤䐜䏜䏬䐤䌐䏤䐄䏜䐠䐠䏔䌠䌠䌈䌰","勶囶\ue2f6櫷䛷苷滶曷囷櫷䛷㻷竷㛷䫷苷滶㻷拷㛷绷绷\u2ef7競競苶鋶黶",-1466488556>(),
         (Class_262)0<"JNT",528103410,"鿄ﾺ徺ﾺ龻忄","㽍䝊䝊䝊䝍꽊","裾豾",748127401>(80, 80, 255)
      );
      0<"JNT",623028493,"ᾼ羻龻","㽍彊佋\u074b꽋\u074b睍彋\u074b潋㝋睍睊ཋ佋❋ᝋ齋흍彊佋\u074b꽋\u074b睍彋\u074b潋㝋睍睊ཋ佋❋ᝋ齋흍䝍彊佋\u074b꽋\u074b睍彋\u074b潋㝋睍睊ཋ佋❋ᝋ齋흍","藾腾课腾柾譾諾蕾蛾柾睾腾裾",748128773>(
         var0,
         1<"JNT",-289820086,"읎쩎왎쵎앎쁎鉎酎陎靎酎","䐌䏨䐤䌐䐈䏸䐌䏨䏤䐜䏜䏬䐤䌐䏤䐄䏜䐠䐠䏔䌠䌠䌈䌰","勶囶\ue2f6櫷䛷苷滶曷囷櫷䛷㻷竷㛷䫷苷滶㻷拷㛷绷绷\u2ef7競競苶鋶黶",-1466488619>(),
         (Class_262)0<"JNT",528103410,"鿄ﾺ徺ﾺ龻忄","㽍䝊䝊䝊䝍꽊","裾豾",748128768>(35, 226, 0)
      );
      return var0;
   }

   // $VF: renamed from: mg () void
   @Override
   public void method_1407() {
      0<"JNT",1090310439,"羺㾹","㽍䝍꽊","譾詾菾",748128774>(this);
   }

   // $VF: renamed from: q () void
   @Override
   public void method_1408() {
      0<"JNT",1090310439,"ﾻ","㽍䝍꽊","譾詾菾",748128771>(this);
   }

   // $VF: renamed from: jw (Class_381) void
   @Class_21
   public void method_1831(Class_381 var1) {
      0<"JNT",496757735,"ﾹ\udfbb","㽍彊띋읋흍䝍꽊","蕾藾襾",748129276>(this, var1);
   }

   // $VF: renamed from: om (net.minecraft.class_2586, int) Class_262
   public Class_262 method_1832(class_2586 var1, int var2) {
      int var8;
      Class_262 var10000;
      label67: {
         label69: {
            var8 = -1758252311;
            class_2248 var3 = 0<"JNT",496757735,"羺羹龻Ά㾺龹㿀\udfc3心\udfc3ῄ鿃","㽍䝍彊潋❋齋睍杋䝋潋❋ᝋ轋\u074b⽋齋睍ᝋ彋\u074b靋靋\uf74a轍轍齍뽍흍","蟾荾諾柾蝾蕾蟾荾艾觾腾菾諾柾艾蛾腾詾詾聾槾毾泾棾",748127372>(
               0<"JNT",496757735,"羺羹龻Ά㾺龹㿀ￃￃῄￃῄ","㽍䝍彊潋❋齋睍杋䝋潋❋ᝋ轋\u074b⽋齋睍ᝋ彋\u074b靋靋\uf74a轍꽍뽍罍흍","蟾荾諾柾蝾蕾蟾荾艾觾腾菾諾柾艾蛾腾詾詾聾槾歾泾毾",748127379>(var1)
            );
            Class_262 var4;
            if (var1 instanceof class_2627) {
               var4 = 0<"JNT",496757735,"㾹ᾼ뾻","㽍彊潋❋齋睍杋䝋潋❋ᝋ轋\u074b⽋齋睍ᝋ彋\u074b靋靋\uf74a轍轍齍뽍흍䝍彊罋띋흍","荾菾蕾",748127378>(
                  1<"JNT",-11034150,"홎왎","䏸䏼䐘","勶囶\ue2f6䛷䫷囷黶",-1466488501>(this), var3
               );
               if (var4 == null) {
                  var4 = 0<"JNT",496757735,"㾹ᾼ뾻","㽍彊潋❋齋睍杋䝋潋❋ᝋ轋\u074b⽋齋睍ᝋ彋\u074b靋靋\uf74a轍轍齍뽍흍䝍彊罋띋흍","荾菾蕾",748127373>(
                     1<"JNT",-11034150,"홎왎","䏸䏼䐘","勶囶\ue2f6䛷䫷囷黶",-1466488531>(this),
                     1<"JNT",-289820086,"읎쩎왎쵎앎쁎鉎酎靎酎鑎","䐌䏨䐤䌐䐈䏸䐌䏨䏤䐜䏜䏬䐤䌐䏤䐄䏜䐠䐠䏔䌠䌠䌈䌰","勶囶\ue2f6櫷䛷苷滶曷囷櫷䛷㻷竷㛷䫷苷滶㻷拷㛷绷绷\u2ef7競競苶鋶黶",-1466488528>()
                  );
               }

               var8 = -1687486577;
            } else {
               var8 = (-867285286 ^ -867285286 | -1067607836) & -681591298;

               label62:
               while (true) {
                  switch (((var8 ^ 912054502) + 479728632 - 786700170 - 1410497256 ^ 1832461993) - 582446893) {
                     case -1075546124:
                     default:
                        if (var1 instanceof class_2669) {
                           var4 = 0<"JNT",496757735,"㾹ᾼ뾻","㽍彊潋❋齋睍杋䝋潋❋ᝋ轋\u074b⽋齋睍ᝋ彋\u074b靋靋\uf74a轍轍齍뽍흍䝍彊罋띋흍","荾菾蕾",748127371>(
                              1<"JNT",-11034150,"홎왎","䏸䏼䐘","勶囶\ue2f6䛷䫷囷黶",-1466488526>(this), var3
                           );
                           if (var4 == null) {
                              var4 = 0<"JNT",496757735,"㾹ᾼ뾻","㽍彊潋❋齋睍杋䝋潋❋ᝋ轋\u074b⽋齋睍ᝋ彋\u074b靋靋\uf74a轍轍齍뽍흍䝍彊罋띋흍","荾菾蕾",748127370>(
                                 1<"JNT",-11034150,"홎왎","䏸䏼䐘","勶囶\ue2f6䛷䫷囷黶",-1466488524>(this),
                                 1<"JNT",-289820086,"읎쩎왎쵎앎쁎鉎酎陎靎酎","䐌䏨䐤䌐䐈䏸䐌䏨䏤䐜䏜䏬䐤䌐䏤䐄䏜䐠䐠䏔䌠䌠䌈䌰","勶囶\ue2f6櫷䛷苷滶曷囷櫷䛷㻷竷㛷䫷苷滶㻷拷㛷绷绷\u2ef7競競苶鋶黶",-1466488525>()
                              );
                           }

                           var8 = 2025315338;
                           break label62;
                        }

                        var8 = -428997432 & -428997432 ^ 2042644052;
                        break;
                     case 200657788:
                        var4 = 0<"JNT",496757735,"㾹ᾼ뾻","㽍彊潋❋齋睍杋䝋潋❋ᝋ轋\u074b⽋齋睍ᝋ彋\u074b靋靋\uf74a轍轍齍뽍흍䝍彊罋띋흍","荾菾蕾",748129274>(
                           1<"JNT",-11034150,"홎왎","䏸䏼䐘","勶囶\ue2f6䛷䫷囷黶",-1466488509>(this), var3
                        );
                        if (var4 != null) {
                           var10000 = (Class_262)0<"JNT",528103410,"鿄ﾺ徺ﾺ龻忄","㽍䝊䝊䝊䝊䝍꽊","裾豾",748127382>(
                              1<"JNT",-11034150,"챎읎쵎","䐔䀰","勶囶훶",-1466488507>(var4),
                              1<"JNT",-11034150,"푎칎퉎","䐔䀰","勶囶훶",-1466488504>(var4),
                              1<"JNT",-11034150,"졎\ud94e","䐔䀰","勶囶훶",-1466488505>(var4),
                              var2
                           );
                           break label69;
                        }

                        var8 = (21514604 | -513376335) ^ 179267216;
                        break label62;
                  }
               }
            }

            label54:
            while (true) {
               switch (((var8 ^ 409785757) + 1522600195 - 1222400158 ^ 873888480 ^ 419746037) + 1772885144) {
                  case -1842549800:
                     var10000 = null;
                     break label69;
                  case -916903807:
                     if (var4 == null) {
                        var8 = (-356417173 - -356417173 | 1721387432) & 2128312751;
                        continue;
                     }

                     var10000 = (Class_262)0<"JNT",528103410,"鿄ﾺ徺ﾺ龻忄","㽍䝊䝊䝊䝊䝍꽊","裾豾",748129272>(
                        1<"JNT",-11034150,"챎읎쵎","䐔䀰","勶囶훶",-1466488613>(var4),
                        1<"JNT",-11034150,"푎칎퉎","䐔䀰","勶囶훶",-1466488514>(var4),
                        1<"JNT",-11034150,"졎\ud94e","䐔䀰","勶囶훶",-1466488515>(var4),
                        var2
                     );
                     break;
                  case 597984506:
                     if (var4 == null) {
                        var8 = 1882283422 ^ 1808263980 ^ 2100228005;
                        continue;
                     }

                     var10000 = (Class_262)0<"JNT",528103410,"鿄ﾺ徺ﾺ龻忄","㽍䝊䝊䝊䝊䝍꽊","裾豾",748129268>(
                        1<"JNT",-11034150,"챎읎쵎","䐔䀰","勶囶훶",-1466488513>(var4),
                        1<"JNT",-11034150,"푎칎퉎","䐔䀰","勶囶훶",-1466488510>(var4),
                        1<"JNT",-11034150,"졎\ud94e","䐔䀰","勶囶훶",-1466488511>(var4),
                        var2
                     );
                     break label54;
                  case 657959826:
                  default:
                     var10000 = null;
                     break label54;
                  case 662043431:
                     var10000 = null;
               }

               var8 = (1458448617 >> -415975570 | -1330471580) & -1107321484;
               break label67;
            }

            var8 = 1818345375 >>> 1818345375 ^ -259212323;
            break label67;
         }

         var8 = (1358932378 | -1497362682) & -1228378121;
      }

      switch ((var8 ^ 565158431) - 1503409090 + 884261018 - 2013748785 - 447763166 - 1021704889) {
         case -1667817349:
            return var10000;
         case -1562218855:
         default:
            return var10000;
         case -593626414:
            return var10000;
      }
   }

   // $VF: renamed from: ar (Class_381) void
   public void method_1833(Class_381 var1) {
      int var21 = -229751085;
      Iterator var2 = 0<"JNT",623028493,"ﾺ龻羹\udfbbﾹ龻㾺\udfbb","㽍䝍彊佋\u074b꽋\u074b睍ꝋ齋䝋彋睍䝊齋❋轋\u074b齋睋轋흍","藾腾课腾柾譾諾蕾蛾柾盾蕾詾諾",748129121>(
         0<"JNT",-784734612,"\udfbc㾺","㽍䝍彊佋\u074b꽋\u074b睍ꝋ齋䝋彋睍彊䝋靋齋흍","觾襾",748129116>()
      );

      label53:
      while (true) {
         var21 = 546096727 * -261664491 ^ -1512343827;

         while (true) {
            switch ((var21 + 379999341 ^ 576344938) + 1590089801 + 1424852456 - 1039129725 - 1875760785) {
               case -375951606:
               default:
                  return;
               case 1969031028:
            }

            if (0<"JNT",623028493,"Άﾹ뾻徾羹᾽龻","㽍䝍콊","藾腾课腾柾譾諾蕾蛾柾畾諾荾觾腾諾衾觾",748129124>(var2)) {
               class_2818 var3 = (class_2818)0<"JNT",623028493,"徺羹᾽龻","㽍䝍彊佋\u074b꽋\u074b睍彋\u074b潋㝋睍睊ཋ佋❋ᝋ齋흍","藾腾课腾柾譾諾蕾蛾柾畾諾荾觾腾諾衾觾",748129129>(var2);
               Iterator var4 = 0<"JNT",623028493,"ﾺ龻羹\udfbbﾹ龻㾺\udfbb","㽍䝍彊佋\u074b꽋\u074b睍ꝋ齋䝋彋睍䝊齋❋轋\u074b齋睋轋흍","藾腾课腾柾譾諾蕾蛾柾穾荾諾",748129223>(
                  0<"JNT",496757735,"羺羹龻Ά㾺龹㿀ￃ\udfc3ῄ\udfc3ￃ","㽍䝍彊佋\u074b꽋\u074b睍ꝋ齋䝋彋睍靊❋齋흍","蟾荾諾柾蝾蕾蟾荾艾觾腾菾諾柾艾蛾腾詾詾聾槾泾楾泾",748129130>(var3)
               );

               while (true) {
                  var21 = 1909842739;

                  while (true) {
                     switch ((var21 + 1660302910 + 713091762 ^ 1062978275) + 1579880148 ^ 404699392 ^ 1002158834) {
                        case 976994518:
                        default:
                           continue label53;
                        case 1038440038:
                     }

                     if (0<"JNT",623028493,"Άﾹ뾻徾羹᾽龻","㽍䝍콊","藾腾课腾柾譾諾蕾蛾柾畾諾荾觾腾諾衾觾",748129127>(var4)) {
                        class_2338 var5 = (class_2338)0<"JNT",623028493,"徺羹᾽龻","㽍䝍彊佋\u074b꽋\u074b睍彋\u074b潋㝋睍睊ཋ佋❋ᝋ齋흍","藾腾课腾柾譾諾蕾蛾柾畾諾荾觾腾諾衾觾",748129120>(var4);
                        class_2586 var6 = 0<"JNT",496757735,"羺羹龻Ά㾺龹㿀\u1fc5뿃\udfc3ￃ","㽍彊潋❋齋睍杋䝋潋❋ᝋ轋\u074b⽋齋睍ᝋ彋\u074b靋靋\uf74a轍靍靍뽍흍䝍彊潋❋齋睍杋䝋潋❋ᝋ轋\u074b⽋齋睍ᝋ彋\u074b靋靋\uf74a轍ꝍ뽍꽍흍","蟾荾諾柾蝾蕾蟾荾艾觾腾菾諾柾艾蛾腾詾詾聾毾橾泾",748129123>(
                           1<"JNT",-11034150,"읎쩎왎쵎앎쁎鉎靎饎顎","䐌䏨䐤䌐䐈䏸䐌䏨䏤䐜䏜䏬䐤䌐䏤䐄䏜䐠䐠䏔䌤䌜䌘","勶囶\ue2f6櫷䛷苷滶曷囷櫷䛷㻷竷㛷䫷苷滶㻷拷㛷绷绷\u2ef7諶绶鋶黶",-1466488710>(
                              1<"JNT",-11034150,"쵎퍎","䏸䏼䐘","勶囶\ue2f6櫷䛷苷滶曷囷櫷䛷㻷竷㛷䫷苷滶㻷拷㛷绷绷\u2ef7绶盶狶黶",-1466488713>(this)
                           ),
                           var5
                        );
                        if (var6 != null) {
                           Class_262 var7 = 0<"JNT",496757735,"㾺羺","㽍彊潋❋齋睍杋䝋潋❋ᝋ轋\u074b⽋齋睍ᝋ彋\u074b靋靋\uf74a轍ꝍ뽍꽍흍䝊䝍彊罋띋흍","蕾藾襾",748129222>(
                              this, var6, 0<"JNT",496757735,"徹\udfbc㾹","㽍䝍䝊","苾艾",748129221>(1<"JNT",-11034150,"쭎흎","䏸䏼䐘","勶囶\ue2f6䋷㻷黶",-1466488552>(this))
                           );
                           if (var7 != null) {
                              double var8 = (double)0<"JNT",496757735,"羺羹龻Ά㾺龹㿀ￃῄ\udfc3心뿃","㽍䝍䝊","蟾荾諾柾蝾蕾蟾荾艾觾腾菾諾柾艾蛾腾詾詾聾槾橾橾泾",748129122>(var5) + 0.1;
                              double var10 = (double)0<"JNT",496757735,"羺羹龻Ά㾺龹㿀ￃῄ\udfc3心鿃","㽍䝍䝊","蟾荾諾柾蝾蕾蟾荾艾觾腾菾諾柾艾蛾腾詾詾聾槾橾橾泾",748129119>(var5) + 0.05;
                              double var12 = (double)0<"JNT",496757735,"羺羹龻Ά㾺龹㿀ￃῄ\udfc3心ῄ","㽍䝍䝊","蟾荾諾柾蝾蕾蟾荾艾觾腾菾諾柾艾蛾腾詾詾聾槾橾橾泾",748129112>(var5) + 0.1;
                              double var14 = (double)0<"JNT",496757735,"羺羹龻Ά㾺龹㿀ￃῄ\udfc3心뿃","㽍䝍䝊","蟾荾諾柾蝾蕾蟾荾艾觾腾菾諾柾艾蛾腾詾詾聾槾橾橾泾",748129117>(var5) + 0.9;
                              double var16 = (double)0<"JNT",496757735,"羺羹龻Ά㾺龹㿀ￃῄ\udfc3心鿃","㽍䝍䝊","蟾荾諾柾蝾蕾蟾荾艾觾腾菾諾柾艾蛾腾詾詾聾槾橾橾泾",748129118>(var5) + 0.85;
                              double var18 = (double)0<"JNT",496757735,"羺羹龻Ά㾺龹㿀ￃῄ\udfc3心ῄ","㽍䝍䝊","蟾荾諾柾蝾蕾蟾荾艾觾腾菾諾柾艾蛾腾詾詾聾槾橾橾泾",748129115>(var5) + 0.9;
                              0<"JNT",496757735,"徻ﾻ㾺","㽍ὊὊὊὊὊὊ彊罋띋흍彊罋띋흍彊齋齋흍䝊䝍꽊","葾裾跾",748129114>(
                                 1<"JNT",-11034150,"\ud94e쥎쩎","䀰䀸","勶囶\ue2f6价狷髷黶",-1466488732>(var1),
                                 var8,
                                 var10,
                                 var12,
                                 var14,
                                 var16,
                                 var18,
                                 var7,
                                 var7,
                                 1<"JNT",-289820086,"챎졎","䐤䐤","勶囶\ue2f6苷苷黶",-1466488733>(),
                                 0
                              );
                              if (0<"JNT",496757735,"ﾹ᾽","㽍䝍콊","葾觾",748129136>(1<"JNT",-11034150,"\udb4e흎","䏸䏼䐘","勶囶\ue2f6价竷黶",-1466488731>(this))
                                 && 1<"JNT",-11034150,"읎쩎왎쵎앎쁎鉎顎靎陎","䐌䏨䐤䌐䐈䏸䐌䏨䏤䐜䏜䏬䐤䌐䏤䐄䏜䐠䐠䏔䌤䌜䌘","勶囶\ue2f6櫷䛷苷滶曷囷櫷䛷㻷竷㛷䫷苷滶㻷拷㛷绷绷\u2ef7競绶零黶",-1466488726>(
                                       1<"JNT",-11034150,"쵎퍎","䏸䏼䐘","勶囶\ue2f6櫷䛷苷滶曷囷櫷䛷㻷竷㛷䫷苷滶㻷拷㛷绷绷\u2ef7绶盶狶黶",-1466488729>(this)
                                    )
                                    != null) {
                                 Class_262 var20 = 0<"JNT",496757735,"㾺羺","㽍彊潋❋齋睍杋䝋潋❋ᝋ轋\u074b⽋齋睍ᝋ彋\u074b靋靋\uf74a轍ꝍ뽍꽍흍䝊䝍彊罋띋흍","蕾藾襾",748129139>(this, var6, 255);
                                 if (var20 != null) {
                                    0<"JNT",496757735,"ﾹ羹徺","㽍ὊὊὊὊὊὊ彊罋띋흍䝍꽊","葾裾跾",748129131>(
                                       1<"JNT",-11034150,"\ud94e쥎쩎","䀰䀸","勶囶\ue2f6价狷髷黶",-1466488756>(var1),
                                       var8 + 0.4,
                                       var10 + 0.4,
                                       var12 + 0.4,
                                       1<"JNT",-11034150,"읎쩎왎쵎앎쁎鉎鑎陎鍎","䐌䏨䐤䌐䐈䏸䐌䏨䏤䐜䏜䏬䐤䌐䏤䐄䏜䐠䐠䏔䌠䌈䌤","勶囶싶",-1466488754>(
                                          1<"JNT",-289820086,"큎왎졎","䏰䐔䀼","勶囶\ue2f6櫷䛷苷滶曷囷櫷䛷㻷竷㛷䫷苷滶㻷拷㛷绷绷\u2ef7競苶绶黶",-1466488725>()
                                       ),
                                       1<"JNT",-11034150,"읎쩎왎쵎앎쁎鉎鑎陎鉎","䐌䏨䐤䌐䐈䏸䐌䏨䏤䐜䏜䏬䐤䌐䏤䐄䏜䐠䐠䏔䌠䌈䌤","勶囶싶",-1466488752>(
                                          1<"JNT",-289820086,"큎왎졎","䏰䐔䀼","勶囶\ue2f6櫷䛷苷滶曷囷櫷䛷㻷竷㛷䫷苷滶㻷拷㛷绷绷\u2ef7競苶绶黶",-1466488755>()
                                       ),
                                       1<"JNT",-11034150,"읎쩎왎쵎앎쁎鉎鑎陎酎","䐌䏨䐤䌐䐈䏸䐌䏨䏤䐜䏜䏬䐤䌐䏤䐄䏜䐠䐠䏔䌠䌈䌤","勶囶싶",-1466488750>(
                                          1<"JNT",-289820086,"큎왎졎","䏰䐔䀼","勶囶\ue2f6櫷䛷苷滶曷囷櫷䛷㻷竷㛷䫷苷滶㻷拷㛷绷绷\u2ef7競苶绶黶",-1466488753>()
                                       ),
                                       var20
                                    );
                                 }
                              }
                           }
                        }
                        break;
                     }

                     var21 = (420090323 | -1966375528) ^ 1836296216;
                  }
               }
            }

            var21 = (-1217550891 | -1425007584) & -346653654;
         }
      }
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1413(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = (((var10 ^ 148086008) - 479083754 + 1350219826 ^ 253040964) - 380524625 ^ 885309522) + 442019085 - 642748609 + 618488466;
      MethodHandle var10000 = field_2137[(((var10 ^ 148086008) - 479083754 + 1350219826 ^ 253040964) - 380524625 ^ 885309522)
         + 442019085
         - 642748609
         + 618488466
         + 1919258238];
      if (field_2137[var10001 + 1919258238] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = -1298329552 ^ 1173045689 ^ -143240823; var23 < var13.length(); var23 += (-1200217462 & -1241274312 | 1) & 1256293317) {
            int var42 = var13.charAt(var23) - '-' ^ 96;
            int var10004 = (var42 & 57344) >> 13;
            int var43 = ((var42 & 57344) >> 13 | var42 << 3) + 119 - 155 + 21 + 238 ^ 231;
            int var85 = ((((var42 & 57344) >> 13 | var42 << 3) + 119 - 155 + 21 + 238 ^ 231) & 65535) >> 0;
            char var44 = (char)(
               (
                     (((var10004 | var42 << 3) + 119 - 155 + 21 + 238 ^ 231) & 65535) >> 0
                        | (((var42 & 57344) >> 13 | var42 << 3) + 119 - 155 + 21 + 238 ^ 231) << 16
                  )
                  - 64
            );
            var13.setCharAt(var23, (char)((var85 | var43 << 16) - 64));
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = 368239232 + -1932638567 ^ -1564399335; var29 < var16.length(); var29 += 586708368 - -876556756 ^ 1463265125) {
            char var49 = var16.charAt(var29);
            char var54 = (char)(
               (
                        (
                                 (
                                       (
                                                (
                                                         (((((var49 & 0) >> 16 | var49 << 0) & 65408) >> 7 | ((var49 & 0) >> 16 | var49 << 0) << 9) & 65024)
                                                               >> 9
                                                            | ((((var49 & 0) >> 16 | var49 << 0) & 65408) >> 7 | ((var49 & 0) >> 16 | var49 << 0) << 9) << 7
                                                      )
                                                      - 254
                                                   & 65534
                                             )
                                             >> 1
                                          | (
                                                   (((((var49 & 0) >> 16 | var49 << 0) & 65408) >> 7 | ((var49 & 0) >> 16 | var49 << 0) << 9) & 65024) >> 9
                                                      | ((((var49 & 0) >> 16 | var49 << 0) & 65408) >> 7 | ((var49 & 0) >> 16 | var49 << 0) << 9) << 7
                                                )
                                                - 254
                                             << 15
                                    )
                                    ^ 185
                                    ^ 232
                              )
                              + 183
                              - 45
                           & 64512
                     )
                     >> 10
                  | (
                           (
                                 (
                                          (
                                                   (((((var49 & 0) >> 16 | var49 << 0) & 65408) >> 7 | ((var49 & 0) >> 16 | var49 << 0) << 9) & 65024) >> 9
                                                      | ((((var49 & 0) >> 16 | var49 << 0) & 65408) >> 7 | ((var49 & 0) >> 16 | var49 << 0) << 9) << 7
                                                )
                                                - 254
                                             & 65534
                                       )
                                       >> 1
                                    | (
                                             (((((var49 & 0) >> 16 | var49 << 0) & 65408) >> 7 | ((var49 & 0) >> 16 | var49 << 0) << 9) & 65024) >> 9
                                                | ((((var49 & 0) >> 16 | var49 << 0) & 65408) >> 7 | ((var49 & 0) >> 16 | var49 << 0) << 9) << 7
                                          )
                                          - 254
                                       << 15
                              )
                              ^ 185
                              ^ 232
                        )
                        + 183
                        - 45
                     << 6
            );
            var16.setCharAt(
               var29,
               (char)(
                  (
                           (
                                    (
                                          (
                                                   (
                                                            (((((var49 & 0) >> 16 | var49 << 0) & 65408) >> 7 | ((var49 & 0) >> 16 | var49 << 0) << 9) & 65024)
                                                                  >> 9
                                                               | ((((var49 & 0) >> 16 | var49 << 0) & 65408) >> 7 | ((var49 & 0) >> 16 | var49 << 0) << 9) << 7
                                                         )
                                                         - 254
                                                      & 65534
                                                )
                                                >> 1
                                             | (
                                                      (((((var49 & 0) >> 16 | var49 << 0) & 65408) >> 7 | ((var49 & 0) >> 16 | var49 << 0) << 9) & 65024) >> 9
                                                         | ((((var49 & 0) >> 16 | var49 << 0) & 65408) >> 7 | ((var49 & 0) >> 16 | var49 << 0) << 9) << 7
                                                   )
                                                   - 254
                                                << 15
                                       )
                                       ^ 185
                                       ^ 232
                                 )
                                 + 183
                                 - 45
                              & 64512
                        )
                        >> 10
                     | (
                              (
                                    (
                                             (
                                                      (((((var49 & 0) >> 16 | var49 << 0) & 65408) >> 7 | ((var49 & 0) >> 16 | var49 << 0) << 9) & 65024) >> 9
                                                         | ((((var49 & 0) >> 16 | var49 << 0) & 65408) >> 7 | ((var49 & 0) >> 16 | var49 << 0) << 9) << 7
                                                   )
                                                   - 254
                                                & 65534
                                          )
                                          >> 1
                                       | (
                                                (((((var49 & 0) >> 16 | var49 << 0) & 65408) >> 7 | ((var49 & 0) >> 16 | var49 << 0) << 9) & 65024) >> 9
                                                   | ((((var49 & 0) >> 16 | var49 << 0) & 65408) >> 7 | ((var49 & 0) >> 16 | var49 << 0) << 9) << 7
                                             )
                                             - 254
                                          << 15
                                 )
                                 ^ 185
                                 ^ 232
                           )
                           + 183
                           - 45
                        << 6
               )
            );
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_124.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = -984090260 ^ -1597250425 ^ -984090260 + -1597250425 ^ 62898200;
            var35 < var19.length();
            var35 += (1722889340 * -388582969 | 1) & 88491785
         ) {
            int var59 = var19.charAt(var35) + 135;
            char var64 = (char)(
               (
                     (
                              (
                                    (
                                             (
                                                   (
                                                            (
                                                                     ((((var59 & 57344) >> 13 | var59 << 3) ^ 40) & 64512) >> 10
                                                                        | (((var59 & 57344) >> 13 | var59 << 3) ^ 40) << 6
                                                                  )
                                                                  + 33
                                                                  - 180
                                                               & 32768
                                                         )
                                                         >> 15
                                                      | (
                                                               ((((var59 & 57344) >> 13 | var59 << 3) ^ 40) & 64512) >> 10
                                                                  | (((var59 & 57344) >> 13 | var59 << 3) ^ 40) << 6
                                                            )
                                                            + 33
                                                            - 180
                                                         << 1
                                                )
                                                & 49152
                                          )
                                          >> 14
                                       | (
                                             (
                                                      (
                                                               ((((var59 & 57344) >> 13 | var59 << 3) ^ 40) & 64512) >> 10
                                                                  | (((var59 & 57344) >> 13 | var59 << 3) ^ 40) << 6
                                                            )
                                                            + 33
                                                            - 180
                                                         & 32768
                                                   )
                                                   >> 15
                                                | (
                                                         ((((var59 & 57344) >> 13 | var59 << 3) ^ 40) & 64512) >> 10
                                                            | (((var59 & 57344) >> 13 | var59 << 3) ^ 40) << 6
                                                      )
                                                      + 33
                                                      - 180
                                                   << 1
                                          )
                                          << 2
                                 )
                                 & 65528
                           )
                           >> 3
                        | (
                              (
                                       (
                                             (
                                                      (
                                                               ((((var59 & 57344) >> 13 | var59 << 3) ^ 40) & 64512) >> 10
                                                                  | (((var59 & 57344) >> 13 | var59 << 3) ^ 40) << 6
                                                            )
                                                            + 33
                                                            - 180
                                                         & 32768
                                                   )
                                                   >> 15
                                                | (
                                                         ((((var59 & 57344) >> 13 | var59 << 3) ^ 40) & 64512) >> 10
                                                            | (((var59 & 57344) >> 13 | var59 << 3) ^ 40) << 6
                                                      )
                                                      + 33
                                                      - 180
                                                   << 1
                                          )
                                          & 49152
                                    )
                                    >> 14
                                 | (
                                       (
                                                (((((var59 & 57344) >> 13 | var59 << 3) ^ 40) & 64512) >> 10 | (((var59 & 57344) >> 13 | var59 << 3) ^ 40) << 6)
                                                      + 33
                                                      - 180
                                                   & 32768
                                             )
                                             >> 15
                                          | (((((var59 & 57344) >> 13 | var59 << 3) ^ 40) & 64512) >> 10 | (((var59 & 57344) >> 13 | var59 << 3) ^ 40) << 6)
                                                + 33
                                                - 180
                                             << 1
                                    )
                                    << 2
                           )
                           << 13
                  )
                  - 16
            );
            var19.setCharAt(
               var35,
               (char)(
                  (
                        (
                                 (
                                       (
                                                (
                                                      (
                                                               (
                                                                        ((((var59 & 57344) >> 13 | var59 << 3) ^ 40) & 64512) >> 10
                                                                           | (((var59 & 57344) >> 13 | var59 << 3) ^ 40) << 6
                                                                     )
                                                                     + 33
                                                                     - 180
                                                                  & 32768
                                                            )
                                                            >> 15
                                                         | (
                                                                  ((((var59 & 57344) >> 13 | var59 << 3) ^ 40) & 64512) >> 10
                                                                     | (((var59 & 57344) >> 13 | var59 << 3) ^ 40) << 6
                                                               )
                                                               + 33
                                                               - 180
                                                            << 1
                                                   )
                                                   & 49152
                                             )
                                             >> 14
                                          | (
                                                (
                                                         (
                                                                  ((((var59 & 57344) >> 13 | var59 << 3) ^ 40) & 64512) >> 10
                                                                     | (((var59 & 57344) >> 13 | var59 << 3) ^ 40) << 6
                                                               )
                                                               + 33
                                                               - 180
                                                            & 32768
                                                      )
                                                      >> 15
                                                   | (
                                                            ((((var59 & 57344) >> 13 | var59 << 3) ^ 40) & 64512) >> 10
                                                               | (((var59 & 57344) >> 13 | var59 << 3) ^ 40) << 6
                                                         )
                                                         + 33
                                                         - 180
                                                      << 1
                                             )
                                             << 2
                                    )
                                    & 65528
                              )
                              >> 3
                           | (
                                 (
                                          (
                                                (
                                                         (
                                                                  ((((var59 & 57344) >> 13 | var59 << 3) ^ 40) & 64512) >> 10
                                                                     | (((var59 & 57344) >> 13 | var59 << 3) ^ 40) << 6
                                                               )
                                                               + 33
                                                               - 180
                                                            & 32768
                                                      )
                                                      >> 15
                                                   | (
                                                            ((((var59 & 57344) >> 13 | var59 << 3) ^ 40) & 64512) >> 10
                                                               | (((var59 & 57344) >> 13 | var59 << 3) ^ 40) << 6
                                                         )
                                                         + 33
                                                         - 180
                                                      << 1
                                             )
                                             & 49152
                                       )
                                       >> 14
                                    | (
                                          (
                                                   (
                                                            ((((var59 & 57344) >> 13 | var59 << 3) ^ 40) & 64512) >> 10
                                                               | (((var59 & 57344) >> 13 | var59 << 3) ^ 40) << 6
                                                         )
                                                         + 33
                                                         - 180
                                                      & 32768
                                                )
                                                >> 15
                                             | (((((var59 & 57344) >> 13 | var59 << 3) ^ 40) & 64512) >> 10 | (((var59 & 57344) >> 13 | var59 << 3) ^ 40) << 6)
                                                   + 33
                                                   - 180
                                                << 1
                                       )
                                       << 2
                              )
                              << 13
                     )
                     - 16
               )
            );
         }

         Class var7 = Class.forName(var19.toString(), false, Class_124.class.getClassLoader());
         switch ((((var4 + 1077492513 - 831579783 - 1265968345 - 1083361712 ^ 1968296338) - 950244328 ^ 1254314751) - 1901131599 ^ 1388789943) - 827997982) {
            case 8024978:
               var10000 = var0.findConstructor(var7, var6);
               break;
            case 29500061:
            case 86263931:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 901964288:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            case 1610877243:
               var10000 = var0.findSpecial(var7, var5, var6, Class_124.class);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_2137[(((var10 ^ 148086008) - 479083754 + 1350219826 ^ 253040964) - 380524625 ^ 885309522) + 442019085 - 642748609 + 618488466 + 1919258238] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1414(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 - 1595584432 - 213747868 ^ 938359631) + 625279343 + 289317016 - 2091397326 ^ 438133982) + 1876555762 - 2137432951;
      MethodHandle var10000 = field_2137[((var10 - 1595584432 - 213747868 ^ 938359631) + 625279343 + 289317016 - 2091397326 ^ 438133982)
         + 1876555762
         - 2137432951
         + 811291552];
      if (field_2137[var10001 + 811291552] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = (-345149901 >>> 188606510 | 0) & -519286272;
            var24 < var14.length();
            var24 += (1754046407 + (1797763550 | 1754046407) | 1) & 146866241
         ) {
            int var43 = var14.charAt(var24);
            int var10004 = (var43 & 65472) >> 6;
            int var44 = ((var43 & 65472) >> 6 | var43 << 10) + 24 + 226;
            int var92 = (((var43 & 65472) >> 6 | var43 << 10) + 24 + 226 & 65408) >> 7;
            var43 = (((var10004 | var43 << 10) + 24 + 226 & 65408) >> 7 | ((var43 & 65472) >> 6 | var43 << 10) + 24 + 226 << 9) + 250;
            var10004 = ((var92 | var44 << 9) + 250 & 65535) >> 0;
            int var46 = (((var92 | var44 << 9) + 250 & 65535) >> 0 | var43 << 16) + 145;
            int var94 = ((((var92 | var44 << 9) + 250 & 65535) >> 0 | var43 << 16) + 145 & 32768) >> 15;
            var43 = ((var10004 | var43 << 16) + 145 & 32768) >> 15 | (((var92 | var44 << 9) + 250 & 65535) >> 0 | var43 << 16) + 145 << 1;
            var10004 = ((var94 | var46 << 1) & 64512) >> 10;
            int var48 = ((var94 | var46 << 1) & 64512) >> 10 | var43 << 6;
            int var96 = ((((var94 | var46 << 1) & 64512) >> 10 | var43 << 6) & 65532) >> 2;
            char var49 = (char)(((var10004 | var43 << 6) & 65532) >> 2 | (((var94 | var46 << 1) & 64512) >> 10 | var43 << 6) << 14);
            var14.setCharAt(var24, (char)(var96 | var48 << 14));
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = (-1569596500 >>> 55202504 | 0) & 1444414496; var30 < var17.length(); var30 += -1898005993 >> 780527345 ^ -14482) {
            int var54 = var17.charAt(var30) - '(';
            int var97 = (var54 & 65520) >> 4;
            int var55 = (var54 & 65520) >> 4 | var54 << 12;
            int var98 = (((var54 & 65520) >> 4 | var54 << 12) & 65504) >> 5;
            var54 = ((((var97 | var54 << 12) & 65504) >> 5 | ((var54 & 65520) >> 4 | var54 << 12) << 11) ^ 77) - 64 - 43;
            var97 = (((var98 | var55 << 11) ^ 77) - 64 - 43 & 61440) >> 12;
            int var57 = ((((var98 | var55 << 11) ^ 77) - 64 - 43 & 61440) >> 12 | var54 << 4) - 30;
            int var100 = (((((var98 | var55 << 11) ^ 77) - 64 - 43 & 61440) >> 12 | var54 << 4) - 30 & 57344) >> 13;
            char var58 = (char)(
               (((var97 | var54 << 4) - 30 & 57344) >> 13 | ((((var98 | var55 << 11) ^ 77) - 64 - 43 & 61440) >> 12 | var54 << 4) - 30 << 3) + 101
            );
            var17.setCharAt(var30, (char)((var100 | var57 << 3) + 101));
         }

         Class var6 = Class.forName(var17.toString(), false, Class_124.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = 139317281 << -929056706 ^ 1073741824; var36 < var20.length(); var36 += 56431896 >> -1313650700 ^ 52) {
            int var63 = var20.charAt(var36) - 'P' - 236 + 70;
            char var68 = (char)(
               (
                        (
                              (
                                       (
                                             (
                                                      (
                                                            (((var63 & 65024) >> 9 | var63 << 7) + 94 - 55 & 65528) >> 3
                                                               | ((var63 & 65024) >> 9 | var63 << 7) + 94 - 55 << 13
                                                         )
                                                         & 65520
                                                   )
                                                   >> 4
                                                | (
                                                      (((var63 & 65024) >> 9 | var63 << 7) + 94 - 55 & 65528) >> 3
                                                         | ((var63 & 65024) >> 9 | var63 << 7) + 94 - 55 << 13
                                                   )
                                                   << 12
                                          )
                                          & 65535
                                    )
                                    >> 0
                                 | (
                                       (
                                                (
                                                      (((var63 & 65024) >> 9 | var63 << 7) + 94 - 55 & 65528) >> 3
                                                         | ((var63 & 65024) >> 9 | var63 << 7) + 94 - 55 << 13
                                                   )
                                                   & 65520
                                             )
                                             >> 4
                                          | ((((var63 & 65024) >> 9 | var63 << 7) + 94 - 55 & 65528) >> 3 | ((var63 & 65024) >> 9 | var63 << 7) + 94 - 55 << 13)
                                             << 12
                                    )
                                    << 16
                           )
                           & 64512
                     )
                     >> 10
                  | (
                        (
                                 (
                                       (
                                                (
                                                      (((var63 & 65024) >> 9 | var63 << 7) + 94 - 55 & 65528) >> 3
                                                         | ((var63 & 65024) >> 9 | var63 << 7) + 94 - 55 << 13
                                                   )
                                                   & 65520
                                             )
                                             >> 4
                                          | ((((var63 & 65024) >> 9 | var63 << 7) + 94 - 55 & 65528) >> 3 | ((var63 & 65024) >> 9 | var63 << 7) + 94 - 55 << 13)
                                             << 12
                                    )
                                    & 65535
                              )
                              >> 0
                           | (
                                 (((((var63 & 65024) >> 9 | var63 << 7) + 94 - 55 & 65528) >> 3 | ((var63 & 65024) >> 9 | var63 << 7) + 94 - 55 << 13) & 65520)
                                       >> 4
                                    | ((((var63 & 65024) >> 9 | var63 << 7) + 94 - 55 & 65528) >> 3 | ((var63 & 65024) >> 9 | var63 << 7) + 94 - 55 << 13)
                                       << 12
                              )
                              << 16
                     )
                     << 6
            );
            var20.setCharAt(
               var36,
               (char)(
                  (
                           (
                                 (
                                          (
                                                (
                                                         (
                                                               (((var63 & 65024) >> 9 | var63 << 7) + 94 - 55 & 65528) >> 3
                                                                  | ((var63 & 65024) >> 9 | var63 << 7) + 94 - 55 << 13
                                                            )
                                                            & 65520
                                                      )
                                                      >> 4
                                                   | (
                                                         (((var63 & 65024) >> 9 | var63 << 7) + 94 - 55 & 65528) >> 3
                                                            | ((var63 & 65024) >> 9 | var63 << 7) + 94 - 55 << 13
                                                      )
                                                      << 12
                                             )
                                             & 65535
                                       )
                                       >> 0
                                    | (
                                          (
                                                   (
                                                         (((var63 & 65024) >> 9 | var63 << 7) + 94 - 55 & 65528) >> 3
                                                            | ((var63 & 65024) >> 9 | var63 << 7) + 94 - 55 << 13
                                                      )
                                                      & 65520
                                                )
                                                >> 4
                                             | (
                                                   (((var63 & 65024) >> 9 | var63 << 7) + 94 - 55 & 65528) >> 3
                                                      | ((var63 & 65024) >> 9 | var63 << 7) + 94 - 55 << 13
                                                )
                                                << 12
                                       )
                                       << 16
                              )
                              & 64512
                        )
                        >> 10
                     | (
                           (
                                    (
                                          (
                                                   (
                                                         (((var63 & 65024) >> 9 | var63 << 7) + 94 - 55 & 65528) >> 3
                                                            | ((var63 & 65024) >> 9 | var63 << 7) + 94 - 55 << 13
                                                      )
                                                      & 65520
                                                )
                                                >> 4
                                             | (
                                                   (((var63 & 65024) >> 9 | var63 << 7) + 94 - 55 & 65528) >> 3
                                                      | ((var63 & 65024) >> 9 | var63 << 7) + 94 - 55 << 13
                                                )
                                                << 12
                                       )
                                       & 65535
                                 )
                                 >> 0
                              | (
                                    (
                                             (
                                                   (((var63 & 65024) >> 9 | var63 << 7) + 94 - 55 & 65528) >> 3
                                                      | ((var63 & 65024) >> 9 | var63 << 7) + 94 - 55 << 13
                                                )
                                                & 65520
                                          )
                                          >> 4
                                       | ((((var63 & 65024) >> 9 | var63 << 7) + 94 - 55 & 65528) >> 3 | ((var63 & 65024) >> 9 | var63 << 7) + 94 - 55 << 13)
                                          << 12
                                 )
                                 << 16
                        )
                        << 6
               )
            );
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_124.class.getClassLoader()).returnType();
         switch ((var4 - 733210007 ^ 1313192321 ^ 1033855348 ^ 1242961071) - 13471996 + 321932036 - 1406063921 - 163469320 - 1439067758 ^ 800357496) {
            case 1028880128:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            case 1724576258:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            case 1779331342:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            case 1986814770:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_2137[((var10 - 1595584432 - 213747868 ^ 938359631) + 625279343 + 289317016 - 2091397326 ^ 438133982) + 1876555762 - 2137432951 + 811291552] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
