import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;

public class Class_304 extends Class_342 {
   // $VF: renamed from: yug java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_1851 = new MethodHandle[11];

   public Class_304() {
      int var10001 = 0;

      StringBuilder var10002;
      for (var10002 = (StringBuilder)0<"JNT",-356253213,"耖胂胞胂胶耞","⋳닳⫴㻴\u1af4㻴㛳㋴㻴㫴围㛳蛳ዴ\u0af4Ỵ㫴围\ue6f3ỳ髳","壍墅堭墅嫭壝墅壭墵嫭夕堝堍壅壭墵妍堥壅壝墝墥堍",-1919993479>("䶀嘀吀劀䂀倀庀䖀匀墀");
         var10001 < (1566478205 >>> 897675745 ^ 783239092);
         var10001 += (-263006106 >> -263006106 | 1) & 524433
      ) {
         int var6 = 0<"JNT",249541555,"肪胆肢胮耢胶","⋳黳ỳ웳","壍墅堭墅嫭壝墅壭墵嫭夕堝堍壅壭墵妍堥壅壝墝墥堍",-1919993482>(var10002, var10001);
         int var10005 = (var6 & 65532) >> 2;
         int var7 = (var6 & 65532) >> 2 | var6 << 14;
         int var24 = (((var6 & 65532) >> 2 | var6 << 14) & 64512) >> 10;
         var6 = ((var10005 | var6 << 14) & 64512) >> 10 | ((var6 & 65532) >> 2 | var6 << 14) << 6;
         var10005 = ((var24 | var7 << 6) & 0) >> 16;
         int var9 = ((var24 | var7 << 6) & 0) >> 16 | var6 << 0;
         int var26 = ((((var24 | var7 << 6) & 0) >> 16 | var6 << 0) & 63488) >> 11;
         char var10 = (char)((((var10005 | var6 << 0) & 63488) >> 11 | (((var24 | var7 << 6) & 0) >> 16 | var6 << 0) << 5) ^ 201);
         0<"JNT",249541555,"胪育胶耪胆肢胮耢胶","⋳黳웳ỳ髳","壍墅堭墅嫭壝墅壭墵嫭夕堝堍壅壭墵妍堥壅壝墝墥堍",-1919993481>(var10002, var10001, (char)((var26 | var9 << 5) ^ 201));
      }

      String var2 = 0<"JNT",249541555,"胶胚聪胶胮胂胞肺","⋳ỳ닳⫴㻴\u1af4㻴㛳㋴㻴㫴围㛳蛳ዴ\u0af4Ỵ㫴围\ue6f3","壍墅堭墅嫭壝墅壭墵嫭夕堝堍壅壭墵妍堥壅壝墝墥堍",-1919993480>(var10002);
      int var4 = (-931715546 * 382965254 * 382965254 | 0) & -2042486750;

      StringBuilder var12;
      for (var12 = (StringBuilder)0<"JNT",-356253213,"耖胂胞胂胶耞","⋳닳⫴㻴\u1af4㻴㛳㋴㻴㫴围㛳蛳ዴ\u0af4Ỵ㫴围\ue6f3ỳ髳","壍墅堭墅嫭壝墅壭墵嫭夕堝堍壅壭墵妍堥壅壝墝墥堍",-1919993487>(
            "⢕梚⢜⢞⢝梈梔梛ꢘꢞꢙ\ue89c⢝梈ꢐ⢙條ꢝꢘ梛梈梒ꢚ條\ue890⢜梞"
         );
         var4 < 27;
         var4 += (-975349803 & -975349803 | 0) & 133161
      ) {
         int var18 = 0<"JNT",249541555,"肪胆肢胮耢胶","⋳黳ỳ웳","壍墅堭墅嫭壝墅壭墵嫭夕堝堍壅壭墵妍堥壅壝墝墥堍",-1919993478>(var12, var4);
         int var10006 = (var18 & 63488) >> 11;
         int var19 = (var18 & 63488) >> 11 | var18 << 5;
         int var31 = (((var18 & 63488) >> 11 | var18 << 5) & 49152) >> 14;
         var18 = ((var10006 | var18 << 5) & 49152) >> 14 | ((var18 & 63488) >> 11 | var18 << 5) << 2;
         var10006 = ((var31 | var19 << 2) & 49152) >> 14;
         int var21 = (((var31 | var19 << 2) & 49152) >> 14 | var18 << 2) - 209;
         int var33 = ((((var31 | var19 << 2) & 49152) >> 14 | var18 << 2) - 209 & 65408) >> 7;
         char var22 = (char)(((var10006 | var18 << 2) - 209 & 65408) >> 7 | (((var31 | var19 << 2) & 49152) >> 14 | var18 << 2) - 209 << 9);
         0<"JNT",249541555,"胪育胶耪胆肢胮耢胶","⋳黳웳ỳ髳","壍墅堭墅嫭壝墅壭墵嫭夕堝堍壅壭墵妍堥壅壝墝墥堍",-1919993477>(var12, var4, (char)(var33 | var21 << 9));
      }

      super(
         var2,
         0<"JNT",249541555,"胶胚聪胶胮胂胞肺","⋳ỳ닳⫴㻴\u1af4㻴㛳㋴㻴㫴围㛳蛳ዴ\u0af4Ỵ㫴围\ue6f3","壍墅堭墅嫭壝墅壭墵嫭夕堝堍壅壭墵妍堥壅壝墝墥堍",-1919993476>(var12),
         -1,
         1<"JNT",1889552364,"셀텀","Ǒ\u009f","\ueab8쪸檼쬶ꬱ誾",1593994807>()
      );
   }

   // $VF: renamed from: mg () void
   @Override
   public void method_1407() {
      0<"JNT",-600104158,"胒肺","⋳ỳ髳","堥堕墭",-1919993486>(this);
   }

   // $VF: renamed from: q () void
   @Override
   public void method_1408() {
      0<"JNT",-600104158,"胢","⋳ỳ髳","堥堕墭",-1919993485>(this);
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1413(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = (var10 - 1188710767 + 1956060445 - 1268287379 + 1626978375 - 1895204255 - 275148532 + 309959392 ^ 526094861) - 1777374820;
      MethodHandle var10000 = field_1851[(var10 - 1188710767 + 1956060445 - 1268287379 + 1626978375 - 1895204255 - 275148532 + 309959392 ^ 526094861)
            - 1777374820
         ^ 346152897];
      if (field_1851[var10001 ^ 346152897] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = 1802125 + 523491646 ^ 525293771; var23 < var13.length(); var23 += -1792822894 - (-1039925278 << -1437047415) ^ -1927025261) {
            int var42 = var13.charAt(var23) - 161 + 165;
            char var47 = (char)(
               (
                        (
                              (
                                       (
                                                (
                                                         (
                                                                  (
                                                                        (((var42 & 65534) >> 1 | var42 << 15) & 65528) >> 3
                                                                           | ((var42 & 65534) >> 1 | var42 << 15) << 13
                                                                     )
                                                                     & 49152
                                                               )
                                                               >> 14
                                                            | ((((var42 & 65534) >> 1 | var42 << 15) & 65528) >> 3 | ((var42 & 65534) >> 1 | var42 << 15) << 13)
                                                               << 2
                                                      )
                                                      + 49
                                                   & 63488
                                             )
                                             >> 11
                                          | (
                                                   (((((var42 & 65534) >> 1 | var42 << 15) & 65528) >> 3 | ((var42 & 65534) >> 1 | var42 << 15) << 13) & 49152)
                                                         >> 14
                                                      | ((((var42 & 65534) >> 1 | var42 << 15) & 65528) >> 3 | ((var42 & 65534) >> 1 | var42 << 15) << 13) << 2
                                                )
                                                + 49
                                             << 5
                                    )
                                    + 185
                                 ^ 45
                           )
                           & 65504
                     )
                     >> 5
                  | (
                        (
                                 (
                                          (
                                                   (((((var42 & 65534) >> 1 | var42 << 15) & 65528) >> 3 | ((var42 & 65534) >> 1 | var42 << 15) << 13) & 49152)
                                                         >> 14
                                                      | ((((var42 & 65534) >> 1 | var42 << 15) & 65528) >> 3 | ((var42 & 65534) >> 1 | var42 << 15) << 13) << 2
                                                )
                                                + 49
                                             & 63488
                                       )
                                       >> 11
                                    | (
                                             (((((var42 & 65534) >> 1 | var42 << 15) & 65528) >> 3 | ((var42 & 65534) >> 1 | var42 << 15) << 13) & 49152) >> 14
                                                | ((((var42 & 65534) >> 1 | var42 << 15) & 65528) >> 3 | ((var42 & 65534) >> 1 | var42 << 15) << 13) << 2
                                          )
                                          + 49
                                       << 5
                              )
                              + 185
                           ^ 45
                     )
                     << 11
            );
            var13.setCharAt(
               var23,
               (char)(
                  (
                           (
                                 (
                                          (
                                                   (
                                                            (
                                                                     (
                                                                           (((var42 & 65534) >> 1 | var42 << 15) & 65528) >> 3
                                                                              | ((var42 & 65534) >> 1 | var42 << 15) << 13
                                                                        )
                                                                        & 49152
                                                                  )
                                                                  >> 14
                                                               | (
                                                                     (((var42 & 65534) >> 1 | var42 << 15) & 65528) >> 3
                                                                        | ((var42 & 65534) >> 1 | var42 << 15) << 13
                                                                  )
                                                                  << 2
                                                         )
                                                         + 49
                                                      & 63488
                                                )
                                                >> 11
                                             | (
                                                      (
                                                               (
                                                                     (((var42 & 65534) >> 1 | var42 << 15) & 65528) >> 3
                                                                        | ((var42 & 65534) >> 1 | var42 << 15) << 13
                                                                  )
                                                                  & 49152
                                                            )
                                                            >> 14
                                                         | ((((var42 & 65534) >> 1 | var42 << 15) & 65528) >> 3 | ((var42 & 65534) >> 1 | var42 << 15) << 13)
                                                            << 2
                                                   )
                                                   + 49
                                                << 5
                                       )
                                       + 185
                                    ^ 45
                              )
                              & 65504
                        )
                        >> 5
                     | (
                           (
                                    (
                                             (
                                                      (
                                                               (
                                                                     (((var42 & 65534) >> 1 | var42 << 15) & 65528) >> 3
                                                                        | ((var42 & 65534) >> 1 | var42 << 15) << 13
                                                                  )
                                                                  & 49152
                                                            )
                                                            >> 14
                                                         | ((((var42 & 65534) >> 1 | var42 << 15) & 65528) >> 3 | ((var42 & 65534) >> 1 | var42 << 15) << 13)
                                                            << 2
                                                   )
                                                   + 49
                                                & 63488
                                          )
                                          >> 11
                                       | (
                                                (((((var42 & 65534) >> 1 | var42 << 15) & 65528) >> 3 | ((var42 & 65534) >> 1 | var42 << 15) << 13) & 49152)
                                                      >> 14
                                                   | ((((var42 & 65534) >> 1 | var42 << 15) & 65528) >> 3 | ((var42 & 65534) >> 1 | var42 << 15) << 13) << 2
                                             )
                                             + 49
                                          << 5
                                 )
                                 + 185
                              ^ 45
                        )
                        << 11
               )
            );
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = 2144865386 >>> 1571099411 ^ 4091; var29 < var16.length(); var29 += (319791969 - -1923059142 | 0) & 1745915417) {
            char var52 = var16.charAt(var29);
            char var57 = (char)(
               (
                        (
                                 (
                                          (
                                                (
                                                         (
                                                                  (
                                                                        (((var52 & '￼') >> 2 | var52 << 14) + 193 & 65504) >> 5
                                                                           | ((var52 & '￼') >> 2 | var52 << 14) + 193 << 11
                                                                     )
                                                                     ^ 206
                                                               )
                                                               - 71
                                                            & 65528
                                                      )
                                                      >> 3
                                                   | (
                                                            (
                                                                  (((var52 & '￼') >> 2 | var52 << 14) + 193 & 65504) >> 5
                                                                     | ((var52 & '￼') >> 2 | var52 << 14) + 193 << 11
                                                               )
                                                               ^ 206
                                                         )
                                                         - 71
                                                      << 13
                                             )
                                             & 65504
                                       )
                                       >> 5
                                    | (
                                          (
                                                   (
                                                            (
                                                                  (((var52 & '￼') >> 2 | var52 << 14) + 193 & 65504) >> 5
                                                                     | ((var52 & '￼') >> 2 | var52 << 14) + 193 << 11
                                                               )
                                                               ^ 206
                                                         )
                                                         - 71
                                                      & 65528
                                                )
                                                >> 3
                                             | (
                                                      ((((var52 & '￼') >> 2 | var52 << 14) + 193 & 65504) >> 5 | ((var52 & '￼') >> 2 | var52 << 14) + 193 << 11)
                                                         ^ 206
                                                   )
                                                   - 71
                                                << 13
                                       )
                                       << 11
                              )
                              + 32
                              + 243
                           & 63488
                     )
                     >> 11
                  | (
                           (
                                    (
                                          (
                                                   (
                                                            (
                                                                  (((var52 & '￼') >> 2 | var52 << 14) + 193 & 65504) >> 5
                                                                     | ((var52 & '￼') >> 2 | var52 << 14) + 193 << 11
                                                               )
                                                               ^ 206
                                                         )
                                                         - 71
                                                      & 65528
                                                )
                                                >> 3
                                             | (
                                                      ((((var52 & '￼') >> 2 | var52 << 14) + 193 & 65504) >> 5 | ((var52 & '￼') >> 2 | var52 << 14) + 193 << 11)
                                                         ^ 206
                                                   )
                                                   - 71
                                                << 13
                                       )
                                       & 65504
                                 )
                                 >> 5
                              | (
                                    (
                                             (((((var52 & '￼') >> 2 | var52 << 14) + 193 & 65504) >> 5 | ((var52 & '￼') >> 2 | var52 << 14) + 193 << 11) ^ 206)
                                                   - 71
                                                & 65528
                                          )
                                          >> 3
                                       | (((((var52 & '￼') >> 2 | var52 << 14) + 193 & 65504) >> 5 | ((var52 & '￼') >> 2 | var52 << 14) + 193 << 11) ^ 206)
                                             - 71
                                          << 13
                                 )
                                 << 11
                        )
                        + 32
                        + 243
                     << 5
            );
            var16.setCharAt(
               var29,
               (char)(
                  (
                           (
                                    (
                                             (
                                                   (
                                                            (
                                                                     (
                                                                           (((var52 & '￼') >> 2 | var52 << 14) + 193 & 65504) >> 5
                                                                              | ((var52 & '￼') >> 2 | var52 << 14) + 193 << 11
                                                                        )
                                                                        ^ 206
                                                                  )
                                                                  - 71
                                                               & 65528
                                                         )
                                                         >> 3
                                                      | (
                                                               (
                                                                     (((var52 & '￼') >> 2 | var52 << 14) + 193 & 65504) >> 5
                                                                        | ((var52 & '￼') >> 2 | var52 << 14) + 193 << 11
                                                                  )
                                                                  ^ 206
                                                            )
                                                            - 71
                                                         << 13
                                                )
                                                & 65504
                                          )
                                          >> 5
                                       | (
                                             (
                                                      (
                                                               (
                                                                     (((var52 & '￼') >> 2 | var52 << 14) + 193 & 65504) >> 5
                                                                        | ((var52 & '￼') >> 2 | var52 << 14) + 193 << 11
                                                                  )
                                                                  ^ 206
                                                            )
                                                            - 71
                                                         & 65528
                                                   )
                                                   >> 3
                                                | (
                                                         (
                                                               (((var52 & '￼') >> 2 | var52 << 14) + 193 & 65504) >> 5
                                                                  | ((var52 & '￼') >> 2 | var52 << 14) + 193 << 11
                                                            )
                                                            ^ 206
                                                      )
                                                      - 71
                                                   << 13
                                          )
                                          << 11
                                 )
                                 + 32
                                 + 243
                              & 63488
                        )
                        >> 11
                     | (
                              (
                                       (
                                             (
                                                      (
                                                               (
                                                                     (((var52 & '￼') >> 2 | var52 << 14) + 193 & 65504) >> 5
                                                                        | ((var52 & '￼') >> 2 | var52 << 14) + 193 << 11
                                                                  )
                                                                  ^ 206
                                                            )
                                                            - 71
                                                         & 65528
                                                   )
                                                   >> 3
                                                | (
                                                         (
                                                               (((var52 & '￼') >> 2 | var52 << 14) + 193 & 65504) >> 5
                                                                  | ((var52 & '￼') >> 2 | var52 << 14) + 193 << 11
                                                            )
                                                            ^ 206
                                                      )
                                                      - 71
                                                   << 13
                                          )
                                          & 65504
                                    )
                                    >> 5
                                 | (
                                       (
                                                (
                                                         (
                                                               (((var52 & '￼') >> 2 | var52 << 14) + 193 & 65504) >> 5
                                                                  | ((var52 & '￼') >> 2 | var52 << 14) + 193 << 11
                                                            )
                                                            ^ 206
                                                      )
                                                      - 71
                                                   & 65528
                                             )
                                             >> 3
                                          | (((((var52 & '￼') >> 2 | var52 << 14) + 193 & 65504) >> 5 | ((var52 & '￼') >> 2 | var52 << 14) + 193 << 11) ^ 206)
                                                - 71
                                             << 13
                                    )
                                    << 11
                           )
                           + 32
                           + 243
                        << 5
               )
            );
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), Class_304.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = (547531711 >> 324793694 | 0) & 1506251820; var35 < var19.length(); var35 += -1599106977 * -231115633 ^ 1118023952) {
            int var62 = var19.charAt(var35);
            int var106 = (var62 & 65024) >> 9;
            int var63 = (var62 & 65024) >> 9 | var62 << 7;
            int var107 = (((var62 & 65024) >> 9 | var62 << 7) & 49152) >> 14;
            var62 = (((var106 | var62 << 7) & 49152) >> 14 | ((var62 & 65024) >> 9 | var62 << 7) << 2) ^ 103;
            var106 = (((var107 | var63 << 2) ^ 103) & 61440) >> 12;
            int var65 = (((var107 | var63 << 2) ^ 103) & 61440) >> 12 | var62 << 4;
            int var109 = (((((var107 | var63 << 2) ^ 103) & 61440) >> 12 | var62 << 4) & 65408) >> 7;
            var62 = (((var106 | var62 << 4) & 65408) >> 7 | ((((var107 | var63 << 2) ^ 103) & 61440) >> 12 | var62 << 4) << 9) + 166;
            var106 = ((var109 | var65 << 9) + 166 & 65024) >> 9;
            int var67 = ((var109 | var65 << 9) + 166 & 65024) >> 9 | var62 << 7;
            int var111 = ((((var109 | var65 << 9) + 166 & 65024) >> 9 | var62 << 7) & 63488) >> 11;
            var62 = ((var106 | var62 << 7) & 63488) >> 11 | (((var109 | var65 << 9) + 166 & 65024) >> 9 | var62 << 7) << 5;
            var106 = ((var111 | var67 << 5) & 65528) >> 3;
            int var69 = ((var111 | var67 << 5) & 65528) >> 3 | var62 << 13;
            int var113 = ((((var111 | var67 << 5) & 65528) >> 3 | var62 << 13) & 65532) >> 2;
            char var70 = (char)(((var106 | var62 << 13) & 65532) >> 2 | (((var111 | var67 << 5) & 65528) >> 3 | var62 << 13) << 14);
            var19.setCharAt(var35, (char)(var113 | var69 << 14));
         }

         Class var7 = Class.forName(var19.toString(), false, Class_304.class.getClassLoader());
         switch (((var4 + 1287821062 - 357769054 ^ 152514340) + 1291330141 - 2127256693 - 1785774038 - 1952091441 ^ 780121301 ^ 345248488) + 1261254308) {
            case 625872503:
            case 1333793281:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 1805361233:
               var10000 = var0.findConstructor(var7, var6);
               break;
            case 1846691419:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            case 2082586518:
               var10000 = var0.findSpecial(var7, var5, var6, Class_304.class);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_1851[(var10 - 1188710767 + 1956060445 - 1268287379 + 1626978375 - 1895204255 - 275148532 + 309959392 ^ 526094861) - 1777374820 ^ 346152897] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1414(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = ((var10 - 312098816 - 1756283994 + 1785005249 ^ 1052635316) - 1434482354 ^ 396664026 ^ 1480230907 ^ 310246669) + 877463160;
      MethodHandle var10000 = field_1851[((var10 - 312098816 - 1756283994 + 1785005249 ^ 1052635316) - 1434482354 ^ 396664026 ^ 1480230907 ^ 310246669)
            + 877463160
         ^ 2064500680];
      if (field_1851[var10001 ^ 2064500680] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = -2051268937 ^ -101272201 ^ 2085268416; var24 < var14.length(); var24 += -2012731532 >>> -2012731532 ^ 2177) {
            int var43 = var14.charAt(var24);
            int var10004 = (var43 & 61440) >> 12;
            int var44 = ((var43 & 61440) >> 12 | var43 << 4) - 182 - 129;
            int var86 = (((var43 & 61440) >> 12 | var43 << 4) - 182 - 129 & 57344) >> 13;
            var43 = ((var10004 | var43 << 4) - 182 - 129 & 57344) >> 13 | ((var43 & 61440) >> 12 | var43 << 4) - 182 - 129 << 3;
            var10004 = ((var86 | var44 << 3) & 0) >> 16;
            int var46 = (((var86 | var44 << 3) & 0) >> 16 | var43 << 0) - 215;
            int var88 = ((((var86 | var44 << 3) & 0) >> 16 | var43 << 0) - 215 & 65408) >> 7;
            var43 = (((var10004 | var43 << 0) - 215 & 65408) >> 7 | (((var86 | var44 << 3) & 0) >> 16 | var43 << 0) - 215 << 9) + 214;
            var10004 = ((var88 | var46 << 9) + 214 & 65408) >> 7;
            int var48 = ((var88 | var46 << 9) + 214 & 65408) >> 7 | var43 << 9;
            int var90 = ((((var88 | var46 << 9) + 214 & 65408) >> 7 | var43 << 9) & 65528) >> 3;
            char var49 = (char)(((var10004 | var43 << 9) & 65528) >> 3 | (((var88 | var46 << 9) + 214 & 65408) >> 7 | var43 << 9) << 13);
            var14.setCharAt(var24, (char)(var90 | var48 << 13));
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = (1173767155 | 1173767155) ^ 1173767155; var30 < var17.length(); var30 += (725837561 >>> 725837561 | 1) & -1551843709) {
            int var54 = (var17.charAt(var30) - ']' + 56 ^ 166) + 204 - 214;
            char var57 = (char)(
               (((((var54 & 65532) >> 2 | var54 << 14) & 32768) >> 15 | ((var54 & 65532) >> 2 | var54 << 14) << 1) - 6 - 1 & 0) >> 16
                  | ((((var54 & 65532) >> 2 | var54 << 14) & 32768) >> 15 | ((var54 & 65532) >> 2 | var54 << 14) << 1) - 6 - 1 << 0
            );
            var17.setCharAt(
               var30,
               (char)(
                  (((((var54 & 65532) >> 2 | var54 << 14) & 32768) >> 15 | ((var54 & 65532) >> 2 | var54 << 14) << 1) - 6 - 1 & 0) >> 16
                     | ((((var54 & 65532) >> 2 | var54 << 14) & 32768) >> 15 | ((var54 & 65532) >> 2 | var54 << 14) << 1) - 6 - 1 << 0
               )
            );
         }

         Class var6 = Class.forName(var17.toString(), false, Class_304.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = (-684733270 & -684733270 + -684733270 | 0) & 540038220;
            var36 < var20.length();
            var36 += (-1717475450 >> -1717475450 * -376318360 | 0) & 1609
         ) {
            char var62 = var20.charAt(var36);
            char var65 = (char)(
               (
                        (
                              (
                                       (
                                             ((((var62 & '쀀') >> 14 | var62 << 2) + 35 ^ 199 ^ 43) + 41 & 64512) >> 10
                                                | (((var62 & '쀀') >> 14 | var62 << 2) + 35 ^ 199 ^ 43) + 41 << 6
                                          )
                                          ^ 94
                                    )
                                    + 247
                                 ^ 172
                           )
                           & 65504
                     )
                     >> 5
                  | (
                        (
                                 (
                                       ((((var62 & '쀀') >> 14 | var62 << 2) + 35 ^ 199 ^ 43) + 41 & 64512) >> 10
                                          | (((var62 & '쀀') >> 14 | var62 << 2) + 35 ^ 199 ^ 43) + 41 << 6
                                    )
                                    ^ 94
                              )
                              + 247
                           ^ 172
                     )
                     << 11
            );
            var20.setCharAt(
               var36,
               (char)(
                  (
                           (
                                 (
                                          (
                                                ((((var62 & '쀀') >> 14 | var62 << 2) + 35 ^ 199 ^ 43) + 41 & 64512) >> 10
                                                   | (((var62 & '쀀') >> 14 | var62 << 2) + 35 ^ 199 ^ 43) + 41 << 6
                                             )
                                             ^ 94
                                       )
                                       + 247
                                    ^ 172
                              )
                              & 65504
                        )
                        >> 5
                     | (
                           (
                                    (
                                          ((((var62 & '쀀') >> 14 | var62 << 2) + 35 ^ 199 ^ 43) + 41 & 64512) >> 10
                                             | (((var62 & '쀀') >> 14 | var62 << 2) + 35 ^ 199 ^ 43) + 41 << 6
                                       )
                                       ^ 94
                                 )
                                 + 247
                              ^ 172
                        )
                        << 11
               )
            );
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), Class_304.class.getClassLoader()).returnType();
         switch ((((var4 ^ 869180723 ^ 1823742055) - 1644730885 ^ 822999862 ^ 400529937 ^ 575226822) - 1561023870 ^ 1271739835 ^ 1011883364) + 417812604) {
            case 881333383:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            case 1155482046:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            case 1907164217:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            case 2003481641:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_1851[((var10 - 312098816 - 1756283994 + 1785005249 ^ 1052635316) - 1434482354 ^ 396664026 ^ 1480230907 ^ 310246669) + 877463160 ^ 2064500680] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
