import dev.krypton.mixin.HandledScreenMixin;
import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;
import net.minecraft.class_1723;
import net.minecraft.class_1735;
import net.minecraft.class_490;

public class ScreenUI_326 extends Class_342 {
   // $VF: renamed from: ol Class_49
   public Class_49 field_1764;
   // $VF: renamed from: yp Class_105
   public Class_105 field_1765;
   // $VF: renamed from: xp Class_49
   public Class_49 field_1766;
   // $VF: renamed from: xyy Class_105
   public Class_105 field_1767;
   // $VF: renamed from: vjc int
   public int field_1768;
   // $VF: renamed from: fiu java.lang.invoke.MethodHandle[]
   public static final MethodHandle[] field_1769 = new MethodHandle[122];

   // $VF: Irreducible bytecode was duplicated to produce valid code
   public ScreenUI_326() {
      int var1 = 887461299;
      int var10001 = 280027152 >>> 650647494 ^ 4375424;

      StringBuilder var10002;
      for (var10002 = (StringBuilder)0<"JNT",-432648368,"芨館鮨館麨莨","\ueddf\uf6df︗ﰟĜﰟ\uef9fﺗﰟ７ﵗ\uef9f\uf89f\u0097\u0017\ufdd7７ﵗ\uf29f\uee1f寧","뼱⼱缰⼱，\udf31⼱Ｐ輱，伎弰㼰꼱Ｐ輱㼏漰꼱\udf31弱漱㼰",2113307907>(
            "à\ue0ec샭ꃫ䃭ã胡\ue0ec胭ꃫꃬ"
         );
         var10001 < ((-479860575 >> -479860575 | 11) & 172296587);
         var10001 += (-298870619 * (540178190 - 540178190) | 1) & 1176105215
      ) {
         int var38 = (
               (0<"JNT",-978320597,"阨風锨鶨蔨麨","\ueddf\uf61f\uee1f\uf49f","뼱⼱缰⼱，\udf31⼱Ｐ輱，伎弰㼰꼱Ｐ輱㼏漰꼱\udf31弱漱㼰",2113307600>(var10002, var10001) ^ 169) - 110 ^ 189
            )
            + 163;
         char var39 = (char)((var38 & 57344) >> 13 | var38 << 3);
         0<"JNT",-978320597,"鸨霨麨蘨風锨鶨蔨麨","\ueddf\uf61f\uf49f\uee1f寧","뼱⼱缰⼱，\udf31⼱Ｐ輱，伎弰㼰꼱Ｐ輱㼏漰꼱\udf31弱漱㼰",2113307597>(
            var10002, var10001, (char)((var38 & 57344) >> 13 | var38 << 3)
         );
      }

      String var10 = 0<"JNT",-978320597,"麨鰨踨麨鶨館鮨頨","\ueddf\uee1f\uf6df︗ﰟĜﰟ\uef9fﺗﰟ７ﵗ\uef9f\uf89f\u0097\u0017\ufdd7７ﵗ\uf29f","뼱⼱缰⼱，\udf31⼱Ｐ輱，伎弰㼰꼱Ｐ輱㼏漰꼱\udf31弱漱㼰",2113307880>(
         var10002
      );
      int var24 = (1654653979 + 1294452902 | 0) & 1345335818;

      StringBuilder var41;
      for (var41 = (StringBuilder)0<"JNT",-432648368,"芨館鮨館麨莨","\ueddf\uf6df︗ﰟĜﰟ\uef9fﺗﰟ７ﵗ\uef9f\uf89f\u0097\u0017\ufdd7７ﵗ\uf29f\uee1f寧","뼱⼱缰⼱，\udf31⼱Ｐ輱，伎弰㼰꼱Ｐ輱㼏漰꼱\udf31弱漱㼰",2113307877>(
            "䀆쇿䀀쀂\ue1ff\u0000\ue009쀁\ue009怀考怀䀂䀃\ue009쀂ꀃ\ue009考ꀂꀂ\ue002쀁ꀃ怂\ue009쀁ꀃ怂\ue009考\ue1ff怀쀂考ꀃ쀁怃怃쀀\ue009\ue002考怀 쀁 \ue009耀\ue002䀂ꀃ\ue009\ue002考ꀀ䀂 쀂ꀃ耂\ue009考ꀀ䀂 \ue009考ꀃ䀂\ue009쀂ꀃ\ue009쀂ꀃꀀ䀂ꀃ怀考 쀀"
         );
         var24 < ((-842713874 - -842713874 | 83) & 1638104539);
         var24 += (-284551531 >> (-284551531 & 258466797) | 1) & 11785
      ) {
         char var71 = 0<"JNT",-978320597,"阨風锨鶨蔨麨","\ueddf\uf61f\uee1f\uf49f","뼱⼱缰⼱，\udf31⼱Ｐ輱，伎弰㼰꼱Ｐ輱㼏漰꼱\udf31弱漱㼰",2113307588>(var41, var24);
         int var10006 = (var71 & '︀') >> 9;
         int var72 = ((var71 & '︀') >> 9 | var71 << 7) + 224 - 192;
         int var127 = (((var71 & '︀') >> 9 | var71 << 7) + 224 - 192 & 65520) >> 4;
         var71 = (char)((((var10006 | var71 << 7) + 224 - 192 & 65520) >> 4 | ((var71 & '︀') >> 9 | var71 << 7) + 224 - 192 << 12) ^ 113);
         0<"JNT",-978320597,"鸨霨麨蘨風锨鶨蔨麨","\ueddf\uf61f\uf49f\uee1f寧","뼱⼱缰⼱，\udf31⼱Ｐ輱，伎弰㼰꼱Ｐ輱㼏漰꼱\udf31弱漱㼰",2113306977>(
            var41, var24, (char)((var127 | var72 << 12) ^ 113)
         );
      }

      super(
         var10,
         0<"JNT",-978320597,"麨鰨踨麨鶨館鮨頨","\ueddf\uee1f\uf6df︗ﰟĜﰟ\uef9fﺗﰟ７ﵗ\uef9f\uf89f\u0097\u0017\ufdd7７ﵗ\uf29f","뼱⼱缰⼱，\udf31⼱Ｐ輱，伎弰㼰꼱Ｐ輱㼏漰꼱\udf31弱漱㼰",2113307861>(
            var41
         ),
         -1,
         1<"JNT",1672878852,"㿓㾠","᱇ᘇ","\u0005怅耉怃쀎⁻",1577193345>()
      );
      ScreenUI_326 var10000 = this;
      var10001 = (-2138943289 * 430506256 | 0) & -1574230901;

      for (var10002 = (StringBuilder)0<"JNT",-432648368,"芨館鮨館麨莨","\ueddf\uf6df︗ﰟĜﰟ\uef9fﺗﰟ７ﵗ\uef9f\uf89f\u0097\u0017\ufdd7７ﵗ\uf29f\uee1f寧","뼱⼱缰⼱，\udf31⼱Ｐ輱，伎弰㼰꼱Ｐ輱㼏漰꼱\udf31弱漱㼰",2113307903>(
            "쀣怦ꀥꀦ䀝쀡\ue025쀦急怨"
         );
         var10001 < ((-466152866 | -950525584 | 10) & 134219786);
         var10001 += (-1509726900 - 753063135 | 1) & -2045876847
      ) {
         char var44 = 0<"JNT",-978320597,"阨風锨鶨蔨麨","\ueddf\uf61f\uee1f\uf49f","뼱⼱缰⼱，\udf31⼱Ｐ輱，伎弰㼰꼱Ｐ輱㼏漰꼱\udf31弱漱㼰",2113307593>(var10002, var10001);
         int var108 = (var44 & '耀') >> 15;
         int var45 = ((var44 & '耀') >> 15 | var44 << 1) - 203 + 109;
         int var109 = (((var44 & '耀') >> 15 | var44 << 1) - 203 + 109 & 49152) >> 14;
         char var46 = (char)((((var108 | var44 << 1) - 203 + 109 & 49152) >> 14 | ((var44 & '耀') >> 15 | var44 << 1) - 203 + 109 << 2) + 175);
         0<"JNT",-978320597,"鸨霨麨蘨風锨鶨蔨麨","\ueddf\uf61f\uf49f\uee1f寧","뼱⼱缰⼱，\udf31⼱Ｐ輱，伎弰㼰꼱Ｐ輱㼏漰꼱\udf31弱漱㼰",2113307878>(
            var10002, var10001, (char)((var109 | var45 << 2) + 175)
         );
      }

      Class_49 var13 = (Class_49)0<"JNT",-432648368,"芨館鮨館麨莨","\ueddf\uf6df︗ﰟĜﰟ\uef9fﺗﰟ７ﵗ\uef9f\uf89f\u0097\u0017\ufdd7７ﵗ\uf29f\uf4df\uf4df\uf4df\uf4df\uee1f寧","弱伱",2113308038>(
         0<"JNT",-978320597,"麨鰨踨麨鶨館鮨頨","\ueddf\uee1f\uf6df︗ﰟĜﰟ\uef9fﺗﰟ７ﵗ\uef9f\uf89f\u0097\u0017\ufdd7７ﵗ\uf29f","뼱⼱缰⼱，\udf31⼱Ｐ輱，伎弰㼰꼱Ｐ輱㼏漰꼱\udf31弱漱㼰",2113307881>(
            var10002
         ),
         0.0,
         20.0,
         0.0,
         1.0
      );
      int var28 = (1968470444 << 44266196 | 0) & 556143451;
      var41 = (StringBuilder)0<"JNT",-432648368,"芨館鮨館麨莨","\ueddf\uf6df︗ﰟĜﰟ\uef9fﺗﰟ７ﵗ\uef9f\uf89f\u0097\u0017\ufdd7７ﵗ\uf29f\uee1f寧","뼱⼱缰⼱，\udf31⼱Ｐ輱，伎弰㼰꼱Ｐ輱㼏漰꼱\udf31弱漱㼰",2113307939>(
         "䀀\u000f耍耏耉䀝䀈耎䀝耈\r\u000f䀈䀝쀍\f䀈耈\f\f쀎䀝耎䀉\f쀉\r䀈\u000f耎쀎耉"
      );

      label100:
      while (true) {
         var1 = 502116309 << 502116309 + -862819539 ^ -2060191206;

         while (true) {
            label122: {
               switch ((var1 ^ 244506293) - 1608573698 + 2142083417 + 85632252 - 1838885962 + 568898681) {
                  case -1281433883:
                  default:
                     var10002 = var41;
                     if (var28 < (-496970347 + -1518664757 ^ -2015635126)) {
                        int var103 = (
                                 0<"JNT",-978320597,"阨風锨鶨蔨麨","\ueddf\uf61f\uee1f\uf49f","뼱⼱缰⼱，\udf31⼱Ｐ輱，伎弰㼰꼱Ｐ輱㼏漰꼱\udf31弱漱㼰",2113307863>(var41, var28) ^ 197
                              )
                              + 182
                           ^ 181
                           ^ 224;
                        char var104 = (char)((var103 & 57344) >> 13 | var103 << 3);
                        0<"JNT",-978320597,"鸨霨麨蘨風锨鶨蔨麨","\ueddf\uf61f\uf49f\uee1f寧","뼱⼱缰⼱，\udf31⼱Ｐ輱，伎弰㼰꼱Ｐ輱㼏漰꼱\udf31弱漱㼰",2113307884>(
                           var41, var28, (char)((var103 & 57344) >> 13 | var103 << 3)
                        );
                        var28 += (-40893735 * 1439405573 | 0) & 321995331;
                        break label122;
                     }

                     var1 = (-1122104838 << 128363908 | 684139707) & 1004532923;
                     break;
                  case -716406915:
                     var10002 = var41;
                     if (var28 < ((-1870311975 | -847107344 | 0) & 36900)) {
                        int var78 = 0<"JNT",-978320597,"阨風锨鶨蔨麨","\ueddf\uf61f\uee1f\uf49f","뼱⼱缰⼱，\udf31⼱Ｐ輱，伎弰㼰꼱Ｐ輱㼏漰꼱\udf31弱漱㼰",2113307898>(var41, var28);
                        int var128 = (var78 & 64512) >> 10;
                        int var79 = (var78 & 64512) >> 10 | var78 << 6;
                        int var129 = (((var78 & 64512) >> 10 | var78 << 6) & 65520) >> 4;
                        var78 = ((var128 | var78 << 6) & 65520) >> 4 | ((var78 & 64512) >> 10 | var78 << 6) << 12;
                        var128 = ((var129 | var79 << 12) & 64512) >> 10;
                        int var81 = ((var129 | var79 << 12) & 64512) >> 10 | var78 << 6;
                        int var131 = ((((var129 | var79 << 12) & 64512) >> 10 | var78 << 6) & 65472) >> 6;
                        char var82 = (char)((((var128 | var78 << 6) & 65472) >> 6 | (((var129 | var79 << 12) & 64512) >> 10 | var78 << 6) << 10) ^ 85);
                        0<"JNT",-978320597,"鸨霨麨蘨風锨鶨蔨麨","\ueddf\uf61f\uf49f\uee1f寧","뼱⼱缰⼱，\udf31⼱Ｐ輱，伎弰㼰꼱Ｐ輱㼏漰꼱\udf31弱漱㼰",2113307879>(
                           var41, var28, (char)((var131 | var81 << 10) ^ 85)
                        );
                        var28 += (-1142575845 >>> 1360670688 | 0) & 68288737;
                        continue label100;
                     }

                     var1 = 316517195 & -1908398027 ^ 1810410055;
               }

               Class_105 var16;
               int var32;
               switch ((var1 - 1366936284 + 299917425 + 449152542 ^ 455736637) - 1380014893 - 820030050) {
                  case -1934088252:
                     var10000.field_1766 = 0<"JNT",-978320597,"鰨館風","\ueddf\uf6df︗ﰟĜﰟ\uef9fﺗﰟ７ﵗ\uef9f\uf89f\u0097\u0017\ufdd7７ﵗ\uf29f\uee1f\uf6dfﲗﱗ\uf29f","弱伱",2113307904>(
                        var13,
                        0<"JNT",-978320597,"麨鰨踨麨鶨館鮨頨","\ueddf\uee1f\uf6df︗ﰟĜﰟ\uef9fﺗﰟ７ﵗ\uef9f\uf89f\u0097\u0017\ufdd7７ﵗ\uf29f","뼱⼱缰⼱，\udf31⼱Ｐ輱，伎弰㼰꼱Ｐ輱㼏漰꼱\udf31弱漱㼰",2113307899>(
                           var10002
                        )
                     );
                     var10000 = this;
                     var10001 = (-1648206209 + -1648206209 | 0) & 1074987521;

                     for (var10002 = (StringBuilder)0<"JNT",-432648368,"芨館鮨館麨莨","\ueddf\uf6df︗ﰟĜﰟ\uef9fﺗﰟ７ﵗ\uef9f\uf89f\u0097\u0017\ufdd7７ﵗ\uf29f\uee1f寧","뼱⼱缰⼱，\udf31⼱Ｐ輱，伎弰㼰꼱Ｐ輱㼏漰꼱\udf31弱漱㼰",2113307901>(
                           "ٕ̕م\u05f5ąеٵ֕مԵօąх\u05f5ąх\u05f5مՕו"
                        );
                        var10001 < ((-1823069002 << 645696506 | 20) & 132037725);
                        var10001 += (1851124470 << -733288919 | 1) & 1074397509
                     ) {
                        int var58 = 0<"JNT",-978320597,"阨風锨鶨蔨麨","\ueddf\uf61f\uee1f\uf49f","뼱⼱缰⼱，\udf31⼱Ｐ輱，伎弰㼰꼱Ｐ輱㼏漰꼱\udf31弱漱㼰",2113307905>(var10002, var10001)
                           + '5'
                           + 198;
                        char var61 = (char)(
                           (((((var58 & 65535) >> 0 | var58 << 16) & 57344) >> 13 | ((var58 & 65535) >> 0 | var58 << 16) << 3) & 65408) >> 7
                              | ((((var58 & 65535) >> 0 | var58 << 16) & 57344) >> 13 | ((var58 & 65535) >> 0 | var58 << 16) << 3) << 9
                        );
                        0<"JNT",-978320597,"鸨霨麨蘨風锨鶨蔨麨","\ueddf\uf61f\uf49f\uee1f寧","뼱⼱缰⼱，\udf31⼱Ｐ輱，伎弰㼰꼱Ｐ輱㼏漰꼱\udf31弱漱㼰",2113307902>(
                           var10002,
                           var10001,
                           (char)(
                              (((((var58 & 65535) >> 0 | var58 << 16) & 57344) >> 13 | ((var58 & 65535) >> 0 | var58 << 16) << 3) & 65408) >> 7
                                 | ((((var58 & 65535) >> 0 | var58 << 16) & 57344) >> 13 | ((var58 & 65535) >> 0 | var58 << 16) << 3) << 9
                           )
                        );
                     }

                     var16 = (Class_105)0<"JNT",-432648368,"芨館鮨館麨莨","\ueddf\uf6df︗ﰟĜﰟ\uef9fﺗﰟ７ﵗ\uef9f\uf89f\u0097\u0017\ufdd7７ﵗ\uf29f著\uee1f寧","輱㼰",2113307891>(
                        0<"JNT",-978320597,"麨鰨踨麨鶨館鮨頨","\ueddf\uee1f\uf6df︗ﰟĜﰟ\uef9fﺗﰟ７ﵗ\uef9f\uf89f\u0097\u0017\ufdd7７ﵗ\uf29f","뼱⼱缰⼱，\udf31⼱Ｐ輱，伎弰㼰꼱Ｐ輱㼏漰꼱\udf31弱漱㼰",2113307862>(
                           var10002
                        ),
                        false
                     );
                     var32 = -1671732504 << -1319482602 ^ -1174405120;
                     var41 = (StringBuilder)0<"JNT",-432648368,"芨館鮨館麨莨","\ueddf\uf6df︗ﰟĜﰟ\uef9fﺗﰟ７ﵗ\uef9f\uf89f\u0097\u0017\ufdd7７ﵗ\uf29f\uee1f寧","뼱⼱缰⼱，\udf31⼱Ｐ輱，伎弰㼰꼱Ｐ輱㼏漰꼱\udf31弱漱㼰",2113307864>(
                        "羯翉\uffc9翆翅羿\uffc9翃翀羿ￅￅ翋ﾟ翈翊翃\uffc9翀ￃ翁翈ﾟ\uffc9翆ﾟ\uffc9翆\uffc9翁翅ﾟ翈ￅ翆\uffc9ﾟ翊ￃ翁ￆﾟ翃ￆￊ翁ￆ\uffc9翆\uffc8翋ﾟ翃翈ﾟ翆ￇ翁ￆ翁\uffc1"
                     );
                     var1 = -1228430846 * -1122860723 ^ -1292451629;
                     break;
                  case -589604043:
                  default:
                     var10000.field_1764 = 0<"JNT",-978320597,"鰨館風","\ueddf\uf6df︗ﰟĜﰟ\uef9fﺗﰟ７ﵗ\uef9f\uf89f\u0097\u0017\ufdd7７ﵗ\uf29f\uee1f\uf6dfﲗﱗ\uf29f","弱伱",2113307575>(
                        var13,
                        0<"JNT",-978320597,"麨鰨踨麨鶨館鮨頨","\ueddf\uee1f\uf6df︗ﰟĜﰟ\uef9fﺗﰟ７ﵗ\uef9f\uf89f\u0097\u0017\ufdd7７ﵗ\uf29f","뼱⼱缰⼱，\udf31⼱Ｐ輱，伎弰㼰꼱Ｐ輱㼏漰꼱\udf31弱漱㼰",2113307594>(
                           var10002
                        )
                     );
                     var10000 = this;
                     var10001 = -319950734 - -319950734 ^ 0;

                     for (var10002 = (StringBuilder)0<"JNT",-432648368,"芨館鮨館麨莨","\ueddf\uf6df︗ﰟĜﰟ\uef9fﺗﰟ７ﵗ\uef9f\uf89f\u0097\u0017\ufdd7７ﵗ\uf29f\uee1f寧","뼱⼱缰⼱，\udf31⼱Ｐ輱，伎弰㼰꼱Ｐ輱㼏漰꼱\udf31弱漱㼰",2113307596>(
                           "ʩʂʭʿʀʯˁˍʂʭʼʄ"
                        );
                        var10001 < ((-1330518332 + -1330518332 | 12) & 143131199);
                        var10001 += (2004939203 + 2004939203 * -1657734167 | 1) & 184603265
                     ) {
                        char var52 = 0<"JNT",-978320597,"阨風锨鶨蔨麨","\ueddf\uf61f\uee1f\uf49f","뼱⼱缰⼱，\udf31⼱Ｐ輱，伎弰㼰꼱Ｐ輱㼏漰꼱\udf31弱漱㼰",2113308040>(var10002, var10001);
                        int var114 = (var52 & '￠') >> 5;
                        int var53 = ((var52 & '￠') >> 5 | var52 << 11) ^ 23;
                        int var115 = ((((var52 & '￠') >> 5 | var52 << 11) ^ 23) & 63488) >> 11;
                        char var54 = (char)(((((var114 | var52 << 11) ^ 23) & 63488) >> 11 | (((var52 & '￠') >> 5 | var52 << 11) ^ 23) << 5) + 22 ^ 23);
                        0<"JNT",-978320597,"鸨霨麨蘨風锨鶨蔨麨","\ueddf\uf61f\uf49f\uee1f寧","뼱⼱缰⼱，\udf31⼱Ｐ輱，伎弰㼰꼱Ｐ輱㼏漰꼱\udf31弱漱㼰",2113308037>(
                           var10002, var10001, (char)((var115 | var53 << 5) + 22 ^ 23)
                        );
                     }

                     var16 = (Class_105)0<"JNT",-432648368,"芨館鮨館麨莨","\ueddf\uf6df︗ﰟĜﰟ\uef9fﺗﰟ７ﵗ\uef9f\uf89f\u0097\u0017\ufdd7７ﵗ\uf29f著\uee1f寧","輱㼰",2113306971>(
                        0<"JNT",-978320597,"麨鰨踨麨鶨館鮨頨","\ueddf\uee1f\uf6df︗ﰟĜﰟ\uef9fﺗﰟ７ﵗ\uef9f\uf89f\u0097\u0017\ufdd7７ﵗ\uf29f","뼱⼱缰⼱，\udf31⼱Ｐ輱，伎弰㼰꼱Ｐ輱㼏漰꼱\udf31弱漱㼰",2113306974>(
                           var10002
                        ),
                        true
                     );
                     var32 = 0;
                     var41 = (StringBuilder)0<"JNT",-432648368,"芨館鮨館麨莨","\ueddf\uf6df︗ﰟĜﰟ\uef9fﺗﰟ７ﵗ\uef9f\uf89f\u0097\u0017\ufdd7７ﵗ\uf29f\uee1f寧","뼱⼱缰⼱，\udf31⼱Ｐ輱，伎弰㼰꼱Ｐ輱㼏漰꼱\udf31弱漱㼰",2113306976>(
                        "쀆耑䀒䀑뿾耒耑쀎䀎쀏䀒뿾쀎뿾耓䀑耓쀏쀑뿾쀐\u0011뿾쀔䀑쀓\u0012뿾耒\u0012쀏\u000f쀏\u0012\u0012쀏耏뿾耐䀑耓\u000e쀎\u0012뿾䀒耑䀑耓"
                     );
                     var1 = -967998180 + -967998180 ^ 1989386811;
               }

               label92:
               while (true) {
                  switch (((var1 ^ 1207317714 ^ 1438220486) + 624664347 + 542619480 ^ 1543008430) + 1654420069) {
                     case -1331437341:
                        var10002 = var41;
                        if (var32 >= (-389129586 - -389129586 ^ 61)) {
                           var1 = (1574006553 - 2104063812 | 295190536) & 362432654;
                           break label92;
                        }

                        int var97 = 0<"JNT",-978320597,"阨風锨鶨蔨麨","\ueddf\uf61f\uee1f\uf49f","뼱⼱缰⼱，\udf31⼱Ｐ輱，伎弰㼰꼱Ｐ輱㼏漰꼱\udf31弱漱㼰",2113307885>(var41, var32)
                           - 213
                           + 189
                           + 137;
                        int var135 = (var97 & 61440) >> 12;
                        int var98 = (var97 & 61440) >> 12 | var97 << 4;
                        int var136 = (((var97 & 61440) >> 12 | var97 << 4) & 65528) >> 3;
                        char var99 = (char)(((var135 | var97 << 4) & 65528) >> 3 | ((var97 & 61440) >> 12 | var97 << 4) << 13);
                        0<"JNT",-978320597,"鸨霨麨蘨風锨鶨蔨麨","\ueddf\uf61f\uf49f\uee1f寧","뼱⼱缰⼱，\udf31⼱Ｐ輱，伎弰㼰꼱Ｐ輱㼏漰꼱\udf31弱漱㼰",2113307882>(
                           var41, var32, (char)(var136 | var98 << 13)
                        );
                        var32 += (-1324366541 | -1324366541 | 0) & 1118835333;
                        var1 = -1228430846 * -1122860723 ^ -1292451629;
                        break;
                     case -658606967:
                     default:
                        var10002 = var41;
                        if (var32 >= (1972727138 >> 1417212924 ^ 54)) {
                           var1 = -2132827419;
                           break label92;
                        }

                        char var91 = 0<"JNT",-978320597,"阨風锨鶨蔨麨","\ueddf\uf61f\uee1f\uf49f","뼱⼱缰⼱，\udf31⼱Ｐ輱，伎弰㼰꼱Ｐ輱㼏漰꼱\udf31弱漱㼰",2113307860>(var41, var32);
                        char var94 = (char)(
                           (
                                 (
                                       (((((var91 & '\uffc0') >> 6 | var91 << '\n') & 32768) >> 15 | ((var91 & '\uffc0') >> 6 | var91 << '\n') << 1) & 65024)
                                             >> 9
                                          | ((((var91 & '\uffc0') >> 6 | var91 << '\n') & 32768) >> 15 | ((var91 & '\uffc0') >> 6 | var91 << '\n') << 1) << 7
                                    )
                                    ^ 2
                              )
                              + 40
                        );
                        0<"JNT",-978320597,"鸨霨麨蘨風锨鶨蔨麨","\ueddf\uf61f\uf49f\uee1f寧","뼱⼱缰⼱，\udf31⼱Ｐ輱，伎弰㼰꼱Ｐ輱㼏漰꼱\udf31弱漱㼰",2113307889>(
                           var41,
                           var32,
                           (char)(
                              (
                                    (
                                          (((((var91 & '\uffc0') >> 6 | var91 << '\n') & 32768) >> 15 | ((var91 & '\uffc0') >> 6 | var91 << '\n') << 1) & 65024)
                                                >> 9
                                             | ((((var91 & '\uffc0') >> 6 | var91 << '\n') & 32768) >> 15 | ((var91 & '\uffc0') >> 6 | var91 << '\n') << 1)
                                                << 7
                                       )
                                       ^ 2
                                 )
                                 + 40
                           )
                        );
                        var32 += -765508096 << -1310043820 ^ 1610612737;
                        var1 = -967998180 + -967998180 ^ 1989386811;
                  }
               }

               switch ((var1 ^ 545895831 ^ 475584117) + 733897562 - 1748919649 + 815870848 + 1149505327) {
                  case -189529681:
                     var10000.field_1765 = 0<"JNT",-978320597,"锨鼨隨","\ueddf\uf6df︗ﰟĜﰟ\uef9fﺗﰟ７ﵗ\uef9f\uf89f\u0097\u0017\ufdd7７ﵗ\uf29f\uee1f\uf6dfﵗ\u0017\uf29f","輱㼰",2113308047>(
                        var16,
                        0<"JNT",-978320597,"麨鰨踨麨鶨館鮨頨","\ueddf\uee1f\uf6df︗ﰟĜﰟ\uef9fﺗﰟ７ﵗ\uef9f\uf89f\u0097\u0017\ufdd7７ﵗ\uf29f","뼱⼱缰⼱，\udf31⼱Ｐ輱，伎弰㼰꼱Ｐ輱㼏漰꼱\udf31弱漱㼰",2113307906>(
                           var10002
                        )
                     );
                     var10000 = this;
                     var10001 = -1550169421 << 1686336379 ^ -1744830464;

                     for (var10002 = (StringBuilder)0<"JNT",-432648368,"芨館鮨館麨莨","\ueddf\uf6df︗ﰟĜﰟ\uef9fﺗﰟ７ﵗ\uef9f\uf89f\u0097\u0017\ufdd7７ﵗ\uf29f\uee1f寧","뼱⼱缰⼱，\udf31⼱Ｐ輱，伎弰㼰꼱Ｐ輱㼏漰꼱\udf31弱漱㼰",2113307876>(
                           "ಕἕ⊕ᦕ᠕↕\uf892ᄕẕἕ⊕"
                        );
                        var10001 < (-1156504081 - 1030895307 ^ 2107567919);
                        var10001 += (1934720453 - -920796610 | 0) & 76284929
                     ) {
                        int var66 = 0<"JNT",-978320597,"阨風锨鶨蔨麨","\ueddf\uf61f\uee1f\uf49f","뼱⼱缰⼱，\udf31⼱Ｐ輱，伎弰㼰꼱Ｐ輱㼏漰꼱\udf31弱漱㼰",2113307900>(var10002, var10001)
                           ^ '~'
                           ^ 239;
                        int var124 = (var66 & 63488) >> 11;
                        int var67 = ((var66 & 63488) >> 11 | var66 << 5) - 125;
                        int var125 = (((var66 & 63488) >> 11 | var66 << 5) - 125 & 61440) >> 12;
                        char var68 = (char)(((var124 | var66 << 5) - 125 & 61440) >> 12 | ((var66 & 63488) >> 11 | var66 << 5) - 125 << 4);
                        0<"JNT",-978320597,"鸨霨麨蘨風锨鶨蔨麨","\ueddf\uf61f\uf49f\uee1f寧","뼱⼱缰⼱，\udf31⼱Ｐ輱，伎弰㼰꼱Ｐ輱㼏漰꼱\udf31弱漱㼰",2113307897>(
                           var10002, var10001, (char)(var125 | var67 << 4)
                        );
                     }

                     var13 = (Class_49)0<"JNT",-432648368,"芨館鮨館麨莨","\ueddf\uf6df︗ﰟĜﰟ\uef9fﺗﰟ７ﵗ\uef9f\uf89f\u0097\u0017\ufdd7７ﵗ\uf29f\uf4df\uf4df\uf4df\uf4df\uee1f寧","弱伱",2113307883>(
                        0<"JNT",-978320597,"麨鰨踨麨鶨館鮨頨","\ueddf\uee1f\uf6df︗ﰟĜﰟ\uef9fﺗﰟ７ﵗ\uef9f\uf89f\u0097\u0017\ufdd7７ﵗ\uf29f","뼱⼱缰⼱，\udf31⼱Ｐ輱，伎弰㼰꼱Ｐ輱㼏漰꼱\udf31弱漱㼰",2113307886>(
                           var10002
                        ),
                        1.0,
                        9.0,
                        1.0,
                        1.0
                     );
                     var28 = (-718699630 * (-718699630 + -288900119) | 0) & 1107483137;
                     var41 = (StringBuilder)0<"JNT",-432648368,"芨館鮨館麨莨","\ueddf\uf6df︗ﰟĜﰟ\uef9fﺗﰟ７ﵗ\uef9f\uf89f\u0097\u0017\ufdd7７ﵗ\uf29f\uee1f寧","뼱⼱缰⼱，\udf31⼱Ｐ輱，伎弰㼰꼱Ｐ輱㼏漰꼱\udf31弱漱㼰",2113307888>(
                        "Ὥ\udf67齠㽠～｠㽠齦뽦齦㽠㽠齦罦～ｧ\udf67罠㽦ὦ㽠～彠罧\udf67罠～뽦\udf67㽠～罠\udf67罠齦齧～｟\u1f58齟ὙὟ"
                     );
                     break;
                  case 1710253078:
                  default:
                     var10000.field_1767 = 0<"JNT",-978320597,"锨鼨隨","\ueddf\uf6df︗ﰟĜﰟ\uef9fﺗﰟ７ﵗ\uef9f\uf89f\u0097\u0017\ufdd7７ﵗ\uf29f\uee1f\uf6dfﵗ\u0017\uf29f","輱㼰",2113306970>(
                        var16,
                        0<"JNT",-978320597,"麨鰨踨麨鶨館鮨頨","\ueddf\uee1f\uf6df︗ﰟĜﰟ\uef9fﺗﰟ７ﵗ\uef9f\uf89f\u0097\u0017\ufdd7７ﵗ\uf29f","뼱⼱缰⼱，\udf31⼱Ｐ輱，伎弰㼰꼱Ｐ輱㼏漰꼱\udf31弱漱㼰",2113306973>(
                           var10002
                        )
                     );
                     Class_49 var7 = 1<"JNT",-1252832079,"㿒㿚","ᦇᤇ","\u0005怅耉耎\u200e⁻",1577193448>(this);
                     Class_105 var19 = 1<"JNT",-1252832079,"㿓㿚","ᦇᤇ","\u0005怅耉ꀎ쀌⁻",1577193451>(this);
                     0<"JNT",83386629,"鶨霨鴨鼨館鶨霨讨鰨鮨讨鼨骨骨","\ueddf\uf6df︗ﰟĜﰟ\uef9fﺗﰟ７ﵗ\uef9f\uf79fﰗ︗ﳗﱗ\u0097\uf29f\uee1f\uf6df︗ﰟĜﰟ\uef9fﺗﰟ７ﵗ\uef9f\uf79fﰗ︗ﳗﱗ\u0097\uf29f","뼱⼱缰⼱，漰弰꼱\udf31，༎㼱뼱漱伱弰估",2113306969>(
                        var19
                     );
                     0<"JNT",-978320597,"鮨ꆨ鸨","\ueddf\uf6df︗ﰟĜﰟ\uef9fÜ\u0097\ufdd7ﺗ\uef9fﴗÜ７ﱗ\u0097\ufdd7ｗ７\uef9f\uf89fÜﾗﾗﺗ\ufdd7ﳗ\u0017\uf29f\uee1f\uf6dfￗﳗﳗ\uf29f","弱伱",2113307574>(
                        var7, var19::ax
                     );
                     Class_105 var8 = 1<"JNT",-1252832079,"㿒㿓㿓","ᦇᤇ","\u0005怅耉ꀎ쀌⁻",1577193436>(this);
                     Class_105 var20 = 1<"JNT",-1252832079,"㿓㿚","ᦇᤇ","\u0005怅耉ꀎ쀌⁻",1577193439>(this);
                     0<"JNT",83386629,"鶨霨鴨鼨館鶨霨讨鰨鮨讨鼨骨骨","\ueddf\uf6df︗ﰟĜﰟ\uef9fﺗﰟ７ﵗ\uef9f\uf79fﰗ︗ﳗﱗ\u0097\uf29f\uee1f\uf6df︗ﰟĜﰟ\uef9fﺗﰟ７ﵗ\uef9f\uf79fﰗ︗ﳗﱗ\u0097\uf29f","뼱⼱缰⼱，漰弰꼱\udf31，༎㼱뼱漱伱弰估",2113307573>(
                        var20
                     );
                     0<"JNT",-978320597,"鮨ꆨ鸨","\ueddf\uf6df︗ﰟĜﰟ\uef9fÜ\u0097\ufdd7ﺗ\uef9fﴗÜ７ﱗ\u0097\ufdd7ｗ７\uef9f\uf89fÜﾗﾗﺗ\ufdd7ﳗ\u0017\uf29f\uee1f\uf6dfￗﳗﳗ\uf29f","輱㼰",2113307602>(
                        var8, var20::ax
                     );
                     0<"JNT",-978320597,"鴨鼨","\ueddf犯\uf6dfￗﳗﳗ\uf29f\uee1f寧","弰缰",2113307595>(
                        this,
                        new Class_271[]{
                           1<"JNT",-1252832079,"㾡㾦","ᦇᤇ","\u0005怅耉耎\u200e⁻",1577193440>(this),
                           1<"JNT",-1252832079,"㿓㿚","ᦇᤇ","\u0005怅耉ꀎ쀌⁻",1577193443>(this),
                           1<"JNT",-1252832079,"㿒㿚","ᦇᤇ","\u0005怅耉耎\u200e⁻",1577193434>(this),
                           1<"JNT",-1252832079,"㿒㿓㿓","ᦇᤇ","\u0005怅耉ꀎ쀌⁻",1577193429>(this)
                        }
                     );
                     return;
               }
            }

            var1 = (2059110293 ^ 2059110293 | -721738282) & -33833001;
         }
      }
   }

   // $VF: renamed from: mg () void
   @Override
   public void method_1407() {
      0<"JNT",-978320597,"ꀨ鶨","\ueddf\uee1f寧","弰缰",2113307938>(this);
      0<"JNT",-1287825210,"鬨頨","\ueddf\uee1f寧","漰估缱",2113307951>(this);
   }

   // $VF: renamed from: gd (Class_207) void
   @Class_21
   public void method_1552(Class_207 var1) {
      int var7 = 667745498;
      if (1<"JNT",-1252832079,"㾨㾣㾯㾦㾮徰徚徘徇徙","ᜇᕇᦇ܇ᝇᡇᜇᕇᗇᨇᙇᔇᦇ܇ᗇជᙇᧇᧇ\u12c7েੇઇ","\u0005怅耉䀌\ue00e而ꀅ\ue00d怍䀌\ue00e\u200e쀌怎䀍而ꀅ\u200e耍怎\u200c\u200cꀏꀄ耄䁻⁻",1577192523>(
            1<"JNT",-1252832079,"㾦㿄","ᦇᤇ","\u0005怅耉䀌\ue00e而ꀅ\ue00d怍䀌\ue00e\u200e쀌怎䀍而ꀅ\u200e耍怎\u200c\u200cꀏ 怄\u0004⁻",1577192520>(this)
         )
         != null) {
         if (!(
            1<"JNT",-1252832079,"㾨㾣㾯㾦㾮徰徚徘從從","ᜇᕇᦇ܇ᝇᡇᜇᕇᗇᨇᙇᔇᦇ܇ᗇជᙇᧇᧇ\u12c7েੇઇ","\u0005怅耉䀌\ue00e而ꀅ\ue00d怍䀌\ue00e\u200e쀌怎䀍而ꀅ\u200e耍怎\u200c\u200cꀏ耄 ꀄ⁻",1577193369>(
               1<"JNT",-1252832079,"㾦㿄","ᦇᤇ","\u0005怅耉䀌\ue00e而ꀅ\ue00d怍䀌\ue00e\u200e쀌怎䀍而ꀅ\u200e耍怎\u200c\u200cꀏ 怄\u0004⁻",1577193374>(this)
            ) instanceof class_490 var2
         )) {
            0<"JNT",-978320597,"ꀨ鶨","\ueddf\uee1f寧","弰缰",2113307834>(this);
         } else {
            class_1735 var8 = 0<"JNT",-1163844208,"頨霨麨螨鰨阨鼨鸨霨隨踨骨鰨麨","\ueddf\uee1f\uf6df７ﳗ\u0097\uef9fﻗ\ufdd7７ﳗﱗ\u0017ﰟﴗ\u0097\uef9fﱗﺗﰟWWﮟ\uf01f\uf19f\uf09f\uf11f\uf29f","弱漱缰，켱㼰꼰ἰ弰༰Ｐ，\uef31꼱鼰꼱Ｐ，鼏⼱Ｐ弱\udf31漱弱伎伱㼰漱漱Ｐ\uef0f꼱鼰꼱Ｐ",2113308043>(
               (HandledScreenMixin)var2
            );
            if (var8 != null && 0<"JNT",-978320597,"鬨霨麨風鰨隨鐨縨纨綨羨羨","\ueddf\uee1f\uf61f","Ｐ漱弰，\uef31꼱Ｐ漱伱㼰⼱缱弰，伱\udf31⼱估估༱⼌輌伌漌",2113308048>(var8) <= 35) {
               var7 = (2072165880 >> 2072165880 | 931979871) & 938469375;
            } else {
               var7 = -1023043646;
            }

            while (true) {
               switch ((var7 + 92082354 ^ 1085592782) - 703728267 + 1402293311 + 234601643 - 13113001) {
                  case -1265365067:
                     if (0<"JNT",-978320597,"锨ꂨ","\ueddf\uee1f著","輱㼰",2113308024>(1<"JNT",-1252832079,"㿒㿓㿓","ᦇᤇ","\u0005怅耉ꀎ쀌⁻",1577193372>(this))) {
                        0<"JNT",-978320597,"鬨霨麨風鰨隨鐨羨紨纨脨羨","\ueddf\uf61f\uee1f寧","Ｐ漱弰，\uef31꼱Ｐ漱伱㼰⼱缱弰，伱\udf31⼱估估༱⼌缌缌⼌",2113308046>(
                           0<"JNT",-978320597,"鬨霨麨風鰨隨鐨縨紨缨纨肨","\ueddf\uee1f\uf6df７ﳗ\u0097\uef9fﻗ\ufdd7７ﳗﱗ\u0017ﰟﴗ\u0097\uef9fﱗﺗﰟWWﮟ\uf01f\uf15f\uf15f\uf01f\uf29f","Ｐ漱弰，\uef31꼱Ｐ漱伱㼰⼱缱弰，伱\udf31⼱估估༱輌弌缌",2113307935>(
                              1<"JNT",-1252832079,"㾨㾣㾯㾦㾮徰徚徘徇徙","ᜇᕇᦇ܇ᝇᡇᜇᕇᗇᨇᙇᔇᦇ܇ᗇជᙇᧇᧇ\u12c7েੇઇ","\u0005怅耉䀌\ue00e而ꀅ\ue00d怍䀌\ue00e\u200e쀌怎䀍而ꀅ\u200e耍怎\u200c\u200cꀏꀄ耄䁻⁻",1577193377>(
                                 1<"JNT",-1252832079,"㾦㿄","ᦇᤇ","\u0005怅耉䀌\ue00e而ꀅ\ue00d怍䀌\ue00e\u200e쀌怎䀍而ꀅ\u200e耍怎\u200c\u200cꀏ 怄\u0004⁻",1577193382>(this)
                              )
                           ),
                           0<"JNT",-978320597,"鞨ꆨ頨","\ueddf\uee1f\uf61f","弱伱",2113308049>(1<"JNT",-1252832079,"㿒㿚","ᦇᤇ","\u0005怅耉耎\u200e⁻",1577193379>(this))
                              - 1
                        );
                     }

                     var7 = -1984129119 + 489040781 + -1984129119 * 489040781 ^ -1613680076;
                     break;
                  case -1089641360:
                     return;
                  case -753504534:
                  default:
                     if (1<"JNT",-1252832079,"㿘㾬㿕","ᦇᤇ","\u0005怅怉",1577192531>(this) > 0) {
                        1<"JNT",-950503250,"㿘㾬㿕","ᦇᤇ","\u0005怅怉",1577192517>(this, 1<"JNT",-1252832079,"㿘㾬㿕","ᦇᤇ","\u0005怅怉",1577192522>(this) - 1);
                        return;
                     }

                     var7 = -688676055 - -688676055 ^ -1665038650;
                     break;
                  case 425798508:
                     int var4 = 0<"JNT",-978320597,"鬨霨麨風鰨隨鐨縨纨綨羨羨","\ueddf\uee1f\uf61f","Ｐ漱弰，\uef31꼱Ｐ漱伱㼰⼱缱弰，伱\udf31⼱估估༱⼌輌伌漌",2113308023>(var8);
                     int var5 = 1<"JNT",-1252832079,"㾨㾣㾯㾦㾮徰徘徘徛径","ᜇᕇᦇ܇ᝇᡇᜇᕇᗇᨇᙇᔇᦇ܇ᗇជᙇᧇᧇ\u12c7ੇࣇਇে","\u0005怅怉",1577192530>(
                        (class_1723)0<"JNT",-978320597,"鬨霨麨風鰨隨鐨紨耨缨耨耨","\ueddf\uee1f\uf6df７ﳗ\u0097\uef9fﻗ\ufdd7７ﳗﱗ\u0017ﰟﴗ\u0097\uef9fﱗﺗﰟWWﮟ\uf01f\uf19f\uefdf\uf09f\uf29f","Ｐ漱弰，\uef31꼱Ｐ漱伱㼰⼱缱弰，伱\udf31⼱估估༱弌꼌Ἄ",2113308044>(
                           var2
                        )
                     );
                     if (!0<"JNT",-978320597,"鬨霨麨風鰨隨鐨縨紨缨耨纨","\ueddf\uf6df７ﳗ\u0097\uef9fﻗ\ufdd7７ﳗﱗ\u0017ﰟﴗ\u0097\uef9fﱗﺗﰟWWﮟ\uf01f\uf19f\uf21f\uf05f\uf29f\uee1f著","Ｐ漱弰，\uef31꼱Ｐ漱伱㼰⼱缱弰，伱\udf31⼱估估༱⼌輌꼌꼌",2113307842>(
                        0<"JNT",-978320597,"鬨霨麨風鰨隨鐨羨粨耨脨","\ueddf\uee1f\uf6df７ﳗ\u0097\uef9fﻗ\ufdd7７ﳗﱗ\u0017ﰟﴗ\u0097\uef9fﱗﺗﰟWWﮟ\uf01f\uf19f\uf21f\uf21f\uf29f","Ｐ漱弰，\uef31꼱Ｐ漱伱㼰⼱缱弰，伱\udf31⼱估估༱輌弌缌",2113307816>(
                           1<"JNT",-1252832079,"㾨㾣㾯㾦㾮徰徚徘徇徙","ᜇᕇᦇ܇ᝇᡇᜇᕇᗇᨇᙇᔇᦇ܇ᗇជᙇᧇᧇ\u12c7েੇઇ","\u0005怅耉䀌\ue00e而ꀅ\ue00d怍䀌\ue00e\u200e쀌怎䀍而ꀅ\u200e耍怎\u200c\u200cꀏꀄ耄䁻⁻",1577192524>(
                              1<"JNT",-1252832079,"㾦㿄","ᦇᤇ","\u0005怅耉䀌\ue00e而ꀅ\ue00d怍䀌\ue00e\u200e쀌怎䀍而ꀅ\u200e耍怎\u200c\u200cꀏ 怄\u0004⁻",1577192525>(this)
                           )
                        ),
                        1<"JNT",1672878852,"㾨㾣㾯㾦㾮徰徝徇徝徝","ᜇᕇᦇ܇ᝇᡇᜇᕇᗇᨇᙇᔇᦇ܇ᗇជᙇᧇᧇ\u12c7ੇಇઇਇ","\u0005怅耉䀌\ue00e而ꀅ\ue00d怍䀌\ue00e\u200e쀌怎䀍而ꀅ\u200e耍怎\u200c\u200cꀏ怄ꀄ恻쀄⁻",1577192534>()
                     )) {
                        0<"JNT",-978320597,"ꀨ骨麨","\ueddf\uf61f\uf61f\uee1f寧","弰缰",2113307983>(this, var5, var4);
                        return;
                     }

                     var7 = 1460748201;

                     while (true) {
                        switch ((var7 ^ 453297101) - 176148787 + 1391418339 + 1858659002 + 654413335 ^ 203564094) {
                           case -105486202:
                              return;
                           case 644731867:
                        }

                        if (0<"JNT",-978320597,"锨ꂨ","\ueddf\uee1f著","輱㼰",2113307937>(1<"JNT",-1252832079,"㿓㿚","ᦇᤇ","\u0005怅耉ꀎ쀌⁻",1577193395>(this))) {
                           int var6 = 0<"JNT",-978320597,"鞨ꆨ頨","\ueddf\uee1f\uf61f","弱伱",2113307931>(
                                 1<"JNT",-1252832079,"㿒㿚","ᦇᤇ","\u0005怅耉耎\u200e⁻",1577193381>(this)
                              )
                              - 1;
                           if (!0<"JNT",-978320597,"鬨霨麨風鰨隨鐨縨紨缨耨纨","\ueddf\uf6df７ﳗ\u0097\uef9fﻗ\ufdd7７ﳗﱗ\u0017ﰟﴗ\u0097\uef9fﱗﺗﰟWWﮟ\uf01f\uf19f\uf21f\uf05f\uf29f\uee1f著","Ｐ漱弰，\uef31꼱Ｐ漱伱㼰⼱缱弰，伱\udf31⼱估估༱⼌輌꼌꼌",2113307929>(
                              0<"JNT",-978320597,"鬨霨麨風鰨隨鐨缨纨縨肨","\ueddf\uf61f\uee1f\uf6df７ﳗ\u0097\uef9fﻗ\ufdd7７ﳗﱗ\u0017ﰟﴗ\u0097\uef9fﱗﺗﰟWWﮟ\uf01f\uf19f\uf21f\uf21f\uf29f","Ｐ漱弰，\uef31꼱Ｐ漱伱㼰⼱缱弰，伱\udf31⼱估估༱⼌缌缌⼌",2113308039>(
                                 0<"JNT",-978320597,"鬨霨麨風鰨隨鐨縨紨缨纨肨","\ueddf\uee1f\uf6df７ﳗ\u0097\uef9fﻗ\ufdd7７ﳗﱗ\u0017ﰟﴗ\u0097\uef9fﱗﺗﰟWWﮟ\uf01f\uf15f\uf15f\uf01f\uf29f","Ｐ漱弰，\uef31꼱Ｐ漱伱㼰⼱缱弰，伱\udf31⼱估估༱輌弌缌",2113307930>(
                                    1<"JNT",-1252832079,"㾨㾣㾯㾦㾮徰徚徘徇徙","ᜇᕇᦇ܇ᝇᡇᜇᕇᗇᨇᙇᔇᦇ܇ᗇជᙇᧇᧇ\u12c7েੇઇ","\u0005怅耉䀌\ue00e而ꀅ\ue00d怍䀌\ue00e\u200e쀌怎䀍而ꀅ\u200e耍怎\u200c\u200cꀏꀄ耄䁻⁻",1577193390>(
                                       1<"JNT",-1252832079,"㾦㿄","ᦇᤇ","\u0005怅耉䀌\ue00e而ꀅ\ue00d怍䀌\ue00e\u200e쀌怎䀍而ꀅ\u200e耍怎\u200c\u200cꀏ 怄\u0004⁻",1577193383>(
                                          this
                                       )
                                    )
                                 ),
                                 var6
                              ),
                              1<"JNT",1672878852,"㾨㾣㾯㾦㾮徰徝徇徝徝","ᜇᕇᦇ܇ᝇᡇᜇᕇᗇᨇᙇᔇᦇ܇ᗇជᙇᧇᧇ\u12c7ੇಇઇਇ","\u0005怅耉䀌\ue00e而ꀅ\ue00d怍䀌\ue00e\u200e쀌怎䀍而ꀅ\u200e耍怎\u200c\u200cꀏ怄ꀄ恻쀄⁻",1577193387>()
                           )) {
                              0<"JNT",-978320597,"閨騨騨","\ueddf\uf61f\uf61f\uf61f\uee1f寧","弰缰",2113308022>(this, var5, var4, var6);
                           }
                        }

                        var7 = (1670248280 - 1670248280 | 207524602) & 2120210175;
                     }
                  case 1823574053:
                     if (0<"JNT",-978320597,"鬨霨麨風鰨隨鐨耨脨粨脨","\ueddf\uee1f\uf6df７ﳗ\u0097\uef9fﻗ\ufdd7７ﳗﱗ\u0017ﰟﴗ\u0097\uef9fﱗﺗﰟWWﮟ\uf01f\uf19f\uf21f\uf05f\uf29f","Ｐ漱弰，\uef31꼱Ｐ漱伱㼰⼱缱弰，伱\udf31⼱估估༱⼌輌꼌꼌",2113307840>(
                           0<"JNT",-978320597,"鬨霨麨風鰨隨鐨耨羨耨耨","\ueddf\uee1f\uf6df７ﳗ\u0097\uef9fﻗ\ufdd7７ﳗﱗ\u0017ﰟﴗ\u0097\uef9fﱗﺗﰟWWﮟ\uf01f\uf19f\uf21f\uf21f\uf29f","Ｐ漱弰，\uef31꼱Ｐ漱伱㼰⼱缱弰，伱\udf31⼱估估༱⼌輌伌漌",2113307835>(
                              var8
                           )
                        )
                        != 1<"JNT",1672878852,"㾨㾣㾯㾦㾮徰徝徇徝徝","ᜇᕇᦇ܇ᝇᡇᜇᕇᗇᨇᙇᔇᦇ܇ᗇជᙇᧇᧇ\u12c7ੇಇઇਇ","\u0005怅耉䀌\ue00e而ꀅ\ue00d怍䀌\ue00e\u200e쀌怎䀍而ꀅ\u200e耍怎\u200c\u200cꀏ怄ꀄ恻쀄⁻",1577192526>()
                        )
                      {
                        return;
                     }

                     var7 = 596695341 - 1471360886 ^ 483650303;
               }
            }
         }
      }
   }

   // $VF: renamed from: wlt (int, int) void
   public void method_1553(int var1, int var2) {
      0<"JNT",-978320597,"鬨霨麨風鰨隨鐨綨脨粨羨","\ueddf\uf61f\uf61f\uf61f\uf6df７ﳗ\u0097\uef9fﻗ\ufdd7７ﳗﱗ\u0017ﰟﴗ\u0097\uef9fﱗﺗﰟWWﮟ\uf01f\uf19f\uf01f\uf09f\uf29f\uf6df７ﳗ\u0097\uef9fﻗ\ufdd7７ﳗﱗ\u0017ﰟﴗ\u0097\uef9fﱗﺗﰟWWﮟ\uf01f\uf15f\uf11f\uf19f\uf29f\uee1f寧","Ｐ漱弰，\uef31꼱Ｐ漱伱㼰⼱缱弰，伱\udf31⼱估估༱缌伌缌",2113307826>(
         1<"JNT",-1252832079,"㾨㾣㾯㾦㾮徰徚徘徛徚","ᜇᕇᦇ܇ᝇᡇᜇᕇᗇᨇᙇᔇᦇ܇ᗇជᙇᧇᧇ\u12c7েੇઇ","\u0005怅耉䀌\ue00e而ꀅ\ue00d怍䀌\ue00e\u200e쀌怎䀍而ꀅ\u200e耍怎\u200c\u200cꀏ䁻 䁻⁻",1577193405>(
            1<"JNT",-1252832079,"㾦㿄","ᦇᤇ","\u0005怅耉䀌\ue00e而ꀅ\ue00d怍䀌\ue00e\u200e쀌怎䀍而ꀅ\u200e耍怎\u200c\u200cꀏ 怄\u0004⁻",1577192514>(this)
         ),
         var1,
         var2,
         40,
         1<"JNT",1672878852,"㾨㾣㾯㾦㾮徰徘徘徒徚","ᜇᕇᦇ܇ᝇᡇᜇᕇᗇᨇᙇᔇᦇ܇ᗇជᙇᧇᧇ\u12c7ੇࣇੇে","\u0005怅耉䀌\ue00e而ꀅ\ue00d怍䀌\ue00e\u200e쀌怎䀍而ꀅ\u200e耍怎\u200c\u200cꀏ怄ꀄ怄 ⁻",1577193404>(),
         1<"JNT",-1252832079,"㾨㾣㾯㾦㾮徰徚徘徇徙","ᜇᕇᦇ܇ᝇᡇᜇᕇᗇᨇᙇᔇᦇ܇ᗇជᙇᧇᧇ\u12c7েੇઇ","\u0005怅耉䀌\ue00e而ꀅ\ue00d怍䀌\ue00e\u200e쀌怎䀍而ꀅ\u200e耍怎\u200c\u200cꀏꀄ耄䁻⁻",1577192518>(
            1<"JNT",-1252832079,"㾦㿄","ᦇᤇ","\u0005怅耉䀌\ue00e而ꀅ\ue00d怍䀌\ue00e\u200e쀌怎䀍而ꀅ\u200e耍怎\u200c\u200cꀏ 怄\u0004⁻",1577193407>(this)
         )
      );
      0<"JNT",-978320597,"ꀨ鶨","\ueddf\uee1f寧","弰缰",2113307839>(this);
   }

   // $VF: renamed from: bkk (int, int, int) void
   public void method_1554(int var1, int var2, int var3) {
      0<"JNT",-978320597,"鬨霨麨風鰨隨鐨綨脨粨羨","\ueddf\uf61f\uf61f\uf61f\uf6df７ﳗ\u0097\uef9fﻗ\ufdd7７ﳗﱗ\u0017ﰟﴗ\u0097\uef9fﱗﺗﰟWWﮟ\uf01f\uf19f\uf01f\uf09f\uf29f\uf6df７ﳗ\u0097\uef9fﻗ\ufdd7７ﳗﱗ\u0017ﰟﴗ\u0097\uef9fﱗﺗﰟWWﮟ\uf01f\uf15f\uf11f\uf19f\uf29f\uee1f寧","Ｐ漱弰，\uef31꼱Ｐ漱伱㼰⼱缱弰，伱\udf31⼱估估༱缌伌缌",2113307821>(
         1<"JNT",-1252832079,"㾨㾣㾯㾦㾮徰徚徘徛徚","ᜇᕇᦇ܇ᝇᡇᜇᕇᗇᨇᙇᔇᦇ܇ᗇជᙇᧇᧇ\u12c7েੇઇ","\u0005怅耉䀌\ue00e而ꀅ\ue00d怍䀌\ue00e\u200e쀌怎䀍而ꀅ\u200e耍怎\u200c\u200cꀏ䁻 䁻⁻",1577193402>(
            1<"JNT",-1252832079,"㾦㿄","ᦇᤇ","\u0005怅耉䀌\ue00e而ꀅ\ue00d怍䀌\ue00e\u200e쀌怎䀍而ꀅ\u200e耍怎\u200c\u200cꀏ 怄\u0004⁻",1577192515>(this)
         ),
         var1,
         var2,
         var3,
         1<"JNT",1672878852,"㾨㾣㾯㾦㾮徰徘徘徒徚","ᜇᕇᦇ܇ᝇᡇᜇᕇᗇᨇᙇᔇᦇ܇ᗇជᙇᧇᧇ\u12c7ੇࣇੇে","\u0005怅耉䀌\ue00e而ꀅ\ue00d怍䀌\ue00e\u200e쀌怎䀍而ꀅ\u200e耍怎\u200c\u200cꀏ怄ꀄ怄 ⁻",1577193397>(),
         1<"JNT",-1252832079,"㾨㾣㾯㾦㾮徰徚徘徇徙","ᜇᕇᦇ܇ᝇᡇᜇᕇᗇᨇᙇᔇᦇ܇ᗇជᙇᧇᧇ\u12c7েੇઇ","\u0005怅耉䀌\ue00e而ꀅ\ue00d怍䀌\ue00e\u200e쀌怎䀍而ꀅ\u200e耍怎\u200c\u200cꀏꀄ耄䁻⁻",1577193399>(
            1<"JNT",-1252832079,"㾦㿄","ᦇᤇ","\u0005怅耉䀌\ue00e而ꀅ\ue00d怍䀌\ue00e\u200e쀌怎䀍而ꀅ\u200e耍怎\u200c\u200cꀏ 怄\u0004⁻",1577193396>(this)
         )
      );
      0<"JNT",-978320597,"ꀨ鶨","\ueddf\uee1f寧","弰缰",2113307818>(this);
   }

   // $VF: renamed from: wr () void
   public void method_1555() {
      1<"JNT",-950503250,"㿘㾬㿕","ᦇᤇ","\u0005怅怉",1577192562>(
         this, 0<"JNT",-978320597,"鞨ꆨ頨","\ueddf\uee1f\uf61f","弱伱",2113307820>(1<"JNT",-1252832079,"㾡㾦","ᦇᤇ","\u0005怅耉耎\u200e⁻",1577193400>(this))
      );
   }

   // $VF: renamed from: 0 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1413(Lookup var0, String var1, MethodType var2, Object... var3) {
      int var10 = (Integer)var3[4];
      int var10001 = ((((var10 + 1889818988 ^ 1887623472) - 988515541 ^ 583328823) + 159526662 ^ 1665600001) + 1968017113 ^ 735250138) + 1994917404;
      MethodHandle var10000 = field_1769[((((var10 + 1889818988 ^ 1887623472) - 988515541 ^ 583328823) + 159526662 ^ 1665600001) + 1968017113 ^ 735250138)
         + 1994917404
         - 764433986];
      if (field_1769[var10001 - 764433986] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var13 = new StringBuilder((String)var3[1]);

         for (int var23 = (1395850692 >> 440276840 | 0) & -2104980222; var23 < var13.length(); var23 += (1442953198 - -1521168762 | 1) & 50332305) {
            char var42 = var13.charAt(var23);
            char var49 = (char)(
               (
                     (
                              (
                                    (
                                             (
                                                   (
                                                            (
                                                                  (
                                                                           (
                                                                                    (
                                                                                             (
                                                                                                   (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                                      | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                                                )
                                                                                                & 0
                                                                                          )
                                                                                          >> 16
                                                                                       | (
                                                                                             (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                                | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                                          )
                                                                                          << 0
                                                                                 )
                                                                                 + 246
                                                                                 - 155
                                                                              & 65535
                                                                        )
                                                                        >> 0
                                                                     | (
                                                                              (
                                                                                       (
                                                                                             (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                                | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                                          )
                                                                                          & 0
                                                                                    )
                                                                                    >> 16
                                                                                 | (
                                                                                       (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                          | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                                    )
                                                                                    << 0
                                                                           )
                                                                           + 246
                                                                           - 155
                                                                        << 16
                                                               )
                                                               & 65504
                                                         )
                                                         >> 5
                                                      | (
                                                            (
                                                                     (
                                                                              (
                                                                                       (
                                                                                             (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                                | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                                          )
                                                                                          & 0
                                                                                    )
                                                                                    >> 16
                                                                                 | (
                                                                                       (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                          | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                                    )
                                                                                    << 0
                                                                           )
                                                                           + 246
                                                                           - 155
                                                                        & 65535
                                                                  )
                                                                  >> 0
                                                               | (
                                                                        (
                                                                                 (
                                                                                       (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                          | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                                    )
                                                                                    & 0
                                                                              )
                                                                              >> 16
                                                                           | (
                                                                                 (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                    | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                              )
                                                                              << 0
                                                                     )
                                                                     + 246
                                                                     - 155
                                                                  << 16
                                                         )
                                                         << 11
                                                )
                                                & 65504
                                          )
                                          >> 5
                                       | (
                                             (
                                                      (
                                                            (
                                                                     (
                                                                              (
                                                                                       (
                                                                                             (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                                | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                                          )
                                                                                          & 0
                                                                                    )
                                                                                    >> 16
                                                                                 | (
                                                                                       (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                          | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                                    )
                                                                                    << 0
                                                                           )
                                                                           + 246
                                                                           - 155
                                                                        & 65535
                                                                  )
                                                                  >> 0
                                                               | (
                                                                        (
                                                                                 (
                                                                                       (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                          | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                                    )
                                                                                    & 0
                                                                              )
                                                                              >> 16
                                                                           | (
                                                                                 (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                    | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                              )
                                                                              << 0
                                                                     )
                                                                     + 246
                                                                     - 155
                                                                  << 16
                                                         )
                                                         & 65504
                                                   )
                                                   >> 5
                                                | (
                                                      (
                                                               (
                                                                        (
                                                                                 (
                                                                                       (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                          | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                                    )
                                                                                    & 0
                                                                              )
                                                                              >> 16
                                                                           | (
                                                                                 (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                    | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                              )
                                                                              << 0
                                                                     )
                                                                     + 246
                                                                     - 155
                                                                  & 65535
                                                            )
                                                            >> 0
                                                         | (
                                                                  (
                                                                           (
                                                                                 (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                    | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                              )
                                                                              & 0
                                                                        )
                                                                        >> 16
                                                                     | (
                                                                           (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                              | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                        )
                                                                        << 0
                                                               )
                                                               + 246
                                                               - 155
                                                            << 16
                                                   )
                                                   << 11
                                          )
                                          << 11
                                 )
                                 & 64512
                           )
                           >> 10
                        | (
                              (
                                       (
                                             (
                                                      (
                                                            (
                                                                     (
                                                                              (
                                                                                       (
                                                                                             (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                                | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                                          )
                                                                                          & 0
                                                                                    )
                                                                                    >> 16
                                                                                 | (
                                                                                       (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                          | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                                    )
                                                                                    << 0
                                                                           )
                                                                           + 246
                                                                           - 155
                                                                        & 65535
                                                                  )
                                                                  >> 0
                                                               | (
                                                                        (
                                                                                 (
                                                                                       (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                          | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                                    )
                                                                                    & 0
                                                                              )
                                                                              >> 16
                                                                           | (
                                                                                 (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                    | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                              )
                                                                              << 0
                                                                     )
                                                                     + 246
                                                                     - 155
                                                                  << 16
                                                         )
                                                         & 65504
                                                   )
                                                   >> 5
                                                | (
                                                      (
                                                               (
                                                                        (
                                                                                 (
                                                                                       (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                          | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                                    )
                                                                                    & 0
                                                                              )
                                                                              >> 16
                                                                           | (
                                                                                 (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                    | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                              )
                                                                              << 0
                                                                     )
                                                                     + 246
                                                                     - 155
                                                                  & 65535
                                                            )
                                                            >> 0
                                                         | (
                                                                  (
                                                                           (
                                                                                 (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                    | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                              )
                                                                              & 0
                                                                        )
                                                                        >> 16
                                                                     | (
                                                                           (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                              | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                        )
                                                                        << 0
                                                               )
                                                               + 246
                                                               - 155
                                                            << 16
                                                   )
                                                   << 11
                                          )
                                          & 65504
                                    )
                                    >> 5
                                 | (
                                       (
                                                (
                                                      (
                                                               (
                                                                        (
                                                                                 (
                                                                                       (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                          | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                                    )
                                                                                    & 0
                                                                              )
                                                                              >> 16
                                                                           | (
                                                                                 (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                    | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                              )
                                                                              << 0
                                                                     )
                                                                     + 246
                                                                     - 155
                                                                  & 65535
                                                            )
                                                            >> 0
                                                         | (
                                                                  (
                                                                           (
                                                                                 (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                    | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                              )
                                                                              & 0
                                                                        )
                                                                        >> 16
                                                                     | (
                                                                           (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                              | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                        )
                                                                        << 0
                                                               )
                                                               + 246
                                                               - 155
                                                            << 16
                                                   )
                                                   & 65504
                                             )
                                             >> 5
                                          | (
                                                (
                                                         (
                                                                  (
                                                                           (
                                                                                 (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                    | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                              )
                                                                              & 0
                                                                        )
                                                                        >> 16
                                                                     | (
                                                                           (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                              | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                        )
                                                                        << 0
                                                               )
                                                               + 246
                                                               - 155
                                                            & 65535
                                                      )
                                                      >> 0
                                                   | (
                                                            (((((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9 | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7) & 0)
                                                                  >> 16
                                                               | ((((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9 | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7)
                                                                  << 0
                                                         )
                                                         + 246
                                                         - 155
                                                      << 16
                                             )
                                             << 11
                                    )
                                    << 11
                           )
                           << 6
                  )
                  - 207
            );
            var13.setCharAt(
               var23,
               (char)(
                  (
                        (
                                 (
                                       (
                                                (
                                                      (
                                                               (
                                                                     (
                                                                              (
                                                                                       (
                                                                                                (
                                                                                                      (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                                         | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                                                   )
                                                                                                   & 0
                                                                                             )
                                                                                             >> 16
                                                                                          | (
                                                                                                (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                                   | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                                             )
                                                                                             << 0
                                                                                    )
                                                                                    + 246
                                                                                    - 155
                                                                                 & 65535
                                                                           )
                                                                           >> 0
                                                                        | (
                                                                                 (
                                                                                          (
                                                                                                (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                                   | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                                             )
                                                                                             & 0
                                                                                       )
                                                                                       >> 16
                                                                                    | (
                                                                                          (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                             | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                                       )
                                                                                       << 0
                                                                              )
                                                                              + 246
                                                                              - 155
                                                                           << 16
                                                                  )
                                                                  & 65504
                                                            )
                                                            >> 5
                                                         | (
                                                               (
                                                                        (
                                                                                 (
                                                                                          (
                                                                                                (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                                   | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                                             )
                                                                                             & 0
                                                                                       )
                                                                                       >> 16
                                                                                    | (
                                                                                          (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                             | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                                       )
                                                                                       << 0
                                                                              )
                                                                              + 246
                                                                              - 155
                                                                           & 65535
                                                                     )
                                                                     >> 0
                                                                  | (
                                                                           (
                                                                                    (
                                                                                          (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                             | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                                       )
                                                                                       & 0
                                                                                 )
                                                                                 >> 16
                                                                              | (
                                                                                    (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                       | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                                 )
                                                                                 << 0
                                                                        )
                                                                        + 246
                                                                        - 155
                                                                     << 16
                                                            )
                                                            << 11
                                                   )
                                                   & 65504
                                             )
                                             >> 5
                                          | (
                                                (
                                                         (
                                                               (
                                                                        (
                                                                                 (
                                                                                          (
                                                                                                (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                                   | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                                             )
                                                                                             & 0
                                                                                       )
                                                                                       >> 16
                                                                                    | (
                                                                                          (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                             | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                                       )
                                                                                       << 0
                                                                              )
                                                                              + 246
                                                                              - 155
                                                                           & 65535
                                                                     )
                                                                     >> 0
                                                                  | (
                                                                           (
                                                                                    (
                                                                                          (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                             | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                                       )
                                                                                       & 0
                                                                                 )
                                                                                 >> 16
                                                                              | (
                                                                                    (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                       | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                                 )
                                                                                 << 0
                                                                        )
                                                                        + 246
                                                                        - 155
                                                                     << 16
                                                            )
                                                            & 65504
                                                      )
                                                      >> 5
                                                   | (
                                                         (
                                                                  (
                                                                           (
                                                                                    (
                                                                                          (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                             | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                                       )
                                                                                       & 0
                                                                                 )
                                                                                 >> 16
                                                                              | (
                                                                                    (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                       | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                                 )
                                                                                 << 0
                                                                        )
                                                                        + 246
                                                                        - 155
                                                                     & 65535
                                                               )
                                                               >> 0
                                                            | (
                                                                     (
                                                                              (
                                                                                    (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                       | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                                 )
                                                                                 & 0
                                                                           )
                                                                           >> 16
                                                                        | (
                                                                              (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                 | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                           )
                                                                           << 0
                                                                  )
                                                                  + 246
                                                                  - 155
                                                               << 16
                                                      )
                                                      << 11
                                             )
                                             << 11
                                    )
                                    & 64512
                              )
                              >> 10
                           | (
                                 (
                                          (
                                                (
                                                         (
                                                               (
                                                                        (
                                                                                 (
                                                                                          (
                                                                                                (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                                   | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                                             )
                                                                                             & 0
                                                                                       )
                                                                                       >> 16
                                                                                    | (
                                                                                          (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                             | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                                       )
                                                                                       << 0
                                                                              )
                                                                              + 246
                                                                              - 155
                                                                           & 65535
                                                                     )
                                                                     >> 0
                                                                  | (
                                                                           (
                                                                                    (
                                                                                          (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                             | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                                       )
                                                                                       & 0
                                                                                 )
                                                                                 >> 16
                                                                              | (
                                                                                    (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                       | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                                 )
                                                                                 << 0
                                                                        )
                                                                        + 246
                                                                        - 155
                                                                     << 16
                                                            )
                                                            & 65504
                                                      )
                                                      >> 5
                                                   | (
                                                         (
                                                                  (
                                                                           (
                                                                                    (
                                                                                          (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                             | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                                       )
                                                                                       & 0
                                                                                 )
                                                                                 >> 16
                                                                              | (
                                                                                    (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                       | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                                 )
                                                                                 << 0
                                                                        )
                                                                        + 246
                                                                        - 155
                                                                     & 65535
                                                               )
                                                               >> 0
                                                            | (
                                                                     (
                                                                              (
                                                                                    (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                       | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                                 )
                                                                                 & 0
                                                                           )
                                                                           >> 16
                                                                        | (
                                                                              (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                 | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                           )
                                                                           << 0
                                                                  )
                                                                  + 246
                                                                  - 155
                                                               << 16
                                                      )
                                                      << 11
                                             )
                                             & 65504
                                       )
                                       >> 5
                                    | (
                                          (
                                                   (
                                                         (
                                                                  (
                                                                           (
                                                                                    (
                                                                                          (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                             | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                                       )
                                                                                       & 0
                                                                                 )
                                                                                 >> 16
                                                                              | (
                                                                                    (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                       | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                                 )
                                                                                 << 0
                                                                        )
                                                                        + 246
                                                                        - 155
                                                                     & 65535
                                                               )
                                                               >> 0
                                                            | (
                                                                     (
                                                                              (
                                                                                    (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                       | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                                 )
                                                                                 & 0
                                                                           )
                                                                           >> 16
                                                                        | (
                                                                              (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                 | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                           )
                                                                           << 0
                                                                  )
                                                                  + 246
                                                                  - 155
                                                               << 16
                                                      )
                                                      & 65504
                                                )
                                                >> 5
                                             | (
                                                   (
                                                            (
                                                                     (
                                                                              (
                                                                                    (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                       | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                                 )
                                                                                 & 0
                                                                           )
                                                                           >> 16
                                                                        | (
                                                                              (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                 | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                           )
                                                                           << 0
                                                                  )
                                                                  + 246
                                                                  - 155
                                                               & 65535
                                                         )
                                                         >> 0
                                                      | (
                                                               (
                                                                        (
                                                                              (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                                 | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                           )
                                                                           & 0
                                                                     )
                                                                     >> 16
                                                                  | (
                                                                        (((var42 & 'ﰀ') >> 10 | var42 << 6) & 65024) >> 9
                                                                           | ((var42 & 'ﰀ') >> 10 | var42 << 6) << 7
                                                                     )
                                                                     << 0
                                                            )
                                                            + 246
                                                            - 155
                                                         << 16
                                                )
                                                << 11
                                       )
                                       << 11
                              )
                              << 6
                     )
                     - 207
               )
            );
         }

         String var5 = var13.toString();
         StringBuilder var16 = new StringBuilder((String)var3[2]);

         for (int var29 = (-197304351 >>> 116224026 | 0) & -772991296; var29 < var16.length(); var29 += -1901741164 ^ -204988410 ^ 2104335251) {
            int var54 = var16.charAt(var29) - 19 - 111;
            int var101 = (var54 & 0) >> 16;
            int var55 = (var54 & 0) >> 16 | var54 << 0;
            int var102 = (((var54 & 0) >> 16 | var54 << 0) & 0) >> 16;
            var54 = (((var101 | var54 << 0) & 0) >> 16 | ((var54 & 0) >> 16 | var54 << 0) << 0) - 36 ^ 14;
            var101 = (((var102 | var55 << 0) - 36 ^ 14) & 65528) >> 3;
            int var57 = ((((var102 | var55 << 0) - 36 ^ 14) & 65528) >> 3 | var54 << 13) + 145;
            int var104 = (((((var102 | var55 << 0) - 36 ^ 14) & 65528) >> 3 | var54 << 13) + 145 & 65528) >> 3;
            char var58 = (char)(
               (((var101 | var54 << 13) + 145 & 65528) >> 3 | ((((var102 | var55 << 0) - 36 ^ 14) & 65528) >> 3 | var54 << 13) + 145 << 13) + 98
            );
            var16.setCharAt(var29, (char)((var104 | var57 << 13) + 98));
         }

         MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), ScreenUI_326.class.getClassLoader());
         StringBuilder var19 = new StringBuilder((String)var3[3]);

         for (int var35 = (2084758129 - -2013604823 | 0) & 153514166; var35 < var19.length(); var35 += -457811703 - 2023380698 ^ 1813774894) {
            int var63 = var19.charAt(var35);
            int var105 = (var63 & 65024) >> 9;
            int var64 = (var63 & 65024) >> 9 | var63 << 7;
            int var106 = (((var63 & 65024) >> 9 | var63 << 7) & 65408) >> 7;
            var63 = ((var105 | var63 << 7) & 65408) >> 7 | ((var63 & 65024) >> 9 | var63 << 7) << 9;
            var105 = ((var106 | var64 << 9) & 65535) >> 0;
            int var66 = ((var106 | var64 << 9) & 65535) >> 0 | var63 << 16;
            int var108 = ((((var106 | var64 << 9) & 65535) >> 0 | var63 << 16) & 0) >> 16;
            var63 = (((var105 | var63 << 16) & 0) >> 16 | (((var106 | var64 << 9) & 65535) >> 0 | var63 << 16) << 0) ^ 17;
            var105 = (((var108 | var66 << 0) ^ 17) & 65535) >> 0;
            int var68 = ((((var108 | var66 << 0) ^ 17) & 65535) >> 0 | var63 << 16) + 250;
            int var110 = (((((var108 | var66 << 0) ^ 17) & 65535) >> 0 | var63 << 16) + 250 & 61440) >> 12;
            char var69 = (char)(
               (((var105 | var63 << 16) + 250 & 61440) >> 12 | ((((var108 | var66 << 0) ^ 17) & 65535) >> 0 | var63 << 16) + 250 << 4) - 130 - 192
            );
            var19.setCharAt(var35, (char)((var110 | var68 << 4) - 130 - 192));
         }

         Class var7 = Class.forName(var19.toString(), false, ScreenUI_326.class.getClassLoader());
         switch ((var4 - 382897780 + 1206052741 + 666049282 + 178980151 + 1955267113 - 1105688909 ^ 112944586 ^ 969770726) - 289981427 - 736019930) {
            case 102181005:
               var10000 = var0.findConstructor(var7, var6);
               break;
            case 663575728:
            case 849230541:
               var10000 = var0.findVirtual(var7, var5, var6);
               break;
            case 957493235:
               var10000 = var0.findSpecial(var7, var5, var6, ScreenUI_326.class);
               break;
            case 1733621306:
               var10000 = var0.findStatic(var7, var5, var6);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      field_1769[((((var10 + 1889818988 ^ 1887623472) - 988515541 ^ 583328823) + 159526662 ^ 1665600001) + 1968017113 ^ 735250138) + 1994917404 - 764433986] = var10000;
      MethodHandle var11 = var10000.asType(var2);
      return new MutableCallSite(var11);
   }

   // $VF: renamed from: 1 (java.lang.invoke.MethodHandles.Lookup, java.lang.String, java.lang.invoke.MethodType, java.lang.Object[]) java.lang.Object
   public static Object method_1414(Lookup var0, String var1, MethodType var2, Object... var3) {
      boolean var11 = false;
      int var10 = (Integer)var3[4];
      int var10001 = (var10 ^ 1785807373 ^ 720334178 ^ 545247238 ^ 29322964) - 576470763 ^ 51788125 ^ 962734892 ^ 1399026753 ^ 1250360276;
      MethodHandle var10000 = field_1769[((var10 ^ 1785807373 ^ 720334178 ^ 545247238 ^ 29322964) - 576470763 ^ 51788125 ^ 962734892 ^ 1399026753 ^ 1250360276)
         - 1049739911];
      if (field_1769[var10001 - 1049739911] == null) {
         int var4 = (Integer)var3[0];
         StringBuilder var14 = new StringBuilder((String)var3[1]);

         for (int var24 = (1704556108 & 363455242 | 0) & -1845067437; var24 < var14.length(); var24 += (1478191655 | 1536697090 | 1) & -2147449711) {
            int var43 = var14.charAt(var24) ^ 'j';
            int var10004 = (var43 & 65528) >> 3;
            int var44 = (var43 & 65528) >> 3 | var43 << 13;
            int var90 = (((var43 & 65528) >> 3 | var43 << 13) & 64512) >> 10;
            var43 = (((var10004 | var43 << 13) & 64512) >> 10 | ((var43 & 65528) >> 3 | var43 << 13) << 6) + 149 + 50 + 127;
            var10004 = ((var90 | var44 << 6) + 149 + 50 + 127 & 65528) >> 3;
            int var46 = (((var90 | var44 << 6) + 149 + 50 + 127 & 65528) >> 3 | var43 << 13) + 42;
            int var92 = ((((var90 | var44 << 6) + 149 + 50 + 127 & 65528) >> 3 | var43 << 13) + 42 & 0) >> 16;
            char var47 = (char)(
               (((var10004 | var43 << 13) + 42 & 0) >> 16 | (((var90 | var44 << 6) + 149 + 50 + 127 & 65528) >> 3 | var43 << 13) + 42 << 0) ^ 114
            );
            var14.setCharAt(var24, (char)((var92 | var46 << 0) ^ 114));
         }

         String var5 = var14.toString();
         StringBuilder var17 = new StringBuilder((String)var3[2]);

         for (int var30 = 508478104 >>> 508478104 - -982442963 ^ 248280; var30 < var17.length(); var30 += (-1716953545 - -1424427764 | 1) & 275677189) {
            int var52 = (var17.charAt(var30) ^ 147 ^ 156) - 174;
            int var93 = (var52 & 65534) >> 1;
            int var53 = ((var52 & 65534) >> 1 | var52 << 15) ^ 236;
            int var94 = ((((var52 & 65534) >> 1 | var52 << 15) ^ 236) & 65024) >> 9;
            var52 = ((((var93 | var52 << 15) ^ 236) & 65024) >> 9 | (((var52 & 65534) >> 1 | var52 << 15) ^ 236) << 7) + 59 - 186;
            var93 = ((var94 | var53 << 7) + 59 - 186 & 65408) >> 7;
            int var55 = ((var94 | var53 << 7) + 59 - 186 & 65408) >> 7 | var52 << 9;
            int var96 = ((((var94 | var53 << 7) + 59 - 186 & 65408) >> 7 | var52 << 9) & 65504) >> 5;
            char var56 = (char)(((var93 | var52 << 9) & 65504) >> 5 | (((var94 | var53 << 7) + 59 - 186 & 65408) >> 7 | var52 << 9) << 11);
            var17.setCharAt(var30, (char)(var96 | var55 << 11));
         }

         Class var6 = Class.forName(var17.toString(), false, ScreenUI_326.class.getClassLoader());
         StringBuilder var20 = new StringBuilder((String)var3[3]);

         for (int var36 = 103233399 << 1349408945 ^ 1861091328; var36 < var20.length(); var36 += -1021403727 & -2058266033 ^ -2129651712) {
            int var61 = var20.charAt(var36);
            int var97 = (var61 & 0) >> 16;
            int var62 = (var61 & 0) >> 16 | var61 << 0;
            int var98 = (((var61 & 0) >> 16 | var61 << 0) & 49152) >> 14;
            var61 = (((var97 | var61 << 0) & 49152) >> 14 | ((var61 & 0) >> 16 | var61 << 0) << 2) ^ 237;
            var97 = (((var98 | var62 << 2) ^ 237) & 65520) >> 4;
            int var64 = (((var98 | var62 << 2) ^ 237) & 65520) >> 4 | var61 << 12;
            int var100 = (((((var98 | var62 << 2) ^ 237) & 65520) >> 4 | var61 << 12) & 64512) >> 10;
            var61 = ((var97 | var61 << 12) & 64512) >> 10 | ((((var98 | var62 << 2) ^ 237) & 65520) >> 4 | var61 << 12) << 6;
            var97 = ((var100 | var64 << 6) & 65532) >> 2;
            int var66 = (((var100 | var64 << 6) & 65532) >> 2 | var61 << 14) - 146;
            int var102 = ((((var100 | var64 << 6) & 65532) >> 2 | var61 << 14) - 146 & 32768) >> 15;
            char var67 = (char)((((var97 | var61 << 14) - 146 & 32768) >> 15 | (((var100 | var64 << 6) & 65532) >> 2 | var61 << 14) - 146 << 1) - 101 ^ 65);
            var20.setCharAt(var36, (char)((var102 | var66 << 1) - 101 ^ 65));
         }

         Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), ScreenUI_326.class.getClassLoader()).returnType();
         switch (((var4 + 488069674 ^ 1641437713 ^ 344549060) - 118047196 ^ 1268653438) - 304781085 - 1864665253 + 27116881 ^ 968977149 ^ 721661331) {
            case 933723550:
               var10000 = var0.findStaticGetter(var6, var5, var7);
               break;
            case 1355452848:
               var10000 = var0.findSetter(var6, var5, var7);
               break;
            case 1914559657:
               var10000 = var0.findStaticSetter(var6, var5, var7);
               break;
            case 2126654901:
               var10000 = var0.findGetter(var6, var5, var7);
               break;
            default:
               throw new UnsupportedOperationException("Unsupported handle type!");
         }
      }

      if (!var11) {
         field_1769[((var10 ^ 1785807373 ^ 720334178 ^ 545247238 ^ 29322964) - 576470763 ^ 51788125 ^ 962734892 ^ 1399026753 ^ 1250360276) - 1049739911] = var10000;
      }

      MethodHandle var12 = var10000.asType(var2);
      return new MutableCallSite(var12);
   }
}
